{
  "name": "Alayeto, Clarisa",
  "scores": {
    "Affordable Housing": {
      "score": 8,
      "shortSummary": "Clarisa Alayeto is a progressive advocate for affordable housing, supporting initiatives to increase housing availability. She has backed programs similar to the NYC Housing Authority's efforts to renovate and preserve public housing.",
      "detailedSummary": "Clarisa Alayeto has shown a strong commitment to affordable housing through her support for initiatives aimed at increasing the availability of low-income housing. She has publicly supported measures akin to the NYCHA Blueprint for Change, which focuses on preserving and renovating public housing units. Her campaign has emphasized the need for affordable housing solutions to address the city's housing crisis.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com",
        "cityandstateny.com"
      ]
    },
    "Policing & Public Safety": {
      "score": 7,
      "shortSummary": "Alayeto leans towards progressive reforms in policing, advocating for community-based approaches. She has supported initiatives that focus on police accountability and transparency.",
      "detailedSummary": "Clarisa Alayeto has advocated for progressive reforms in policing, emphasizing the importance of community-based approaches to public safety. She has supported initiatives that aim to increase police accountability and transparency, similar to the goals of the Community Safety Act which seeks to enhance oversight of the NYPD. Her stance includes advocating for reallocating some police funds to community services.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Education": {
      "score": 9,
      "shortSummary": "Alayeto is a strong proponent of progressive education policies, advocating for increased funding for public schools and equitable resources for all students.",
      "detailedSummary": "Clarisa Alayeto has consistently supported progressive education policies, emphasizing the need for increased funding for public schools. She has advocated for equitable distribution of resources to ensure all students have access to quality education. Her platform includes support for initiatives similar to the NYC Community Schools Initiative, which integrates academics, health, and social services to support students' holistic development.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Public Transit": {
      "score": 8,
      "shortSummary": "Alayeto supports progressive improvements in public transit, advocating for increased funding and accessibility. She has shown support for initiatives like the MTA's capital plan.",
      "detailedSummary": "Clarisa Alayeto has expressed strong support for improving public transit in New York City, advocating for increased funding and accessibility. She has backed initiatives similar to the MTA's capital plan, which aims to modernize the subway system and improve service reliability. Her focus includes ensuring that public transit is accessible to all New Yorkers, particularly those in underserved communities.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Climate & Environment": {
      "score": 9,
      "shortSummary": "Alayeto is a progressive advocate for environmental sustainability, supporting initiatives to reduce carbon emissions and promote green energy.",
      "detailedSummary": "Clarisa Alayeto has been a vocal advocate for environmental sustainability, supporting initiatives aimed at reducing carbon emissions and promoting green energy. She has endorsed policies similar to Local Law 97, which mandates significant reductions in greenhouse gas emissions from large buildings. Her campaign emphasizes the importance of transitioning to renewable energy sources and implementing sustainable practices citywide.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Immigration": {
      "score": 10,
      "shortSummary": "Alayeto is a strong progressive supporter of immigrant rights, advocating for sanctuary city policies and legal assistance for undocumented residents.",
      "detailedSummary": "Clarisa Alayeto has consistently championed immigrant rights, advocating for New York City to remain a sanctuary city and providing legal assistance to undocumented residents. She supports initiatives like the ActionNYC program, which offers free, safe immigration legal help. Her platform emphasizes the protection of immigrant communities and the importance of integrating immigrants into the social and economic fabric of the city.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "LGBTQ+ Rights": {
      "score": 9,
      "shortSummary": "Alayeto is a progressive advocate for LGBTQ+ rights, supporting anti-discrimination laws and inclusive policies.",
      "detailedSummary": "Clarisa Alayeto has been a strong advocate for LGBTQ+ rights, supporting anti-discrimination laws and policies that promote inclusivity. She has endorsed measures similar to the Gender Expression Non-Discrimination Act (GENDA), which prohibits discrimination based on gender identity or expression. Her platform includes ensuring equal rights and protections for LGBTQ+ individuals in all aspects of life.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Economic Development": {
      "score": 7,
      "shortSummary": "Alayeto supports progressive economic development policies, focusing on small businesses and equitable growth.",
      "detailedSummary": "Clarisa Alayeto advocates for progressive economic development policies that prioritize small businesses and equitable growth. She supports initiatives that provide financial assistance and resources to small businesses, similar to the NYC Small Business Services programs. Her focus includes ensuring that economic growth benefits all communities and addresses income inequality.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Homelessness": {
      "score": 8,
      "shortSummary": "Alayeto is a progressive advocate for addressing homelessness, supporting housing-first initiatives and increased funding for shelters.",
      "detailedSummary": "Clarisa Alayeto has shown a strong commitment to addressing homelessness through progressive policies. She supports housing-first initiatives that prioritize providing permanent housing to homeless individuals. Her platform includes advocating for increased funding for shelters and supportive services, similar to the goals of the NYC Department of Homeless Services' Turning the Tide plan.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Health Care Access": {
      "score": 9,
      "shortSummary": "Alayeto is a strong advocate for progressive health care access, supporting universal health care and expanded services for underserved communities.",
      "detailedSummary": "Clarisa Alayeto has been a vocal advocate for expanding health care access, supporting universal health care initiatives. She endorses programs like NYC Care, which provides low-cost or free health services to uninsured New Yorkers. Her focus includes ensuring that all residents, regardless of income or immigration status, have access to comprehensive health care services.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Veterans & Military": {
      "score": null,
      "shortSummary": "Not enough information available.",
      "detailedSummary": "Not enough public information available to assign a rating.",
      "sources": []
    },
    "Government & Ethics": {
      "score": 8,
      "shortSummary": "Alayeto supports progressive government reforms, advocating for transparency and accountability in public office.",
      "detailedSummary": "Clarisa Alayeto has advocated for progressive government reforms that emphasize transparency and accountability. She supports measures similar to the Public Oversight of Surveillance Technology (POST) Act, which requires the NYPD to disclose its surveillance technology. Her platform includes ensuring ethical standards in government operations and increasing public access to information.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Elections & Democracy": {
      "score": 9,
      "shortSummary": "Alayeto is a progressive advocate for voting rights, supporting measures to increase voter access and participation.",
      "detailedSummary": "Clarisa Alayeto has been a strong advocate for expanding voting rights and increasing voter participation. She supports measures like automatic voter registration and early voting, similar to the reforms implemented in New York State. Her platform emphasizes the importance of making the electoral process more accessible and inclusive for all eligible voters.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    },
    "Civil Rights & Discrimination": {
      "score": 9,
      "shortSummary": "Alayeto is a progressive advocate for civil rights, supporting anti-discrimination laws and policies that promote equity.",
      "detailedSummary": "Clarisa Alayeto has consistently supported civil rights initiatives, advocating for anti-discrimination laws and policies that promote equity. She endorses measures similar to the NYC Human Rights Law, which prohibits discrimination in housing, employment, and public accommodations. Her platform includes ensuring equal rights and protections for all individuals, regardless of race, gender, or sexual orientation.",
      "sources": [
        "council.nyc.gov",
        "nytimes.com"
      ]
    }
  },
  "averageScore": 8.5
}