[
  {
    "candidate": "Acquafredda, Janine",
    "category": "bio",
    "score": null,
    "link": "https://streeteasy.com/profile/924465-janine-acquafredda-crs-abr",
    "text": "Advertise Sign up / Sign in Rent Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Near Me Popular neighborhoods Tribeca All Upper East Side All Upper West Side East Village Williamsburg Astoria Hoboken Jersey City View All Browse Pet-Friendly Rentals Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Near Me Popular neighborhoods Tribeca All Upper East Side All Upper West Side East Village Williamsburg Astoria Hoboken Jersey City View All Browse Pet-Friendly Rentals Buy Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Near Me Popular neighborhoods All Upper East Side Tribeca Williamsburg Brooklyn Heights Park Slope Ditmas Park Hoboken Jersey City View All Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Near Me Popular neighborhoods All Upper East Side Tribeca Williamsburg Brooklyn Heights Park Slope Ditmas Park Hoboken Jersey City View All Sell Selling with StreetEasy Explore your options Sell with a real estate agent Sell on your own Your Home See how much your home is worth Resources StreetEasy Concierge Market data Guide to selling in NYC Selling with StreetEasy Explore your options Sell with a real estate agent Sell on your own Your Home See how much your home is worth Resources StreetEasy Concierge Market data Guide to selling in NYC Buildings Browse New Developments Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Popular buildings City Tower 301 West 53rd Street Chelsea Modern CORTE The Kent House Gotham Point North The Baltic Canal 360 Wythe Avenue View All New developments 85 Jay Street 128 West 23rd Street 77 Charlton Street 150 East 78th Street 200 Amsterdam Avenue 1059 Third Avenue 368 Third Avenue 202 Broome Street 252 South Street View All Browse New Developments Areas Manhattan Brooklyn Queens Bronx Staten Island New Jersey All NYC + NJ Popular buildings City Tower 301 West 53rd Street Chelsea Modern CORTE The Kent House Gotham Point North The Baltic Canal 360 Wythe Avenue View All New developments 85 Jay Street 128 West 23rd Street 77 Charlton Street 150 East 78th Street 200 Amsterdam Avenue 1059 Third Avenue 368 Third Avenue 202 Broome Street 252 South Street View All Resources Guides NYC Real Estate Guides Neighborhood Guides Moving to NYC Guide Mortgage Mortgage Rates Mortgage Calculator Tools StreetEasy Forums Open House Planner Industry Hub Data Dashboard Market Data Market Reports Comparables Reports Q&A Should You Rent or Buy? What are Maintenance Fees How Much Rent Can You Afford? How to Find a Roommate Guides NYC Real Estate Guides Neighborhood Guides Moving to NYC Guide Mortgage Mortgage Rates Mortgage Calculator Tools StreetEasy Forums Open House Planner Industry Hub Data Dashboard Market Data Market Reports Comparables Reports Q&A Should You Rent or Buy? What are Maintenance Fees How Much Rent Can You Afford? How to Find a Roommate Blog Browse Market Data Rental Deals Sales Deals First-Time Buyer's Guide Neighborhood Guides Most popular 7 Affordable Queens Neighborhoods for Renters New Prospect Lefferts Gardens Condo Asks $539K 5 NYC Duplexes Under $3,600 To Rent Now Browse Market Data Rental Deals Sales Deals First-Time Buyer's Guide Neighborhood Guides Most popular 7 Affordable Queens Neighborhoods for Renters New Prospect Lefferts Gardens Condo Asks $539K 5 NYC Duplexes Under $3,600 To Rent Now Search Search Janine Acquafredda, CRS, ABR Licensed Associate Real Estate Broker Remax Real Estate Professionals Experience View this agent's total verified deal history. 205 past sales 82 past rentals About Janine Acquafredda, CRS, ABR After spending almost 10 years as a Financial Advisor, Janine entered the real estate industry in 2007 and began helping people with the biggest... After spending almost 10 years as a Financial Advisor, Janine entered the real estate industry in 2007 and began helping people with the biggest financial transaction they will ever make...buying and selling real estate. An award-winning Associate Real Estate Broker and a former teacher at the Real Estate Education Center, Janine is often sought after by the media for her industry expertise and has been quoted as a real estate source in the New York Times, Wall Street Journal, on various real estate and financial websites, and has also appeared on several episodes of HGTV's House Hunters. Janine founded Realtors 4 Rescues in 2012, a non-profit that aims to educate other real estate professionals about the importance of getting landlords, co-op and condo boards to “say yes to pets”. The project has evolved into actually finding homes for animals displaced by relocation"
  },
  {
    "candidate": "Acquafredda, Janine",
    "category": "bio",
    "score": null,
    "link": "https://streeteasy.com/profile/924465-janine-acquafredda-crs-abr",
    "text": "and landlord issues as well as community outreach to educate consumers on adoption and rescue alternatives with her \"Buy Real Estate Not Pets\" initiative. While Janine was born, raised, and continues to reside in New York, she has spent the last 14 years developing real estate relationships and alliances all over the world and has advised and assisted clients with moves all over the United States. Janine holds both the CRS (Certified Residential Specialist) & ABR (Accredited Buyers Agent) designations. NY License Number 10301205749 (Expires 01/26/2027) NY Licensed Name ACQUAFREDDA JANINE Blog We're hiring! Submit your listings Work with us NYC rental network Press room Browse all homes Near Me Help Terms of Use Do Not Sell or Share My Personal Information Cookie Preferences Privacy Notice Download on the App Store Get it on Google Play + Roosevelt Island All Downtown Civic Center Financial District Fulton/Seaport Tribeca Stuyvesant Town/PCV Soho Hudson Square Little Italy Mott Haven North New York Melrose Port Morris Hunts Point Longwood Morrisania Claremont Crotona Park East Highbridge Greenpoint Williamsburg East Williamsburg Downtown Brooklyn Fort Greene Brooklyn Heights Boerum Hill DUMBO Vinegar Hill Bedford-Stuyvesant Astoria Ditmars-Steinway Long Island City Hunters Point Sunnyside Woodside Jackson Heights East Elmhurst North Corona Elmhurst North Shore Arlington Clifton Elm Park Grymes Hill Howland Hook Mariners Harbor New Brighton Park Hill Port Richmond Cliffside Park Edgewater Fort Lee Jersey City Historic Downtown Waterfront Paulus Hook The Heights Journal Square McGinley Square StreetEasy is a brand of Zillow, Inc. and registered trademark of MFTB Hold Co Inc. Zillow, Inc. has a real estate brokerage license in multiple states. See a list of these real estate licenses . § 442-H New York Standard Operating Procedures . Zillow Trulia Hotpads Out East Zillow Inc. Sites © 2006- 2025 Zillow Made in NYC Powered by Bikes, Coffee, and Doughnuts. Zillow Inc. Sites © 2006- 2025 Zillow Made in NYC Powered by Bikes, Coffee, and Doughnuts. Made in NYC Powered by Bikes, Coffee, and Doughnuts."
  },
  {
    "candidate": "Acquafredda, Janine",
    "category": "bio",
    "score": null,
    "link": "https://www.remax.com/real-estate-agents/janine-acquafredda-brooklyn-ny/102084840",
    "text": "Buy Property Search Buying Guide Virtual Home Buying Buy Property Search Buying Guide Virtual Home Buying Sell Home Value Estimate Selling Guide Sell Home Value Estimate Selling Guide Rent Rental Search Find a Rental Agent Rent Rental Search Find a Rental Agent Agents Agent Search Office Search We have the tools and the experience to lead you to success! Join RE/MAX Agents Agent Search Office Search We have the tools and the experience to lead you to success! More Luxury Global Commercial Articles and Advice Account Benefits Childrens Miracle Network Hospitals More Luxury Global Commercial Articles and Advice Account Benefits Childrens Miracle Network Hospitals Log In Log In Sign Up Sign Up RE/MAX Brooklyn RE/MAX Real Estate Professionals Janine Acquafredda, CRS, ABR Janine Acquafredda, CRS, ABR RE/MAX Real Estate Professionals Janine Acquafredda, CRS, ABR Licensed Associate Real Estate Broker Mobile: (917) 584-7685 Contact Me About Awards Listings Office Address: 6423 11th Ave Brooklyn , NY 11219-5621 About Me After spending almost ten years as a Financial Advisor, Janine entered the real estate industry in 2007 and began helping people with the biggest financial transaction they will ever make...buying and selling real estate. An award-winning Associate Real Estate Broker and a former teacher at the Real Estate Education Center in NYC, Janine is often sought after by the media for her industry expertise and has been quoted as a real estate source in the New York Times, Wall Street Journal, on various real estate and financial websites, and has also appeared on several episodes of HGTV's House Hunters. Janine founded Realtors 4 Rescues in 2012, a non-profit that aims to educate other real estate professionals about the importance of getting landlords, co-op and condo boards to “say yes to pets”. The project has evolved into actually finding homes for animals displaced by relocation and landlord issues, as well as, community outreach to educate consumers on adoption and rescue alternatives with her \"Buy Real Estate Not Pets\" initiative. As a Pawsitive Property Agent, Janine is also committed to donating $100 from each closing to an animal rescue. Janine was born, raised, and continues to reside in New York...she has never lived anywhere else :). In her spare time she locates, purchases, renovates and manages Airbnbs in the NYC Metro area and Puerto Rico. Hobbies Fitness, Dogs, Walking / Running Civic Activities Foster Care/Adoption, Tunnel To Towers Foundation, Women's Council of Realtors Experience 18 Years Experience License # 10301205749 Languages English Spanish French Italian Mandarin Specialties Condominiums Relocation Rentals Luxury Homes Designations CRS, ABR Contact Me Mobile: (917) 584-7685 Search Homes For Sale By State View All Worldwide Property Search RE/MAX Canada RE/MAX Commercial The RE/MAX Collection Real Estate Articles and Advice New Listings For Sale News Leadership Investor Relations RE/MAX Holdings Invest in a RE/MAX Franchise RE/MAX, LLC Careers Become a RE/MAX Agent NAHREP English-Spanish Glossary of Real Estate Industry Terms Advertise on the RE/MAX Media Network LifeLock™ Home Title Protect Our Family of Brands Each office independently owned and operated. RE/MAX, LLC is an Equal Opportunity Employer and supports the Fair Housing Act and equal opportunity housing. If you have a disability that is preventing you from experiencing this website, call (800) 525-7452 . © 2025 RE/MAX, LLC. All Rights Reserved. Privacy Notice Terms of Use"
  }
]