[
  {
    "candidate": "Adams, Adrienne E",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/adrienne-adams/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 28 Adrienne E. Adams South Ozone Park, Jamaica, South Jamaica, Baisley Park, Springfield Gardens (North)-Rochdale Village, Springfield Gardens (South)-Brookville Biography Adrienne Eadie Adams is the Speaker of the New York City Council. Elected in January 2022 by her colleagues, she leads the most diverse and the first women-majority Council in New York City history as the first-ever African American Speaker. Elected to the City Council in November 2017, she is also the first woman to represent District 28, which encompasses the Queens neighborhoods of Jamaica, Richmond Hill, Rochdale Village, and South Ozone Park. Under the leadership of Speaker Adams, the Council has been tackling long-standing inequities. She led the lawmaking body to advance women’s health by passing legislative packages to address persistent racial disparities in maternal health and expand access to abortion and reproductive healthcare. The Council, under Speaker Adams’ leadership, also directed the largest amount of municipal funding of any city in the nation to support direct access to abortion healthcare for those without an ability to pay. Speaker Adams has expanded support for crime victims in communities that experience high levels of violence but are underserved by traditional victim services. She created a new $5.1 million budget initiative to fund community safety and victim services at the neighborhood level, and secured funding to establish New York State’s first four Trauma Recovery Centers. Speaker Adams and the Council prioritized addressing inequities in the city’s workforce, passing legislative packages to confront the historic lack of diversity in the FDNY and gender- and race-based pay disparities that impact municipal workers. Speaker Adams also helped establish the CUNY Reconnect program that has helped thousands of working-age New Yorkers to return to college in pursuit of a degree after leaving school. Speaker Adams’ leadership has set a new tone for the Council’s leadership in addressing the City’s housing crisis. Under her leadership, the Council approved over 40 land use projects in 2022, which will produce more than 12,000 units of housing, over 63% of which are affordable. Adams also put forward an aggressive Housing Agenda with a Fair Housing Framework to increase the equitable production of affordable housing development across the City, while prioritizing deeper affordability, housing preservation, and homeownership. During her first term in the Council, Speaker Adams secured a record level of funding for her district, which had endured years of disparity and disinvestment, including investments in schools, parks, libraries, housing, and sanitation services. As a member of the Budget Negotiating Team, she championed funding for cultural institutions, health care, digital access, child and adult literacy, community-based food pantries, small business assistance, as well as Fair Futures, an initiative providing mentorship and services for foster care youth. During the height of the COVID-19 pandemic, she fought to secure additional testing and vaccine sites in her district, which lacked equitable resources despite having one of the highest COVID-19 case rates in the entire City. While serving as Co-Chair of the Black, Latino, and Asian Caucus (BLAC) of the Council, Speaker Adams advocated for additional investments in foreclosure prevention programs, CUNY’s research institutions, and many other community support initiatives. Under her leadership, the City Council also funded the Education Equity Action Plan, an initiative to implement a comprehensive K-12 Black Studies Curriculum for all students in New York City’s public schools. As Chair of the Committee on Public Safety, Speaker Adams shepherded passage of critical reform legislation to improve police accountability and transparency. These included bills to end qualified immunity (making New York City the first city in the nation to enact such a law); require NYPD to document and report on vehicle stops with demographic breakdowns (race, gender, etc.); and empower the Civilian Complaint Review Board to initiate investigations into police misconduct. During her tenure as Chair of the Subcommittee on Landmarks, Public Sitings, and Dispositions, she played a key role in advancing the plan to close Rikers Island. Speaker Adams also passed legislation to reform the City’s tax lien sale to protect homeowners, extend protections for fast food workers, require transparency on the Administration for Children’s Services’ emergency removals of children, and return unused commissary funds to formerly incarcerated New Yorkers. Speaker Adams was raised in Hollis, Queens, as the daughter of two proud union workers. She attended St. Pascal Baylon Elementary School and Bayside High School. After briefly studying at CUNY’s York College, she earned her Bachelor’s Degree"
  },
  {
    "candidate": "Adams, Adrienne E",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/adrienne-adams/",
    "text": "in Psychology from Spelman College in Atlanta, Georgia, minoring in Early Childhood Development. Prior to serving in the City Council, Speaker Adams worked professionally as a Corporate Trainer at several Fortune 500 companies, specializing in Executive Training, Telecommunications Management, and Human Capital Management, and worked as a Childhood Development Associate Instructor, training child care professionals to obtain their Child Development Associate credentials in accordance with the standards set by the National Association for the Education of Young Children. Speaker Adams first entered public service as a member of Queens Community Board 12, the second largest community board in the borough. She was appointed Chair of the Education Committee, advocating for education equity and opposing school closures and co-locations. In recognition of her leadership, Speaker Adams was elected to three consecutive terms as Chair of Community Board 12, serving from December 2012 to November 2017. She advocated for improved delivery of services, economic opportunities, and better quality of life in Southeast Queens. As a community advocate, Speaker Adams served in leadership positions for community-based organizations and advisory committees. She was appointed by then Queens Borough President Melinda Katz to the Queens Public Library Board of Trustees, overseeing a 62-branch institution that maintained the highest circulation of any municipal library system in the country. Additionally, she was appointed to the Local Planning Committee for the Jamaica Downtown Revitalization Initiative and served as Co-Chair of the Jamaica NOW Leadership Council. In these roles, Speaker Adams guided more than $150 million in funding and investments for workforce and business development, education, health and wellness, housing, and transportation for the Downtown Jamaica area. Speaker Adams is an active member of Alpha Kappa Alpha Sorority, Incorporated, the first sorority for Black college-educated women. She is also a longstanding member of the NAACP and the National Action Network. Speaker Adams is a wife, mother, and grandmother (“cool Nona”) within her beloved blended family. Biography Under the leadership of Speaker Adams, the Council has been tackling long-standing inequities. She led the lawmaking body to advance women’s health by passing legislative packages to address persistent racial disparities in maternal health and expand access to abortion and reproductive healthcare. The Council, under Speaker Adams’ leadership, also directed the largest amount of municipal funding of any city in the nation to support direct access to abortion healthcare for those without an ability to pay. Speaker Adams has expanded support for crime victims in communities that experience high levels of violence but are underserved by traditional victim services. She created a new $5.1 million budget initiative to fund community safety and victim services at the neighborhood level, and secured funding to establish New York State’s first four Trauma Recovery Centers. Speaker Adams and the Council prioritized addressing inequities in the city’s workforce, passing legislative packages to confront the historic lack of diversity in the FDNY and gender- and race-based pay disparities that impact municipal workers. Speaker Adams also helped establish the CUNY Reconnect program that has helped thousands of working-age New Yorkers to return to college in pursuit of a degree after leaving school. Speaker Adams’ leadership has set a new tone for the Council’s leadership in addressing the City’s housing crisis. Under her leadership, the Council approved over 40 land use projects in 2022, which will produce more than 12,000 units of housing, over 63% of which are affordable. Adams also put forward an aggressive Housing Agenda with a Fair Housing Framework to increase the equitable production of affordable housing development across the City, while prioritizing deeper affordability, housing preservation, and homeownership. During her first term in the Council, Speaker Adams secured a record level of funding for her district, which had endured years of disparity and disinvestment, including investments in schools, parks, libraries, housing, and sanitation services. As a member of the Budget Negotiating Team, she championed funding for cultural institutions, health care, digital access, child and adult literacy, community-based food pantries, small business assistance, as well as Fair Futures, an initiative providing mentorship and services for foster care youth. During the height of the COVID-19 pandemic, she fought to secure additional testing and vaccine sites in her district, which lacked equitable resources despite having one of the highest COVID-19 case rates in the entire City. While serving as Co-Chair of the Black, Latino, and Asian Caucus (BLAC) of the Council, Speaker Adams advocated for additional investments in foreclosure prevention programs, CUNY’s research institutions, and many other community support initiatives. Under her leadership, the City Council also funded the Education"
  },
  {
    "candidate": "Adams, Adrienne E",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/adrienne-adams/",
    "text": "Equity Action Plan, an initiative to implement a comprehensive K-12 Black Studies Curriculum for all students in New York City’s public schools. As Chair of the Committee on Public Safety, Speaker Adams shepherded passage of critical reform legislation to improve police accountability and transparency. These included bills to end qualified immunity (making New York City the first city in the nation to enact such a law); require NYPD to document and report on vehicle stops with demographic breakdowns (race, gender, etc.); and empower the Civilian Complaint Review Board to initiate investigations into police misconduct. During her tenure as Chair of the Subcommittee on Landmarks, Public Sitings, and Dispositions, she played a key role in advancing the plan to close Rikers Island. Speaker Adams also passed legislation to reform the City’s tax lien sale to protect homeowners, extend protections for fast food workers, require transparency on the Administration for Children’s Services’ emergency removals of children, and return unused commissary funds to formerly incarcerated New Yorkers. Speaker Adams was raised in Hollis, Queens, as the daughter of two proud union workers. She attended St. Pascal Baylon Elementary School and Bayside High School. After briefly studying at CUNY’s York College, she earned her Bachelor’s Degree in Psychology from Spelman College in Atlanta, Georgia, minoring in Early Childhood Development. Prior to serving in the City Council, Speaker Adams worked professionally as a Corporate Trainer at several Fortune 500 companies, specializing in Executive Training, Telecommunications Management, and Human Capital Management, and worked as a Childhood Development Associate Instructor, training child care professionals to obtain their Child Development Associate credentials in accordance with the standards set by the National Association for the Education of Young Children. Speaker Adams first entered public service as a member of Queens Community Board 12, the second largest community board in the borough. She was appointed Chair of the Education Committee, advocating for education equity and opposing school closures and co-locations. In recognition of her leadership, Speaker Adams was elected to three consecutive terms as Chair of Community Board 12, serving from December 2012 to November 2017. She advocated for improved delivery of services, economic opportunities, and better quality of life in Southeast Queens. As a community advocate, Speaker Adams served in leadership positions for community-based organizations and advisory committees. She was appointed by then Queens Borough President Melinda Katz to the Queens Public Library Board of Trustees, overseeing a 62-branch institution that maintained the highest circulation of any municipal library system in the country. Additionally, she was appointed to the Local Planning Committee for the Jamaica Downtown Revitalization Initiative and served as Co-Chair of the Jamaica NOW Leadership Council. In these roles, Speaker Adams guided more than $150 million in funding and investments for workforce and business development, education, health and wellness, housing, and transportation for the Downtown Jamaica area. Speaker Adams is an active member of Alpha Kappa Alpha Sorority, Incorporated, the first sorority for Black college-educated women. She is also a longstanding member of the NAACP and the National Action Network. Speaker Adams is a wife, mother, and grandmother (“cool Nona”) within her beloved blended family. Biography Contact the District Participatory Budgeting Discretionary Funding/Budget Scheduling & Press Inquires Subscribe to E-Newsletter District Office 165-38A Baisley Blvd., 2nd Floor Jamaica, NY 11434 Telephone: 718-206-2068 Legislative Office City Hall New York, NY 10007 212-482-6731 Follow us on social media Twitter Twitter Facebook Facebook Instagram Instagram Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Adams, Adrienne E",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/adrienne-adams/participatory-budgeting/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 28 Adrienne E. Adams South Ozone Park, Jamaica, South Jamaica, Baisley Park, Springfield Gardens (North)-Rochdale Village, Springfield Gardens (South)-Brookville Participatory Budgeting City Council District 28 is one of twenty-three districts participating in Cycle 14 of participatory budgeting, where constituents from each district will decide how to spend $1 million in capital funding locally. What is participatory budgeting? Participatory budgeting is a democratic process in which community members directly decide how to spend $1 million on capital projects. Qualifying projects must cost at least $50,000 and have a lifespan of at least 5 years. Funds for this program can be used for physical improvements that benefit the public. PB funds physical infrastructure projects like improvements to schools, parks, libraries, public housing, streets and more. We encourage interested community members to submit project ideas here: https://rnd.council.nyc.gov/ideamap/map/ . Contact Ayana Greene to get involved: AGreene@council.nyc.gov . How does participatory budgeting work? District residents design and submit project ideas. Then, volunteers join delegate committees to develop those suggestions into project proposals, and work with city agencies to estimate project costs. The projects with the most votes are included in next year’s city budget, to be built or implemented over the next few years. Idea Collection and Volunteer Recruitment (September – October) Through community meetings, residents brainstorm ideas and recruit Budget Delegates for the current cycle. Proposal Development (October – January) Budget Delegates transform ideas into full proposals, with support from city agencies and staff. Delegates narrow down proposals and select projects that meet the needs of the community. GOTV and Vote Week (March – April) Once proposals have been determined, Budget Delegates and residents get out the vote and prepare for a nine-day community vote. Evaluation and Planning (May – June) Winning projects are included in New York City’s upcoming fiscal year budget. Staff and stakeholders evaluate the process and oversee the implementation of winning projects by agencies. Want to volunteer? Delegates, Facilitators, and Poll Workers make the real work of democracy possible. Learn more about how you can participate or sign up to volunteer by calling the district office at 718-206-2068 or contacting Ayana Greene: AGreene@council.nyc.gov . Voting Sites Office of New York City Council Speaker Adrienne Adams 165-38A Baisley Blvd, 2nd Floor, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Rochdale Village Library 169-09 137th Ave, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours South Ozone Park Library 128-16 Rockaway Blvd, South Ozone Park, NY 11420 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Baisley Park Library 117-11 Sutphin Blvd, Jamaica NY 11436 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Rochdale Village Shopping Mall 169-65 137th Ave, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Category Project Title Location Cost Description Education Bathroom Upgrades for PS 123Q PS 123Q, 145-01 119th Avenue $300,000 Funding will go towards renovating all the girls’ bathroom to include new stalls, lighting fixtures and more. Education Bathroom Upgrades for Epic South H.S. PS 40Q $300,000 Funding will go towards renovating the bathrooms to include new stalls, lighting fixtures and more. Education Technology Upgrades for PS8Q PS 80Q Thurgood Marshall, 171-05 137th Avenue $300,000 Funding will go towards adding 5 Smartboards around the gym for interactive learning and presentations. Education Technology Upgrades for MS72 MS 72, 133-25 Guy R Brewer Blvd $300,000 Funding will go towards adding new Smartboards to each classroom and 10 new laptop/tablet carts. Total: $1,200,000 Click More Info for New York City Council’s Participatory Budgeting details. Click here to learn about the Mayor’s Office of NYC Civic Engagement Commission’s PB process, The People’s Money. Participatory Budgeting City Council District 28 is one of twenty-three districts participating in Cycle 14 of participatory budgeting, where constituents from each district will decide how to spend $1 million in capital funding locally. What is participatory budgeting? Participatory budgeting is a democratic process in which community members directly decide how to spend $1 million on capital projects. Qualifying projects must cost at least $50,000 and have a lifespan of at least 5 years. Funds for this program can be used for physical improvements that benefit the public. PB funds physical infrastructure projects like improvements to schools, parks, libraries, public housing, streets and more. We encourage interested community"
  },
  {
    "candidate": "Adams, Adrienne E",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/adrienne-adams/participatory-budgeting/",
    "text": "members to submit project ideas here: https://rnd.council.nyc.gov/ideamap/map/ . Contact Ayana Greene to get involved: AGreene@council.nyc.gov . How does participatory budgeting work? District residents design and submit project ideas. Then, volunteers join delegate committees to develop those suggestions into project proposals, and work with city agencies to estimate project costs. The projects with the most votes are included in next year’s city budget, to be built or implemented over the next few years. Idea Collection and Volunteer Recruitment (September – October) Through community meetings, residents brainstorm ideas and recruit Budget Delegates for the current cycle. Proposal Development (October – January) Budget Delegates transform ideas into full proposals, with support from city agencies and staff. Delegates narrow down proposals and select projects that meet the needs of the community. GOTV and Vote Week (March – April) Once proposals have been determined, Budget Delegates and residents get out the vote and prepare for a nine-day community vote. Evaluation and Planning (May – June) Winning projects are included in New York City’s upcoming fiscal year budget. Staff and stakeholders evaluate the process and oversee the implementation of winning projects by agencies. Want to volunteer? Delegates, Facilitators, and Poll Workers make the real work of democracy possible. Learn more about how you can participate or sign up to volunteer by calling the district office at 718-206-2068 or contacting Ayana Greene: AGreene@council.nyc.gov . Voting Sites Office of New York City Council Speaker Adrienne Adams 165-38A Baisley Blvd, 2nd Floor, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Rochdale Village Library 169-09 137th Ave, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours South Ozone Park Library 128-16 Rockaway Blvd, South Ozone Park, NY 11420 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Baisley Park Library 117-11 Sutphin Blvd, Jamaica NY 11436 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Rochdale Village Shopping Mall 169-65 137th Ave, Jamaica, NY 11434 Monday, March 31, 2025 – Friday, April 4, 2025 During operational hours Education Bathroom Upgrades for PS 123Q PS 123Q, 145-01 119th Avenue $300,000 Funding will go towards renovating all the girls’ bathroom to include new stalls, lighting fixtures and more. Education Bathroom Upgrades for Epic South H.S. PS 40Q $300,000 Funding will go towards renovating the bathrooms to include new stalls, lighting fixtures and more. Education Technology Upgrades for PS8Q PS 80Q Thurgood Marshall, 171-05 137th Avenue $300,000 Funding will go towards adding 5 Smartboards around the gym for interactive learning and presentations. Education Technology Upgrades for MS72 MS 72, 133-25 Guy R Brewer Blvd $300,000 Funding will go towards adding new Smartboards to each classroom and 10 new laptop/tablet carts. Total: $1,200,000 Click More Info for New York City Council’s Participatory Budgeting details. Click here to learn about the Mayor’s Office of NYC Civic Engagement Commission’s PB process, The People’s Money. Biography Contact the District Participatory Budgeting Discretionary Funding/Budget Scheduling & Press Inquires Subscribe to E-Newsletter District Office 165-38A Baisley Blvd., 2nd Floor Jamaica, NY 11434 Telephone: 718-206-2068 Legislative Office City Hall New York, NY 10007 212-482-6731 Follow us on social media Twitter Twitter Facebook Facebook Instagram Instagram Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]