[
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shirley_Aldebol",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Shirley Aldebol Shirley Aldebol Shirley Aldebol Do you have a photo that could go here? Click here to submit it for this profile! Democratic Party Candidate, New York City Council District 13 June 24, 2025 Education Cardinal Spellman High School Barnard College, 1986 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Personal Facebook Personal Instagram Shirley Aldebol ( Democratic Party ) is running for election to the New York City Council to represent District 13 . She is on the ballot in the Democratic primary on June 24, 2025 . Aldebol completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Shirley Aldebol was born in New York, New York . She earned a high school diploma from Cardinal Spellman High School and a bachelor's degree from Barnard College in 1986. Aldebol has been affiliated with 32BJ SEIU. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 13 Shirley Aldebol , David Diaz , John Perez , Theona Reets-DuPont , and Jacqueline Torres are running in the Democratic primary for New York City Council District 13 on June 24, 2025. Candidate Submit photo Shirley Aldebol Submit photo David Diaz Submit photo John Perez Theona Reets-DuPont Submit photo Jacqueline Torres There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 13 Incumbent Kristy Marmorato is running in the Republican primary for New York City Council District 13 on June 24, 2025. Candidate Kristy Marmorato Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Shirley Aldebol completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Aldebol's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. I was born and raised in the Bronx, by my parents who migrated from Puerto Rico. Growing up, I spent my time behind the counter of a bodega that my parents operated in the Soundview neighborhood. Forty-five years ago, they bought a home in the Throggs Neck section of the Bronx. Like many working families, they sacrificed and struggled so that their children could have a better life. I’ve always felt a strong connection to the neighborhood, from my teenage years through adulthood, which ultimately led me to buy a home here 12 years ago. Raising my now-adult son, Emilio, as a single mom in this community motivated me to become even more involved. I’ve volunteered, collaborated with local businesses and organizations, and actively participated in"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shirley_Aldebol",
    "text": "community events to make a positive impact and build stronger connections with my neighbors. I have dedicated over 35 years to the Labor Movement organizing and fighting for workers’ rights, dignity, and respect in the workplace and their communities. I have held various roles, throughout my career, in the union. Early on, I served as the Executive Vice President of the Social Service Employees Union, local 371, DC 37. I later stepped down to work with AFSCME and a coalition of unions, including SEIU, to organize and attain collective bargaining rights for public employees In Puerto Rico. For the past 20 years, I have been part of the staff at SEIU Local 32BJ. I spent my time behind the counter of a bodega that my parents operated in the Soundview neighborhood. Forty-five years ago, they bought a home in the Throggs Neck section of the Bronx. Like many working families, they sacrificed and struggled so that their children could have a better life. I’ve always felt a strong connection to the neighborhood, from my teenage years through adulthood, which ultimately led me to buy a home here 12 years ago. Raising my now-adult son, Emilio, as a single mom in this community motivated me to become even more involved. I’ve volunteered, collaborated with local businesses and organizations, and actively participated in community events to make a positive impact and build stronger connections with my neighbors. I have dedicated over 35 years to the Labor Movement organizing and fighting for workers’ rights, dignity, and respect in the workplace and their communities. I have held various roles, throughout my career, in the union. Early on, I served as the Executive Vice President of the Social Service Employees Union, local 371, DC 37. I later stepped down to work with AFSCME and a coalition of unions, including SEIU, to organize and attain collective bargaining rights for Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Shirley will work to increase access to truly affordable childcare, expand affordable housing, strengthen protections for tenants, improve access to quality healthcare including mental health care, and increase wages to put more money in the pockets of working families. As a lifelong labor leader and organizer, Shirley understands the challenges that working people in the Bronx face. Every worker deserves good wages, fair contracts, quality health care, and safe working conditions. As our City Councilmember, Shirley will push for policies that support workers in our city, including better pay, strong benefits, and safe workplaces. She’ll also work with her colleagues on the City Council and in Albany to create more good-paying jobs and invest in tech, vocational, and apprenticeship programs to get more New Yorkers into stable employment and on a path to the middle class. Everyone deserves to live in safe communities. As our City Councilmember, Shirley will deliver solutions that address the root causes of crime: strengthening our neighborhood services and providing people with the resources they need to thrive, not just survive. Shirley will invest in good-paying jobs, fully funded public services, parks, libraries, recreational centers, and after school programs for our youth. And she will make sure that law enforcement has the tools and resources they need to keep our communities and transit system safe. Shirley will also work to improve quality of life in our neighborhoods, including by closing illegal smoke shops and keeping our streets and business corridors clean. Shirley will work to increase access to truly affordable childcare, expand affordable housing, strengthen protections for tenants, improve access to quality healthcare including mental health care, and increase wages to put more money in the pockets of working families. As a lifelong labor leader and organizer, Shirley understands the challenges that working people in the Bronx face. Every worker deserves good wages, fair contracts, quality health care, and safe working conditions. As our City Councilmember, Shirley will push for policies that support workers in our city, including better pay, strong benefits, and safe workplaces. She’ll also work with her colleagues on the City Council and in Albany to create more good-paying jobs and invest in tech, vocational, and apprenticeship programs to get more New Yorkers into stable employment and on a path to the middle class. Everyone deserves to live in safe communities. As our City Councilmember, Shirley will deliver solutions that address the root causes of crime: strengthening our neighborhood services and providing people"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shirley_Aldebol",
    "text": "with the resources they need to thrive, not just survive. Shirley will invest in good-paying jobs, fully funded public services, parks, libraries, recreational centers, and after school programs for our youth. And she will make sure that law enforcement has the tools and resources they need to keep our communities and transit system safe. Shirley will also work to improve quality of life in our neighborhoods, including by closing illegal smoke shops and keeping our streets and business corridors clean. What areas of public policy are you personally passionate about? Shirley is running for the City Council because it’s time to stand up! We don’t have to accept skyrocketing housing costs, underfunded public services, and low wages that aren’t even keeping up with inflation. What characteristics or principles are most important for an elected official? An elected official must stand firmly with working people, fight for fair wages, and ensure government works for everyone—not just the wealthy. Common sense leadership means listening to the community, making practical decisions that improve lives, and holding those in power accountable. I’ll always put working-class families first and fight for the dignity and rights of every worker. What was your very first job? How long did you have it? Her first job out of college was working as a child welfare caseworker for New York City. She quickly became involved with her union, SSEU Local 371, and hasn’t left the labor movement since. Two years into working for Local 371, Shirley was promoted to Executive Vice President. What organizations or individuals have endorsed your campaign? 32BJ SEIU, 1199 SEIU, HTC, CWA, PAC LIUNA, MasonTenders, and Bronx Democrats Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 13 Website Facebook Twitter Instagram Candidate New York City Council District 13 Website Facebook Twitter Instagram Personal Facebook Instagram Personal Facebook Instagram Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 23, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 23, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,590 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open?"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shirley_Aldebol",
    "text": "Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shirley_Aldebol",
    "text": "Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://www.seiu32bj.org/officers-leadership/shirley-aldebol/",
    "text": "About 32BJ Our Members Officers & Leadership Our History 32BJ Constitution Join Our Staff Our Members Officers & Leadership Our History 32BJ Constitution Join Our Staff Member Resources Contracts Member Benefits 100% Strong Union Store Register to Vote American Dream Fund Immigration Resources Internal Union Elections 2024 FAQ Contracts Member Benefits 100% Strong Union Store Register to Vote American Dream Fund Immigration Resources Internal Union Elections 2024 FAQ News Press Releases Building Strength Magazine Press Releases Building Strength Magazine Contact Us Office Contacts Press Room Text & Email Signup Office Contacts Press Room Text & Email Signup English Español About 32BJ Our Members Officers & Leadership Our History 32BJ Constitution Join Our Staff Our Members Officers & Leadership Our History 32BJ Constitution Join Our Staff Member Resources Contracts Member Benefits 100% Strong Union Store Register to Vote American Dream Fund Immigration Resources Internal Union Elections 2024 FAQ Contracts Member Benefits 100% Strong Union Store Register to Vote American Dream Fund Immigration Resources Internal Union Elections 2024 FAQ News Press Releases Building Strength Magazine Press Releases Building Strength Magazine Contact Us Office Contacts Press Room Text & Email Signup Office Contacts Press Room Text & Email Signup English Español Facebook Facebook Twitter Twitter Instagram Instagram Youtube Youtube Shirley Aldebol Shirley Aldebol Shirley Aldebol is Executive Vice President and oversees the public schools division in the New York Metro area, which includes more than 5,000 members who work as cleaners and handypersons in New York city’s public schools as well as the Hudson Valley District and the Bronx Residential division. Shirley’s many accomplishments at 32BJ include her leadership in the union’s successful 2011 contract campaign for 22,000 commercial office cleaners. Employers in that fight sought to eliminate key protections, including silencing 32BJ members’ political voice by changing how their voluntary contributions to the union’s political action fund are collected. After mobilizing thousands of members to marches, rallies and other actions, 32BJ members not only preserved their contract protections but won compensation increases and other improvements. After more than 5,000 cleaners and handypersons working in New York City public schools became 32BJ members in 2012, Shirley led a campaign to ensure that these members would be covered by the city’s prevailing wage rate, and shepherded the transition of all public school cleaners and handypersons to a single employer, which allowed them to finally receive equal pay for equal work, and improved workplace conditions. And in January 2016, Shirley also negotiated the first collective bargaining agreement for subcontracted service workers at New York and New Jersey airports, working in security, cabin and terminal cleaning, baggage handling and as wheelchair attendants. Over 8,000 of these members significantly improved their wages, benefits and working conditions. Shirley knows the challenges that face New York City’s working people. Born in the Bronx to Puerto Rican parents, she was raised by her mother, who worked numerous jobs to support the family but received no healthcare coverage or other benefits. “I got involved in unions for workers to get respect and a voice on the job,” she said. “But I also saw that unions could help to form public policy for people in the city who are poor or struggling.” Shirley joined the labor movement through a job as a child welfare caseworker for New York City. She quickly became involved in her workplace’s union, Local 371 of District Council 37, part of AFSCME, the American Federation of State, County and Municipal Employees, and rose to the position of Executive Vice President of the local. AFSCME then named Shirley as organizing director in Puerto Rico, where she worked with SEIU and other unions to pass critical legislation allowing public workers to form unions. Shirley also served as AFSCME’s field director for the Eastern Seaboard and as Assistant to the President for Local 371. She came to 32BJ in 2004 as a coordinator for security organizing. She has also run the union’s operations on Long Island, in Westchester County, and in New York City’s outer boroughs. In 2008, she became deputy director of the commercial division, and was appointed director of the division in 2011. She has also been the union’s leader for VAMOS4PR, a coalition of labor and community groups fighting for a better economy for Puerto Rico. Shirley lives in the Bronx with her son, Emilio. Facebook-f Facebook-f Twitter Twitter SEIU 32BJ Manhattan Office and Union Headquarters 25 West 18th Street New York, NY 10011 Phone: 212-388-3800 Facebook Facebook Twitter Twitter Instagram Instagram Youtube Youtube QUICK LINKS Benefits Benefits"
  },
  {
    "candidate": "Aldebol, Shirley",
    "category": "bio",
    "score": null,
    "link": "https://www.seiu32bj.org/officers-leadership/shirley-aldebol/",
    "text": "Contracts Contracts Member Resources Member Resources Find a 5 Star Center Find a 5 Star Center Contact Contact IMPORTANT MESSAGE FOR MEMBERS ON LAYOFF If you are on a layoff and still desire to pay dues to the union, you can do so by mailing a check to the union – 25 West 18th Street, New York, NY 10011. Please note that under the Local 32BJ Constitution, it is necessary for members on layoff who wish to remain in good standing to pay the minimum dues amount ($35) each month, which are due upon return from layoff. A layoff will be considered a leave of absence under Article X, Section 7. Copyright © 2022 32BJ SEIU | Privacy and Terms of Use Scroll to Top"
  }
]