[
  {
    "candidate": "Altidor, Kenny",
    "category": "bio",
    "score": null,
    "link": "https://abc7ny.com/mural-officers-killed-painting-kenny-altidor/11511950/",
    "text": "24/7 Live New York City New Jersey Long Island Northern Suburbs Connecticut SOCIETY SOCIETY Artist creates paintings of fallen officers to help NYPD, community heal Artist creates paintings of fallen officers to help NYPD, community heal By Michelle Charlesworth Michelle Charlesworth has more on a local artist who is using a paint brush to help NYPD officers grieving the deaths of two members of the force killed by a gunman in Harlem. Michelle Charlesworth has more on a local artist who is using a paint brush to help NYPD officers grieving the deaths of two members of the force killed by a gunman in Harlem. Michelle Charlesworth has more on a local artist who is using a paint brush to help NYPD officers grieving the deaths of two members of the force killed by a gunman in Harlem. CANARSIE, Brooklyn (WABC) -- A local artist is using a paint brush to help NYPD officers grieving the deaths of two members of the force killed by a gunman in Harlem. CANARSIE, Brooklyn (WABC) -- Portrait artist and muralist Kenny Altidor pours his emotions into his paintings, meticulously- stroke by stroke. \"I'm hurt, I'm hurt, we lost somebody like that very sad,\" Altidor said. \"As an artist, the one thing I've got is the brush, and to give a small token of appreciation to the family of Officer Rivera, to the NYPD and also to the community.\" Altidor is especially drawn to Officer Jason Rivera's promise to improve relationships between police and young people and families. His own 10-year-old son wants to be a police officer. \"I'm using my platform, my talent that God gave me to give back number one, and bridge the gap between the community and cops,\" Altidor said. \"I remember when they were throwing water at the cops, I put something together where we don't throw water at the cops, we washed their cars - and kids were involved.\" He likes to turn things around. On the back of the canvas of Officer Rivera, fellow police officers from the 32 Precinct were invited to write something personal in solidarity. And now, another canvas is being painted, that of fallen Officer Wilbert Mora, Officer Rivera's partner. Heartbroken that we have now lost two young officers, Altidor's message is this: \"The whole idea is to keep the hero, to keep the keep memories alive, to let the world know they are heroes.\" ALSO READ | Mayor Adams unveils New York City's blueprint to combat violence CeFaan Kim reports that New York City Mayor Eric Adams is unveiling his new plan to stop gun violence, called the \"Blueprint for Safety.\" CeFaan Kim reports that New York City Mayor Eric Adams is unveiling his new plan to stop gun violence, called the \"Blueprint for Safety.\" CeFaan Kim reports that New York City Mayor Eric Adams is unveiling his new plan to stop gun violence, called the \"Blueprint for Safety.\" ---------- * Get Eyewitness News Delivered * More New York City news * Send us a news tip * Download the abc7NY app for breaking news alerts * Follow us on YouTube Submit a News Tip Related Topics SOCIETY SOCIETY NEW YORK CITY NEW YORK CITY ART ART NYPD NYPD MURAL ARTS MURAL ARTS OFFICER KILLED OFFICER KILLED ON NOW ON NOW Top Stories Sean 'Diddy' Combs sex trafficking trial | Live updates 2 minutes ago 2 minutes ago 2 minutes ago US-Israeli hostage Edan Alexander freed from Hamas captivity 1 hour ago 1 hour ago 1 hour ago Tenafly cheers news of hostage Edan Alexander's release by Hamas 1 hour ago 1 hour ago 1 hour ago Sharpe James, longest-serving mayor of Newark, dies at age 89 2 hours ago 2 hours ago 2 hours ago Duffy plans meeting with airlines after problems plague Newark airport 44 minutes ago 44 minutes ago 44 minutes ago Trump defends Qatar jumbo jet offer 39 minutes ago 39 minutes ago 39 minutes ago Shocking video shows 2 young boys handling loaded gun Dispute ends in deadly stabbing on MTA shuttle bus Home Weather Traffic 7 On Your Side 7 on Your Side Investigates Localish Shop Watch ABC 7 New York Apps New York City New Jersey Long Island Northern Suburbs Connecticut New York Lottery Neighborhood Safety Tracker US & World News Politics Health Sports Entertainment On The Red Carpet Podcasts abc7NY En Español Submit a News Tip Jobs Meet the Eyewitness News Team ABC 7 In Your Community About ABC 7 Closed Captioning Contests and"
  },
  {
    "candidate": "Altidor, Kenny",
    "category": "bio",
    "score": null,
    "link": "https://abc7ny.com/mural-officers-killed-painting-kenny-altidor/11511950/",
    "text": "Rules"
  }
]