[
  {
    "candidate": "Anglade, Jean h",
    "category": "bio",
    "score": null,
    "link": "https://www.imdb.com/name/nm0000767/bio/?mode=desktop",
    "text": "Menu Movies Release Calendar Top 250 Movies Most Popular Movies Browse Movies by Genre Top Box Office Showtimes & Tickets Movie News India Movie Spotlight Movies Release Calendar Top 250 Movies Most Popular Movies Browse Movies by Genre Top Box Office Showtimes & Tickets Movie News India Movie Spotlight TV Shows What's on TV & Streaming Top 250 TV Shows Most Popular TV Shows Browse TV Shows by Genre TV News TV Shows What's on TV & Streaming Top 250 TV Shows Most Popular TV Shows Browse TV Shows by Genre TV News Watch What to Watch Latest Trailers IMDb Originals IMDb Picks IMDb Spotlight IMDb Podcasts Watch What to Watch Latest Trailers IMDb Originals IMDb Picks IMDb Spotlight IMDb Podcasts Awards & Events Oscars Cannes Film Festival Star Wars Asian Pacific American Heritage Month Summer Watch Guide STARmeter Awards Awards Central Festival Central All Events Awards & Events Oscars Cannes Film Festival Star Wars Asian Pacific American Heritage Month Summer Watch Guide STARmeter Awards Awards Central Festival Central All Events Celebs Born Today Most Popular Celebs Celebrity News Celebs Born Today Most Popular Celebs Celebrity News Community Help Center Contributor Zone Polls Community Help Center Contributor Zone Polls For Industry Professionals Language English (United States) Language English (United States) Language English (United States) Language Language Fully supported Fully supported English (United States) English (United States) Partially supported Français (Canada) Français (Canada) Français (France) Français (France) Deutsch (Deutschland) Deutsch (Deutschland) हिंदी (भारत) हिंदी (भारत) Italiano (Italia) Italiano (Italia) Português (Brasil) Português (Brasil) Español (España) Español (España) Español (México) Español (México) All All All All Watchlist Sign In EN Fully supported English (United States) Partially supported Français (Canada) Français (France) Deutsch (Deutschland) हिंदी (भारत) Italiano (Italia) Português (Brasil) Español (España) Español (México) Fully supported Fully supported English (United States) English (United States) Partially supported Français (Canada) Français (Canada) Français (France) Français (France) Deutsch (Deutschland) Deutsch (Deutschland) हिंदी (भारत) हिंदी (भारत) Italiano (Italia) Italiano (Italia) Português (Brasil) Português (Brasil) Español (España) Español (España) Español (México) Español (México) Use app Biography Awards Trivia All topics Biography Jean-Hugues Anglade Jump to Overview (2) Mini bio (1) Family (1) Trademarks (1) Trivia (6) Jump to Overview (2) Mini bio (1) Family (1) Trademarks (1) Trivia (6) Edit Overview Overview Born July 29 , 1955 · Thouars, Deux-Sèvres, France Born Height 5′ 7½″ (1.71 m) Height Mini bio Mini bio Sensual, ambiguous, ultra sensitive French performer Jean-Hugues Anglade always had a reputation of intense and passionate actor. Any role, any language, Anglade seems to be able to do anything. From appearing integrally naked alongside Beatrice Dalle in \"37.2 degrees in the morning\", to playing an homosexual role in \"The wounded man\", from portraying the king of France in \"Queen Margot\", to playing a Canadian cop alongside Angelina Jolie and Ethan Hawke in \"Taking lives\", from playing Anne Parillaud's lover in \"Nikita\", to showing the 40-years-old-men crisis. Now Anglade is an established actor, a respected artist and man, who overcame the drama of his childhood. - IMDb mini biography by: shy Family Family Spouse Pamela Soo (1996 - 2000) (divorced) Spouse (1996 - 2000) (divorced) Trademarks Trademarks Frequently cast in Luc Besson's films. Trivia Trivia Aug 21, 2015, Injured his hand in a terrorist attack on a train from Amsterdam to Paris, with his 2 children and family. Rescued by 3 Americans (Spencer Stone, Anthony Sadler, & Alek Skarlatos), along with British citizen Chris Norman. Sadler was hospitalized. Mentioned in song \"Cosmopolitan\" by Vincent Delerm. Spent 5 years in the \"Conservatoire d'art dramatique\" in Paris. Father is a veterinary. Mother is a social worker. 1 more 1 more 1 more All All All Contribute to this page Contribute to this page Learn more about contributing Edit page More from this person More from this person View agent, publicist, legal and company contact details on IMDbPro More to explore Recently viewed You have no recently viewed pages Get the IMDb app Sign in for more access Sign in for more access Sign in for more access Sign in for more access Help Site Index IMDbPro Box Office Mojo License IMDb Data Press Room Advertising Jobs Conditions of Use Privacy Policy Your Ads Privacy Choices © 1990- 2025 by IMDb.com, Inc. Back to top"
  }
]