[
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Darren Dione Aquino Darren Dione Aquino Darren Dione Aquino Republican Party Candidate, Mayor of New York June 24, 2025 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Darren Dione Aquino ( Republican Party ) is running for election for Mayor of New York . He declared candidacy for the Republican primary scheduled on June 24, 2025 . [source] Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2.2 2022 2.3 2020 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 2.2 2022 2.2 2022 2.3 2020 2.3 2020 3 Campaign themes 3.1 2025 3.2 2022 3.2.1 Campaign website 3.3 2020 3.3.1 Video for Ballotpedia 3 Campaign themes 3.1 2025 3.1 2025 3.2 2022 3.2.1 Campaign website 3.2 2022 3.2.1 Campaign website 3.2.1 Campaign website 3.3 2020 3.3.1 Video for Ballotpedia 3.3 2020 3.3.1 Video for Ballotpedia 3.3.1 Video for Ballotpedia 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Darren Dione Aquino was born in New York, New York. His career experience includes founding the nonprofit organization Advocates for Disabled Americans, Veterans, Police, Firemen & Families. Aquino has also worked as an actor in television shows and movies, including Law & Order: SVU and the Sopranos. Additionally, Aquino has worked as a private chef. [1] Elections Elections 2025 2025 See also: Mayoral election in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. Additional general election candidates will be added here following the primary. General election for Mayor of New York Incumbent Eric Adams , Jean Anglade , Kyle Gutierrez , Abbey Laurel-Smith , and James Walden are running in the general election for Mayor of New York on November 4, 2025. Candidate Eric Adams (Independent) Jean Anglade (Independent) Submit photo Kyle Gutierrez (Independent) Abbey Laurel-Smith (Independent) Submit photo James Walden (Independent) Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for Mayor of New York The following candidates are running in the Democratic primary for Mayor of New York on June 24, 2025. Candidate Adrienne Adams Submit photo Selma Bartholomew Michael Blake Andrew Cuomo Corinne Fisher Brad Lander Deirdre Levy Zohran Kwame Mamdani Zellnor Myrie Paperboy Prince Jessica Ramos Scott Stringer Whitney Tilson There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Cleopatra Fitzgerald (D) Republican primary election Republican primary for Mayor of New York The following candidates are running in the Republican primary for Mayor of New York on June 24, 2025. Candidate Joe Alny Darren Dione Aquino Submit photo Naomi Coley Gonzalo Duran John Harris Submit photo Kris Lord Submit photo James Manning Submit photo Montell Moseley Submit photo Ronen Nahom Fátimazöhra Nouinou Submit photo David Rem Curtis Sliwa There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "endorsement, click here . 2022 2022 See also: Florida's 26th Congressional District election, 2022 General election General election for U.S. House Florida District 26 Incumbent Mario Diaz-Balart defeated Christine Alexandria Olivo in the general election for U.S. House Florida District 26 on November 8, 2022. Candidate % Votes ✔ Mario Diaz-Balart (R) 70.9 143,240 Christine Alexandria Olivo (D) 29.1 58,868 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 202,108 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election The Democratic primary election was canceled. Christine Alexandria Olivo advanced from the Democratic primary for U.S. House Florida District 26. Republican primary election Republican primary for U.S. House Florida District 26 Incumbent Mario Diaz-Balart defeated Darren Dione Aquino in the Republican primary for U.S. House Florida District 26 on August 23, 2022. Candidate % Votes ✔ Mario Diaz-Balart 84.3 36,861 Darren Dione Aquino 15.7 6,885 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 43,746 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Ruth Swanson (R) 2020 2020 See also: Florida's 19th Congressional District election, 2020 Florida's 19th Congressional District election, 2020 (August 18 Republican primary) Florida's 19th Congressional District election, 2020 (August 18 Democratic primary) General election General election for U.S. House Florida District 19 Byron Donalds defeated Cindy Banyai and Patrick Post in the general election for U.S. House Florida District 19 on November 3, 2020. Candidate % Votes ✔ Byron Donalds (R) 61.3 272,440 Cindy Banyai (D) 38.7 172,146 Patrick Post (D) (Write-in) 0.0 3 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 444,589 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Antonio Dumornay (Independent) Democratic primary election Democratic primary for U.S. House Florida District 19 Cindy Banyai defeated David Holden in the Democratic primary for U.S. House Florida District 19 on August 18, 2020. Candidate % Votes ✔ Cindy Banyai 57.6 28,765 David Holden 42.4 21,212 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 49,977 (100.00% precincts reporting) = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for U.S. House Florida District 19 The following candidates ran in the Republican primary for U.S. House Florida District 19 on August 18, 2020. Candidate % Votes ✔ Byron Donalds 22.6 23,492 Dane Eagle 21.9 22,715 Casey Askar 20.0 20,774 William Figlesthaler 18.3 19,075 Randy Henderson 7.6 7,858 Christy McLaughlin 4.1 4,245 Dan Severson 3.1 3,197 Darren Dione Aquino 1.4 1,466 Daniel Kowal 1.1 1,135 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "and underlined . The results have been certified. Source Total votes: 103,957 (100.00% precincts reporting) = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Francis Rooney (R) Ford O’Connell (R) Heather Fitzenhagen (R) Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Darren Dione Aquino has not yet completed Ballotpedia's 2025 Candidate Connection survey. Send a message to Darren Dione Aquino asking him to fill out the survey . If you are Darren Dione Aquino, click here to fill out Ballotpedia's 2025 Candidate Connection survey . Who fills out Ballotpedia's Candidate Connection survey? Any candidate running for elected office, at any level, can complete Ballotpedia's Candidate Survey. Completing the survey will update the candidate's Ballotpedia profile, letting voters know who they are and what they stand for. More than 21,000 candidates have taken Ballotpedia's candidate survey since we launched it in 2015. Learn more about the survey here . You can ask Darren Dione Aquino to fill out this survey by using the buttons below or emailing manager@vote4aquino.com. 2022 2022 Darren Dione Aquino did not complete Ballotpedia's 2022 Candidate Connection survey. Campaign website Campaign website Aquino's campaign website stated the following: “ Fighting for the Forgotten As congressman, Darren will fight tirelessly for the forgotten men and women of America. In his twenties, Darren was a struggling father with two disabilities, but out of pure self-determination, Darren rose up from poverty. Understanding the struggle himself, for 40 years, Darren has been a champion for those who are neglected. He has become an icon for disabled advocacy, advising 4 presidents, creating and running Advocates for Disabled Americans, Veterans, Police, Fireman & Families (ADA VETs) since 1999. There are 70,000 homeless veterans in the streets of America — Darren believes this is unacceptable. As your Congressman, Darren will give the needed focus on these forgotten men and women. Pro-America Darren Aquino experienced the greatest of America first-hand and understands the dangers of the anti-American sentiment that prevails in society today. Leaders in Congress call America fundamentally “racist” and Fake News media do just the same. American youth, so civically illiterate, adhere to the dangerous claims made by these leaders. Darren is leading the fight to stop this. Darren supports a nationalized Patriot Test, in which American high-school students are required to pass a basic civics test that assesses American values, ideas, governmental-composition and history in order to graduate high school. As congressman, Darren will call out anti-Americans who prevail in Congress, like Ilhan Omar and AOC and will propose legislation that requires people running for Congress to be naturally-born Americans. Looting, rioting and violence — a symptom of anti-American sentiment — needs to stop and Darren is fighting against it. Law & Order As rioting and looting spread across the country and calls for defunding police become mainstream, now, more than ever, is it important to ensure every American citizens’ fundamental right to protect themselves. “Assault rifle bans” are pointless — criminals don’t follow laws! As Congressman, Darren will fight tirelessly to ensure your 2nd amendment right is not stripped away. America-First The Chinese Virus pandemic has highlighted America’s need for in-country manufacturing and America-first economics. Darren Aquino will make sure to be principled in his American-First, District-First approach to the economy. Through deregulation, southwest Florida infrastructural proposals, and pro-American trade deals, Darren Aquino will bring the biggest amount of jobs that southwest Florida has ever seen. Furthermore, as a self-made man, Darren understands the struggle for hard-earned money, and supports a decrease in federal taxes, including the elimination of the federal tax on overtime labor. Darren Aquino will fight for the Great American Comeback and the Great Southwest Florida Comeback. American Health Medicare and Medicaid as we know it is a fundamental right of protection through social security, but it is being depleted due to mismanagement of prior administrations: Clinton and Obama. My experience for 35 years working with the disabled allowed me to see and actually experience the deficiencies, and inspired me to repair it. This is not a creative repair, but a common sense repair. In addition, mental"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "illness has been largely overlooked in the healthcare community. The mentally ill have been abandoned and neglected for too long. This issue has fallen on the lap of local law enforcement around the country. This is a healthcare issue. This is not the duty of law enforcement, it overburdens the system. Water Management The Water Resource Development Act (WRDA) of 2018 clearly stated that the Everglades Agricultural Area (EAA) Storage Reservoir is part of the Central Everglades Planning Project. However, the Army Corps of Engineers’ bureaucracy still designated this as a “new start,” thus delaying the needed project that would have otherwise been completed in time and under budget. As your congressman, I will help diminish this act by the Army Corps. Furthermore, as your congressman, I will continue to support additional WRDAs that will provide needed insight and projects to aid water management and precision water ecosystems in Southwest Florida. Immigration Because of the Chinese Virus pandemic, our unemployment rate is at an all-time high. Thus, now more than ever, is it important to have a representative who says NO to illegal immigrants stealing American jobs. Right now we have 70,000 veterans living on the street and they deserve jobs, not illegal immigrants. As your congressman, Darren Aquino will fight to increase the power of ICE, cracking down on illegal immigration. Darren Aquino will also fight for our border wall, increases in border security, and cracking down on overstayed VISAs. He will support federally mandated E-verify laws to crack down on businesses profiting from illegal workers. China China poses a threat as great as the Soviet Union! China’s lack of regard for basic human rights and their utter aggression, both militarily in Eurasia and intellectually all across the globe, poses an existential threat to America. Through continuing sanctions on Chinese officials and corporations, through continuing the private-public initiative for American technology companies to properly rival Chinese ones, through pushing legislation that allows American citizens to sue China and the Chinese Communist Party for negligence and intention for the Chinese Virus spread , Darren Aquino will stand up to Xi Jinping and China. Pro-Life The Declaration of Independence states that all people are endowed to their unalienable rights of “life, liberty, and the pursuit of happiness.” Unfortunately, because of leftists and pro-death activists, babies are deprived of their right to have a chance at life . As your congressman, Darren Aquino promises to fight tirelessly for babies’ rights, continuing his 40-year fight for the forgotten. School Choice Our education system is failing too many, but we will change that. Lee County is home to one of the best schooling systems in the world: a school choice system. As your congressman, Darren Aquino will support laws that expand school choice programs across the United States and he will continue his career-long fight for the rights of those who are forgotten. [2] Fighting for the Forgotten As congressman, Darren will fight tirelessly for the forgotten men and women of America. In his twenties, Darren was a struggling father with two disabilities, but out of pure self-determination, Darren rose up from poverty. Understanding the struggle himself, for 40 years, Darren has been a champion for those who are neglected. He has become an icon for disabled advocacy, advising 4 presidents, creating and running Advocates for Disabled Americans, Veterans, Police, Fireman & Families (ADA VETs) since 1999. There are 70,000 homeless veterans in the streets of America — Darren believes this is unacceptable. As your Congressman, Darren will give the needed focus on these forgotten men and women. Pro-America Darren Aquino experienced the greatest of America first-hand and understands the dangers of the anti-American sentiment that prevails in society today. Leaders in Congress call America fundamentally “racist” and Fake News media do just the same. American youth, so civically illiterate, adhere to the dangerous claims made by these leaders. Darren is leading the fight to stop this. Darren supports a nationalized Patriot Test, in which American high-school students are required to pass a basic civics test that assesses American values, ideas, governmental-composition and history in order to graduate high school. As congressman, Darren will call out anti-Americans who prevail in Congress, like Ilhan Omar and AOC and will propose legislation that requires people running for Congress to be naturally-born Americans. Looting, rioting and violence — a symptom of anti-American sentiment — needs to stop and Darren is fighting against it. Law & Order As rioting and looting spread across the country and calls for"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "defunding police become mainstream, now, more than ever, is it important to ensure every American citizens’ fundamental right to protect themselves. “Assault rifle bans” are pointless — criminals don’t follow laws! As Congressman, Darren will fight tirelessly to ensure your 2nd amendment right is not stripped away. America-First The Chinese Virus pandemic has highlighted America’s need for in-country manufacturing and America-first economics. Darren Aquino will make sure to be principled in his American-First, District-First approach to the economy. Through deregulation, southwest Florida infrastructural proposals, and pro-American trade deals, Darren Aquino will bring the biggest amount of jobs that southwest Florida has ever seen. Furthermore, as a self-made man, Darren understands the struggle for hard-earned money, and supports a decrease in federal taxes, including the elimination of the federal tax on overtime labor. Darren Aquino will fight for the Great American Comeback and the Great Southwest Florida Comeback. American Health Medicare and Medicaid as we know it is a fundamental right of protection through social security, but it is being depleted due to mismanagement of prior administrations: Clinton and Obama. My experience for 35 years working with the disabled allowed me to see and actually experience the deficiencies, and inspired me to repair it. This is not a creative repair, but a common sense repair. In addition, mental illness has been largely overlooked in the healthcare community. The mentally ill have been abandoned and neglected for too long. This issue has fallen on the lap of local law enforcement around the country. This is a healthcare issue. This is not the duty of law enforcement, it overburdens the system. Water Management The Water Resource Development Act (WRDA) of 2018 clearly stated that the Everglades Agricultural Area (EAA) Storage Reservoir is part of the Central Everglades Planning Project. However, the Army Corps of Engineers’ bureaucracy still designated this as a “new start,” thus delaying the needed project that would have otherwise been completed in time and under budget. As your congressman, I will help diminish this act by the Army Corps. Furthermore, as your congressman, I will continue to support additional WRDAs that will provide needed insight and projects to aid water management and precision water ecosystems in Southwest Florida. Immigration Because of the Chinese Virus pandemic, our unemployment rate is at an all-time high. Thus, now more than ever, is it important to have a representative who says NO to illegal immigrants stealing American jobs. Right now we have 70,000 veterans living on the street and they deserve jobs, not illegal immigrants. As your congressman, Darren Aquino will fight to increase the power of ICE, cracking down on illegal immigration. Darren Aquino will also fight for our border wall, increases in border security, and cracking down on overstayed VISAs. He will support federally mandated E-verify laws to crack down on businesses profiting from illegal workers. China China poses a threat as great as the Soviet Union! China’s lack of regard for basic human rights and their utter aggression, both militarily in Eurasia and intellectually all across the globe, poses an existential threat to America. Through continuing sanctions on Chinese officials and corporations, through continuing the private-public initiative for American technology companies to properly rival Chinese ones, through pushing legislation that allows American citizens to sue China and the Chinese Communist Party for negligence and intention for the Chinese Virus spread , Darren Aquino will stand up to Xi Jinping and China. Pro-Life The Declaration of Independence states that all people are endowed to their unalienable rights of “life, liberty, and the pursuit of happiness.” Unfortunately, because of leftists and pro-death activists, babies are deprived of their right to have a chance at life . As your congressman, Darren Aquino promises to fight tirelessly for babies’ rights, continuing his 40-year fight for the forgotten. School Choice Our education system is failing too many, but we will change that. Lee County is home to one of the best schooling systems in the world: a school choice system. As your congressman, Darren Aquino will support laws that expand school choice programs across the United States and he will continue his career-long fight for the rights of those who are forgotten. [2] ” —Darren Dione Aquino's campaign website (2022) [3] 2020 2020 Video for Ballotpedia Video for Ballotpedia Video submitted to Ballotpedia Released February 23, 2020 Video submitted to Ballotpedia Released February 23, 2020 Darren Dione Aquino completed Ballotpedia's Candidate Connection survey in 2020. The survey questions appear in bold and are followed by Aquino's"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Darren Aquino is the founder and CEO of Advocates for Disabled Americans, Veterans, Police, Firemen & Families (ADA VETs), and has advocated for them successfully for over 35 years. Darren is a Puerto-Rican, Italian American, who began advocating for the disabled in 1983. Darren founded this national non-profit in 1999. with a unique concept, all members and volunteers are disabled. This comprehensive network of members and volunteers assist the disabled community with all issues involving lack of societal integration, lack of due process and lack of fair and equal treatment. Darren Aquino has been fighting for individuals for over 35 years, and should he become a Congressman, he will know how to fight for his district. Darren is a Puerto-Rican, Italian American, who began advocating for the disabled in 1983. Darren founded this national non-profit in 1999. with a unique concept, all members and volunteers are disabled. This comprehensive network of members and volunteers assist the disabled community with all issues involving lack of societal integration, lack of due process and lack of fair and equal treatment. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? I will protect and fight for ALL people as I've done for over 35 years advocating for the disabled and their rights. I will protect our right to bear arms and protect the constitution. We will ALWAYS put the needs of the district first. I will protect and fight for ALL people as I've done for over 35 years advocating for the disabled and their rights. I will protect our right to bear arms and protect the constitution. We will ALWAYS put the needs of the district first. What areas of public policy are you personally passionate about? 1)Healthcare- Quality -driven and affordable healthcare for all is a fundamental right. Mental health should be incorporated into every health plan. Accessibility to mental healthcare is lacking. Facilities are crowded, there is no integration of programs to treat the \"whole\" person. The mentally ill, especially our disabled veterans, are not getting the care they deserve. Homelessness is increased by the influx of the untreated mentally ill. 2)Constitutional Rights Enforcement-vital to the growth of America. Those amendments were set forth by our forefathers for the daily fundamental rights of the citizens. These are known as freedoms, liberties, the right to pursue uninfringed is the most important duty for a congressman or woman. These are inherent rights. We are the guardians of our forefathers. dreams Seven of the most powerful constitutional rights are deprived disabled citizens on a daily basis . 50 % of the nation's population are disabled, hence, the importance of quality-driven and accessible healthcare. The vulnerable face imminent harm on a daily basis, 2)Constitutional Rights Enforcement-vital to the growth of America. Those amendments were set forth by our forefathers for the daily fundamental rights of the citizens. These are known as freedoms, liberties, the right to pursue uninfringed is the most important duty for a congressman or woman. These are inherent rights. We are the guardians of our forefathers. dreams Seven of the most powerful constitutional rights are deprived disabled citizens on a daily basis . What characteristics or principles are most important for an elected official? Integrity, loyalty, honesty, transparency, honor, patriotism, community activism, dedication, moral values and faith. What legacy would you like to leave? The legacy I want to leave is to be the best Congressman of this century. A congressman who works, who with the people in his district. One that actually serves the people. A congressman who works closely with the community, having hands-on, listening, talking with the community, collaborating together. The congressional seat is the most important , 2nd is judicial. Without the legislative branch , we have no laws. The people always have the right to enforce, I will constitutionally practice my duty, fully and faithfully. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? When I was 24 years old, due to a car accident, I became totally disabled. I was in dire straits, had an infant, and I wrote a 15 page letter to President Ronald Reagan, a 911 to the"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "White House. I received a response from President Reagan himself.. He was moved by my correspondence .He exclusively assigned the White House liaison, Ms. Charlene Kozard to assist me. I was involved with his White House for over six years. President Reagan changed my life, forever. He broke the battle of the states rule to have the White House help me get services for myself and my family. He enrolled me in the GOP, coming from a Democratic family, I became a Republican. He gave me such pride and encouragement, I became an advocate for disabled because of my President. I was able to learn the system since I had the honor and privilege of learning from the best while I was being assisted with my battles. He is my hero. What is your favorite book? Why? My favorite book is ,\"The Seasons of Emma\", it is a children's book that I wrote for disabled children and bully prevention. What was the last song that got stuck in your head? God Bless the USA-Lee Greenwood I was at Yankee stadium after 911, when the President threw the first ball. All Americans were mourning our loss and celebrating our patriotism and unity , as a united America, celebrating those who had sacrificed. What qualities does the U.S. House of Representatives possess that makes it unique as an institution? Currently, it is not unique. It's founding is unique, one-of-a-kind. However, under Democratic leaders, it suffers from Oligarchy. Do you believe that it's beneficial for representatives to have previous experience in government or politics? I don't believe that it is beneficial to have previous experience. I don't believe we need any more career politicians. Congress should be refreshed and renewed. Having experience in grassroots activities, whereby, you fight for the rights of the community, those communities that struggle, the vulnerable who struggle, I believe these are characteristics of a candidate that legislates laws for, \"we the people\". What do you perceive to be the United States’ greatest challenges as a nation over the next decade? Healthcare-half the nation, 50% of the population is disabled. My experience, my knowledge, and my creative ideas, that were inspired by the people who I have advocated for, and which I shared with President Bush, (43). President Bush perceived my notes on healthcare to be a good plan . I proposed a united healthcare owned by the people. I was able to develop the plan since I, and many of those who I had advocated for, had suffered from inaccessible and inadequate healthcare . Do you believe that two years is the right term length for representatives? I would like to see three years, and a maximum of 3 term. A representative should only be allowed only 9 years, for the sake of the country.. We need a renewing, a refreshing. The Senate is 6 years. After the 1st term, You should get a quarter pension, 2nd term, half a pension, and 3rd term, full pension. You should not be allowed both pension and Social Security. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate Mayor of New York Website Facebook Twitter Instagram Candidate Mayor of New York Website Facebook Twitter Instagram Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 23, 2020 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 23, 2020 ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. ↑ Aquino For Congress 2022 , “Promises,” accessed August 19, 2022 ↑ Aquino For Congress 2022 , “Promises,” accessed August 19, 2022 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2020 challenger 2020 primary (defeated) 2022 challenger 2022 primary (defeated) 2025 challenger 2025 primary Florida Marquee, primary candidate, 2020 Mayor of New York candidate, 2025 Municipal candidate, 2025 Municipal candidates New York Republican Party U.S. House candidate, 2020 U.S. House candidate, 2022 U.S. House candidates Ballotpedia features 604,590 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections"
  },
  {
    "candidate": "Aquino, Darren D",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Darren_Dione_Aquino",
    "text": "2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]