[
  {
    "candidate": "Ariola, Joann",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/joann-ariola/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 32 Joann Ariola Glendale, Forest Park, Ozone Park (North), Woodhaven, Ozone Park, Howard Beach-Lindenwood, Spring Creek Park, Broad Channel, Rockaway Beach, Rockaway Park, Belle Harbor, Neponsit, Roxbury, Jacob Riis Park, Fort Tilden, Breezy Point Biography Joann Ariola is a lifelong resident of the 32nd Council District. She was born in Ozone Park and raised in Howard Beach. She attended P.S. 63 (Old South), P.S. 207 (Rockwood Park), Our Lady of Grace Catholic School, Stella Maris H.S. on the Rockaway Peninsula and Adelphi Business School. A longtime Queens civic leader, Ariola won a Republican Primary On June 22, 2021, with over 80 percent of the vote, and on November 2, 2021, she was elected to the NYC City Council in a General Election by a margin of over 65 percent. She subsequently entered into her second term after an unchallenged election in 2023. Since taking office, she has proven herself to be a common-sense moderate and serves as a member of the Republican Minority Caucus as well as the Common-Sense Caucus in the Council. Throughout her period in office, Councilwoman Ariola has put a strong focus on improving the quality of life in the neighborhoods of District 32. This means working closely with both city agencies and nonprofits to ensure that streets are cleaned, as well as advocating for more NYPD officers in our precincts. Councilwoman Ariola was also a sponsor of Int. 1001, which holds landlords accountable for knowingly renting properties to individuals selling unlicensed marijuana products. The Councilwoman has also fiercely advocated for medical freedom, rallying repeatedly for city workers who were wrongfully removed from their jobs for COVID-19 vaccine non-compliance. To that end, the Councilwoman introduced Reso 5 in early 2024, which calls upon the City of New York to immediately bring any and all city workers back to the workforce should they still desire their positions. A large portion of the 32nd Council District is geographically centered around Jamaica Bay, and as such the Councilwoman has also made cleaning up our waterways a priority. One of her proudest achievements to date was her creation of the Office of Marine Debris and Removal – an entirely new mayoral office that would be directly responsible for cleaning our waterways and disposing of derelict and unwanted vessels. Biography Joann Ariola is a lifelong resident of the 32nd Council District. She was born in Ozone Park and raised in Howard Beach. She attended P.S. 63 (Old South), P.S. 207 (Rockwood Park), Our Lady of Grace Catholic School, Stella Maris H.S. on the Rockaway Peninsula and Adelphi Business School. A longtime Queens civic leader, Ariola won a Republican Primary On June 22, 2021, with over 80 percent of the vote, and on November 2, 2021, she was elected to the NYC City Council in a General Election by a margin of over 65 percent. She subsequently entered into her second term after an unchallenged election in 2023. Since taking office, she has proven herself to be a common-sense moderate and serves as a member of the Republican Minority Caucus as well as the Common-Sense Caucus in the Council. Throughout her period in office, Councilwoman Ariola has put a strong focus on improving the quality of life in the neighborhoods of District 32. This means working closely with both city agencies and nonprofits to ensure that streets are cleaned, as well as advocating for more NYPD officers in our precincts. Councilwoman Ariola was also a sponsor of Int. 1001, which holds landlords accountable for knowingly renting properties to individuals selling unlicensed marijuana products. The Councilwoman has also fiercely advocated for medical freedom, rallying repeatedly for city workers who were wrongfully removed from their jobs for COVID-19 vaccine non-compliance. To that end, the Councilwoman introduced Reso 5 in early 2024, which calls upon the City of New York to immediately bring any and all city workers back to the workforce should they still desire their positions. A large portion of the 32nd Council District is geographically centered around Jamaica Bay, and as such the Councilwoman has also made cleaning up our waterways a priority. One of her proudest achievements to date was her creation of the Office of Marine Debris and Removal – an entirely new mayoral office that would be directly responsible for cleaning our waterways and disposing of derelict and unwanted vessels. Biography News Upcoming Events Staff Directory District Office"
  },
  {
    "candidate": "Ariola, Joann",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/joann-ariola/",
    "text": "Ozone Park Office: 93-06 101st Avenue Ozone Park, NY 11416 Phone: 718-738-1083 Fax: 718-738-1918 Rockaway District Office: 114-12 Beach Channel Drive, Suite 1 Rockaway Park, NY 11694 Phone: 718-318-6411 Legislative Office 250 Broadway Suite 1555 New York, NY 10007 Phone: 212-788-7069 For media inquiries please email RVann@council.nyc.gov Twitter Twitter Instagram Instagram Facebook Facebook Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Ariola, Joann",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/joann-ariola/news/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 32 Joann Ariola Glendale, Forest Park, Ozone Park (North), Woodhaven, Ozone Park, Howard Beach-Lindenwood, Spring Creek Park, Broad Channel, Rockaway Beach, Rockaway Park, Belle Harbor, Neponsit, Roxbury, Jacob Riis Park, Fort Tilden, Breezy Point The Wave – Official Point of View: Vote Local July 23, 2024 By NYC Councilwoman Joann Ariola With Election Day looming just a few short months ahead, there’s understandably a lot of conversation about who will serve as our next Commander-in-Chief. Especially in light of the tragedy last weekend and the near assassination of former President Trump, all eyes are very firmly glued to the race for the White House. … READ MORE The Wave – Official Point of View: Vote Local July 23, 2024 By NYC Councilwoman Joann Ariola With Election Day looming just a few short months ahead, there’s understandably a lot of conversation about who will serve as our next Commander-in-Chief. Especially in light of the tragedy last weekend and the near assassination of former President Trump, all eyes are very firmly glued to the race for the White House. … READ MORE QNS – Council Member Joann Ariola secures $31 Million for Queens District 32 in NYC budge July 23, 2024 By Anthony Medina Queens City Council Member Joann Ariola , representing City Council District 32 residents, has secured $31 million in funding as part of the recently approved New York City Council budget for fiscal year 2025. The councilwoman steered millions of dollars to help maintain vital services and organizations this year in her expansive district, which includes Breezy Point , Broad Channel , Glendale , Howard Beach , Ozone Park and Woodhaven . … READ MORE QNS – Council Member Joann Ariola secures $31 Million for Queens District 32 in NYC budge July 23, 2024 By Anthony Medina Queens City Council Member Joann Ariola , representing City Council District 32 residents, has secured $31 million in funding as part of the recently approved New York City Council budget for fiscal year 2025. The councilwoman steered millions of dollars to help maintain vital services and organizations this year in her expansive district, which includes Breezy Point , Broad Channel , Glendale , Howard Beach , Ozone Park and Woodhaven . … READ MORE NY Post – Defying lefties, NYC pol gives NYPD, FDNY flags honoring fallen heroes July 23, 2024 By Rich Calder A Queens councilwoman wants to supply all Big Apple firehouses and police precincts with thin “red-line” and “blue-line” American flags in response to leftists claiming they’re fascist symbols. Republican Joann Ariola collected 53 of the tribute flags from generous New Yorkers since beginning an online campaign two weeks ago. The councilwoman already delivered blue-line flags to … READ MORE NY Post – Defying lefties, NYC pol gives NYPD, FDNY flags honoring fallen heroes July 23, 2024 By Rich Calder A Queens councilwoman wants to supply all Big Apple firehouses and police precincts with thin “red-line” and “blue-line” American flags in response to leftists claiming they’re fascist symbols. Republican Joann Ariola collected 53 of the tribute flags from generous New Yorkers since beginning an online campaign two weeks ago. The councilwoman already delivered blue-line flags to … READ MORE Fox News – NYC councilwoman defends First Amendment rights of firefighters scolded for booing AG James, cheering Trump March 12, 2024 By Elizabeth Heckman A New York City Council member came to the defense of firefighters who booed New York Attorney General Letitia James and cheered former President Trump last week after the FDNY said it was “looking into” staff who broke department regulations. “That sounds a little like McCarthyism to me,” Councilwoman Joann Ariola told “ … READ MORE Fox News – NYC councilwoman defends First Amendment rights of firefighters scolded for booing AG James, cheering Trump March 12, 2024 By Elizabeth Heckman A New York City Council member came to the defense of firefighters who booed New York Attorney General Letitia James and cheered former President Trump last week after the FDNY said it was “looking into” staff who broke department regulations. “That sounds a little like McCarthyism to me,” Councilwoman Joann Ariola told “ … READ MORE QNS – CM Joann Ariola leads effort to keep streets in southeast Queens clean February 26, 2024 By Anthony Medina Council Member Joann Ariola aims to keep the streets clean in her southeast Queens district with the help"
  },
  {
    "candidate": "Ariola, Joann",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/joann-ariola/news/",
    "text": "of city agencies and an employment program looking to improve the area. Every week participants of the Center for Employment Opportunities (CEO)— a second-chance program giving formerly incarcerated people support in finding jobs — work to keep the Queens neighborhoods in Ariola’s district (D-23) clear of trash and dangerous conditions. … READ MORE QNS – CM Joann Ariola leads effort to keep streets in southeast Queens clean February 26, 2024 By Anthony Medina Council Member Joann Ariola aims to keep the streets clean in her southeast Queens district with the help of city agencies and an employment program looking to improve the area. Every week participants of the Center for Employment Opportunities (CEO)— a second-chance program giving formerly incarcerated people support in finding jobs — work to keep the Queens neighborhoods in Ariola’s district (D-23) clear of trash and dangerous conditions. … READ MORE The Wave – The NYC Debt Crisis: Where is Governor Hochul? November 30, 2023 By NYC Councilwoman Joann Ariola & Col. Thomas P. Sullivan, Candidate for NYS Assembly New York City is in a tailspin. In large part thanks to the growing – and completely mishandled – migrant crisis, Mayor Eric Adams has announced that he’s planning enormous slashes to city services across the board. $32 million in cuts to the DSNY. … READ MORE The Wave – The NYC Debt Crisis: Where is Governor Hochul? November 30, 2023 By NYC Councilwoman Joann Ariola & Col. Thomas P. Sullivan, Candidate for NYS Assembly New York City is in a tailspin. In large part thanks to the growing – and completely mishandled – migrant crisis, Mayor Eric Adams has announced that he’s planning enormous slashes to city services across the board. $32 million in cuts to the DSNY. … READ MORE The Wave: The State of the City March 17, 2023 Last week, City Council Speaker Adrienne Adams presented her “State of the City” address to a crowd of people gathered at the Sotomayor Center in the Bronx. During the speech, the Speaker outlined her agenda to recreate New York City in a way that would put “people over everything” and improve the lives of New Yorkers. I must say that although I was encouraged by a number of the Speaker’s proposed initiatives–I do think the proposals regarding public safety and some of the usage of taxpayer dollars are completely off the mark. … READ MORE The Wave: The State of the City March 17, 2023 Last week, City Council Speaker Adrienne Adams presented her “State of the City” address to a crowd of people gathered at the Sotomayor Center in the Bronx. During the speech, the Speaker outlined her agenda to recreate New York City in a way that would put “people over everything” and improve the lives of New Yorkers. I must say that although I was encouraged by a number of the Speaker’s proposed initiatives–I do think the proposals regarding public safety and some of the usage of taxpayer dollars are completely off the mark. … READ MORE Queens Daily Eagle: We Need More Police, Not Less March 3, 2023 New York City is a city under siege. The Big Apple saw a 22% increase in major crimes in 2022 (126,537 vs 103,388 the year prior). Of those, there were 433 homicides and 1,294 shootings. In a recent New York Times article – the same one where these very figures can be read – John Jay College professor Christopher Hermann told reporters “crime is up in New York City, and it’s up quite a bit.” Crime is up, and yet some in our city want to further handcuff our police – the one group in the city that’s been proven to keep us safe. … READ MORE Queens Daily Eagle: We Need More Police, Not Less March 3, 2023 New York City is a city under siege. The Big Apple saw a 22% increase in major crimes in 2022 (126,537 vs 103,388 the year prior). Of those, there were 433 homicides and 1,294 shootings. In a recent New York Times article – the same one where these very figures can be read – John Jay College professor Christopher Hermann told reporters “crime is up in New York City, and it’s up quite a bit.” Crime is up, and yet some in our city want to further handcuff our police – the one group in the city that’s been proven to keep us safe. … READ MORE The Wave: Fighting For The Bravest February 10,"
  },
  {
    "candidate": "Ariola, Joann",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/joann-ariola/news/",
    "text": "2023 As many of my constituents know, I am the Chair of the New York City Council’s Fire & Emergency Committee. In that capacity, I’ve spent much of my time fighting to protect the FDNY’s benefits, enhance their on-the-job safety, and guarantee that all members of the Department are given the pay that they deserve. This week, I’d like to take a minute to tell you all about some of the battles we’re waging in the Council and let you know of some of the developments going on behind the scenes. … READ MORE The Wave: Fighting For The Bravest February 10, 2023 As many of my constituents know, I am the Chair of the New York City Council’s Fire & Emergency Committee. In that capacity, I’ve spent much of my time fighting to protect the FDNY’s benefits, enhance their on-the-job safety, and guarantee that all members of the Department are given the pay that they deserve. This week, I’d like to take a minute to tell you all about some of the battles we’re waging in the Council and let you know of some of the developments going on behind the scenes. … READ MORE Rockaway Point News: Let’s Get Serious About Immigration January 20, 2023 In the past year alone, more than 40,000 migrants from the Southern border have made their way to the Big Apple. That means more than 40,000 new mouths that New York taxpayers need to feed, and more than 40,000 new bodies that New York taxpayers have to shelter. For a city that’s already on the brink of a financial crisis, with a swelling homeless problem of its own to deal with, this is nothing short of a catastrophe in the making. … READ MORE Rockaway Point News: Let’s Get Serious About Immigration January 20, 2023 In the past year alone, more than 40,000 migrants from the Southern border have made their way to the Big Apple. That means more than 40,000 new mouths that New York taxpayers need to feed, and more than 40,000 new bodies that New York taxpayers have to shelter. For a city that’s already on the brink of a financial crisis, with a swelling homeless problem of its own to deal with, this is nothing short of a catastrophe in the making. … READ MORE Page 1 Page 2 Page 3 Next Page Biography News Upcoming Events Staff Directory District Office Ozone Park Office: 93-06 101st Avenue Ozone Park, NY 11416 Phone: 718-738-1083 Fax: 718-738-1918 Rockaway District Office: 114-12 Beach Channel Drive, Suite 1 Rockaway Park, NY 11694 Phone: 718-318-6411 Legislative Office 250 Broadway Suite 1555 New York, NY 10007 Phone: 212-788-7069 For media inquiries please email RVann@council.nyc.gov Twitter Twitter Instagram Instagram Facebook Facebook Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]