[
  {
    "candidate": "Armstead, Eric W",
    "category": "bio",
    "score": null,
    "link": "https://www.cityandstateny.com/politics/2017/01/de-blasios-rivals-the-second-tier-weighs-in-on-the-mayor/180282/",
    "text": "Continue to the site State Budget The state budget passed at last: What’s in it for NYC? State Budget NYC mayoral candidates voted for the state budget this year State Budget Fierce debate over standards for religious schools prompted last-minute budget delays AI Opinion: The time for smart, responsible AI regulation is now Podcast Episode 7: An Interview with Scott Stringer Interviews & Profiles Zohran Mamdani is trying to build a new NYC Democratic primary coalition State Budget The state budget passed at last: What’s in it for NYC? State Budget NYC mayoral candidates voted for the state budget this year State Budget Fierce debate over standards for religious schools prompted last-minute budget delays AI Opinion: The time for smart, responsible AI regulation is now Podcast Episode 7: An Interview with Scott Stringer Interviews & Profiles Zohran Mamdani is trying to build a new NYC Democratic primary coalition Notice at Collection Your Privacy Choices Exercise Your Privacy Rights Politics Policy Personality Power Lists Opinion | Events Special Reports Magazine Newsletters More Politics Policy Personality Power Lists Opinion Events Special Reports Magazine Newsletters Podcasts Job Board Resource Directory Legal & Public Notices Subscription Advertise About Us Staff Merchandise Awards, Plaques & Permissions Channels Notice at Collection Your Privacy Choices Exercise Your Privacy Rights Trending Episode 7: An Interview with Scott Stringer The state budget passed at last: What’s in it for NYC? NYC mayoral candidates voted for the state budget this year Fierce debate over standards for religious schools prompted last-minute budget delays Opinion: The time for smart, responsible AI regulation is now Episode 7: An Interview with Scott Stringer Zohran Mamdani is trying to build a new NYC Democratic primary coalition Politics De Blasio's rivals: The second tier weighs in on the mayor The must-read daily newsletter for NY's political community. Get it in your inbox. email Register for Newsletter Podcasts Sponsored Episode 7: An Interview with Scott Stringer Tune In | Past Episodes Featured Content Sponsored Here’s who’s running for New York City mayor in 2025 By Sarina Trangle | January 23, 2017 By Sarina Trangle January 23, 2017 Politics New York City ERIC ARMSTEAD Eric Armstead says Mayor Bill de Blasio is doing “pretty good,” but, as an East New York native, Armstead could do better because he knows firsthand what New Yorkers need. “I was born and raised in New York City – I was a ’70s baby,” said Armstead, who has never run for public office before. “So I know how to handle this city, the Big Apple. I know what people want.” Armstead, 45, who has experience doing criminal security work, said he would better equip the police force and seek to add tolls to bridges that lack them because he believes that would help deter people from smuggling in drugs and guns. Additionally, Armstead said he would work to institute a tax credit for renters. “(Landlords are) killing people’s pockets,” he said. “I’m fighting for our people to see a better life and better living. If we only see a little bit of it – as long as our children do – that’s the most important thing to me.” He credited de Blasio for repairing bricks and removing asbestos in public housing, but said more should be done. Armstead, who lives in public housing, said he would collaborate with New York City public housing residents to come up with ways to improve their communities. JOSH THOMPSON Josh Thompson, a 31-year-old protégé of New Jersey Sen. Cory Booker, boasts about standing up to his own party. He told Politico New York that he was proud of backing charter schools against fellow Democrats, and has been public about his support for school vouchers and merit pay for educators. Thompson, whose campaign did not respond to an interview request, credited a private school in Newark, New Jersey, with changing his life while growing up with a mother who struggled to make ends meet. That gave him the goal of ensuring all children have access to such quality education, according to Chalkbeat. While in school, Thompson met Booker and volunteered on his Newark mayoral campaign. Thompson went on to work in education roles for pro-charter, Democratic mayors in Washington, D.C., and Bridgeport, Connecticut, before becoming executive director of New Leaders New York, a nonprofit teacher development group, according to his campaign website. “While the mayor is raising money to get his own job back I’ve raised over $9 million for children (at New Leaders),” Thompson told Town &"
  },
  {
    "candidate": "Armstead, Eric W",
    "category": "bio",
    "score": null,
    "link": "https://www.cityandstateny.com/politics/2017/01/de-blasios-rivals-the-second-tier-weighs-in-on-the-mayor/180282/",
    "text": "Village . “If you go to Bridgeport, you’ll see a balanced budget and every student has a tablet in their hand.” Beyond concerns with education, Thompson has said Mayor Bill de Blasio has not done enough to help the homeless. Thompson also questioned de Blasio’s affordable housing agenda, noting in Town & Village , that the administration’s preservation deal for Stuyvesant Town, where he resides, is far from affordable. After moving to the city in 2014, Thompson planned to run for outgoing City Councilman Daniel Garodnick’s Upper East Side seat. But he decided he wanted to work with more under-served communities, and opted to oppose de Blasio instead, according to Town & Village. MICHAEL BASCH Michael Basch, who worked on Democratic presidential nominee Hillary Clinton’s campaign in Madison, Wisconsin, is back in the boroughs and bent on upending the status quo at City Hall. “I am running for mayor because I believe that politics as usual needs to change and that we have both the ability and responsibility to stand up and make the change we want to see in this city,” Basch wrote in an email. “I see problems in the city that should have been addressed by now, and I know I can make a difference in people's lives.” Basch, who declined to speak with City & State, wrote back identifying several topics, but with few specifics, when asked about his priorities. He wrote that he wanted to make the city a hub of technological innovation, sustainability and inclusion; address racial inequality across the criminal justice and education systems; and ensure children get sufficient nutrition. The 32-year-old lives in the Financial District and describes himself as a successful entrepreneur who is a volunteer and is active in the Jewish community. After earning an MBA, he joined Bamko, a global promotional goods company, and then worked as president of Spotad, a global, mobile advertising company. He claims to be one of the first volunteers to show up at Clinton’s headquarters after she announced her candidacy. He helped craft Clinton’s policy positions as part of her technology and innovation team and oversaw community organizing for her in Madison. Clinton won Dane County, where Madison is located, by 47 percentage points. Share This: NEXT STORY: De Blasio's rivals: Daniel Garodnick weighs in on the mayor News & Politics Are mayoral candidates getting serious about Chinese American voters? News & Politics Inside the split between Kathy Hochul and Antonio Delgado Albany Agenda The ambitious plan to Make Albany Great Again News & Politics Inside the quiet race for New York City's second-most powerful position Campaigns & Elections Here’s who’s running for New York City mayor in 2025 Campaigns & Elections New York City Council 2025 primary races to watch News & Politics Are mayoral candidates getting serious about Chinese American voters? News & Politics Inside the split between Kathy Hochul and Antonio Delgado Albany Agenda The ambitious plan to Make Albany Great Again News & Politics Inside the quiet race for New York City's second-most powerful position Campaigns & Elections Here’s who’s running for New York City mayor in 2025 Campaigns & Elections New York City Council 2025 primary races to watch Politics De Blasio's rivals: The second tier weighs in on the mayor Get it in your inbox. email Register for Newsletter Register for Newsletter Sponsored Episode 7: An Interview with Scott Stringer Tune In | Past Episodes Episode 7: An Interview with Scott Stringer Tune In | Sponsored Here’s who’s running for New York City mayor in 2025 Here’s who’s running for New York City mayor in 2025 By Sarina Trangle By Sarina Trangle Sarina Trangle | January 23, 2017 By Politics Politics Politics Politics New York City New York City New York City New York City ERIC ARMSTEAD Eric Armstead says Mayor Bill de Blasio is doing “pretty good,” but, as an East New York native, Armstead could do better because he knows firsthand what New Yorkers need. Eric Armstead says Mayor Bill de Blasio is doing “pretty good,” but, as an East New York native, Armstead could do better because he knows firsthand what New Yorkers need. “I was born and raised in New York City – I was a ’70s baby,” said Armstead, who has never run for public office before. “So I know how to handle this city, the Big Apple. I know what people want.” “I was born and raised in New York City – I was a ’70s baby,” said Armstead, who has never"
  },
  {
    "candidate": "Armstead, Eric W",
    "category": "bio",
    "score": null,
    "link": "https://www.cityandstateny.com/politics/2017/01/de-blasios-rivals-the-second-tier-weighs-in-on-the-mayor/180282/",
    "text": "run for public office before. “So I know how to handle this city, the Big Apple. I know what people want.” Armstead, 45, who has experience doing criminal security work, said he would better equip the police force and seek to add tolls to bridges that lack them because he believes that would help deter people from smuggling in drugs and guns. Armstead, 45, who has experience doing criminal security work, said he would better equip the police force and seek to add tolls to bridges that lack them because he believes that would help deter people from smuggling in drugs and guns. Additionally, Armstead said he would work to institute a tax credit for renters. “(Landlords are) killing people’s pockets,” he said. “I’m fighting for our people to see a better life and better living. If we only see a little bit of it – as long as our children do – that’s the most important thing to me.” Additionally, Armstead said he would work to institute a tax credit for renters. “(Landlords are) killing people’s pockets,” he said. “I’m fighting for our people to see a better life and better living. If we only see a little bit of it – as long as our children do – that’s the most important thing to me.” He credited de Blasio for repairing bricks and removing asbestos in public housing, but said more should be done. Armstead, who lives in public housing, said he would collaborate with New York City public housing residents to come up with ways to improve their communities. He credited de Blasio for repairing bricks and removing asbestos in public housing, but said more should be done. Armstead, who lives in public housing, said he would collaborate with New York City public housing residents to come up with ways to improve their communities. JOSH THOMPSON JOSH THOMPSON Josh Thompson, a 31-year-old protégé of New Jersey Sen. Cory Booker, boasts about standing up to his own party. Josh Thompson, a 31-year-old protégé of New Jersey Sen. Cory Booker, boasts about standing up to his own party. He told Politico New York that he was proud of backing charter schools against fellow Democrats, and has been public about his support for school vouchers and merit pay for educators. He told Politico New York that he was proud of backing charter schools against fellow Democrats, and has been public about his support for school vouchers and merit pay for educators. Thompson, whose campaign did not respond to an interview request, credited a private school in Newark, New Jersey, with changing his life while growing up with a mother who struggled to make ends meet. That gave him the goal of ensuring all children have access to such quality education, according to Chalkbeat. Thompson, whose campaign did not respond to an interview request, credited a private school in Newark, New Jersey, with changing his life while growing up with a mother who struggled to make ends meet. That gave him the goal of ensuring all children have access to such quality education, according to Chalkbeat. While in school, Thompson met Booker and volunteered on his Newark mayoral campaign. Thompson went on to work in education roles for pro-charter, Democratic mayors in Washington, D.C., and Bridgeport, Connecticut, before becoming executive director of New Leaders New York, a nonprofit teacher development group, according to his campaign website. While in school, Thompson met Booker and volunteered on his Newark mayoral campaign. Thompson went on to work in education roles for pro-charter, Democratic mayors in Washington, D.C., and Bridgeport, Connecticut, before becoming executive director of New Leaders New York, a nonprofit teacher development group, according to his campaign website. “While the mayor is raising money to get his own job back I’ve raised over $9 million for children (at New Leaders),” Thompson told Town & Village . “If you go to Bridgeport, you’ll see a balanced budget and every student has a tablet in their hand.” “While the mayor is raising money to get his own job back I’ve raised over $9 million for children (at New Leaders),” Thompson told Town & Village . “If you go to Bridgeport, you’ll see a balanced budget and every student has a tablet in their hand.” Beyond concerns with education, Thompson has said Mayor Bill de Blasio has not done enough to help the homeless. Thompson also questioned de Blasio’s affordable housing agenda, noting in Town & Village , that the administration’s preservation deal for Stuyvesant Town,"
  },
  {
    "candidate": "Armstead, Eric W",
    "category": "bio",
    "score": null,
    "link": "https://www.cityandstateny.com/politics/2017/01/de-blasios-rivals-the-second-tier-weighs-in-on-the-mayor/180282/",
    "text": "where he resides, is far from affordable. Beyond concerns with education, Thompson has said Mayor Bill de Blasio has not done enough to help the homeless. Thompson also questioned de Blasio’s affordable housing agenda, noting in Town & Village , that the administration’s preservation deal for Stuyvesant Town, where he resides, is far from affordable. After moving to the city in 2014, Thompson planned to run for outgoing City Councilman Daniel Garodnick’s Upper East Side seat. But he decided he wanted to work with more under-served communities, and opted to oppose de Blasio instead, according to Town & Village. After moving to the city in 2014, Thompson planned to run for outgoing City Councilman Daniel Garodnick’s Upper East Side seat. But he decided he wanted to work with more under-served communities, and opted to oppose de Blasio instead, according to Town & Village. MICHAEL BASCH MICHAEL BASCH Michael Basch, who worked on Democratic presidential nominee Hillary Clinton’s campaign in Madison, Wisconsin, is back in the boroughs and bent on upending the status quo at City Hall. Michael Basch, who worked on Democratic presidential nominee Hillary Clinton’s campaign in Madison, Wisconsin, is back in the boroughs and bent on upending the status quo at City Hall. “I am running for mayor because I believe that politics as usual needs to change and that we have both the ability and responsibility to stand up and make the change we want to see in this city,” Basch wrote in an email. “I see problems in the city that should have been addressed by now, and I know I can make a difference in people's lives.” “I am running for mayor because I believe that politics as usual needs to change and that we have both the ability and responsibility to stand up and make the change we want to see in this city,” Basch wrote in an email. “I see problems in the city that should have been addressed by now, and I know I can make a difference in people's lives.” Basch, who declined to speak with City & State, wrote back identifying several topics, but with few specifics, when asked about his priorities. He wrote that he wanted to make the city a hub of technological innovation, sustainability and inclusion; address racial inequality across the criminal justice and education systems; and ensure children get sufficient nutrition. Basch, who declined to speak with City & State, wrote back identifying several topics, but with few specifics, when asked about his priorities. He wrote that he wanted to make the city a hub of technological innovation, sustainability and inclusion; address racial inequality across the criminal justice and education systems; and ensure children get sufficient nutrition. The 32-year-old lives in the Financial District and describes himself as a successful entrepreneur who is a volunteer and is active in the Jewish community. After earning an MBA, he joined Bamko, a global promotional goods company, and then worked as president of Spotad, a global, mobile advertising company. The 32-year-old lives in the Financial District and describes himself as a successful entrepreneur who is a volunteer and is active in the Jewish community. After earning an MBA, he joined Bamko, a global promotional goods company, and then worked as president of Spotad, a global, mobile advertising company. He claims to be one of the first volunteers to show up at Clinton’s headquarters after she announced her candidacy. He helped craft Clinton’s policy positions as part of her technology and innovation team and oversaw community organizing for her in Madison. Clinton won Dane County, where Madison is located, by 47 percentage points. He claims to be one of the first volunteers to show up at Clinton’s headquarters after she announced her candidacy. He helped craft Clinton’s policy positions as part of her technology and innovation team and oversaw community organizing for her in Madison. Clinton won Dane County, where Madison is located, by 47 percentage points. He claims to be one of the first volunteers to show up at Clinton’s headquarters after she announced her candidacy. He helped craft Clinton’s policy positions as part of her technology and innovation team and oversaw community organizing for her in Madison. Clinton won Dane County, where Madison is located, by 47 percentage points. Share This: NEXT STORY: De Blasio's rivals: Daniel Garodnick weighs in on the mayor News & Politics Are mayoral candidates getting serious about Chinese American voters? News & Politics Inside the split between Kathy Hochul and Antonio Delgado Albany"
  },
  {
    "candidate": "Armstead, Eric W",
    "category": "bio",
    "score": null,
    "link": "https://www.cityandstateny.com/politics/2017/01/de-blasios-rivals-the-second-tier-weighs-in-on-the-mayor/180282/",
    "text": "Agenda The ambitious plan to Make Albany Great Again News & Politics Inside the quiet race for New York City's second-most powerful position Campaigns & Elections Here’s who’s running for New York City mayor in 2025 Campaigns & Elections New York City Council 2025 primary races to watch News & Politics Are mayoral candidates getting serious about Chinese American voters? News & Politics Inside the split between Kathy Hochul and Antonio Delgado Albany Agenda The ambitious plan to Make Albany Great Again News & Politics Inside the quiet race for New York City's second-most powerful position Campaigns & Elections Here’s who’s running for New York City mayor in 2025 Campaigns & Elections New York City Council 2025 primary races to watch News & Politics Albany Agenda Campaign Confidential New York City New York State Campaigns & Elections Heard Around Town News & Politics Ask the Experts Announcements Policy Budget Criminal Justice Education Energy & Environment Ethics Gambling Healthcare Housing Immigration Infrastructure Labor Policy Publisher's Section Small Business Technology Transportation Personality Interviews & Profiles Personality Winners & Losers Power List Opinion Commentary Editor's Note Opinion NYN Media Nonprofits List Nominations First Read Sign up Featured Announcements Magazine Subscribe Issues Media Podcasts Videos Resource Directory Events Conferences Network Receptions Award Ceremony Past Events Jobs Products Why Post with Us About NY Nonprofit Jobs About Staff Contact Privacy Policy Terms of Use Merchandise Awards, Plaques & Permissions Follow Us Help us tailor content specifically for you: * * * * * * * * * * * * * * * Yes, I want to receive occasional updates from partners I agree to the use of my personal data by Government Executive Media Group and its partners to serve me targeted ads. Learn more . Thank you for subscribing! Please check out our other newsletter offerings on our Newsletter page. × Get the must-read daily newsletter covering New York's nonprofit community. Sign up for FIRST READ Today Also get our Events Newsletters, and stay up to date on all our in-person and virtual offerings. Sign up Almost There! Help us tailor content specifically for you: Yes, City & State NY can email me on behalf of carefully selected companies and organizations companies and organizations. I agree to the use of my personal data by Government Executive Media Group and its partners to serve me targeted ads. Learn more . Submit"
  }
]