[
  {
    "candidate": "Aronson, Vanessa T",
    "category": "bio",
    "score": null,
    "link": "https://vanessafornyc.com/about",
    "text": "Home About Issues Contact Endorsements Survey Events Donate More Home About Issues Contact Endorsements Survey Events Donate More Home About Issues Contact Endorsements Survey Events Donate Home Home About About Issues Issues Contact Contact Endorsements Endorsements Survey Survey Events Events Donate Donate Vanessa Aronson for NYC Council District 4 Vanessa Aronson for NYC Council District 4 Vanessa Aronson for NYC Council District 4 Vanessa Aronson for NYC Council District 4 Vanessa Aronson for NYC Council District 4 Meet Vanessa Meet Vanessa A Community Leader Vanessa is the former president of the Lexington Democratic Club, a Judicial Delegate and a member of the New York County Democratic Committee. She previously served on Community Board 8 and co-chaired the Tikkun Olam (\"repairing the world\") committee at Park Avenue Synagogue. Vanessa is the former president of the Lexington Democratic Club, a Judicial Delegate and a member of the New York County Democratic Committee. She previously served on Community Board 8 and co-chaired the Tikkun Olam (\"repairing the world\") committee at Park Avenue Synagogue. Vanessa was formerly a New York City public school teacher, senior advisor to the president of Hunter College and United States Foreign Service Officer. Vanessa was formerly a New York City public school teacher, senior advisor to the president of Hunter College and United States Foreign Service Officer. She shares two beautiful children with her husband, Reid, and currently works as a nonprofit strategist. She shares two beautiful children with her husband, Reid, and currently works as a nonprofit strategist. Early Years Vanessa grew up in a middle-class family, the daughter of a school nurse and a computer systems analyst. As a child, she had severely limited mobility and strabismus. Fortunately, through early intervention made possible by access to quality healthcare, her mobility and eyesight improved. Vanessa grew up in a middle-class family, the daughter of a school nurse and a computer systems analyst. As a child, she had severely limited mobility and strabismus. Fortunately, through early intervention made possible by access to quality healthcare, her mobility and eyesight improved. When she was nine, her family faced a major loss and economic instability when her father died suddenly. She saw the struggles her mother faced raising and supporting two children on her own. When she was nine, her family faced a major loss and economic instability when her father died suddenly. She saw the struggles her mother faced raising and supporting two children on her own. These early experiences shaped how Vanessa sees the world and made her attuned to the ways families can fall through the cracks of our systems and our infrastructure. She is committed to ensuring that every family in New York has the same support that her family did. These early experiences shaped how Vanessa sees the world and made her attuned to the ways families can fall through the cracks of our systems and our infrastructure. She is committed to ensuring that every family in New York has the same support that her family did. Experienced Diplomat Vanessa proudly represented our country as a diplomat both overseas and right here in New York. While working at the U.S. Embassy in Jakarta, she led a project to bring laptops to students in rural Indonesia. At the U.S. Consulate General in Vietnam, Vanessa cut through red tape and bureaucracy to reunite children with their forever families. At the United Nations, she led negotiations to address food insecurity throughout the world. Vanessa proudly represented our country as a diplomat both overseas and right here in New York. While working at the U.S. Embassy in Jakarta, she led a project to bring laptops to students in rural Indonesia. At the U.S. Consulate General in Vietnam, Vanessa cut through red tape and bureaucracy to reunite children with their forever families. At the United Nations, she led negotiations to address food insecurity throughout the world. Union Strong A former member of two unions - the UFT and AFSA - Vanessa knows the critical role unions and union members play in keeping our City strong and our economy fair. As a member of the City Council, she will be a steadfast voice for labor and for working people. A former member of two unions - the UFT and AFSA - Vanessa knows the critical role unions and union members play in keeping our City strong and our economy fair. As a member of the City Council, she will be a steadfast voice for labor and for working people. This website uses cookies."
  },
  {
    "candidate": "Aronson, Vanessa T",
    "category": "bio",
    "score": null,
    "link": "https://vanessafornyc.com/about",
    "text": "We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
  }
]