[
  {
    "candidate": "Ashman, Dion M",
    "category": "bio",
    "score": null,
    "link": "https://www.voteashman.com/",
    "text": "top of page VOTE ASHMAN DEMOCRATIC PRIMARY JUNE 24, 2025 VOTE ASHMAN DEMOCRATIC PRIMARY JUNE 24, 2025 VOTE ASHMAN DEMOCRATIC PRIMARY JUNE 24, 2025 VOTE ASHMAN DEMOCRATIC PRIMARY JUNE 24, 2025 VOTE ASHMAN DEMOCRATIC PRIMARY JUNE 24, 2025 Contribute Contribute Home Home Meet Dion Meet Dion Volunteer Volunteer Priorities Priorities Vote Vote Contact Contact More More Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. Proudly representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. District 35 in New York City needs a leader who truly understands the unique challenges and aspirations of our community—and Dion Michael Ashman is that leader. He is deeply committed to advocating for the people of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene, and working tirelessly to create positive change. With his passion for social justice, community empowerment, and equitable development, Dion will be the voice our neighborhoods deserve. District 35 in New York City needs a leader who truly understands the unique challenges and aspirations of our community—and Dion Michael Ashman is that leader. He is deeply committed to advocating for the people of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene, and working tirelessly to create positive change. With his passion for social justice, community empowerment, and equitable development, Dion will be the voice our neighborhoods deserve. District 35 in New York City needs a leader who truly understands the unique challenges and aspirations of our community—and Dion Michael Ashman is that leader. He is deeply committed to advocating for the people of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene, and working tirelessly to create positive change. With his passion for social justice, community empowerment, and equitable development, Dion will be the voice our neighborhoods deserve. District 35 in New York City needs a leader who truly understands the unique challenges and aspirations of our community—and Dion Michael Ashman is that leader. He is deeply committed to advocating for the people of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene, and working tirelessly to create positive change. With his passion for social justice, community empowerment, and equitable development, Dion will be the voice our neighborhoods deserve. With his passion for social justice, community empowerment, and equitable development, Dion will be the voice our neighborhoods deserve. It’s time to make our voices heard. Let’s stand together for a brighter future, a better tomorrow, and a stronger community. Learn about Dion Michael Ashman's priorities. It’s time to make our voices heard. Let’s stand together for a brighter future, a better tomorrow, and a stronger community. Learn about Dion Michael Ashman's priorities. It’s time to make our voices heard. Let’s stand together for a brighter future, a better tomorrow, and a stronger community. Learn about Dion Michael Ashman's priorities. It’s time to make our voices heard. Let’s stand together for a brighter future, a better tomorrow, and a stronger community. Learn about Dion Michael Ashman's priorities. Campaign Priorities Campaign Priorities Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman is a lifelong resident with deep roots in the Crown Heights community. Dion Michael Ashman was born and raised in Brooklyn by his parents, who were Jamaican immigrants and has deep roots in the Crown Heights community as a lifelong resident. He attended public schools , P.S. 161, I.S. 320, and Midwood High School. His father, Donald Ashman, was a scholar, school administrator, and researcher, while his mother, Dorothy, balanced her roles as a homemaker, caregiver, and real estate broker. These values—service, community, and dedication—are the strong foundation of Dion's work. He is now channeling those values into his campaign for a seat on the New York City Council to represent the 35th District. Dion Michael Ashman"
  },
  {
    "candidate": "Ashman, Dion M",
    "category": "bio",
    "score": null,
    "link": "https://www.voteashman.com/",
    "text": "was born and raised in Brooklyn by his parents, who were Jamaican immigrants and has deep roots in the Crown Heights community as a lifelong resident. He attended public schools , P.S. 161, I.S. 320, and Midwood High School. His father, Donald Ashman, was a scholar, school administrator, and researcher, while his mother, Dorothy, balanced her roles as a homemaker, caregiver, and real estate broker. These values—service, community, and dedication—are the strong foundation of Dion's work. He is now channeling those values into his campaign for a seat on the New York City Council to represent the 35th District. Dion Michael Ashman was born and raised in Brooklyn by his parents, who were Jamaican immigrants and has deep roots in the Crown Heights community as a lifelong resident. He attended public schools , P.S. 161, I.S. 320, and Midwood High School. His father, Donald Ashman, was a scholar, school administrator, and researcher, while his mother, Dorothy, balanced her roles as a homemaker, caregiver, and real estate broker. These values—service, community, and dedication—are the strong foundation of Dion's work. He is now channeling those values into his campaign for a seat on the New York City Council to represent the 35th District. Dion Michael Ashman was born and raised in Brooklyn by his parents, who were Jamaican immigrants and has deep roots in the Crown Heights community as a lifelong resident. He attended public schools , P.S. 161, I.S. 320, and Midwood High School. His father, Donald Ashman, was a scholar, school administrator, and researcher, while his mother, Dorothy, balanced her roles as a homemaker, caregiver, and real estate broker. These values—service, community, and dedication—are the strong foundation of Dion's work. He is now channeling those values into his campaign for a seat on the New York City Council to represent the 35th District. Dion Michael Ashman He attended public schools These values—service, community, and dedication—are the strong foundation of Dion's work. More About Dion More About Dion Follow Us on Instagram @voteashman Follow Us on Instagram @voteashman Follow Us on Instagram @voteashman Follow Us on Instagram @voteashman Follow Us on Instagram @voteashman Follow Us on Instagram @voteashman ​ ​ ​ ​ Load more Load more Contribute Contribute Paid for by The People To Elect Dion Michael Ashman Paid for by The People To Elect Dion Michael Ashman Paid for by The People To Elect Dion Michael Ashman Paid for by The People To Elect Dion Michael Ashman Paid for by The People To Elect Dion Michael Ashman bottom of page"
  }
]