[
  {
    "candidate": "Athayde, Kyle",
    "category": "bio",
    "score": null,
    "link": "https://boldjourney.com/meet-kyle-athayde/",
    "text": "Bold Journey Magazine Sitemap Nominations About Bold Journey Bold Journey Podcast Privacy & Terms of Service Categories Leadership Development Mental Health Relationships Productivity Resilience Confidence Technology Meet Kyle Athayde March 21, 2025 We were lucky to catch up with Kyle Athayde recently and have shared our conversation below. Alright, so we’re so thrilled to have Kyle with us today – welcome and maybe we can jump right into it with a question about one of your qualities that we most admire. How did you develop your work ethic? Where do you think you get it from? It takes a lot of work to organize a 20+ piece big band like the Kyle Athayde Dance Party, so I need to be very productive in order to keep up with all of the demands of the group. I am always so happy to get to perform with and hear my music played by such great musicians – every job that needs to get done is an opportunity to bring me closer to yet another moment of that happiness. It also helps, of course, to have people encouraging and working with me to make this dream come true. In my own playing and development, I just love music so much that I’m always interested to learn more and grow in different areas of my skills and understanding. The sounds created by great composers always push me to work harder and create more. Thanks, so before we move on maybe you can share a bit more about yourself? I am a musician, primarily composing and performing with my big band, the Kyle Athayde Dance Party, as well as on vibraphone, trumpet, piano, and a variety of other instruments. I also compose and arrange music for other musicians, most regularly for saxophonist Eddie Barbash, and play vibraphone in a duo with pianist Sullivan Fortner. I also play in bands led by Nate Sparks, Jon Hatamiya, and Ryan DeWeese, in addition to other freelance work. I work often as a teacher, especially in workshops throughout the country, and am the director of curriculum for the Lafayette Summer Music Workshop. I love playing and teaching music, and spend most of my days involved in that in one way or another. My band recently recorded our third studio album, consisting of primarily Afro-Cuban music, and we’re working on our next project – a program of children’s songs composed and arranged to entertain and educate audiences of all ages. There is so much advice out there about all the different skills and qualities folks need to develop in order to succeed in today’s highly competitive environment and often it can feel overwhelming. So, if we had to break it down to just the three that matter most, which three skills or qualities would you focus on? Three important qualities that have been beneficial for me are the ability to work quickly, thoroughness in my research, and care for the people around me. Time is so valuable, so working quickly is crucial to being able to achieve results and work under pressure. I find that having an authentic sound in any style is a rare quality, and putting in the time and work to learn through targeted listening and transcription is the only way to truly develop that authenticity. Finally, you can’t get anywhere without help from others, so you have to be conscious of how people feel working with you and strive to treat them well. Even without regard to your own advancement, taking care of others just feels good and right. If you knew you only had a decade of life left, how would you spend that decade? My main challenge at the moment is in becoming well known and getting opportunities for my band and myself to perform. Many of my projects are not financially sustainable on their own, so I end up doing a lot of work to afford to pay for them. This makes it hard to take the time to pound the pavement to procure performance opportunities, so I am constantly trying to figure out who to work with and how to work on my own towards these goals. Contact Info: Website: https://kyleathaydedanceparty.com Instagram: @kadpofficial Facebook: https://facebook.com/kyleathaydedanceparty Twitter: @dizzkidboogie Youtube: https://www.youtube.com/@KyleAthaydeDanceParty Suggest a Story: BoldJourney is built on recommendations from the community; it’s how we uncover hidden gems, so if you or someone you know deserves recognition please let us know here. Meet Kyle Athayde March 21, 2025 March 21, 2025 We were lucky"
  },
  {
    "candidate": "Athayde, Kyle",
    "category": "bio",
    "score": null,
    "link": "https://boldjourney.com/meet-kyle-athayde/",
    "text": "to catch up with Kyle Athayde recently and have shared our conversation below. Alright, so we’re so thrilled to have Kyle with us today – welcome and maybe we can jump right into it with a question about one of your qualities that we most admire. How did you develop your work ethic? Where do you think you get it from? It takes a lot of work to organize a 20+ piece big band like the Kyle Athayde Dance Party, so I need to be very productive in order to keep up with all of the demands of the group. I am always so happy to get to perform with and hear my music played by such great musicians – every job that needs to get done is an opportunity to bring me closer to yet another moment of that happiness. It also helps, of course, to have people encouraging and working with me to make this dream come true. In my own playing and development, I just love music so much that I’m always interested to learn more and grow in different areas of my skills and understanding. The sounds created by great composers always push me to work harder and create more. Thanks, so before we move on maybe you can share a bit more about yourself? I am a musician, primarily composing and performing with my big band, the Kyle Athayde Dance Party, as well as on vibraphone, trumpet, piano, and a variety of other instruments. I also compose and arrange music for other musicians, most regularly for saxophonist Eddie Barbash, and play vibraphone in a duo with pianist Sullivan Fortner. I also play in bands led by Nate Sparks, Jon Hatamiya, and Ryan DeWeese, in addition to other freelance work. I work often as a teacher, especially in workshops throughout the country, and am the director of curriculum for the Lafayette Summer Music Workshop. I love playing and teaching music, and spend most of my days involved in that in one way or another. My band recently recorded our third studio album, consisting of primarily Afro-Cuban music, and we’re working on our next project – a program of children’s songs composed and arranged to entertain and educate audiences of all ages. There is so much advice out there about all the different skills and qualities folks need to develop in order to succeed in today’s highly competitive environment and often it can feel overwhelming. So, if we had to break it down to just the three that matter most, which three skills or qualities would you focus on? Three important qualities that have been beneficial for me are the ability to work quickly, thoroughness in my research, and care for the people around me. Time is so valuable, so working quickly is crucial to being able to achieve results and work under pressure. I find that having an authentic sound in any style is a rare quality, and putting in the time and work to learn through targeted listening and transcription is the only way to truly develop that authenticity. Finally, you can’t get anywhere without help from others, so you have to be conscious of how people feel working with you and strive to treat them well. Even without regard to your own advancement, taking care of others just feels good and right. If you knew you only had a decade of life left, how would you spend that decade? My main challenge at the moment is in becoming well known and getting opportunities for my band and myself to perform. Many of my projects are not financially sustainable on their own, so I end up doing a lot of work to afford to pay for them. This makes it hard to take the time to pound the pavement to procure performance opportunities, so I am constantly trying to figure out who to work with and how to work on my own towards these goals. Contact Info: Website: https://kyleathaydedanceparty.com Instagram: @kadpofficial Facebook: https://facebook.com/kyleathaydedanceparty Twitter: @dizzkidboogie Youtube: https://www.youtube.com/@KyleAthaydeDanceParty Leadership Development Embracing risk is one of the most powerful things anyone can do to level up Leadership Development Core to our mission is building a more compassionate and generous world and so we Productivity “The difficulty lies not so much in developing new ideas as in escaping from old Sections Mental Health Productivity Resilience Confidence Leadership Development Relationships More About us Nominations Bold Journey Podcast Privacy & Terms of Service Copyright © 2025 Bold Journey. All rights"
  },
  {
    "candidate": "Athayde, Kyle",
    "category": "bio",
    "score": null,
    "link": "https://boldjourney.com/meet-kyle-athayde/",
    "text": "reserved."
  }
]