[
  {
    "candidate": "Aviles, Alexa",
    "category": "bio",
    "score": null,
    "link": "https://www.bkreader.com/newsletter/meet-your-candidates-alexa-aviles-and-ling-ye-for-city-council-district-38-10485822",
    "text": "FREE newsletter Support Your Profile Your Subscriptions Support Local News Payment History Sign Out Sign In Register Support Local News Sign up for Daily Headlines Sign up for Notifications Contact Us Home News Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Events About About Us Contact Us Our Team Write for Us About Us Contact Us Our Team Write for Us Advertise Neighborhood Profiles NYC Elections 2025 Home Newsletter Meet Your Candidates: Alexa Avilés and Ling Ye for City Council District 38 Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message Owen Lavine Listen to this article Incumbent City Council Member Alexa Avilés is facing challenger Ling Ye—a former staffer for U.S. Representatives Dan Goldman and Nydia Velázquez—for the District 38 seat, which includes Red Hook and parts of Park Slope, Sunset Park, Borough Park, Dyker Heights, Bensonhurst and Bath Beach. Aviles is a member of the Democratic Socialists of America and the City Council’s Progressive Caucus, while Ye, a political outsider, described herself as a “pragmatic,\" or a candidate who is willing to find \"common ground to get everybody working.\" Both candidates have one similarity: they both grew up in working-class families: Avilés in East New York and Ye in Dyker Heights. Ye immigrated from China at the age of 14. Her mom was a garment factory worker and then a street vendor. “That earlier part of my life, living in economic hardship, had a huge impact,” Ye reflected. She said her upbringing taught her to “pay it forward,” which led her to be a caseworker and community liaison for Goldman and Velazquez. Aviles’ father was killed when she was five, which left her mother to raise Avilés and her siblings on her own in East New York. She remembers her family felt “ashamed” for relying on public assistance, growing up in the Reagan-era where “welfare queens” were “always blamed for whatever social-ill.” Her mom was engaged with her local civic clubs and often dragged Avilés along with her to meetings, inspiring her to take up public service. She has represented District 38 since 2022 and is most proud of her constituent services team, her push to secure funding for four playgrounds under the Brooklyn-Queens Expressway and investments alongThird Avenue. Meanwhile, Ye said she was inspired to run for City Council following President Trump’s reelection. \"The Democratic Party is losing a lot of working class supporters,” because the party ran on too many “fringe cultural issues,” in the last election, which turned off the working class. (When asked which issues she was referring to, she said “there are too many to name.”) Avilés noted, however, that only certain Democrats under-performed in the last election, citing the 2024 election victory of Assembly Member Marcela Mitaynes, who was endorsed by the DSA, in District 51 . Avilés suggested that this was proof that Socialist Democrats were also popular and not everyone in New York was a centrist. On the issue of housing, Avilés said “policies that enrich developers” wouldn’t help build more affordable housing, while Ye said “we do need to give incentives to developers” and negotiation with them was necessary. That said, both candidates have their issues with the \"City of Yes\" housing plan. Avilés said she fought “really hard to include affordability mechanisms” in the city's program that made it easier for builders to construct housing, including additional funding for the New York City Housing Authority (NYCHA). Ye wants to expand the number of Section 8 units to reduce the burden on the shelter system. She stressed the city could do more with its $100 billion budget and that programs didn’t need to be cut to accomplish more. “I don't want to take away from Paul in order to give to Henry,” she said. On the topic of taxes, Ye said she did not favor increasing taxes on the wealthiest New Yorkers, a move that would drive the affluent out of the state. Avilés on the other hand, said “I pay more taxes than Elon Musk and Amazon… it's not right.” She added that other places with wealth taxes did not"
  },
  {
    "candidate": "Aviles, Alexa",
    "category": "bio",
    "score": null,
    "link": "https://www.bkreader.com/newsletter/meet-your-candidates-alexa-aviles-and-ling-ye-for-city-council-district-38-10485822",
    "text": "see billionaires flee. Public safety was another dividing issue. Avilés said the city's Police Department had a “bloated” budget and that cops are trying to “solve every social ill.” “If we are serious about crime, then we need to seriously invest differently,” she added. “Creating an army is not going to solve our mental health crisis. It's not going to solve poverty, which in many ways perpetuates crime. It's not going to solve the sh--ty MTA service.” Ye on the other hand said many New Yorkers rely on the NYPD, adding that social workers often call the police to assist them in tricky situations. With the June Democratic primary election also deciding on a mayoral candidate, Avilés said “no thank you” to ranking former Governor Andrew Cuomo, while Ye said she considers him to be “practical” and would rank him. Ye is endorsed by Solidarity PAC , a politcal action committee formed in 2024 to help “candidates and efforts who support the best interests of New York’s Jewish community.” Ye said Avilés is “out of touch with the district and out of touch with the working class people\" and that she \"has made both Jewish and Muslim residents of Brooklyn less safe by turning neighbors needlessly against each other.\" Avilés said she believes Solidarity PAC does not support her because she \"affirms Palestinian life.\" This has been shared 0 times 0 times 0 Shares Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message More Newsletter Reader Feedback Sort Oldest Newest Oldest Newest Show See a typo/mistake? Have a story/tip? Stay in the loop. Get the latest local news delivered directly to your inbox every afternoon, for free! News Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Events Advertise Neighborhood Profiles NYC Elections 2025 About Us Contact Us Privacy Policy Community Guidelines Our Team Write for Us Advertising Sponsored Content © 2025 BKReader"
  }
]