[
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "Search Menu Search UNH.edu Search Research, Economic Engagement and Outreach Commonly Searched Items: Academic Calendar Visit Tuition Registrar About us Contact Contact People CRISTaL Faculty CRISTaL Post-Docs CRISTaL Graduate Students CRISTaL Faculty CRISTaL Post-Docs CRISTaL Graduate Students Programs Research Resources Events Home CRISTAL STEM Education Christopher F. Bauer Christopher F. Bauer Christopher F. Bauer Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Research Group Interests Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Current Projects Using assessment of affective student characteristics to identify those at risk of academic difficulties Understanding sources of student illusions of competence Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF Longitudinal Impact of PLTL on Student and Peer Leader Retention of General Chemistry Concepts and Attitudes toward Chemistry (with Scott Lewis, USF), NSF Research-based assessment of attitudes for informal science events Clinical and course studies of student chemical misconceptions and representations Retrospective perceptions of high-school chemistry learning Large classroom pedagogy, including POGIL (Process-Oriented Guide Inquiry Learning) His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. Scholarly Interests Learning road-blocks (so-called misconceptions) and how to address them pedagogically Assessment and building of student attitudes, metacognition, and motivation Active inquiry and collaborative learning models for small and large classrooms, particularly non-science majors, preservice teachers, analytical and general chemistry Peer-Lead Team Learning by which successful students learn to guide others in learning Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois),"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years, including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Christopher Bauer is Professor of Chemistry and the 1992 recipient of the UNH Jean Brierley teaching award. His degree history includes a Bachelors (1974, University of Notre Dame), a Masters (1976, University of Illinois), and a move with his advisor David Natusch to Colorado State University to complete his PhD in analytical chemistry in 1979. For two years he was a postdoc at the Water Resources Center (advisors Anders Andren, Mark Anderson) on environmental problems related to coal combustion emissions. Chris continued to work in environmental chemistry and plasma spectroscopy for a decade, and then his interests shifted to student learning. For 25 years, he has contributed to the scholarly development of the Chemistry Education Research field through research, curriculum and assessment projects, policy development, and designing professional development for teachers, kindergarten through graduate students and faculty. He coordinates and teaches the General Chemistry program at UNH, mentors more than 50 undergraduate peer learning assistants, and served on the development and advisory committees for the UNH Center for Excellence and Innovation in Teaching and Learning, and for the Leitzel Center for STEM education and outreach. Chris chaired the 2007 Gordon Conference on Chemical Education Research and Practice and served for 9 years,"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "including as chair, on the Board of Publication (Division of Chemical Education ACS) which oversees the Journal of Chemical Education. Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Research Group Interests Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions;"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Our interests include making sense of student misconceptions in understanding of chemistry and chemical representations; development of assessments for student attitudes, self-perceptions, motivation, and behaviors regarding learning and coursework, and using these to guide interventions; discovery-based college chemistry lessons and curricula; and faculty beliefs and practices. Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Current Projects Using assessment of affective student characteristics to identify those at risk of academic difficulties Using assessment of affective student characteristics to identify those at risk of academic difficulties Using assessment of affective student characteristics to identify those at risk of academic difficulties Using assessment of affective student characteristics to identify those at risk of academic difficulties Using assessment of affective student characteristics to identify those at risk of academic difficulties Understanding sources of student illusions of competence Understanding sources of student illusions of competence Understanding sources of student illusions of competence Understanding sources of student illusions of competence Understanding sources of student illusions of competence Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF Windows on the inquiry classroom: Full course, instructor-and-apprentice-annotated video for professional development in STEM inquiry teaching. A reality-TV version of a college science course “Fire and Ice” about understanding of heat and temperature, NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF ELIPSS: Enhanced Learning by Improving Process Skills in STEM (collaborator) NSF Longitudinal Impact of PLTL on Student and Peer Leader Retention of General Chemistry Concepts and Attitudes toward Chemistry (with Scott Lewis, USF), NSF Longitudinal Impact of PLTL on Student and Peer Leader Retention of General Chemistry Concepts and Attitudes toward Chemistry (with Scott Lewis, USF), NSF Longitudinal Impact of PLTL on Student and Peer Leader Retention of General Chemistry Concepts and Attitudes toward Chemistry (with Scott Lewis, USF), NSF Longitudinal Impact of PLTL on Student and Peer Leader Retention of General Chemistry Concepts and Attitudes toward Chemistry (with Scott Lewis, USF), NSF Research-based assessment of attitudes for informal science events Research-based assessment of attitudes for informal science events Research-based assessment of attitudes for informal science events Research-based assessment of attitudes for informal science events Research-based assessment of attitudes for informal science events Clinical and course studies of student chemical misconceptions and representations Clinical and course studies of student chemical misconceptions and representations Clinical and course studies of student chemical misconceptions and representations Clinical and course studies of student chemical misconceptions and representations Clinical and course studies of student chemical misconceptions and representations Retrospective perceptions of high-school chemistry learning Retrospective perceptions of high-school chemistry learning Retrospective perceptions of high-school chemistry learning Retrospective perceptions of high-school chemistry learning Retrospective perceptions of high-school chemistry learning Large classroom pedagogy, including POGIL (Process-Oriented Guide Inquiry Learning) Large classroom pedagogy, including POGIL (Process-Oriented Guide Inquiry Learning) Large classroom pedagogy, including POGIL (Process-Oriented Guide"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "Inquiry Learning) Large classroom pedagogy, including POGIL (Process-Oriented Guide Inquiry Learning) Large classroom pedagogy, including POGIL (Process-Oriented Guide Inquiry Learning) His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. His continuing collaborations include the Process-Oriented Guided Inquiry Learning Project and several current NSF funded projects as a project assessment consultant. Scholarly Interests Learning road-blocks (so-called misconceptions) and how to address them pedagogically Learning road-blocks (so-called misconceptions) and how to address them pedagogically Assessment and building of student attitudes, metacognition, and motivation Assessment and building of student attitudes, metacognition, and motivation Active inquiry and collaborative learning models for small and large classrooms, particularly non-science majors, preservice teachers, analytical and general chemistry Active inquiry and collaborative learning models for small and large classrooms, particularly non-science majors, preservice teachers, analytical and general chemistry Peer-Lead Team Learning by which successful students learn to guide others in learning Peer-Lead Team Learning by which successful students learn to guide others in learning USNH Privacy Policies • USNH Terms of Use • ADA Acknowledgment • Statement of Nondiscrimination • Jeanne Clery Act CRISTaL Stem Education Durham, NH 03824 (603) 862-1111 department.email@unh.edu Research, Economic Engagement and Outreach CRISTAL STEM Education About us Show About us submenu Contact Show About us submenu Show Contact People Show People submenu CRISTaL Faculty CRISTaL Post-Docs CRISTaL Graduate Students Show People submenu Show CRISTaL Faculty CRISTaL Post-Docs CRISTaL Graduate Students Programs Research Resources Events About Show About submenu Overview Leadership Sustainability Embrace New Hampshire University News The Future of UNH Campus Locations Calendars & Events Contact Us Directories Facts & Figures Show About submenu Show Overview Leadership Sustainability Embrace New Hampshire University News The Future of UNH Campus Locations Calendars & Events Contact Us Directories Facts & Figures Academics Show Academics submenu Overview Academic Advising Colleges & Schools Degrees & Programs Undeclared Students Library Bookstore Course Search Academic Calendar Study Abroad Career Services Show Academics submenu Show Overview Academic Advising Colleges & Schools Degrees & Programs Undeclared Students Library Bookstore Course Search Academic Calendar Study Abroad Career Services Admissions Show Admissions submenu Overview How to Apply Visit Campus Undergraduate Admissions Costs & Financial Aid Net Price Calculator Graduate Admissions UNH Franklin Pierce School of Law UNH Online Show Admissions submenu Show Overview How to Apply Visit Campus Undergraduate Admissions Costs & Financial Aid Net"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://www.unh.edu/research/cristal-stem-education/christopher-f-bauer",
    "text": "Price Calculator Graduate Admissions UNH Franklin Pierce School of Law UNH Online Student Life Show Student Life submenu Overview Housing & Residential Life Clubs & Organizations New Student Programs Student Support Fitness & Recreation Dining Student Union Health & Wellness Student Life Leadership Show Student Life submenu Show Overview Housing & Residential Life Clubs & Organizations New Student Programs Student Support Fitness & Recreation Dining Student Union Health & Wellness Student Life Leadership Athletics Show Athletics submenu Overview Sport Clubs UNH Wildcats Intramural Sports Campus Recreation Tickets Show Athletics submenu Show Overview Sport Clubs UNH Wildcats Intramural Sports Campus Recreation Tickets Research Show Research submenu Overview Centers & Institutes Undergraduate Research Research Office Graduate Research FindScholars@UNH Show Research submenu Show Overview Centers & Institutes Undergraduate Research Research Office Graduate Research FindScholars@UNH Businesses Show Businesses submenu Overview Business Partnerships with UNH Professional Development & Continuing Education Research and Technology at UNH Show Businesses submenu Show Overview Business Partnerships with UNH Professional Development & Continuing Education Research and Technology at UNH Apply Request Information Give Visit Campus News Events myUNH Information For Show Information For submenu Current Students Faculty & Staff Alumni & Friends Community Businesses Show Information For submenu Show Current Students Faculty & Staff Alumni & Friends Community Businesses"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://mabumbe.com/people/chris-bauer-age-net-worth-career-highlights-biography-more/",
    "text": "Accept Home Home Music Music Movies Movies Contact us Contact us Search Reading: Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Share Font Resizer Font Resizer Home Home Music Music Movies Movies Contact us Contact us Search Home Home Music Music Movies Movies Contact us Contact us Follow US Mabumbe > Celebrity Profiles > Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Celebrity Profiles Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Last updated: February 4, 2025 11:07 am Emanuela Samwel Share SHARE Chris Bauer: Age, Biography, Net Worth, Family, Relationships, Career Highlights, and More Mini Bio and Overview Chris Bauer, born Mark Christopher Bauer on October 28, 1966, in Los Angeles, California, is a celebrated American actor known for his versatile performances across television, film, and theater. With a career spanning over three decades, Bauer has delivered memorable roles in critically acclaimed series such as The Wire , True Blood , and The Deuce . A graduate of the prestigious Yale School of Drama, he has also made significant contributions to Broadway and Off-Broadway productions. Contents Chris Bauer: Age, Biography, Net Worth, Family, Relationships, Career Highlights, and More Mini Bio and Overview Early Life and Family Background Career Beginnings and Key Milestones Notable Works and Achievements Current Relevance and Recent Updates Personal Life and Relationships Net Worth and Lifestyle Interesting Facts and Trivia Charitable Work and Legacy Future Plans and Impact on Culture Key Details Information Full Name Mark Christopher Bauer Date of Birth October 28, 1966 Place of Birth Los Angeles, California Nationality American Education Miramonte High School; University of San Diego; Yale School of Drama Notable Works The Wire , True Blood , The Deuce , A Streetcar Named Desire Spouse Laura Bauer (married since May 12, 1997) Children Two Net Worth Estimated at $4 million (from acting roles in TV, films, stage work) Early Life and Family Background Chris Bauer was born into a family of five children in Los Angeles but spent much of his formative years in Orinda, California. He attended Miramonte High School, where he excelled as a football player and was part of the state championship-winning team in 1984. However, it was acting that ultimately captured his passion. Bauer pursued his interest in acting by studying at the University of San Diego and later attending the American Academy of Dramatic Arts in Pasadena. His dedication led him to the Yale School of Drama, where he refined his craft alongside other aspiring actors. His diverse cultural background—of German and Irish descent—also influenced his perspective and approach to storytelling. Career Beginnings and Key Milestones Chris Bauer’s professional journey began in the late 1980s with minor roles in television shows and films. His Broadway debut came in 1990 when he portrayed Happy Loman in a revival of Arthur Miller’s Death of a Salesman , earning critical acclaim and a Drama Desk Award nomination. Bauer’s first major breakthrough occurred with his role as Frank Sobotka in HBO’s The Wire (2002–2008), where he played a conflicted union leader entangled in smuggling operations. This performance solidified his reputation as a talented character actor capable of delivering emotionally complex portrayals. In 2008, Bauer joined the cast of HBO’s True Blood as Detective Andy Bellefleur. His portrayal spanned all seven seasons of the series (2008–2014), further cementing his place in television history. Other notable milestones include: Recurring roles on Third Watch (1999–2005), Survivor’s Remorse (2016), and The Deuce (2017–2019). Film appearances such as 8MM (1999), Flags of Our Fathers (2006), and The Phenom (2016). Broadway performances like Mitch in Tennessee Williams’ A Streetcar Named Desire (2011). Notable Works and Achievements Chris Bauer’s career is defined by his ability to bring depth to supporting roles. His performance as Frank Sobotka on The Wire remains one of the most lauded portrayals on television for its raw emotion and authenticity. Similarly, his comedic yet poignant turn as Andy Bellefleur on True Blood showcased his range. Awards and recognitions include: Drama Desk Award nomination for Outstanding Featured Actor ( Death of a Salesman ). Praise for his role as Bobby Dwyer in HBO’s The Deuce , which explored New York City’s adult entertainment industry during the 1970s. Current Relevance and Recent Updates Chris Bauer continues to remain active in the entertainment industry. Most recently, he appeared on Apple TV+’s science fiction drama series For All Mankind . His ability to adapt to diverse genres—from crime dramas to supernatural thrillers—has kept him relevant"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://mabumbe.com/people/chris-bauer-age-net-worth-career-highlights-biography-more/",
    "text": "across generations. Additionally, Bauer has been involved in theater projects while making guest appearances on popular shows like Law & Order: SVU and Parks and Recreation . His work continues to resonate with audiences due to its authenticity and emotional depth. Personal Life and Relationships Chris Bauer has been married to costume designer Laura Bauer since May 12, 1997. The couple shares two children. Despite his public career, Bauer has maintained a relatively private personal life . Interestingly, he is not related to Kristin Bauer van Straten , his co-star from True Blood , despite their shared surname. Net Worth and Lifestyle As of 2025, Chris Bauer’s estimated net worth is $4 million. His wealth primarily stems from his acting career across television, film, and theater. Notable assets include investments in real estate properties in California. Bauer has also earned from endorsements and guest appearances over the years. Despite his success, he leads a grounded lifestyle focused on family and creative pursuits. Interesting Facts and Trivia Chris Bauer played football during high school but transitioned to acting after discovering his passion for storytelling. He attended the prestigious Yale School of Drama alongside other notable actors. While filming True Blood , he brought humor to set with behind-the-scenes anecdotes about playing Detective Andy Bellefleur. He is a member of the Atlantic Theater Company based in New York City. Charitable Work and Legacy Throughout his career, Chris Bauer has supported causes related to education and performing arts. He has participated in charity events aimed at promoting theater education for underprivileged youth. Bauer’s legacy lies in his ability to portray characters with authenticity and nuance. From gritty dramas like The Wire to supernatural tales like True Blood , he has left an indelible mark on television history. Future Plans and Impact on Culture Looking ahead, Chris Bauer is reportedly exploring opportunities behind the camera as a director or producer while continuing to act. His influence extends beyond acting; he serves as an inspiration for aspiring performers who value craft over celebrity status. Bauer’s enduring presence in Hollywood exemplifies how talent combined with dedication can create a lasting impact on pop culture. Sign Up For Daily Newsletter Be keep up! Get the latest breaking news delivered straight to your inbox. By signing up, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy . You may unsubscribe at any time. Help Us Improve! We’re committed to providing accurate and up-to-date information. If you’ve come across an error or something that needs adjustment, let us know. Your input is invaluable in helping us improve! Send a Suggestion. Share This Article Facebook X Pinterest Whatsapp Whatsapp LinkedIn Telegram Email Copy Link Print Share Stay Connected 248.1k Like 69.1k Follow 134k Pin 54.3k Follow Latest News Shintaro Tsuji Age, Net Worth, Relationships & Biography Celebrity Profiles Dédé Fortin: A Legacy of Music and Mental Health Advocacy Celebrity News Gail Devers: Age, Net Worth, Family, and Career Highlights Celebrity Profiles Lucero: Age, Net Worth, Family & Career Highlights Celebrity Profiles Mabumbe Mabumbe Celebrity Profiles Celebrity Profiles Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Chris Bauer: Age, Net Worth & Career Highlights – Biography & More Emanuela Samwel Share SHARE Chris Bauer: Age, Biography, Net Worth, Family, Relationships, Career Highlights, and More Mini Bio and Overview Chris Bauer, born Mark Christopher Bauer on October 28, 1966, in Los Angeles, California, is a celebrated American actor known for his versatile performances across television, film, and theater. With a career spanning over three decades, Bauer has delivered memorable roles in critically acclaimed series such as The Wire , True Blood , and The Deuce . A graduate of the prestigious Yale School of Drama, he has also made significant contributions to Broadway and Off-Broadway productions. Chris Bauer, born Mark Christopher Bauer on October 28, 1966, in Los Angeles, California, is a celebrated American actor known for his versatile performances across television, film, and theater. With a career spanning over three decades, Bauer has delivered memorable roles in critically acclaimed series such as The Wire , True Blood , and The Deuce . A graduate of the prestigious Yale School of Drama, he has also made significant contributions to Broadway and Off-Broadway productions. Contents Full Name Mark Christopher Bauer Date of Birth October 28, 1966 Place of Birth Los Angeles, California Nationality American Education Miramonte High School; University of"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://mabumbe.com/people/chris-bauer-age-net-worth-career-highlights-biography-more/",
    "text": "San Diego; Yale School of Drama Notable Works The Wire , True Blood , The Deuce , A Streetcar Named Desire Spouse Laura Bauer (married since May 12, 1997) Children Two Net Worth Estimated at $4 million (from acting roles in TV, films, stage work) Early Life and Family Background Chris Bauer was born into a family of five children in Los Angeles but spent much of his formative years in Orinda, California. He attended Miramonte High School, where he excelled as a football player and was part of the state championship-winning team in 1984. However, it was acting that ultimately captured his passion. Bauer pursued his interest in acting by studying at the University of San Diego and later attending the American Academy of Dramatic Arts in Pasadena. His dedication led him to the Yale School of Drama, where he refined his craft alongside other aspiring actors. His diverse cultural background—of German and Irish descent—also influenced his perspective and approach to storytelling. Chris Bauer was born into a family of five children in Los Angeles but spent much of his formative years in Orinda, California. He attended Miramonte High School, where he excelled as a football player and was part of the state championship-winning team in 1984. However, it was acting that ultimately captured his passion. Bauer pursued his interest in acting by studying at the University of San Diego and later attending the American Academy of Dramatic Arts in Pasadena. His dedication led him to the Yale School of Drama, where he refined his craft alongside other aspiring actors. His diverse cultural background—of German and Irish descent—also influenced his perspective and approach to storytelling. Career Beginnings and Key Milestones Chris Bauer’s professional journey began in the late 1980s with minor roles in television shows and films. His Broadway debut came in 1990 when he portrayed Happy Loman in a revival of Arthur Miller’s Death of a Salesman , earning critical acclaim and a Drama Desk Award nomination. Bauer’s first major breakthrough occurred with his role as Frank Sobotka in HBO’s The Wire (2002–2008), where he played a conflicted union leader entangled in smuggling operations. This performance solidified his reputation as a talented character actor capable of delivering emotionally complex portrayals. In 2008, Bauer joined the cast of HBO’s True Blood as Detective Andy Bellefleur. His portrayal spanned all seven seasons of the series (2008–2014), further cementing his place in television history. Other notable milestones include: Chris Bauer’s professional journey began in the late 1980s with minor roles in television shows and films. His Broadway debut came in 1990 when he portrayed Happy Loman in a revival of Arthur Miller’s Death of a Salesman , earning critical acclaim and a Drama Desk Award nomination. Bauer’s first major breakthrough occurred with his role as Frank Sobotka in HBO’s The Wire (2002–2008), where he played a conflicted union leader entangled in smuggling operations. This performance solidified his reputation as a talented character actor capable of delivering emotionally complex portrayals. In 2008, Bauer joined the cast of HBO’s True Blood as Detective Andy Bellefleur. His portrayal spanned all seven seasons of the series (2008–2014), further cementing his place in television history. Other notable milestones include: Recurring roles on Third Watch (1999–2005), Survivor’s Remorse (2016), and The Deuce (2017–2019). Recurring roles on Third Watch (1999–2005), Survivor’s Remorse (2016), and The Deuce (2017–2019). Film appearances such as 8MM (1999), Flags of Our Fathers (2006), and The Phenom (2016). Film appearances such as 8MM (1999), Flags of Our Fathers (2006), and The Phenom (2016). Broadway performances like Mitch in Tennessee Williams’ A Streetcar Named Desire (2011). Broadway performances like Mitch in Tennessee Williams’ A Streetcar Named Desire (2011). Notable Works and Achievements Chris Bauer’s career is defined by his ability to bring depth to supporting roles. His performance as Frank Sobotka on The Wire remains one of the most lauded portrayals on television for its raw emotion and authenticity. Similarly, his comedic yet poignant turn as Andy Bellefleur on True Blood showcased his range. Awards and recognitions include: Chris Bauer’s career is defined by his ability to bring depth to supporting roles. His performance as Frank Sobotka on The Wire remains one of the most lauded portrayals on television for its raw emotion and authenticity. Similarly, his comedic yet poignant turn as Andy Bellefleur on True Blood showcased his range. Awards and recognitions include: Drama Desk Award nomination for Outstanding Featured Actor ( Death of a Salesman ). Drama Desk Award nomination for Outstanding Featured"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://mabumbe.com/people/chris-bauer-age-net-worth-career-highlights-biography-more/",
    "text": "Actor ( Death of a Salesman ). Praise for his role as Bobby Dwyer in HBO’s The Deuce , which explored New York City’s adult entertainment industry during the 1970s. Praise for his role as Bobby Dwyer in HBO’s The Deuce , which explored New York City’s adult entertainment industry during the 1970s. Current Relevance and Recent Updates Chris Bauer continues to remain active in the entertainment industry. Most recently, he appeared on Apple TV+’s science fiction drama series For All Mankind . His ability to adapt to diverse genres—from crime dramas to supernatural thrillers—has kept him relevant across generations. Additionally, Bauer has been involved in theater projects while making guest appearances on popular shows like Law & Order: SVU and Parks and Recreation . His work continues to resonate with audiences due to its authenticity and emotional depth. Chris Bauer continues to remain active in the entertainment industry. Most recently, he appeared on Apple TV+’s science fiction drama series For All Mankind . His ability to adapt to diverse genres—from crime dramas to supernatural thrillers—has kept him relevant across generations. Additionally, Bauer has been involved in theater projects while making guest appearances on popular shows like Law & Order: SVU and Parks and Recreation . His work continues to resonate with audiences due to its authenticity and emotional depth. Personal Life and Relationships Chris Bauer has been married to costume designer Laura Bauer since May 12, 1997. The couple shares two children. Despite his public career, Bauer has maintained a relatively private personal life . Interestingly, he is not related to Kristin Bauer van Straten , his co-star from True Blood , despite their shared surname. Chris Bauer has been married to costume designer Laura Bauer since May 12, 1997. The couple shares two children. Despite his public career, Bauer has maintained a relatively private personal life . Interestingly, he is not related to Kristin Bauer van Straten , his co-star from True Blood , despite their shared surname. Net Worth and Lifestyle As of 2025, Chris Bauer’s estimated net worth is $4 million. His wealth primarily stems from his acting career across television, film, and theater. Notable assets include investments in real estate properties in California. Bauer has also earned from endorsements and guest appearances over the years. Despite his success, he leads a grounded lifestyle focused on family and creative pursuits. As of 2025, Chris Bauer’s estimated net worth is $4 million. His wealth primarily stems from his acting career across television, film, and theater. Notable assets include investments in real estate properties in California. Bauer has also earned from endorsements and guest appearances over the years. Despite his success, he leads a grounded lifestyle focused on family and creative pursuits. Interesting Facts and Trivia Chris Bauer played football during high school but transitioned to acting after discovering his passion for storytelling. Chris Bauer played football during high school but transitioned to acting after discovering his passion for storytelling. He attended the prestigious Yale School of Drama alongside other notable actors. He attended the prestigious Yale School of Drama alongside other notable actors. While filming True Blood , he brought humor to set with behind-the-scenes anecdotes about playing Detective Andy Bellefleur. While filming True Blood , he brought humor to set with behind-the-scenes anecdotes about playing Detective Andy Bellefleur. He is a member of the Atlantic Theater Company based in New York City. He is a member of the Atlantic Theater Company based in New York City. Charitable Work and Legacy Throughout his career, Chris Bauer has supported causes related to education and performing arts. He has participated in charity events aimed at promoting theater education for underprivileged youth. Bauer’s legacy lies in his ability to portray characters with authenticity and nuance. From gritty dramas like The Wire to supernatural tales like True Blood , he has left an indelible mark on television history. Throughout his career, Chris Bauer has supported causes related to education and performing arts. He has participated in charity events aimed at promoting theater education for underprivileged youth. Bauer’s legacy lies in his ability to portray characters with authenticity and nuance. From gritty dramas like The Wire to supernatural tales like True Blood , he has left an indelible mark on television history. Future Plans and Impact on Culture Looking ahead, Chris Bauer is reportedly exploring opportunities behind the camera as a director or producer while continuing to act. His influence extends beyond acting; he serves as an inspiration for aspiring performers who"
  },
  {
    "candidate": "Bauer, Chris F",
    "category": "bio",
    "score": null,
    "link": "https://mabumbe.com/people/chris-bauer-age-net-worth-career-highlights-biography-more/",
    "text": "value craft over celebrity status. Bauer’s enduring presence in Hollywood exemplifies how talent combined with dedication can create a lasting impact on pop culture. Looking ahead, Chris Bauer is reportedly exploring opportunities behind the camera as a director or producer while continuing to act. His influence extends beyond acting; he serves as an inspiration for aspiring performers who value craft over celebrity status. Bauer’s enduring presence in Hollywood exemplifies how talent combined with dedication can create a lasting impact on pop culture. Sign Up For Daily Newsletter Be keep up! Get the latest breaking news delivered straight to your inbox. By signing up, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy . You may unsubscribe at any time. Help Us Improve! Help Us Improve! We’re committed to providing accurate and up-to-date information. If you’ve come across an error or something that needs adjustment, let us know. Your input is invaluable in helping us improve! Send a Suggestion. Share This Article Facebook X Pinterest Whatsapp Whatsapp LinkedIn Telegram Email Copy Link Print Share Stay Connected Stay Connected 248.1k Like 248.1k Like 69.1k Follow 69.1k Follow 134k Pin 134k Pin 54.3k Follow 54.3k Follow Latest News Latest News Shintaro Tsuji Age, Net Worth, Relationships & Biography Celebrity Profiles Dédé Fortin: A Legacy of Music and Mental Health Advocacy Celebrity News Gail Devers: Age, Net Worth, Family, and Career Highlights Celebrity Profiles Lucero: Age, Net Worth, Family & Career Highlights Celebrity Profiles You Might also Like You Might also Like Digger Phelps: Age, Net Worth, Career & Family Bio 6 Min Read Foster Friess: Family, Career Highlights, and Impact on Culture 8 Min Read Douglas Durst: Age, Career Highlights, Net Worth, Family & Bio 8 Min Read Peter Frampton’s Life Story: From Humble Beginnings to Rock Legend 6 Min Read Dive into our constantly updated content featuring breaking headlines about famous people. Discover the latest celebrity news stories, photos, and videos. Explore exclusive insights into celebrity homes, families, and much more. Quick Link Quick Link Tanzania Jobs Tanzania Jobs Jobs in Zambia Jobs in Zambia Jobs in Rwanda Jobs in Rwanda Jobs in Kenya Jobs in Kenya Jobs in Uganda Jobs in Uganda Jobs in Ghana Jobs in Ghana Tenders in Tanzania Tenders in Tanzania Other Countries Jobs Other Countries Jobs Support Support About Us About Us Post A Job Post A Job Post Tender/Post a bid online Post Tender/Post a bid online Contact us Contact us Privacy Privacy Disclaimer Disclaimer Companies Companies Advertise Here Advertise Here Follow US Welcome Back! Sign in to your account Remember me"
  }
]