[
  {
    "candidate": "Blake, Michael A",
    "category": "bio",
    "score": null,
    "link": "https://www.blakemichael.com/bio1",
    "text": "Sign In My Account Sign In My Account Blake Michael… Born in Atlanta, Georgia, Blake Michael is best known for his leading roles in Disney's Dog With a Blog and Lemonade Mouth. He began his career at the age of 3 booking numerous print jobs. When Blake was 5, he enrolled in acting classes with Lisina (Longo) Stoneburner at the Company Acting Studio in Atlanta. It was with Lisina and her staff that Blake's serious love for acting was nurtured and developed. When Blake was 6 he was signed by Atlanta talent agent Joy Pervis, with whom he remained until moving to L.A. Blake's first principal role in a commercial was for Bojangles' Chicken in which he shared the spotlight with NC quarterback Jake Delhomme. He also appeared in the U.S. Army sponsored Mark Schultz music video \"Letters From War.\" Blake's first worldwide exposure came in 2006 when his commercial for the game of the movie Zathura saturated the globe. Blake worked frequently as a model for Macy's for 2 years and in 3rd grade he told his mom that he needed to be home schooled because acting is what he wanted to do. When Blake was 10, he was chosen to be the host of a series of four collaborative commercials for Hasbro Toys and Cartoon Network. This piqued Cartoon Network's interest in him and soon after, they hired him to host his own show for Cartoon Network. Aimed toward an audience of 6-11 year old boys, Blake named the Friday show \"Fried Dynamite\" while the Saturday morning show was called \"Dynamite Action Squad.\" His stint with the network lasted 3 years. In June 2010, Blake's talent was recognized by Disney and he was cast in a lead role, 'Charlie', for the 2011 Disney made for TV movie musical, \"Lemonade Mouth.\" Later in 2010 Blake jumped to the other side of the camera when he wrote and directed a short film, \"Anonymous\" which debuted at teen festivals in April 2011. Then in November Blake snagged a lead in the Disney Channel show Dog with a Blog, featuring a talking dog. Dog With a Blog earned four Emmy nominations. While still filming the show, Blake wrote, directed, and composed the music for another of his original short films, which went on to win an award at the Red Rock Film Festival. As a young boy Blake followed in his big brother's footsteps, pursuing swimming and acquiring many state champion titles as well as a few state records. He also became one of the youngest people to acquire a You Tube partnership at the age of 12. Blake enjoys being active, swimming, traveling, and is an avid car enthusiast and driver. In 2016 he raced a late model race car in a charity event at Irwindale Speedway. He also travels to France when possible to maintain his french proficiency and loves all things french. Blake's older only sibling, Zack, is an aeronautical engineer. Blake co-produced and starred in the R.L. Stine adaptation “Mostly Ghostly” and has recently starred in “Princess of the Row” and “Voltron”, and continues to pursue his talents in the industry. He currently serves as an executive in the creator economy, having worked with dozens of startup companies on their growth and product strategies. https://www.linkedin.com/in/blake-michael/ imdb | facebook | instagram | twitter | tiktok"
  }
]