[
  {
    "candidate": "Blas, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://sarahblas.com/bio-1",
    "text": "Home Bio Platform Contact More Home Bio Platform Contact More Home Bio Platform Contact Home Home Bio Bio Platform Platform Contact Contact Who is Sarah Blas? Political leadership should be the highest form of public service, and I have spent years delivering material solutions for the North Shore. My track record demonstrates the ability to make a meaningful difference, and I am confident I can create an even greater impact if elected to City Council. Political leadership should be the highest form of public service, and I have spent years delivering material solutions for the North Shore. My track record demonstrates the ability to make a meaningful difference, and I am confident I can create an even greater impact if elected to City Council. Staten Island is the place where I’ve raised my family, built my career, and fought for my city’s future. Navigating services for my children, my business, and myself has only deepened my belief that elected officials should prioritize the needs of the people they serve — not personal agendas. Staten Island is the place where I’ve raised my family, built my career, and fought for my city’s future. Navigating services for my children, my business, and myself has only deepened my belief that elected officials should prioritize the needs of the people they serve — not personal agendas. I serve as founder, board member, and instructor for some of Staten Island’s most valued and respected organizations. My results have been recognized and awarded by the City Council, the Mayor’s Office, the New York State Legislature, and many more. I serve as founder, board member, and instructor for some of Staten Island’s most valued and respected organizations. My results have been recognized and awarded by the City Council, the Mayor’s Office, the New York State Legislature, and many more. Learn more about my full track record of service below, and join me in realizing a more resilient Staten Island. Learn more about my full track record of service below, and join me in realizing a more resilient Staten Island. SARAH'S EXTENSIVE INVOLVEMENT IN THE NORTH SHORE: SARAH'S EXTENSIVE INVOLVEMENT IN THE NORTH SHORE: Government Recognition Certificate of Special Congressional Recognition from Congressman Max Rose , 2020, 2021 . Certificate of Special Congressional Recognition from Congresswoman Nicole Malliotakis, 2021. Executive Chamber Certificate of Recognition from Governor Andrew Cuomo, 2021. Certificate of Recognition from NYC Comptroller Brad Lander, 2023. Certificate of Recognition from Richmond County District Attorney Michael E. McMahon, 2021. Certificate of Appreciation from Staten Island Borough President Vito J. Fossella, 2023. Certificate of Appreciation from Staten Island Borough President James Oddo, 2021. Senate Proclamation from NY State Senator Diane Savino, 2020. Assembly Certificate of Merit from NY Assemblymember Charles Fall: 2021, 2022, 2023, 2024. Citation from NY Assemblymember Michael J. Cusack, 2021. Citation from NYC Councilmember Kamillah Hanks, 2023. Citation from NYC Councilmember Deborah Rose: 2018, 2019, 2020. Certificate of Recognition from NYC Community Board #1, 2018. Awarded a City Council Citation for Civic Engagement with Staten Island Woman Who March, 2017. Certificate of Special Congressional Recognition from Congressman Max Rose , 2020, 2021 . Certificate of Special Congressional Recognition from Congresswoman Nicole Malliotakis, 2021. Executive Chamber Certificate of Recognition from Governor Andrew Cuomo, 2021. Certificate of Recognition from NYC Comptroller Brad Lander, 2023. Certificate of Recognition from Richmond County District Attorney Michael E. McMahon, 2021. Certificate of Appreciation from Staten Island Borough President Vito J. Fossella, 2023. Certificate of Appreciation from Staten Island Borough President James Oddo, 2021. Senate Proclamation from NY State Senator Diane Savino, 2020. Assembly Certificate of Merit from NY Assemblymember Charles Fall: 2021, 2022, 2023, 2024. Citation from NY Assemblymember Michael J. Cusack, 2021. Citation from NYC Councilmember Kamillah Hanks, 2023. Citation from NYC Councilmember Deborah Rose: 2018, 2019, 2020. Certificate of Recognition from NYC Community Board #1, 2018. Awarded a City Council Citation for Civic Engagement with Staten Island Woman Who March, 2017. Awards Awarded the Staten Island Woman of Achievement Award by the Staten Island Advance, 2020. Awarded the Friends of Tompkinsville Park Service Award by the Partnership for Parks, 2024. Awarded Peace Action of Staten Island Award by the Peace Action Network for community dedication and service, 2018. Awarded the Staten Island Woman of Achievement Award by the Staten Island Advance, 2020. Awarded the Friends of Tompkinsville Park Service Award by the Partnership for Parks, 2024. Awarded Peace Action of Staten Island Award by the Peace Action Network for community dedication and service, 2018. Civic Engagement Former Director of"
  },
  {
    "candidate": "Blas, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://sarahblas.com/bio-1",
    "text": "Equity and Inclusion for Staten Island Women Who March, 2018. Instructor at Dare to Run, 2019. Co-founder of Food Policy Reformers, 2024. Graduate of the Campaign School at Yale University, 2018. Former Director of Equity and Inclusion for Staten Island Women Who March, 2018. Instructor at Dare to Run, 2019. Co-founder of Food Policy Reformers, 2024. Graduate of the Campaign School at Yale University, 2018. Commitment to the Non-Profit Sector Former Director of Health for House of Community Baituljamaat, 2022. Founder of Staten Island Therapeutic Gardens, 2017. Co-founder of the Afro-Caribbean Latin X Food & Spice Market, 2024. Co-founder of The Staten Island Environmental Justice Coalition, 2023. Awarded the Unsung Hero Award by Non-Profit Staten Island, 2022 Awarded a Certificate of Appreciation by the Muslim Sisters of Staten Island, 2018. Awarded Recognition of Community Impact by the Staten Island Zoo, 2022. Former Director of Health for House of Community Baituljamaat, 2022. Founder of Staten Island Therapeutic Gardens, 2017. Co-founder of the Afro-Caribbean Latin X Food & Spice Market, 2024. Co-founder of The Staten Island Environmental Justice Coalition, 2023. Awarded the Unsung Hero Award by Non-Profit Staten Island, 2022 Awarded a Certificate of Appreciation by the Muslim Sisters of Staten Island, 2018. Awarded Recognition of Community Impact by the Staten Island Zoo, 2022. Board Member Service Board Member of Destiny Housing, Present. Vice President for the Voorspuy Memorial Scholarship, Present. Board Member of the Alice Austen House Museum, Present. Board Member of Destiny Housing, Present. Vice President for the Voorspuy Memorial Scholarship, Present. Board Member of the Alice Austen House Museum, Present. Public Health & Disaster-Relief Response Member of PREP-SI, an emergency coalition working closely with the NYC Department of Emergency Management to provide disaster relief and resources for the most vulnerable. Awarded the Staten Island Women of Achievement Award due to her pandemic response, 2021. Awarded the RCDA Black Excellence in Public Health Award by the Office of the District Attorney, 2021. Member of PREP-SI, an emergency coalition working closely with the NYC Department of Emergency Management to provide disaster relief and resources for the most vulnerable. Awarded the Staten Island Women of Achievement Award due to her pandemic response, 2021. Awarded the Staten Island Women of Achievement Award due to her pandemic response, 2021. Awarded the RCDA Black Excellence in Public Health Award by the Office of the District Attorney, 2021. Youth & Education Equity & Community Impact Lead at the Child Wellness Initiative, 2023. Parent-Elected Membe r of the CEC (Community Education Council) for District 31, where she chaired the Special Education Committee, 2020. Founder & Principal Consultan t at Community Impact Strategies, Present. Equity & Community Impact Lead at the Child Wellness Initiative, 2023. Parent-Elected Membe r of the CEC (Community Education Council) for District 31, where she chaired the Special Education Committee, 2020. Founder & Principal Consultan t at Community Impact Strategies, Present. Parks & Open Spaces Representative of Climate Strong Communities with the Mayor’s Office of Climate & Environmental Justice, 2023. Co-Founder Friends of Mahoney Park, Present. Volunteer at the Staten Island Urban Center, Present. Volunteer at Friends of Tompkinsville Park, Present. Representative of Climate Strong Communities with the Mayor’s Office of Climate & Environmental Justice, 2023. Co-Founder Friends of Mahoney Park, Present. Volunteer at the Staten Island Urban Center, Present. Volunteer at Friends of Tompkinsville Park, Present. Connect With Us Connect With Us Copyright © 2025 Sarah Blas for Staten island Copyright © 2025 Sarah Blas for Staten island Paid for by Sarah Blas for Staten Island Paid for by Sarah Blas for Staten Island Home Bio Platform Contact This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
  },
  {
    "candidate": "Blas, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://newdestinyhousing.org/bio-sarah-blas/",
    "text": "Menu About Board Our Team Jobs and Internships Stories of Hope Financial Info and Annual Reports Contact Us Board Our Team Jobs and Internships Stories of Hope Financial Info and Annual Reports Contact Us Programs Family Support Program Housing Access and Stability Services Emergency Housing Voucher Program Family Support Program Housing Access and Stability Services Emergency Housing Voucher Program Buildings Supportive Housing Other Developments Projects In Development Supportive Housing Other Developments Projects In Development Housing Help FAQ Emergency Shelter Housing Transfers NYCHA Housing Rental Subsidies ACS Housing Subsidy CityFHEPS State FHEPS Pathway Home NYCHA Section 8 Other Section 8 Programs Affordable Apartments Housing Connect (Housing Lottery) Eviction Prevention Common Obstacles Resources and Links FAQ Emergency Shelter Housing Transfers NYCHA Housing Rental Subsidies ACS Housing Subsidy CityFHEPS State FHEPS Pathway Home NYCHA Section 8 Other Section 8 Programs ACS Housing Subsidy CityFHEPS State FHEPS Pathway Home NYCHA Section 8 Other Section 8 Programs Affordable Apartments Housing Connect (Housing Lottery) Housing Connect (Housing Lottery) Eviction Prevention Common Obstacles Resources and Links Advocacy Policy Priorities Testimony/Support New Destiny Reports Family Homelessness Coalition Policy Priorities Testimony/Support New Destiny Reports Family Homelessness Coalition Ways to Give Donate Rising Leaders Council Donate Rising Leaders Council Events/News Press Newsletters Awards Blog Events Annual Cocktail Benefit 2025 2025 TCS NYC Marathon Third Annual Symposium Press Newsletters Awards Blog Events Annual Cocktail Benefit 2025 2025 TCS NYC Marathon Third Annual Symposium Home > Bio > Sarah Blas Sarah Blas (she/her/hers) Sarah Blas is a native New Yorker and a mother of six. She has made it her life’s mission to combat identity-based oppression within vulnerable communities. With over two decades of experience in her field, she has been a transformative force in New York City. Sarah has been at the helm of the DOVE Project on Staten Island with Staten Island Urban Center, which focuses on domestic violence prevention. She is a champion in promoting domestic violence resources through community radio. Sarah uses her platform to share her lived experience and provide a lifeline to those in need. Her contributions have earned her numerous accolades, including the Eric Adams Mayoral Citation for community improvement and the Staten Island Woman of Achievement Award for her heroic efforts during the COVID-19 pandemic. She has also been recognized by the State of New York with a Gubernatorial Certificate of Recognition in 2021 and a State Senate Proclamation for Community Impact in the same year. Sarah’s relentless commitment to social justice, and domestic violence prevention has left an indelible mark on the communities she serves, making her a revered figure in her field. She joined the Board of New Destiny in 2023. Sarah Blas (she/her/hers) Sarah Blas is a native New Yorker and a mother of six. She has made it her life’s mission to combat identity-based oppression within vulnerable communities. With over two decades of experience in her field, she has been a transformative force in New York City. Sarah Blas is a native New Yorker and a mother of six. She has made it her life’s mission to combat identity-based oppression within vulnerable communities. With over two decades of experience in her field, she has been a transformative force in New York City. Sarah has been at the helm of the DOVE Project on Staten Island with Staten Island Urban Center, which focuses on domestic violence prevention. She is a champion in promoting domestic violence resources through community radio. Sarah uses her platform to share her lived experience and provide a lifeline to those in need. Sarah has been at the helm of the DOVE Project on Staten Island with Staten Island Urban Center, which focuses on domestic violence prevention. She is a champion in promoting domestic violence resources through community radio. Sarah uses her platform to share her lived experience and provide a lifeline to those in need. Her contributions have earned her numerous accolades, including the Eric Adams Mayoral Citation for community improvement and the Staten Island Woman of Achievement Award for her heroic efforts during the COVID-19 pandemic. She has also been recognized by the State of New York with a Gubernatorial Certificate of Recognition in 2021 and a State Senate Proclamation for Community Impact in the same year. Sarah’s relentless commitment to social justice, and domestic violence prevention has left an indelible mark on the communities she serves, making her a revered figure in her field. She joined the Board of New Destiny in 2023. Her contributions have earned her numerous accolades, including the Eric Adams Mayoral"
  },
  {
    "candidate": "Blas, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://newdestinyhousing.org/bio-sarah-blas/",
    "text": "Citation for community improvement and the Staten Island Woman of Achievement Award for her heroic efforts during the COVID-19 pandemic. She has also been recognized by the State of New York with a Gubernatorial Certificate of Recognition in 2021 and a State Senate Proclamation for Community Impact in the same year. Sarah’s relentless commitment to social justice, and domestic violence prevention has left an indelible mark on the communities she serves, making her a revered figure in her field. She joined the Board of New Destiny in 2023. Comments are closed. FAQs How do domestic violence survivors find housing? This is the first of a series of videos to help visitors find quick answers to their questions. Visit... Read more Can you help me find an apartment? New Destiny’s website has a section on finding affordable housing. Most affordable housing is accessed through New York City’s... Read more How can I find housing if I have a criminal background, bad credit history and history with housing court (eviction)? Having a criminal history, poor credit or poor rental history can make it more difficult to find an apartment.... Read more Impact 11 supportive housing projects with 407 units for domestic violence survivors developed 140 units of affordable housing for domestic violence survivors in development 100 Nearly 100% of domestic violence survivors stably housed and 99% violence free in 2024 1060 adults and children received on‑site services in our supportive housing buildings in 2024 1160 domestic violence survivors housed by Housing Access and Stability Services in the 5 boroughs New Destiny Housing Corporation 12 West 37 Street, 7th floor New York, NY 10018 Call Us: Subscribe to our newsletter Receive news & updates about New Destiny Housing We do not share or sell our email list. Ever. Receive news & updates about New Destiny Housing We do not share or sell our email list. Ever. Receive news & updates about New Destiny Housing We do not share or sell our email list. Ever. We do not share or sell our email list. Ever. Email (required) * Email (required) * First Name * First Name * Last Name * Last Name * Job Title Job Title Company Company Sign-up Form Example: Yes, I would like to receive emails from New Destiny Housing. (You can unsubscribe anytime) Example: Yes, I would like to receive emails from New Destiny Housing. (You can unsubscribe anytime) Copyright Ⓒ 2025 - New Destiny Housing Corporation. All Rights Reserved. Websites for nonprofits by Elevation Elevation"
  }
]