[
  {
    "candidate": "Bondy, Faith",
    "category": "bio",
    "score": null,
    "link": "https://www.faithbondy.com/",
    "text": "0 0 DONATE ABOUT FAITH Faith Bondy is a lifelong Democrat and New Yorker who has been deeply connected to every part of the 4th City Council District for over three decades. She has resided in East Midtown for nearly 25 years with her husband, Matthew, and two daughters, Lila and Rose. Faith has been an active and respected litigator for over 25 years and has been recognized by Super Lawyers as a Rising Star, Top Women Attorney, and Super Lawyer for her advocacy. She graduated from Binghamton University and the Benjamin N. Cardozo School of Law. Faith has demonstrated a deep-seated commitment to preserving and improving the quality of life in New York City, in her community, and in her neighborhood. She has established herself as a staunch advocate for the community concerning education, public safety, housing, and quality of life issues affecting New Yorkers. She is the President of the Samuel J. Tilden Democratic Club, one of the oldest and most highly respected Democratic clubs in New York City; a Board member of, and legal advisor to, the Sutton Place Parks Conservancy, a charitable organization whose mission is to help preserve and maintain several parks in the midtown east community; a member and Officer of the Board of Directors of the East Sixties Neighborhood Association, and a former member of Community Board 8’s Street Life Committee. As a public school parent, Faith has unparalleled experience with education issues affecting our community. For a decade, she served as a member of the Executive Board of the PTA of PS 59, a local District 2 public elementary school, as well as several years as a member of the School Leadership Team. Faith seeks to bring all of this experience to the City Council as your representative for the 4th City Council District, where she will passionately advocate for pragmatic and practical solutions with only the best interests of the District, its residents, children, and businesses at heart and in mind. DONATE FAITH’S PRIORITIES: Quality of Life Always prioritize the needs and concerns of those who live, work, and do business in the community. Fight every day to deliver our fair share of funding, resources, and opportunities to protect and better our quality of life including by working to curb abuses by mopeds and e-bikes through stricter laws and enforcement; expanding rat mitigation efforts and funding; and increasing sanitation initiatives within the District to ensure clean and accessible streets. Parks & Green Spaces Beautify, maintain, and expand parks and green spaces by increasing funding for the Parks Department; funding capital improvements; supporting organizations that maintain our parks and organize programming within them; funding new green space projects; securing private funding of public green space; and ensuring that the Parks Department is fully staffed. Public Schools Deliver more funding to ensure that we expand the number of local K-12 public schools in our District and that those schools can serve all students, offer robust arts and enrichment programs that provide opportunities to learn both inside and outside the classroom, and furnish our children with the best chance for success. Public Safety Work to maximize funding for our local police precincts so that they have all the resources necessary to protect our District; increase foot patrols and community policing initiatives in our District; foster mutual respect and appreciation between the community, elected officials, and law enforcement partners; fight against antisemitism and all forms of hate; and reduce retail theft and encourage the return of businesses to our community. Nobody should feel unsafe in our community or traveling around our District or City. ABOUT NYC COUNCIL DISTRICT 4 District 4 covers much of eastern Manhattan, including some or all of: the Upper East Side, Midtown, Stuyvesant Town–Peter Cooper Village, Turtle Bay, Murray Hill, and Koreatown. The UN Headquarters, Rockefeller Center, and many other central Manhattan landmarks are located in the district. ENDORSEMENTS 1199 SEIU United Healthcare Workers East District Council 37 Council of School Supervisors & Administrators Advocate for: Students with Special Needs, Parks, Landmarks, and Cultural Affairs Neil Barclay Sarah Chu Longtime Community Board 8 Member* Community Advocate; Board Member, Sutton Area Community Ann Marie Folan JR Havlan Former PTA President, JHS 104 Hon. Benjamin Kallos Former New York City Council Member, District 5 Elyssa Kates President, Sutton Place Parks Conservancy*; Parks and Community Advocate State Committee Person, 74th AD; Former President, Samuel J. Tilden Democratic Club Christopher Collins District Leader, 74th AD, Part B Myrna LePree Florie Huppert Small Business Owner; Public"
  },
  {
    "candidate": "Bondy, Faith",
    "category": "bio",
    "score": null,
    "link": "https://www.faithbondy.com/",
    "text": "School Parent Kevin O’Keefe President, St. Vartan’s Park Conservancy and MECA*; Parks and Community Advocate Small Business Owner; Public School Parent; Community Advocate Joelle Obsatz Sandra Roth Small Business Owner; PTA Executive Board Member*; Public School Parent Former PTA President, SLT and Executive Board Member, PS 59 Rachael Lissman Andrew Fine Community Activist; Vice President, East 86th Street Association* PTA President and SLT Member, MS 255* Clare Huston Former PTA President, PS 59 and JHS 104 Jessa Schwartz Medical Professional Eileen McAleer Letty Simon Board Member, Sutton Place Parks Conservancy*; Community Advocate Former District Leader, 63rd AD, Part A and 74th AD, Part C; Former President, Waterside Tenants Association Steven Smollens Bettina Teodoro Former PTA President and SLT Member, MS 255* Education Advocate Alexandra Beess und Chrostin Mark Thompson Former Chair, Community Board Six Manhattan; Stuyvesant Town Community Leader Former President, Sutton Place Parks Conservancy Pat Scharlin Taylor District Leader, 74th AD, Part C; former State Committee Persn, 74th AD; retired NYC DOE Educator; Committee to Honor Dr. May Edward Chinn Michelle D. Winfield Former Chair, Community Board Six Manhattan Claude L. Winfield Michael Laval & Shari Fox-Laval Community Advocates President, East 78th Street Block Association* Bryan Verona *Organization listed for identification purposes only. FAITH IN THE NEWS The general election for the seat held by term-limited city council member Keith Powers in District 4 is not until November 2025, but community activist Faith Bondy… (READ MORE) The event evolved over a six month period bringing the community together under one banner thanks to CUI and to Faith Bondy who chaired the event… (READ MORE) GET INVOLVED Sign up for our email list Name * First Name Last Name Email * Message Thank you! Sign up to volunteer Name * First Name Last Name Email * Message Thank you! ABOUT FAITH Faith Bondy is a lifelong Democrat and New Yorker who has been deeply connected to every part of the 4th City Council District for over three decades. She has resided in East Midtown for nearly 25 years with her husband, Matthew, and two daughters, Lila and Rose. Faith has been an active and respected litigator for over 25 years and has been recognized by Super Lawyers as a Rising Star, Top Women Attorney, and Super Lawyer for her advocacy. She graduated from Binghamton University and the Benjamin N. Cardozo School of Law. Faith has demonstrated a deep-seated commitment to preserving and improving the quality of life in New York City, in her community, and in her neighborhood. She has established herself as a staunch advocate for the community concerning education, public safety, housing, and quality of life issues affecting New Yorkers. She is the President of the Samuel J. Tilden Democratic Club, one of the oldest and most highly respected Democratic clubs in New York City; a Board member of, and legal advisor to, the Sutton Place Parks Conservancy, a charitable organization whose mission is to help preserve and maintain several parks in the midtown east community; a member and Officer of the Board of Directors of the East Sixties Neighborhood Association, and a former member of Community Board 8’s Street Life Committee. As a public school parent, Faith has unparalleled experience with education issues affecting our community. For a decade, she served as a member of the Executive Board of the PTA of PS 59, a local District 2 public elementary school, as well as several years as a member of the School Leadership Team. Faith seeks to bring all of this experience to the City Council as your representative for the 4th City Council District, where she will passionately advocate for pragmatic and practical solutions with only the best interests of the District, its residents, children, and businesses at heart and in mind. FAITH’S PRIORITIES: Quality of Life Quality of Life Always prioritize the needs and concerns of those who live, work, and do business in the community. Fight every day to deliver our fair share of funding, resources, and opportunities to protect and better our quality of life including by working to curb abuses by mopeds and e-bikes through stricter laws and enforcement; expanding rat mitigation efforts and funding; and increasing sanitation initiatives within the District to ensure clean and accessible streets. Parks & Green Spaces Parks & Green Spaces Beautify, maintain, and expand parks and green spaces by increasing funding for the Parks Department; funding capital improvements; supporting organizations that maintain our parks and organize programming within them; funding new green space projects; securing private"
  },
  {
    "candidate": "Bondy, Faith",
    "category": "bio",
    "score": null,
    "link": "https://www.faithbondy.com/",
    "text": "funding of public green space; and ensuring that the Parks Department is fully staffed. Public Schools Public Schools Deliver more funding to ensure that we expand the number of local K-12 public schools in our District and that those schools can serve all students, offer robust arts and enrichment programs that provide opportunities to learn both inside and outside the classroom, and furnish our children with the best chance for success. Public Safety Public Safety Work to maximize funding for our local police precincts so that they have all the resources necessary to protect our District; increase foot patrols and community policing initiatives in our District; foster mutual respect and appreciation between the community, elected officials, and law enforcement partners; fight against antisemitism and all forms of hate; and reduce retail theft and encourage the return of businesses to our community. Nobody should feel unsafe in our community or traveling around our District or City. ABOUT NYC COUNCIL DISTRICT 4 ABOUT NYC COUNCIL DISTRICT 4 District 4 covers much of eastern Manhattan, including some or all of: the Upper East Side, Midtown, Stuyvesant Town–Peter Cooper Village, Turtle Bay, Murray Hill, and Koreatown. The UN Headquarters, Rockefeller Center, and many other central Manhattan landmarks are located in the district. District 4 covers much of eastern Manhattan, including some or all of: the Upper East Side, Midtown, Stuyvesant Town–Peter Cooper Village, Turtle Bay, Murray Hill, and Koreatown. The UN Headquarters, Rockefeller Center, and many other central Manhattan landmarks are located in the district. ENDORSEMENTS 1199 SEIU United Healthcare Workers East District Council 37 Council of School Supervisors & Administrators Advocate for: Students with Special Needs, Parks, Landmarks, and Cultural Affairs Advocate for: Students with Special Needs, Parks, Landmarks, and Cultural Affairs Neil Barclay Neil Barclay Sarah Chu Longtime Community Board 8 Member* Community Advocate; Board Member, Sutton Area Community Ann Marie Folan JR Havlan Former PTA President, JHS 104 Hon. Benjamin Kallos Former New York City Council Member, District 5 Elyssa Kates President, Sutton Place Parks Conservancy*; Parks and Community Advocate State Committee Person, 74th AD; Former President, Samuel J. Tilden Democratic Club Christopher Collins District Leader, 74th AD, Part B Myrna LePree Florie Huppert Small Business Owner; Public School Parent Kevin O’Keefe President, St. Vartan’s Park Conservancy and MECA*; Parks and Community Advocate Small Business Owner; Public School Parent; Community Advocate Joelle Obsatz Sandra Roth Small Business Owner; PTA Executive Board Member*; Public School Parent Former PTA President, SLT and Executive Board Member, PS 59 Rachael Lissman Andrew Fine Community Activist; Vice President, East 86th Street Association* PTA President and SLT Member, MS 255* Clare Huston Former PTA President, PS 59 and JHS 104 Jessa Schwartz Medical Professional Eileen McAleer Letty Simon Board Member, Sutton Place Parks Conservancy*; Community Advocate Former District Leader, 63rd AD, Part A and 74th AD, Part C; Former President, Waterside Tenants Association Steven Smollens Bettina Teodoro Former PTA President and SLT Member, MS 255* Education Advocate Alexandra Beess und Chrostin Mark Thompson Former Chair, Community Board Six Manhattan; Stuyvesant Town Community Leader Former President, Sutton Place Parks Conservancy Pat Scharlin Taylor District Leader, 74th AD, Part C; former State Committee Persn, 74th AD; retired NYC DOE Educator; Committee to Honor Dr. May Edward Chinn Michelle D. Winfield Former Chair, Community Board Six Manhattan Claude L. Winfield Michael Laval & Shari Fox-Laval Community Advocates President, East 78th Street Block Association* Bryan Verona *Organization listed for identification purposes only. FAITH IN THE NEWS The general election for the seat held by term-limited city council member Keith Powers in District 4 is not until November 2025, but community activist Faith Bondy… (READ MORE) The event evolved over a six month period bringing the community together under one banner thanks to CUI and to Faith Bondy who chaired the event… (READ MORE) GET INVOLVED Sign up for our email list Sign up for our email list * First Name Last Name * Sign up to volunteer Sign up to volunteer * First Name Last Name * faith@faithbondy.com PAID FOR BY FAITH BONDY 2025"
  }
]