[
  {
    "candidate": "Brown, Telee",
    "category": "bio",
    "score": null,
    "link": "https://brown4citycouncil.com/about/",
    "text": "About Policies Contact Main Menu About Policies Contact About Telee Brown A Leader With a Vision Dedicated and committed to advocacy and community development, championing initiatives that drive lasting social impact. Biography The Journey to Public Service Telee Brown has dedicated his life to improving the lives of citizens through thoughtful policy, community engagement, and forward-thinking leadership. Born and raised in our city, Brown understands firsthand the challenges and opportunities that shape our community. With over two decades of experience in community organizing, immigrant advocacy, and social services, Deacon Telee Brown has been instrumental in empowering diverse communities across Staten Island, the U.S., and Liberia. His leadership has fostered meaningful change, securing critical resources and creating spaces that promote cultural preservation and social development. Outside his political life, Brown is an avid runner, volunteers at the local food bank, and enjoys spending quality time with his family exploring the natural beauty of our region. View Policy Platform > Contact Brown Career Journey Timeline Of Achievements A look at the milestones and contributions that have shaped Telee Brown’s Career in Public service and community leadership. February 2, 2014 February 2, 2014 Elected City Council Member Became the youngest elected official on the city council, focusing on urban development and community engagement March 11, 2014 March 11, 2014 Little Liberian Way Godard vegan heirloom sartorial flannel raw denim +1 umami gluten-free hella vinyl. Viral seitan chillwave, before they sold out wayfarers selvage skateboard Pinterest messenger bag. November 15, 2014 November 15, 2014 Giving Back Foundation Twee DIY kale chips, dreamcatcher scenester mustache leggings trust fund Pinterest pickled. Williamsburg street art Odd Future jean shorts cold-pressed banh mi DIY distillery Williamsburg. Click here Now Visual Journey Moments that Matter Explore key moments from Telee Brown’s career and community involvement through this visual gallery Little Liberia Way Little Liberia Way in Staten Island is a landmark achievement recognizing the cultural, economic, and historical contributions of the Liberian community . This initiative not only celebrates the rich heritage of Liberians in Staten Island but also fosters a sense of identity, unity, and pride among residents. Old Folks Food Bank A dedicated space for seniors to showcase and sell cultural products, traditional food, and artisanal crafts . This initiative not only provides economic opportunities but also serves as a vital platform for preserving and sharing heritage with future generations. Giving Back Foundation A foundation established with a clear mission: to uplift underserved communities by providing essential resources, educational opportunities, and social support programs that empower individuals to build better futures. View Full Gallery About Telee Brown About Telee Brown A Leader With a Vision Dedicated and committed to advocacy and community development, championing initiatives that drive lasting social impact. Biography The Journey to Public Service Telee Brown has dedicated his life to improving the lives of citizens through thoughtful policy, community engagement, and forward-thinking leadership. Born and raised in our city, Brown understands firsthand the challenges and opportunities that shape our community. With over two decades of experience in community organizing, immigrant advocacy, and social services, Deacon Telee Brown has been instrumental in empowering diverse communities across Staten Island, the U.S., and Liberia. His leadership has fostered meaningful change, securing critical resources and creating spaces that promote cultural preservation and social development. Outside his political life, Brown is an avid runner, volunteers at the local food bank, and enjoys spending quality time with his family exploring the natural beauty of our region. View Policy Platform > View Policy Platform > Contact Brown Contact Brown Career Journey Career Journey Timeline Of Achievements A look at the milestones and contributions that have shaped Telee Brown’s Career in Public service and community leadership. Elected City Council Member Became the youngest elected official on the city council, focusing on urban development and community engagement Little Liberian Way Godard vegan heirloom sartorial flannel raw denim +1 umami gluten-free hella vinyl. Viral seitan chillwave, before they sold out wayfarers selvage skateboard Pinterest messenger bag. Giving Back Foundation Twee DIY kale chips, dreamcatcher scenester mustache leggings trust fund Pinterest pickled. Williamsburg street art Odd Future jean shorts cold-pressed banh mi DIY distillery Williamsburg. Click here Click here Now Now Visual Journey Visual Journey Moments that Matter Explore key moments from Telee Brown’s career and community involvement through this visual gallery Little Liberia Way Little Liberia Way in Staten Island is a landmark achievement recognizing the cultural, economic, and historical contributions of the Liberian community . This initiative not only celebrates the rich heritage"
  },
  {
    "candidate": "Brown, Telee",
    "category": "bio",
    "score": null,
    "link": "https://brown4citycouncil.com/about/",
    "text": "of Liberians in Staten Island but also fosters a sense of identity, unity, and pride among residents. Little Liberia Way in Staten Island is a landmark achievement recognizing the cultural, economic, and historical contributions of the Liberian community . This initiative not only celebrates the rich heritage of Liberians in Staten Island but also fosters a sense of identity, unity, and pride among residents. Old Folks Food Bank A dedicated space for seniors to showcase and sell cultural products, traditional food, and artisanal crafts . This initiative not only provides economic opportunities but also serves as a vital platform for preserving and sharing heritage with future generations. A dedicated space for seniors to showcase and sell cultural products, traditional food, and artisanal crafts . This initiative not only provides economic opportunities but also serves as a vital platform for preserving and sharing heritage with future generations. Giving Back Foundation A foundation established with a clear mission: to uplift underserved communities by providing essential resources, educational opportunities, and social support programs that empower individuals to build better futures. A foundation established with a clear mission: to uplift underserved communities by providing essential resources, educational opportunities, and social support programs that empower individuals to build better futures. View Full Gallery View Full Gallery Fighting for a better future with progressive policies and community focused leadership. Contact Detail Address: 123 Staten Island, New York City Number : +1 (718) 496-7492 Email:telee@brown4citycouncil.com Mon to Fri: 9.00 AM – 5.00 PM Quick Links About Policies Contact Copyright © 2025 Powered by [Breodan IT]"
  },
  {
    "candidate": "Brown, Telee",
    "category": "bio",
    "score": null,
    "link": "https://brown4citycouncil.com/",
    "text": "About Policies Contact Main Menu About Policies Contact C.H.A.R.G.E Community, Housing, Advocacy, Rights, Growth Empowerment A Stronger Future for Staten Island & NYC!” Get Involved Learn More About Telee Brown C.H.A.R.G.E. – Leading the Charge for Our Community Telee Brown is a man who has dedicated his life to public service. working tirelessly to improve the lives of citizens through thoughtful policy, community engagement, and forward-thinking leadership. With a deep passion for serving the people of the 49th District, Telee has consistently advocated for policies that promote economic opportunity, public safety, education, and social justice. Experience Over 20+ years un public service and community leadership. Read full Biography >>> Education Master's in Public Policy, with focus on Urban Development Key Policy Priorities Telee’s comprehensive platform addresses the most important issues facing our community, with practical solutions and clear vision for the future. Economic Growth & Jobs Promoting economic and workforce development. Affordable Housing Fighting for affordable and accessible housing for all. Immigrant & Workers’ Rights Championing immigrant rights, economic justice, and social services. View All Policies Why Telee Brown? Community: Strengthening local engagement and leadership. Housing: Fighting for affordable and accessible housing for all. Advocacy: Championing immigrant rights, economic justice, and social services. 2000+ People across many backgrounds 93% Successful Cases 40+ Professional Consultations 20+ Homes Helped Call Us 24/7 +1(718) 4967492 OR Get to know us as we are here for you!! Write to Us C.H.A.R.G.E C.H.A.R.G.E Community, Housing, Advocacy, Rights, Growth Empowerment A Stronger Future for Staten Island & NYC!” Get Involved Get Involved Learn More Learn More About Telee Brown About Telee Brown C.H.A.R.G.E. – Leading the Charge for Our Community Experience Experience Over 20+ years un public service and community leadership. Read full Biography >>> Education Education Master's in Public Policy, with focus on Urban Development Key Policy Priorities Telee’s comprehensive platform addresses the most important issues facing our community, with practical solutions and clear vision for the future. Economic Growth & Jobs Promoting economic and workforce development. Affordable Housing Fighting for affordable and accessible housing for all. Immigrant & Workers’ Rights Championing immigrant rights, economic justice, and social services. View All Policies View All Policies Why Telee Brown? Community: Strengthening local engagement and leadership. Housing: Fighting for affordable and accessible housing for all. Advocacy: Championing immigrant rights, economic justice, and social services. 2000+ People across many backgrounds 93% Successful Cases 40+ Professional Consultations 20+ Homes Helped Call Us 24/7 +1(718) 4967492 OR OR Get to know us as we are here for you!! Write to Us Write to Us Fighting for a better future with progressive policies and community focused leadership. Contact Detail Address: 123 Staten Island, New York City Number : +1 (718) 496-7492 Email:telee@brown4citycouncil.com Mon to Fri: 9.00 AM – 5.00 PM Quick Links About Policies Contact Copyright © 2025 Powered by [Breodan IT]"
  }
]