[
  {
    "candidate": "Carr, David M",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/David_M._Carr",
    "text": "Main menu Main page Main page Contents Contents Current events Current events Random article Random article About Wikipedia About Wikipedia Contact us Contact us Help Help Learn to edit Learn to edit Community portal Community portal Recent changes Recent changes Upload file Upload file Special pages Special pages Search Appearance Donate Donate Create account Create account Log in Log in Personal tools Donate Donate Create account Create account Log in Log in learn more Contributions Contributions Talk Talk Contents (Top) 1 Works Toggle Works subsection 1.1 Thesis 1.2 Books 1.3 Papers 1.4 Chapters 1 Works Toggle Works subsection 1.1 Thesis 1.1 Thesis 1.2 Books 1.2 Books 1.3 Papers 1.3 Papers 1.4 Chapters 1.4 Chapters 2 References 2 References Toggle the table of contents David M. Carr David M. Carr 1 language Deutsch Deutsch Edit links Article Article Talk Talk English Read Read Edit Edit View history View history Tools Read Read Edit Edit View history View history What links here What links here Related changes Related changes Upload file Upload file Permanent link Permanent link Page information Page information Cite this page Cite this page Get shortened URL Get shortened URL Download QR code Download QR code Download as PDF Download as PDF Printable version Printable version Wikidata item Wikidata item David McLain Carr is Professor of Old Testament at the Union Theological Seminary in New York City. [ 1 ] He is a leading scholar of the textual formation of the Hebrew Bible . [ 2 ] [ ] [ ] Carr received his B.A. from Carleton College in 1980, his M.T.S., from the Candler School of Theology at Emory University in 1983, and his Ph.D. from Claremont Graduate School in 1988. [ 3 ] [ ] Joshua Berman describes Carr's The Formation of the Hebrew Bible: A New Reconstruction as a \"convention-smashing\" book in its use of epigraphic evidence to demonstrate that \"many of the forms of editing routinely hypothesized by source critics of the Torah were not employed anywhere else in the ancient Near East.\" [ 4 ] Formation is considered a significant contribution to the empirical side of biblical source criticism. [ ] In Holy Resilience: The Bible’s Traumatic Origins Carr, a Quaker and a committed pacifist , argues that the Old Testament was composed by the Jews in exile in Babylon and reflects their suffering as an exiled and oppressed minority group; and the Christian Bible was likewise shaped by the unspeakable shame of having a crucified savior . The book has received positive blurbs from biblical scholars like Israel Finkelstein , Daniel L. Smith-Christopher and Walter Brueggemann , [ 5 ] however, Carr's argument has been criticized for ignoring the consensus among Biblical linguists that the Hebrew Bible was written in pre-exilic Hebrew that would have been impossible for scribes in the period of the Babylonian exile to replicate. [ 4 ] [ ] [ ] Works [ edit ] [ edit ] Thesis [ edit ] [ edit ] Carr, David M. (1988). Royal Ideology and the Technology of Faith: a comparative midrash study of 1 Kgs. 3:2-15 (Ph.D.). Claremont Graduate School. OCLC 20591573 . Books [ edit ] [ edit ] Carr, David M. (1991). From D to Q: A Study of Early Jewish Interpretations of Solomon's Dream at Gibeon . Society of Biblical Literature monograph series. Vol. 44. Atlanta, GA: Scholars Press. ISBN 978-1-555-40528-1 . OCLC 24380332 . - thoroughly revised version of Ph.D. Thesis ——— (1996). Reading the Fractures of Genesis: Historical and Literary Approaches . Louisville, KY: Westminster, John Knox Press. ISBN 978-0-664-22071-6 . OCLC 33664323 . ———; Weis, Richard D., eds. (1996). A gift of God in due season : essays on scripture and community in honor of James A. Sanders . Journal for the Study of the Old Testament, Supplement series. Vol. 225. Sheffield, England: Sheffield Academic Press. ISBN 978-1-850-75626-2 . OCLC 37480916 . ——— (2003). The Erotic Word: Sexuality, Spirituality and the Bible . New York: Oxford University Press. ISBN 978-0-195-15652-2 . OCLC 50091614 . ——— (2005). Writing on the Tablet of the Heart: Origins of Western Scripture and Literature . New York; Oxford: Oxford University Press. ISBN 978-0-195-17297-3 . OCLC 54753370 . ——— (2010). An Introduction to the Old Testament: sacred texts and imperial contexts of the Hebrew Bible . Chichester, West Sussex; Malden, MA: Wiley-Blackwell. ISBN 978-1-405-18468-7 . OCLC 455419934 . ——— (2011). The Formation of the Hebrew Bible: A New Reconstruction . New York: Oxford University Press. ISBN 978-0-199-74260-8 . OCLC 671916759 ."
  },
  {
    "candidate": "Carr, David M",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/David_M._Carr",
    "text": "——— (2014). Holy Resilience: The Bible's Traumatic Origins . New Haven: Yale University Press. ISBN 978-0-300-20456-8 . OCLC 877369828 . ——— (2020). The Formation of Genesis 1-11: Biblical and Other Precursors . Oxford University Press. ISBN 978-0190062569 . Papers [ edit ] [ edit ] \"Narrative and the real world: An argument for continuity\", History and Theory (1986), pp. 117–131 \"Torah on the Heart: Literary Jewish Textuality Within Its Ancient Near Eastern Context\" Oral Tradition (2010), pp. Chapters [ edit ] [ edit ] ——— (1996). \"Canonization in the Context of Community\". In Weis, Richard D.; ——— (eds.). A gift of God in due season : essays on scripture and community in honor of James A. Sanders . Journal for the Study of the Old Testament, Supplement series. Vol. 225. Sheffield, England: Sheffield Academic Press. ISBN 978-1-850-75626-2 . OCLC 37480916 . ——— (2015). \"The Formation of the Hebrew Bible: Sources, Compositional Layers, and Other Revisions\". In Niditch, Susan (ed.). The Wiley Blackwell Companion to Ancient Israel . Wiley-Blackwell. ISBN 978-0470656778 . References [ edit ] [ edit ] ^ \"David Carr - Union Theological Seminary\" . Archived from the original on 2012-10-23 . Retrieved 2012-12-03 . ^ \"David Carr - Union Theological Seminary\" . Archived from the original on 2012-10-23 . Retrieved 2012-12-03 . . Retrieved 2012-12-03 2012-12-03 ^ \"Interview with David M. Carr- Current state of Bible Scholarship\" . The Book of Doctrines and Opinions . 8 January 2012. ^ \"Interview with David M. Carr- Current state of Bible Scholarship\" . The Book of Doctrines and Opinions . 8 January 2012. ^ \"David M. Carr\" . Union Theological Seminary . Retrieved 2019-10-17 . ^ \"David M. Carr\" . Union Theological Seminary . Retrieved 2019-10-17 . . Retrieved 2019-10-17 2019-10-17 ^ a b Berman, Joshua (10 July 2017). \"The Corruption of Biblical Studies\" . Mosaic . Retrieved 11 July 2017 . ^ a b Berman, Joshua (10 July 2017). \"The Corruption of Biblical Studies\" . Mosaic . Retrieved 11 July 2017 . . Retrieved 11 July 2017 11 July ^ Carr, David M. \"Info About And Reviews Of Holy Resilience: The Bible's Traumatic Origins (Yale University Press, Fall 2014)\" . Retrieved January 5, 2024 . ^ Carr, David M. \"Info About And Reviews Of Holy Resilience: The Bible's Traumatic Origins (Yale University Press, Fall 2014)\" . Retrieved January 5, 2024 . . Retrieved January 5, 2024 January 5, v t e Columbia University Jewish Theological Seminary Columbia University Jewish Theological Seminary Henry Sloane Coffin Joseph C. Hough Jr. Serene Jones Henry Sloane Coffin Joseph C. Hough Jr. Serene Jones Founding Charles Butler Former William Greenough Thayer Shedd Charles Augustus Briggs Reinhold Niebuhr Paul Tillich John Macquarrie Robert Pollack Raymond E. Brown Edward Robinson Henry Sloane Coffin James H. Cone Dorothee Sölle Beverly Wildung Harrison Harry Emerson Fosdick Harry F. Ward Walter Wink Roger Haight Harrison S. Elliot J. Brooke Mosley Present Mary C. Boys David M. Carr Paul F. Knitter Chung Hyun Kyung Christopher Morse John Anthony McGuckin Ann Belford Ulanov Cornel West Charles Butler Charles Butler William Greenough Thayer Shedd Charles Augustus Briggs Reinhold Niebuhr Paul Tillich John Macquarrie Robert Pollack Raymond E. Brown Edward Robinson Henry Sloane Coffin James H. Cone Dorothee Sölle Beverly Wildung Harrison Harry Emerson Fosdick Harry F. Ward Walter Wink Roger Haight Harrison S. Elliot J. Brooke Mosley William Greenough Thayer Shedd Charles Augustus Briggs Reinhold Niebuhr Paul Tillich John Macquarrie Robert Pollack Raymond E. Brown Edward Robinson Henry Sloane Coffin James H. Cone Dorothee Sölle Beverly Wildung Harrison Harry Emerson Fosdick Harry F. Ward Walter Wink Roger Haight Harrison S. Elliot J. Brooke Mosley Mary C. Boys David M. Carr Paul F. Knitter Chung Hyun Kyung Christopher Morse John Anthony McGuckin Ann Belford Ulanov Cornel West Mary C. Boys David M. Carr Paul F. Knitter Chung Hyun Kyung Christopher Morse John Anthony McGuckin Ann Belford Ulanov Cornel West Union Seminary Quarterly Review Union Seminary Quarterly Review ISNI VIAF 2 WorldCat ISNI ISNI VIAF 2 VIAF 2 2 WorldCat WorldCat Germany United States France BnF data Italy Netherlands Sweden Israel Belgium Germany Germany United States United States France France BnF data BnF data Italy Italy Italy Netherlands Netherlands Sweden Sweden Israel Israel Belgium Belgium DDB DDB DDB IdRef IdRef IdRef Living people Old Testament scholars Union Theological Seminary faculty Emory University alumni Carleton College alumni Candler School of Theology alumni Claremont Graduate University alumni American Christian writers 20th-century Quakers 21st-century Quakers Quaker writers Articles with short description Short description matches Wikidata Place of birth"
  },
  {
    "candidate": "Carr, David M",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/David_M._Carr",
    "text": "missing (living people) Year of birth missing (living people) This page was last edited on 29 September 2024, at 19:22 (UTC) . (UTC) Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Toggle the table of contents David M. Carr 1 language Add topic"
  }
]