[
  {
    "candidate": "Carter-Williams, Jozette",
    "category": "bio",
    "score": null,
    "link": "https://jozettefornorthshore.com/meet-jozette-carter-williams/",
    "text": "Meet Jozette Meet Jozette Volunteer Volunteer News News Events Events Platform Platform Donate Donate Main Menu Meet Jozette Carter-Williams · Meet Jozette Carter-Williams · Meet Jozette Carter-Williams · Meet Jozette Carter-Williams · Meet Jozette Carter-Williams Jozette Carter-Williams is a dynamic individual with a rich personal and professional history that showcases her resilience, creativity, and commitment to making a meaningful difference. Born in Brooklyn, NY and at the age of 3 years, she moved to Staten Island where she has lived for more than 50 yrs. Jozette’s heritage reflects her deep Puerto Rican and Taino roots, which have shaped her strength and perspective. Jozette’s academic journey is marked by ambition and adaptability. She attended Immaculate Conception School, spent three formative years at Staten Island Tech, and graduated from New Dorp High School. She further honed her analytical and technical skills at the College of Staten Island, where she studied Computer Science with a minor in Accounting. Currently, she is pursuing her passion for art and storytelling at the Academy of Art University, working toward a degree in Photography and the Arts. Her professional career spans nearly three decades, beginning in 1995 with a successful tenure in the banking industry that lasted until 2024. However, Jozette’s entrepreneurial spirit led her to found JoJo Cee Photography in 2010. Through this venture, she not only captured meaningful moments but also gave back to the community, contributing her talents to organizations such as the American Cancer Society, Blue Lives Matter, and Autism Warriors. Jozette’s dedication to service extends far beyond her career. She is the visionary founder of two non-profit organizations that honor the legacy of her late ex-husband, Police Officer Gerard Carter, who tragically lost his life in the line of duty. The Police Officer Gerard Carter Athletic Organization (established in 2001) and the PO Gerard Carter Foundation (founded in 2019) provide vital support and opportunities to children in the Stapleton community—an area deeply connected to Officer Carter’s work and sacrifice. These initiatives reflect Jozette’s unwavering commitment to uplifting others and fostering positive change. On a personal level, Jozette’s life is filled with love and purpose. She is married to Grady Williams and is a proud mother of three children—Louis, Selena, and Jason—and two bonus children, Grady IV and Jenese. She brings the same passion and dedication to her family as she does to her professional and philanthropic pursuits. Jozette has also served on numerous boards, where her leadership, compassion, and strategic thinking have made a tangible impact. Whether mentoring children, empowering underserved communities, or building strong organizations, Jozette’s actions speak louder than words. Her blend of technical expertise, creative vision, and deep-rooted commitment to service makes Jozette Carter-Williams a remarkable candidate for any role. She is not just a professional; she is a change-maker who leads with empathy and delivers results. If you are seeking someone who can inspire, innovate, and drive meaningful progress, Jozette is the ideal choice. Meet Jozette Carter-Williams Jozette Carter-Williams is a dynamic individual with a rich personal and professional history that showcases her resilience, creativity, and commitment to making a meaningful difference. Jozette Carter-Williams is a dynamic individual with a rich personal and professional history that showcases her resilience, creativity, and commitment to making a meaningful difference. Born in Brooklyn, NY and at the age of 3 years, she moved to Staten Island where she has lived for more than 50 yrs. Jozette’s heritage reflects her deep Puerto Rican and Taino roots, which have shaped her strength and perspective. Jozette’s academic journey is marked by ambition and adaptability. She attended Immaculate Conception School, spent three formative years at Staten Island Tech, and graduated from New Dorp High School. She further honed her analytical and technical skills at the College of Staten Island, where she studied Computer Science with a minor in Accounting. Currently, she is pursuing her passion for art and storytelling at the Academy of Art University, working toward a degree in Photography and the Arts. Her professional career spans nearly three decades, beginning in 1995 with a successful tenure in the banking industry that lasted until 2024. However, Jozette’s entrepreneurial spirit led her to found JoJo Cee Photography in 2010. Through this venture, she not only captured meaningful moments but also gave back to the community, contributing her talents to organizations such as the American Cancer Society, Blue Lives Matter, and Autism Warriors. Jozette’s dedication to service extends far beyond her career. She is the visionary founder of two non-profit organizations that honor the legacy of"
  },
  {
    "candidate": "Carter-Williams, Jozette",
    "category": "bio",
    "score": null,
    "link": "https://jozettefornorthshore.com/meet-jozette-carter-williams/",
    "text": "her late ex-husband, Police Officer Gerard Carter, who tragically lost his life in the line of duty. The Police Officer Gerard Carter Athletic Organization (established in 2001) and the PO Gerard Carter Foundation (founded in 2019) provide vital support and opportunities to children in the Stapleton community—an area deeply connected to Officer Carter’s work and sacrifice. These initiatives reflect Jozette’s unwavering commitment to uplifting others and fostering positive change. On a personal level, Jozette’s life is filled with love and purpose. She is married to Grady Williams and is a proud mother of three children—Louis, Selena, and Jason—and two bonus children, Grady IV and Jenese. She brings the same passion and dedication to her family as she does to her professional and philanthropic pursuits. Jozette has also served on numerous boards, where her leadership, compassion, and strategic thinking have made a tangible impact. Whether mentoring children, empowering underserved communities, or building strong organizations, Jozette’s actions speak louder than words. Her blend of technical expertise, creative vision, and deep-rooted commitment to service makes Jozette Carter-Williams a remarkable candidate for any role. She is not just a professional; she is a change-maker who leads with empathy and delivers results. If you are seeking someone who can inspire, innovate, and drive meaningful progress, Jozette is the ideal choice. Education ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Awards, Training, and Acknowledgments Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award 120th Precinct 2024 Minority Woman in Business Community Award Volunteer Work 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors Quote: “Change will not come if we wait for some other person or if we wait for some other time. We are the ones we’ve been waiting for. We are the change that we seek.” – Pres. Barack Obama Education ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Awards, Training, and Acknowledgments Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award 120th Precinct 2024 Minority Woman in Business Community Award Volunteer Work 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors Quote: “Change will not come if we wait for some other person or if we wait for some other time. We are the ones we’ve been waiting for. We are the change that we seek.” – Pres. Barack Obama Jozette’s academic journey is marked by ambition and adaptability. She attended Immaculate Conception School, spent three formative years at Staten Island Tech, and graduated from New Dorp High School. She further honed her analytical and technical skills at the College of Staten Island, where she studied Computer Science with a minor in Accounting. Currently, she is pursuing her passion for art and storytelling at the Academy of Art University, working toward a degree in Photography and the Arts. Her professional career spans nearly three decades, beginning in 1995 with a successful tenure in the banking industry that lasted until 2024. However, Jozette’s entrepreneurial spirit led her to found JoJo Cee Photography in 2010. Through this venture, she not only captured meaningful moments but also gave back to the community, contributing her talents to organizations such as the American Cancer Society, Blue Lives Matter, and Autism Warriors. Jozette’s dedication to service extends far beyond her career. She is the visionary founder of two non-profit organizations that honor the legacy of her late ex-husband, Police Officer Gerard Carter, who tragically lost his life in the line of duty. The Police Officer Gerard Carter Athletic Organization (established in 2001) and the PO Gerard Carter Foundation (founded in 2019) provide vital support and opportunities to children in the Stapleton community—an area"
  },
  {
    "candidate": "Carter-Williams, Jozette",
    "category": "bio",
    "score": null,
    "link": "https://jozettefornorthshore.com/meet-jozette-carter-williams/",
    "text": "deeply connected to Officer Carter’s work and sacrifice. These initiatives reflect Jozette’s unwavering commitment to uplifting others and fostering positive change. On a personal level, Jozette’s life is filled with love and purpose. She is married to Grady Williams and is a proud mother of three children—Louis, Selena, and Jason—and two bonus children, Grady IV and Jenese. She brings the same passion and dedication to her family as she does to her professional and philanthropic pursuits. Jozette has also served on numerous boards, where her leadership, compassion, and strategic thinking have made a tangible impact. Whether mentoring children, empowering underserved communities, or building strong organizations, Jozette’s actions speak louder than words. Her blend of technical expertise, creative vision, and deep-rooted commitment to service makes Jozette Carter-Williams a remarkable candidate for any role. She is not just a professional; she is a change-maker who leads with empathy and delivers results. If you are seeking someone who can inspire, innovate, and drive meaningful progress, Jozette is the ideal choice. Jozette’s academic journey is marked by ambition and adaptability. She attended Immaculate Conception School, spent three formative years at Staten Island Tech, and graduated from New Dorp High School. She further honed her analytical and technical skills at the College of Staten Island, where she studied Computer Science with a minor in Accounting. Currently, she is pursuing her passion for art and storytelling at the Academy of Art University, working toward a degree in Photography and the Arts. Her professional career spans nearly three decades, beginning in 1995 with a successful tenure in the banking industry that lasted until 2024. However, Jozette’s entrepreneurial spirit led her to found JoJo Cee Photography in 2010. Through this venture, she not only captured meaningful moments but also gave back to the community, contributing her talents to organizations such as the American Cancer Society, Blue Lives Matter, and Autism Warriors. Jozette’s dedication to service extends far beyond her career. She is the visionary founder of two non-profit organizations that honor the legacy of her late ex-husband, Police Officer Gerard Carter, who tragically lost his life in the line of duty. The Police Officer Gerard Carter Athletic Organization (established in 2001) and the PO Gerard Carter Foundation (founded in 2019) provide vital support and opportunities to children in the Stapleton community—an area deeply connected to Officer Carter’s work and sacrifice. These initiatives reflect Jozette’s unwavering commitment to uplifting others and fostering positive change. On a personal level, Jozette’s life is filled with love and purpose. She is married to Grady Williams and is a proud mother of three children—Louis, Selena, and Jason—and two bonus children, Grady IV and Jenese. She brings the same passion and dedication to her family as she does to her professional and philanthropic pursuits. Jozette has also served on numerous boards, where her leadership, compassion, and strategic thinking have made a tangible impact. Whether mentoring children, empowering underserved communities, or building strong organizations, Jozette’s actions speak louder than words. Her blend of technical expertise, creative vision, and deep-rooted commitment to service makes Jozette Carter-Williams a remarkable candidate for any role. She is not just a professional; she is a change-maker who leads with empathy and delivers results. If you are seeking someone who can inspire, innovate, and drive meaningful progress, Jozette is the ideal choice. Education ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Awards, Training, and Acknowledgments Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award 120th Precinct 2024 Minority Woman in Business Community Award Volunteer Work 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors Quote: “Change will not come if we wait for some other person or if we wait for some other time. We are the ones we’ve been waiting for. We are the change that we seek.” – Pres. Barack Obama ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award"
  },
  {
    "candidate": "Carter-Williams, Jozette",
    "category": "bio",
    "score": null,
    "link": "https://jozettefornorthshore.com/meet-jozette-carter-williams/",
    "text": "120th Precinct 2024 Minority Woman in Business Community Award 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors “Change will not come if we wait for some other person or if we wait for some other time. We are the ones we’ve been waiting for. We are the change that we seek.” Education ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Awards, Training, and Acknowledgments Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award 120th Precinct 2024 Minority Woman in Business Community Award Volunteer Work 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors ACADEMY OF ART UNIVERSITY – California, Major: Photography COLLEGE OF STATEN ISLAND – Staten Island, NY, Major: Computer Science Minor: Accounting Training in Bank Knowledge, SUCCESS Training, Management Training 2018 Schnep’s Power Woman in Business Award 2019 Community Appreciation Award 120th Precinct 2024 Minority Woman in Business Community Award 2009 – Present: Founder, The Police Officer Gerard Carter Foundation 2010 – Present: Owner and Operator of JoJo Cee Photography 2018 – 2024: Board Member, The JCC of Staten Island 2019 – 2024: Member of The Brighton Kiwanis Club 2021 – 2024: Board Chairman, United Activities Unlimited (UAU) 2023 – Present: Fraternal Order of Police, Honorary Member 2024 – Present: Volunteer Photographer, Autism Warriors “Change will not come if we wait for some other person or if we wait for some other time. We are the ones we’ve been waiting for. We are the change that we seek.” Join the movement to bring back integrity to the North Shore. Host Coffee Clutch Host Fundraiser Petitions Request Sign Donate Host Coffee Clutch Host Fundraiser Petitions Request Sign Donate Host Coffee Clutch Host Fundraiser Petitions Request Sign Donate Host Coffee Clutch Host Coffee Clutch Host Fundraiser Host Fundraiser Petitions Petitions Request Sign Request Sign Donate Donate Meet Jozette Meet Jozette Volunteer Volunteer News News Events Events Platform Platform Donate Donate Meet Jozette Meet Jozette Volunteer Volunteer News News Events Events Platform Platform Donate Donate Scroll to Top"
  }
]