[
  {
    "candidate": "Caruso, Alexander J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Alexander_Caruso",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Alexander Caruso Alexander Caruso Alexander Caruso Democratic Party Candidate, New York City Council District 19 June 24, 2025 Education Francis Lewis High School Queens College, 2021 Queens College, 2023 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Campaign TikTok Personal LinkedIn Alexander Caruso ( Democratic Party ) is running for election to the New York City Council to represent District 19 . He is on the ballot in the Democratic primary on June 24, 2025 . Caruso completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Alexander Caruso was born in New York, New York . He graduated from Francis Lewis High School. He earned a bachelor's degree from Queens College in 2021 and a graduate degree from Queens College in 2023. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 19 Alexander Caruso and Benjamin Chou are running in the Democratic primary for New York City Council District 19 on June 24, 2025. Candidate Alexander Caruso Benjamin Chou There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 19 Incumbent Vickie Paladino is running in the Republican primary for New York City Council District 19 on June 24, 2025. Candidate Vickie Paladino Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Alexander Caruso completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Caruso's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. I’m a Gen Z substitute teacher and political organizer, born & raised in Bayside, Queens. Raised by an Italian father and Colombian mother, both in the legal profession, understanding the law, justice, and doing the right thing runs in my blood. As a teacher, I know first-hand how broken our public education system is in NYC. I couldn't stand by working in a system that fails our children. I’m running for the same reason I became a teacher—for the kids. If we’re not building a better society for them, then what’s the point? That means addressing our housing crisis, building better schools, and having a city government ran by tried and true public servants. This is why I’m running for NYC Council District 19. I’m a Gen Z substitute teacher and political organizer, born & raised in Bayside, Queens. Raised by an Italian father and Colombian mother, both in the legal profession, understanding the law, justice, and doing the right thing runs in my blood."
  },
  {
    "candidate": "Caruso, Alexander J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Alexander_Caruso",
    "text": "As a teacher, I know first-hand how broken our public education system is in NYC. I couldn't stand by working in a system that fails our children. I’m running for the same reason I became a teacher—for the kids. If we’re not building a better society for them, then what’s the point? That means addressing our housing crisis, building better schools, and having a city government ran by tried and true public servants. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? This is a call to all Queens, both residential and commercial alike to Unite! Around forty percent (24,133 units) of NYC Council District 19 are renters. We need a City Council, with the will and courage to stand up to the real estate lobby, The Real Estate Board of New York, REBNY. -Office Conversions: Turning vacant office spaces into affordable housing units -Expanding supportive housing that integrates on-site services to help vulnerable populations -Empowering communities to control land, prevent displacement, and ensure housing remains permanently affordable. -Increasing the supply of affordable housing, incentivizing mixed-income development, and leveraging federal and state resources for sustainable growth. An educator by trade, I have a passion and focus for the education system. New York State spends upwards of 45 billion dollars on education in NYC, which is the largest municipal education budget in the country. Yet our schools don’t rank in the top 10 in the United States. Unfortunately, this system has declined, spurred by poor leadership during DeBlasio and Adams mayoral administration. In the last decade alone, NYC has seen lowered test standards, and literacy rates, and cut the arts programs. Resulting in a decline in the quality of our student’s education across the board. -Fight for universal after-school programs. -Make CUNY colleges tuition-free! -Fair Pay for Our Paraprofessionals -Build more schools! Public safety extends to more than just tackling crime; it requires a holistic approach that ensures safe streets, safe communities, and trusted public institutions. I will work to create safer neighborhoods without compromising justice and fairness. At the end of the day, I wanna fund cops, NOT robots! We need to investing in Alternatives: Funding mental health response teams, violence interruption programs, and reentry support to address the root causes of crime and promote community safety. -Supporting common-sense gun laws -community-based violence prevention - Expanding Vision Zero -safe storage regulations to keep firearms out of the wrong hands. This is a call to all Queens, both residential and commercial alike to Unite! Around forty percent (24,133 units) of NYC Council District 19 are renters. We need a City Council, with the will and courage to stand up to the real estate lobby, The Real Estate Board of New York, REBNY. -Office Conversions: Turning vacant office spaces into affordable housing units -Expanding supportive housing that integrates on-site services to help vulnerable populations -Empowering communities to control land, prevent displacement, and ensure housing remains permanently affordable. -Increasing the supply of affordable housing, incentivizing mixed-income development, and leveraging federal and state resources for sustainable growth. -Office Conversions: Turning vacant office spaces into affordable housing units -Expanding supportive housing that integrates on-site services to help vulnerable populations -Empowering communities to control land, prevent displacement, and ensure housing remains permanently affordable. An educator by trade, I have a passion and focus for the education system. New York State spends upwards of 45 billion dollars on education in NYC, which is the largest municipal education budget in the country. Yet our schools don’t rank in the top 10 in the United States. Unfortunately, this system has declined, spurred by poor leadership during DeBlasio and Adams mayoral administration. In the last decade alone, NYC has seen lowered test standards, and literacy rates, and cut the arts programs. Resulting in a decline in the quality of our student’s education across the board. -Fight for universal after-school programs. -Make CUNY colleges tuition-free! -Fair Pay for Our Paraprofessionals -Build more schools! Public safety extends to more than just tackling crime; it requires a holistic approach that ensures safe streets, safe communities, and trusted public institutions. I will work to create safer neighborhoods without compromising justice and fairness. At the end of the day, I wanna fund cops, NOT robots! We need to investing in Alternatives: Funding mental health response teams, violence interruption programs, and reentry support to address the root causes of crime and promote community safety. -Supporting common-sense gun laws"
  },
  {
    "candidate": "Caruso, Alexander J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Alexander_Caruso",
    "text": "-community-based violence prevention - Expanding Vision Zero -safe storage regulations to keep firearms out of the wrong hands. What areas of public policy are you personally passionate about? The Democratic Party is in an identity crisis! Neo-liberalism has tainted the idea of what it means to be a public servant. We had it right back when we were the Party of FDR—the days of the New Deal Democrats. We need to get back to our roots and fight for working-class Americans. The way we do that is by ensuring constituent services are proactive, not reactive, and that district offices are hubs for organizing so that constituents can access the tools, skills, and training needed to find solutions to local problems. -Organize a working-class bloc within the City Council to influence not only the Speaker’s race, committee chairs, and memberships. -Implement internal rules and reforms that limit the overwhelming power in govt. The way we do that is by ensuring constituent services are proactive, not reactive, and that district offices are hubs for organizing so that constituents can access the tools, skills, and training needed to find solutions to local problems. -Organize a working-class bloc within the City Council to influence not only the Speaker’s race, committee chairs, and memberships. Who do you look up to? Whose example would you like to follow, and why? I have always been a fan of New Deal Democrats such as President FDR and JFK. It was these great men that paved the way for the workers' rights we have today. What characteristics or principles are most important for an elected official? What qualities do you possess that you believe would make you a successful officeholder? Someone who isn't a career poilitican. Someone who wants to run for office because it is the right thing to do. They are not a politlcian but rather a public servant to the people. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? At just eight years old, I proudly watching Barack Obama--the first African American to be elected President of the United States. It was on that day I knew real change truly was possible in the United States. What qualities does this office possess that makes it a unique and important part of the local government? The Democratic Party need to get back to our roots and fight for working-class Americans. We achieve this by organizing a working-class bloc within the City Council to influence not only the Speaker’s race, committee chairs, and memberships, but also the adoption of session rules and the budget process and outcome. Implement internal rules and reforms that limit the overwhelming power of the Speaker over the Council’s legislative and budget agenda and push the bounds of the body’s power as the effective counterweight to the Mayoralty. Use working groups, resident councils, and/or neighborhood block groups to influence decision-making, increase understanding of local government processes, and facilitate constant communication and co-governance. Implement internal rules and reforms that limit the overwhelming power of the Speaker over the Council’s legislative and budget agenda and push the bounds of the body’s power as the effective counterweight to the Mayoralty. What organizations or individuals have endorsed your campaign? Working Family's Party Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 19 Website Facebook Twitter Instagram TikTok Candidate New York City Council District 19 Website Facebook Twitter Instagram TikTok Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 21, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 21, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public"
  },
  {
    "candidate": "Caruso, Alexander J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Alexander_Caruso",
    "text": "Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional"
  },
  {
    "candidate": "Caruso, Alexander J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Alexander_Caruso",
    "text": "elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]