[
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Theo Chino-Tavarez Theo Chino-Tavarez Theo Chino-Tavarez This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Democratic Party November 7, 2023 Education University of Alaska Theo Chino-Tavarez ( Democratic Party ) ran for election for New York City Public Advocate . He will not appear on the ballot for the Democratic primary on June 24, 2025 . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.3 2021 2.4 2019 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.2.1 Endorsements 2.3 2021 2.3 2021 2.4 2019 2.4 2019 3 Campaign themes 3.1 2025 3.2 2023 3.3 2021 3.4 2019 3.4.1 Ballotpedia biographical submission form 3 Campaign themes 3.1 2025 3.1 2025 3.2 2023 3.2 2023 3.3 2021 3.3 2021 3.4 2019 3.4.1 Ballotpedia biographical submission form 3.4 2019 3.4.1 Ballotpedia biographical submission form 3.4.1 Ballotpedia biographical submission form 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Chino graduated from the University of Alaska with a degree in management information service. His professional experience includes working as a computer engineer. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Public Advocate Incumbent Jumaane Williams , Martin Dolan , and Jenifer Rajkumar are running in the Democratic primary for New York City Public Advocate on June 24, 2025. Candidate Jumaane Williams Submit photo Martin Dolan Jenifer Rajkumar Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Theo Chino-Tavarez (D) Republican primary election Republican primary for New York City Public Advocate Angela Aquino is running in the Republican primary for New York City Public Advocate on June 24, 2025. Candidate Submit photo Angela Aquino There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . 2023 2023 See also: City elections in New York, New York (2023) General election General election for New York City Council District 7 Incumbent Shaun Abreu won election in the general election for New York City Council District 7 on November 7, 2023. Candidate % Votes ✔ Submit photo Shaun Abreu (D) 97.4 13,061 Other/Write-in votes 2.6 355 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 13,416 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Emily Yuexin Miller (Recovery Party) Kathleen Lally (Medical Freedom Party) Davon Phillips (Freedom Party) Theo Chino-Tavarez (Social Democratic Party) Democratic primary election Democratic Primary for New York City Council District 7 The following candidates"
  },
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "advanced in the ranked-choice voting election: Shaun Abreu in round 1 . Candidate ✔ Submit photo Shaun Abreu Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Withdrawn or disqualified candidates Keith Harris (D) Republican primary election Republican Primary for New York City Council District 7 Candidate There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Withdrawn or disqualified candidates Emily Yuexin Miller (R) Endorsements Endorsements Ballotpedia did not identify endorsements for Chino-Tavarez in this election. 2021 2021 See also: City elections in New York, New York (2021) General election General election for New York City Public Advocate Incumbent Jumaane Williams defeated Devi Nampiaparampil , Anthony Herbert , and Devin Balkind in the general election for New York City Public Advocate on November 2, 2021. Candidate % Votes ✔ Jumaane Williams (D) 68.4 744,183 Submit photo Devi Nampiaparampil (R / Save Our City Party) 23.4 254,491 Anthony Herbert (Conservative Party / Independent Party) 6.8 73,943 Devin Balkind (L) 1.3 14,352 Other/Write-in votes 0.2 1,701 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 1,088,670 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic Primary for New York City Public Advocate The following candidates advanced in the ranked-choice voting election: Jumaane Williams in round 1 . Candidate % Total Votes Transfer Round eliminated Jumaane Williams 70.0 572,762 0 Advanced (1) Anthony Herbert 21.2 173,858 0 1 Theo Chino-Tavarez 7.8 64,053 0 1 Undeclared Write-ins Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. 1.0 8,049 0 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 818,722 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Republican primary election The Republican primary election was canceled. Devi Nampiaparampil advanced from the Republican primary for New York City Public Advocate. Conservative Party primary election The Conservative Party primary election was canceled. Anthony Herbert advanced from the Conservative Party primary for New York City Public Advocate. 2019 2019 See also: Public advocate election in New York, New York (2019) General election Special general election for New York City Public Advocate The following candidates ran in the special general election for New York City Public Advocate on February 26, 2019. Candidate % Votes ✔ Jumaane Williams (Nonpartisan) 32.8 138,803 Eric Ulrich (Nonpartisan) 19.0 80,308 Melissa Mark-Viverito (Nonpartisan) 11.2 47,375 Michael Blake (Nonpartisan) 8.4 35,416 Ydanis Rodriguez (Nonpartisan) 6.0 25,253 Submit photo Dawn Smalls (Nonpartisan) 4.1 17,420 Rafael Espinal (Nonpartisan) 3.2 13,482 Daniel O'Donnell (Nonpartisan) 3.0 12,774 Ron Kim (Nonpartisan) 2.8 11,849 Submit photo Benjamin Yee (Nonpartisan) 2.5 10,701 Nomiki Konst (Nonpartisan) 2.3 9,738 Submit photo Helal Sheikh (Nonpartisan) 1.3 5,347 David Eisenbach (Nonpartisan) 0.8 3,491 Submit photo Manny Alicandro (Nonpartisan) 0.8 3,373 Anthony Herbert (Nonpartisan) 0.8 3,189 Latrice Walker (Nonpartisan) 0.6 2,549 Submit photo Jared Rich (Nonpartisan) 0.2 1,053 Other/Write-in votes 0.2 825 There were no incumbents in this race. The results have been certified. Source"
  },
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "There were no incumbents in this race. The results have been certified. Source Total votes: 422,946 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Danniel Maio (Nonpartisan) Gary Popkin (Nonpartisan) Ifeoma Ike (Nonpartisan) Mike Zumbluskas (Nonpartisan) Walter Iwachiw (Nonpartisan) Theo Chino-Tavarez (Nonpartisan) Though the special election was nonpartisan , candidates were allowed to file with their own party line as long as it did not resemble an established political party's name. [2] Click [show] below to see the list of party lines for each candidate. Manny Alicandro Better Leadership Michael Blake For The People Theo Chino Courage To Change David Eisenbach Stop REBNY Rafael Espinal Livable City Anthony L. Herbert Housing Residents First Ifeoma Ike People Over Profit Walter Iwachiw I4panyc Ron Kim People Over Corporations Nomiki Konst Pay People More Danniel Maio I Like Maio Melissa Mark-Viverito Fix the MTA Daniel O'Donnell Equality For All Gary Popkin Liberal Jared Rich Jared Rich For NYC Ydanis Rodriguez UNITED FOR IMMIGRANTS Helal Sheikh Friends Of Helal Dawn Smalls No More Delays Eric Ulrich Common Sense Latrice Walker People For Walker Jumaane Williams The People's Voice Benjamin Yee COMMUNITY EMPOWERMENT Mike Zumbluskas FIX MTA & NYCHA NOW Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Theo Chino-Tavarez did not complete Ballotpedia's 2025 Candidate Connection survey. 2023 2023 Theo Chino-Tavarez did not complete Ballotpedia's 2023 Candidate Connection survey. 2021 2021 Theo Chino-Tavarez did not complete Ballotpedia's 2021 Candidate Connection survey. 2019 2019 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Theo Chino-Tavarez completed Ballotpedia's Candidate Connection survey. The survey questions appear in bold and are followed by Chino-Tavarez's responses. What would be your top three priorities, if elected? - Placing the sharing of information by getting the Commission on Public Information and Communication to hold a monthly meeting. - Getting the Governor and the Mayor to resolve the Subways problems. - Working closely with the various NYCHA board to understand where the process breaks down. What areas of public policy are you personally passionate about? I am very interested in New York technology policies; Encryption, Blockchain, Privacy. Who do you look up to? Whose example would you like to follow, and why? Fiorello La Guardia. The legend make him being the most honest Mayor. Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? Scorsese's Gangs of New York because it doesn't seems to be fiction. What characteristics or principles are most important for an elected official? Truthful and always strive for consensus. What qualities do you possess that you believe would make you a successful officeholder? Ability to acknowledge and convey that I don't always have the answer but will seek them. Ability to reach consensus. What do you believe are the core responsibilities for someone elected to this office? To represent the voiceless and the disenfranchised. What legacy would you like to leave? That future elected official understand that one doesn't need to be continually pandering to be effective and affect change. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? The fall of the Berlin wall. What was your very first job? How long did you have it? First ever job was Cashier at Sloan's Supermarket on 2nd avenue and 40th street. First ever career position was Perpecta, Inc in San Francisco for a year. What happened on your most awkward date? Stuck on the subway and being late several hours. What is your favorite holiday? Why? January 1st as it is just an arbitrary point in time and space. What is your favorite book? Why? The Bourne Identity by Robert Ludlum. If you could be any fictional character, who would you want to be? A mix of Speedy Gonzales and the Tasmanian Devil. What is your favorite thing in your home or apartment? Why? The rent amount because it is cheap. What is something that has been a struggle in your life? Too visionary. Are there any little-known powers or responsibilities held by"
  },
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "this office that you believe more people should be aware of? The Commission on Public Information and Communication. What kind of skills or expertise do you believe would be the most helpful for the holders of this office to possess? To be curious. What qualities does this office possess that makes it a unique and important part of the local government? The chairmanship of The Commission on Public Information and Communication. Do you believe that it’s beneficial for holders of this office to have previous experience in government or politics? No. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. Ballotpedia biographical submission form Ballotpedia biographical submission form The candidate completed Ballotpedia's biographical information submission form: “ What is your political philosophy? I decided to run for office when I witnessed the incapacity of the current elected officials to understand how technology adversely affects people. Their misconceptions around it allow the widening of inequality. [3] I decided to run for office when I witnessed the incapacity of the current elected officials to understand how technology adversely affects people. Their misconceptions around it allow the widening of inequality. [3] ” —Theo Chino [1] See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Footnotes Footnotes ↑ 1.0 1.1 Information submitted on Ballotpedia’s biographical information submission form on December 4, 2018 ↑ 1.0 1.1 Information submitted on Ballotpedia’s biographical information submission form on December 4, 2018 ↑ Gotham Gazette , \"23 Candidates Submit Petitions to Get on February 26 Public Advocate Ballot,\" January 15, 2019 ↑ Gotham Gazette , \"23 Candidates Submit Petitions to Get on February 26 Public Advocate Ballot,\" January 15, 2019 ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2019 challenger 2021 challenger 2021 primary (defeated) 2023 challenger 2025 challenger Democratic Party Marquee, general candidate, 2019 Municipal candidate, 2019 Municipal candidate, 2021 Municipal candidate, 2023 Municipal candidate, 2025 Municipal candidates New York New York City Council candidate (Disqualified), 2023 New York City Council candidate, 2023 New York City Public Advocate candidate (Disqualified), 2019 New York City Public Advocate candidate (Withdrew), 2025 New York City Public Advocate candidate, 2019 New York City Public Advocate candidate, 2021 New York City Public Advocate candidate, 2025 Nonpartisan Social Democratic Party Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit"
  },
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot"
  },
  {
    "candidate": "Chino-Tavarez, Theo B",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theo_Chino-Tavarez",
    "text": "Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]