[
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou_(Texas)",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Benjamin Chou (Texas) Benjamin Chou (Texas) Benjamin Chou (Texas) This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Democratic Party May 24, 2022 Education Rice University, 2013 Northwestern University, 2020 Northwestern University, 2020 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Benjamin Chou ( Democratic Party ) (also known as Ben) ran for election to the Harris County Commissioners Court to represent District 4 in Texas. He lost in the Democratic primary runoff on May 24, 2022 . Chou completed Ballotpedia's Candidate Connection survey in 2022. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2022 2.1.1 Endorsements 2 Elections 2.1 2022 2.1.1 Endorsements 2.1 2022 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2022 3 Campaign themes 3.1 2022 3.1 2022 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Benjamin Chou was born in Houston, Texas . He earned a bachelor's degree from Rice University in 2013 and both a graduate degree and a law degree from Northwestern University in 2020. [1] Elections Elections 2022 2022 See also: Municipal elections in Harris County, Texas (2022) General election General election for Harris County Commissioners Court Precinct 4 Lesley Briones defeated incumbent R. Jack Cagle in the general election for Harris County Commissioners Court Precinct 4 on November 8, 2022. Candidate % Votes ✔ Lesley Briones (D) 51.7 122,644 Submit photo R. Jack Cagle (R) 48.3 114,718 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 237,362 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary runoff election Democratic primary runoff for Harris County Commissioners Court Precinct 4 Lesley Briones defeated Benjamin Chou in the Democratic primary runoff for Harris County Commissioners Court Precinct 4 on May 24, 2022. Candidate % Votes ✔ Lesley Briones 53.9 8,139 Benjamin Chou 46.1 6,958 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 15,097 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for Harris County Commissioners Court Precinct 4 The following candidates ran in the Democratic primary for Harris County Commissioners Court Precinct 4 on March 1, 2022. Candidate % Votes ✔ Lesley Briones 33.9 9,893 ✔ Benjamin Chou 24.6 7,167 Ann Williams 13.7 3,999 Submit photo Clarence Miller 11.0 3,211 Gina Calanni 9.0 2,619 Submit photo Sandra Pelmore 5.6 1,624 Submit photo Jeff Stauber 2.2 650 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 29,163 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for Harris County Commissioners Court Precinct 4 Incumbent R. Jack Cagle advanced from the Republican primary for Harris County Commissioners Court Precinct 4 on March 1, 2022. Candidate % Votes ✔ Submit photo R. Jack Cagle 100.0 29,864 Incumbents are bolded and underlined"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou_(Texas)",
    "text": ". The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 29,864 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements To view Chou's endorsements in the 2022 election, please click here . Campaign themes Campaign themes 2022 2022 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Benjamin Chou completed Ballotpedia's Candidate Connection survey in 2022. The survey questions appear in bold and are followed by Chou's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Ben is an attorney and civil rights advocate. As the Director of Innovation for the Harris County Elections Office, he helped lead the team that created drive thru voting in Texas, resulting in record turnout during the 2020 election. He’s running to represent Harris County Commissioner Precinct 4, which has over 1.2 million people, and fighting to fix our roads, prevent flooding, and tackle violent crime. Ben has a record of getting things done in government. As an aide for Speaker Nancy Pelosi, he helped to create what became known as the Future Forum, a group of members of Congress who advocate for policies benefiting young Americans. He co-founded a nonprofit voter registration organization that registered thousands of Texans to vote. He most recently served as the Director of Innovation at the Harris County Elections Office where he helped to lead the team that created drive-thru voting. Ben is a lifelong Houstonian and a proud graduate of Rice University. He earned his JD and MBA from Northwestern University. Ben has a record of getting things done in government. As an aide for Speaker Nancy Pelosi, he helped to create what became known as the Future Forum, a group of members of Congress who advocate for policies benefiting young Americans. He co-founded a nonprofit voter registration organization that registered thousands of Texans to vote. He most recently served as the Director of Innovation at the Harris County Elections Office where he helped to lead the team that created drive-thru voting. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Fully fund flood prevention projects and protect our green spaces so our neighborhoods do not flood. We also need a comprehensive disaster playbook so people are prepared when the next one hits. Improve our neighborhood infrastructure by providing a 72 hour guarantee to fix our roads, sidewalks, and bike paths. Keep our communities safe by fighting violent crime and working to reduce gun violence. Fully fund flood prevention projects and protect our green spaces so our neighborhoods do not flood. We also need a comprehensive disaster playbook so people are prepared when the next one hits. Improve our neighborhood infrastructure by providing a 72 hour guarantee to fix our roads, sidewalks, and bike paths. Keep our communities safe by fighting violent crime and working to reduce gun violence. What areas of public policy are you personally passionate about? Expansion of voting rights is something that I hold dear to my heart. Before I was a candidate, I worked as the Director of Innovation at the Harris County Elections Office where I helped create voting innovations such as drive thru voting. As County Commissioner, I intend to have a team of paid full-time organizers on staff who will go to community events and door-to-door to register voters as a part of their role. We must also partner with high schools so that we register every student who is 17 years and 10 months old. As the only Democrat in the race who has publicly rejected county vendor dollars, I am eager to reform our campaign finance structure as well. Our Elections Office can do more to make our campaign finance system more transparent so that the public can hold candidates and elected officials accountable for their actions. Throughout 2021, I worked to bring light on how the voter suppression"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou_(Texas)",
    "text": "law would harm Harris County residents, particularly people of color. I organized and led protests in front of the Greater Houston Partnership to call out their refusal to condemn the voter suppression bill. I marched 33 miles with Beto from Round Rock to Austin in July heat to protest the law. I will always keep fighting to protect our right to vote. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2022 Elections Government Newsletters External links External links Search Google News for this topic Candidate Harris County Commissioners Court Precinct 4 Website Facebook Twitter Instagram Candidate Harris County Commissioners Court Precinct 4 Website Facebook Twitter Instagram Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 19, 2022 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 19, 2022 v • e Largest U.S. Cities by Population Mayors • City council officials • Overlapping counties • Municipal partisanship A-C Albuquerque • Anaheim • Anchorage • Arlington • Atlanta • Aurora • Austin • Bakersfield • Baltimore • Baton Rouge • Boise • Boston • Buffalo • Chandler • Charlotte • Chesapeake • Chicago • Chula Vista • Cincinnati • Cleveland • Colorado Springs • Columbus • Corpus Christi D-H Dallas • Denver • Detroit • Durham • El Paso • Fort Wayne • Fort Worth • Fremont • Fresno • Garland • Gilbert • Glendale • Greensboro • Henderson • Hialeah • Honolulu • Houston I-M Indianapolis • Irvine • Irving • Jacksonville • Jersey City • Kansas City • Laredo • Las Vegas • Lexington • Lincoln • Long Beach • Los Angeles • Louisville • Lubbock • Madison • Memphis • Mesa • Miami • Milwaukee • Minneapolis N-R Nashville-Davidson • New Orleans • New York • Newark • Norfolk • North Las Vegas • Oakland • Oklahoma City • Omaha • Orlando • Philadelphia • Phoenix • Pittsburgh • Plano • Portland • Raleigh • Reno • Richmond • Riverside S-W Sacramento • San Antonio • San Diego • San Francisco • San Jose • Santa Ana • Santa Clarita • Scottsdale • Seattle • Spokane • St. Louis • St. Paul • St. Petersburg • Stockton • Tampa • Toledo • Tucson • Tulsa • Virginia Beach • Wichita • Winston-Salem v • e Largest U.S. Cities by Population Mayors • City council officials • Overlapping counties • Municipal partisanship A-C Albuquerque • Anaheim • Anchorage • Arlington • Atlanta • Aurora • Austin • Bakersfield • Baltimore • Baton Rouge • Boise • Boston • Buffalo • Chandler • Charlotte • Chesapeake • Chicago • Chula Vista • Cincinnati • Cleveland • Colorado Springs • Columbus • Corpus Christi D-H Dallas • Denver • Detroit • Durham • El Paso • Fort Wayne • Fort Worth • Fremont • Fresno • Garland • Gilbert • Glendale • Greensboro • Henderson • Hialeah • Honolulu • Houston I-M Indianapolis • Irvine • Irving • Jacksonville • Jersey City • Kansas City • Laredo • Las Vegas • Lexington • Lincoln • Long Beach • Los Angeles • Louisville • Lubbock • Madison • Memphis • Mesa • Miami • Milwaukee • Minneapolis N-R Nashville-Davidson • New Orleans • New York • Newark • Norfolk • North Las Vegas • Oakland • Oklahoma City • Omaha • Orlando • Philadelphia • Phoenix • Pittsburgh • Plano • Portland • Raleigh • Reno • Richmond • Riverside S-W Sacramento • San Antonio • San Diego • San Francisco • San Jose • Santa Ana • Santa Clarita • Scottsdale • Seattle • Spokane • St. Louis • St. Paul • St. Petersburg • Stockton • Tampa • Toledo • Tucson • Tulsa • Virginia Beach • Wichita • Winston-Salem v • e State of Texas capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou_(Texas)",
    "text": "office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2022 challenger 2022 primary (winner) 2022 primary runoff (defeated) Democratic Party Harris County Commissioners Court candidate, 2022 Municipal candidate, 2022 Municipal candidates Texas Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou_(Texas)",
    "text": "2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Benjamin Chou Benjamin Chou Benjamin Chou Benjamin Chou may refer to: Benjamin Chou (New York) Benjamin Chou (Texas) This disambiguation page lists articles with similar titles. All disambiguation pages All article disambiguation pages Disambiguation pages Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed"
  },
  {
    "candidate": "Chou, Benjamin",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Benjamin_Chou",
    "text": "Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]