[
  {
    "candidate": "Coleman, Jess K",
    "category": "bio",
    "score": null,
    "link": "https://www.jessfornewyork.com/meet-jess",
    "text": "0 0 English Open Menu Close Menu English Open Menu Close Menu English Back Meet Jess As a lifelong Lower Manhattanite, Jess knows what makes this community special—and he knows how much is at risk. Skyrocketing rents are forcing families out. Traffic congestion is choking our streets. Vacant storefronts plague our neighborhoods. And while everyday people struggle, our leadership stands in the way of progress. Jess learned early that you don’t wait for change—you fight for it. His mother co-founded the Run for Knowledge to fund the P.S. 89 library, and his father helped rebuild the West Street baseball fields. They taught him that a strong community isn’t something you inherit—it’s something you build. From a young age, he carried that forward, coaching in the Little League, reporting for the Tribeca Trib and volunteering for his City Councilmember. After earning his law degree, he returned to Tribeca with his wife, Jessica, his cat, Oliver, and his Boston Terrier, Maxie, determined to fight for the neighborhood’s future. As co-chair of Community Board 1’s Transportation Committee, he stood up for congestion pricing, championed expanding pedestrian plazas and Open Streets, and was the board’s most vocal advocate of City of Yes, an overhaul of exclusionary zoning laws that cause skyrocketing rents. After Trump’s election, he also wrote for national publications about reviving progressive politics and fighting back against the right-wing legal movement. As a lawyer, he took on corporate giants, representing opioid crisis victims in the Purdue Pharma bankruptcy—an experience that showed him just how much power is stacked against everyday people. Lower Manhattan needs a leader who will take on the fights that matter. For too long, politicians have stood by as rents soared, streets became gridlocked, and small businesses struggled to survive. Jess is running to change that. He’ll take on the housing crisis by reining in rents, expanding ownership opportunities, and investing in social housing. He’ll push for safer, more walkable streets and real action on climate change. The stakes are high, and Lower Manhattan can’t afford more of the same. It’s time for leadership that delivers. Why I'm Running Lower Manhattan is at a breaking point—rents are soaring, traffic is gridlocked, and public services are failing while politicians protect the status quo. Jess Coleman has spent his life here, fighting for safer streets, affordable housing, and stronger public spaces. Now, he’s taking on a system that puts powerful interests ahead of everyday people. It’s time for bold, no-nonsense leadership that delivers real results. DONATE $25 $175 $50 $250 $100 OTHER Our campaign relies on your support! If you’re a New York City resident, your donation up to $175 will be matched 8-1! Name * First Name Last Name Email * Phone (###) ### #### Message Thank you! GET INVOLVED For questions and media requests, please email us at info@jessfornewyork.com Meet Jess Meet Jess As a lifelong Lower Manhattanite, Jess knows what makes this community special—and he knows how much is at risk. Skyrocketing rents are forcing families out. Traffic congestion is choking our streets. Vacant storefronts plague our neighborhoods. And while everyday people struggle, our leadership stands in the way of progress. Jess learned early that you don’t wait for change—you fight for it. His mother co-founded the Run for Knowledge to fund the P.S. 89 library, and his father helped rebuild the West Street baseball fields. They taught him that a strong community isn’t something you inherit—it’s something you build. From a young age, he carried that forward, coaching in the Little League, reporting for the Tribeca Trib and volunteering for his City Councilmember. After earning his law degree, he returned to Tribeca with his wife, Jessica, his cat, Oliver, and his Boston Terrier, Maxie, determined to fight for the neighborhood’s future. As co-chair of Community Board 1’s Transportation Committee, he stood up for congestion pricing, championed expanding pedestrian plazas and Open Streets, and was the board’s most vocal advocate of City of Yes, an overhaul of exclusionary zoning laws that cause skyrocketing rents. After Trump’s election, he also wrote for national publications about reviving progressive politics and fighting back against the right-wing legal movement. As a lawyer, he took on corporate giants, representing opioid crisis victims in the Purdue Pharma bankruptcy—an experience that showed him just how much power is stacked against everyday people. Lower Manhattan needs a leader who will take on the fights that matter. For too long, politicians have stood by as rents soared, streets became gridlocked, and small businesses struggled to survive. Jess"
  },
  {
    "candidate": "Coleman, Jess K",
    "category": "bio",
    "score": null,
    "link": "https://www.jessfornewyork.com/meet-jess",
    "text": "is running to change that. He’ll take on the housing crisis by reining in rents, expanding ownership opportunities, and investing in social housing. He’ll push for safer, more walkable streets and real action on climate change. The stakes are high, and Lower Manhattan can’t afford more of the same. It’s time for leadership that delivers. Why I'm Running Why I'm Running Lower Manhattan is at a breaking point—rents are soaring, traffic is gridlocked, and public services are failing while politicians protect the status quo. Jess Coleman has spent his life here, fighting for safer streets, affordable housing, and stronger public spaces. Now, he’s taking on a system that puts powerful interests ahead of everyday people. It’s time for bold, no-nonsense leadership that delivers real results. DONATE Our campaign relies on your support! If you’re a New York City resident, your donation up to $175 will be matched 8-1! * First Name Last Name * (###) ### #### GET INVOLVED GET INVOLVED For questions and media requests, please email us at info@jessfornewyork.com Meet Jess Platform Voter Resources Get Involved PAID FOR BY JESS FOR NEW YORK"
  }
]