[
  {
    "candidate": "Creneti, Michael",
    "category": "bio",
    "score": null,
    "link": "https://us.bold.pro/my/michael-creneti",
    "text": "Login Login Michael Creneti New York , NY Overview years of professional experience Work History DIRECTOR OF FINANCE & OPERATIONS Creating department budgets and coordinating with department heads to implement and maintain Analyzing financial reports, including data on income, expenditure, and market performance Processing and filing annual audit for over 12 entities within organization Designing and implementing scalable finance policies, procedures, internal controls, and risk framework Implementing new tools for cross-functional use to improve profit and efficiency Developing and maintaining effective financial controls, and ensuring compliance on all levels for current and multiple emerging market. Creating department budgets and coordinating with department heads to implement and maintain Analyzing financial reports, including data on income, expenditure, and market performance Processing and filing annual audit for over 12 entities within organization Designing and implementing scalable finance policies, procedures, internal controls, and risk framework Implementing new tools for cross-functional use to improve profit and efficiency Developing and maintaining effective financial controls, and ensuring compliance on all levels for current and multiple emerging market. Creating department budgets and coordinating with department heads to implement and maintain Analyzing financial reports, including data on income, expenditure, and market performance Processing and filing annual audit for over 12 entities within organization Designing and implementing scalable finance policies, procedures, internal controls, and risk framework Implementing new tools for cross-functional use to improve profit and efficiency Developing and maintaining effective financial controls, and ensuring compliance on all levels for current and multiple emerging market. OWNER Managing all financial planning and accounting services for several growing startups. Managing all financial planning and accounting services for several growing startups. Managing all financial planning and accounting services for several growing startups. FINANCE MANAGER Evaluated financial and operating activities of current and potential venture capital investments Maintained and creating new investor relationships for current and future ventures Managed the operations of the current $60m venture capital fund, as well as planning for future funds Spearheaded the conception and implementation of new revenue channels Finalized all internal and external financial audits, while coordinating with CPA firms Optimized capital spending through newly created reporting and analysis. Evaluated financial and operating activities of current and potential venture capital investments Maintained and creating new investor relationships for current and future ventures Managed the operations of the current $60m venture capital fund, as well as planning for future funds Spearheaded the conception and implementation of new revenue channels Finalized all internal and external financial audits, while coordinating with CPA firms Optimized capital spending through newly created reporting and analysis. Evaluated financial and operating activities of current and potential venture capital investments Maintained and creating new investor relationships for current and future ventures Managed the operations of the current $60m venture capital fund, as well as planning for future funds Spearheaded the conception and implementation of new revenue channels Finalized all internal and external financial audits, while coordinating with CPA firms Optimized capital spending through newly created reporting and analysis. DIRECTOR OF OPERATIONS & FINANCE Created the financial model/ forecast that senior leadership uses to report on business health Transferred the accounting method of the organization from a cash flow basis to an accrual basis Created the cash flow forecast that allows for the selection of multiple scenario options and utilizes several data points including forecasted revenue and client health Drove strategic planning for the business to align with the company on goals, targets, and KPIs Developed and implementing of all financial planning and processes through the creation of dynamic metrics models. Created the financial model/ forecast that senior leadership uses to report on business health Transferred the accounting method of the organization from a cash flow basis to an accrual basis Created the cash flow forecast that allows for the selection of multiple scenario options and utilizes several data points including forecasted revenue and client health Drove strategic planning for the business to align with the company on goals, targets, and KPIs Developed and implementing of all financial planning and processes through the creation of dynamic metrics models. Created the financial model/ forecast that senior leadership uses to report on business health Transferred the accounting method of the organization from a cash flow basis to an accrual basis Created the cash flow forecast that allows for the selection of multiple scenario options and utilizes several data points including forecasted revenue and client health Drove strategic planning for the business to align with the company on goals, targets, and KPIs Developed and implementing of all financial planning and processes"
  },
  {
    "candidate": "Creneti, Michael",
    "category": "bio",
    "score": null,
    "link": "https://us.bold.pro/my/michael-creneti",
    "text": "through the creation of dynamic metrics models. OPERATIONS & FINANCE MANAGER / ASSISTANT DIRECTOR OF OPERATIONS Facilitated the gathering of capital for the business through the methods of debt refinancing and the issuing of convertible notes & Began the Series-B process for the organization Designed and finalized all financial decks used for both internal and external presentations Improved the efficiency of resources through the handling of all accounting responsibilities (Cash Burn reduced by 70% and Net Income increased by 150%) Created and revising of financial models for investor relations and capital growth. Facilitated the gathering of capital for the business through the methods of debt refinancing and the issuing of convertible notes & Began the Series-B process for the organization Designed and finalized all financial decks used for both internal and external presentations Improved the efficiency of resources through the handling of all accounting responsibilities (Cash Burn reduced by 70% and Net Income increased by 150%) Created and revising of financial models for investor relations and capital growth. Facilitated the gathering of capital for the business through the methods of debt refinancing and the issuing of convertible notes & Began the Series-B process for the organization Designed and finalized all financial decks used for both internal and external presentations Improved the efficiency of resources through the handling of all accounting responsibilities (Cash Burn reduced by 70% and Net Income increased by 150%) Created and revising of financial models for investor relations and capital growth. Education Bachelor of Arts - New York, NY New York, NY Skills Financial Modeling QBO Project Management Data Analytics Cash Flow Management Budget Planning Investor Relations AR/AP Tax Prep Audit management Financial Modeling QBO Project Management Data Analytics Cash Flow Management Budget Planning Investor Relations AR/AP Tax Prep Audit management Timeline DIRECTOR OF FINANCE & OPERATIONS OWNER FINANCE MANAGER DIRECTOR OF OPERATIONS & FINANCE OPERATIONS & FINANCE MANAGER / ASSISTANT DIRECTOR OF OPERATIONS Bachelor of Arts - Similar Profiles Terrence Arnold Terrence Arnold Project Manager at Global Stage Entertainment Project Manager at Global Stage Entertainment Terrence Arnold Terrence Arnold Terrence Arnold Project Manager at Global Stage Entertainment Project Manager at Global Stage Entertainment Project Manager at Global Stage Entertainment Benjamin Wegman Benjamin Wegman Studio Manager at Perspire Sauna Studio Studio Manager at Perspire Sauna Studio Benjamin Wegman Benjamin Wegman Benjamin Wegman Studio Manager at Perspire Sauna Studio Studio Manager at Perspire Sauna Studio Studio Manager at Perspire Sauna Studio Armin De Goorte Armin De Goorte CREATOR at Global Teach, Inc. CREATOR at Global Teach, Inc. Armin De Goorte Armin De Goorte Armin De Goorte CREATOR at Global Teach, Inc. CREATOR at Global Teach, Inc. CREATOR at Global Teach, Inc. Baron Watson Baron Watson Sales Development Representative at The Trade Desk Sales Development Representative at The Trade Desk Baron Watson Baron Watson Baron Watson Sales Development Representative at The Trade Desk Sales Development Representative at The Trade Desk Sales Development Representative at The Trade Desk Betty Michelle A. McCline Betty Michelle A. McCline Director of Finance & Operations at Memphis Merit Academy Charter School Director of Finance & Operations at Memphis Merit Academy Charter School Betty Michelle A. McCline Betty Michelle A. McCline Betty Michelle A. McCline Director of Finance & Operations at Memphis Merit Academy Charter School Director of Finance & Operations at Memphis Merit Academy Charter School Director of Finance & Operations at Memphis Merit Academy Charter School Michael Creneti Contact me Skills Job Company School Name Contact Us Accessibility Cookie Policy Terms of Use Privacy Policy Sitemap Blog Fraud Awareness Facebook Facebook X X Instagram Instagram Youtube Youtube Pinterest Pinterest a b c d e f g h i j k l m n o p q r s t u v w x y z"
  }
]