[
  {
    "candidate": "Cuomo, Andrew M",
    "category": "bio",
    "score": null,
    "link": "https://www.britannica.com/biography/Andrew-Cuomo",
    "text": "Click here to search Click here to search SUBSCRIBE SUBSCRIBE Login Home History & Society Science & Tech Biographies Animals & Nature Geography & Travel Arts & Culture ProCon Money Games & Quizzes Videos On This Day One Good Fact Dictionary New Articles Lifestyles & Social Issues Philosophy & Religion Politics, Law & Government World History Health & Medicine Science Technology Browse Biographies Birds, Reptiles & Other Vertebrates Bugs, Mollusks & Other Invertebrates Environment Fossils & Geologic Time Mammals Plants Geography & Travel Entertainment & Pop Culture Literature Sports & Recreation Visual Arts Companions Demystified Image Galleries Lists Podcasts Spotlight Summaries Top Questions #WTFact Britannica Kids Ask the Chatbot Andrew Cuomo Table of Contents Introduction Early life and education From assistant district attorney to secretary of HUD Governor of New York Policies and COVID Sexual misconduct allegations and resignation Return to politics Personal life References & Edit History Quick Facts & Related Topics Images Read Next Have Any U.S. Presidents Decided Not to Run For a Second Term? What State Is Washington, D.C. In? 14 Questions About Government in the United States Answered U.S. Death Toll During Major Events 26 Decade-Defining Events in U.S. History Discover 10 Greatest Baseball Players of All Time 9 Noteworthy Bog Bodies (And What They Tell Us) Spies Like Us: 10 Famous Names in the Espionage Game The 6 Deadliest Earthquakes Since 1950 Did Marie-Antoinette Really Say “Let Them Eat Cake”? 6 Animals That Eat Their Mates All 81 References in Fall Out Boy’s “We Didn’t Start the Fire,” Explained Contents Politics, Law & Government World Leaders Governors Andrew Cuomo American politician Andrew Cuomo in 2010 during his second campaign for governor of New York. The run was successful, and he ultimately served between 2011 and 2021. (more) Andrew Cuomo American politician Ask the Chatbot a Question More Actions Print print Print Please select which sections you would like to print: Table Of Contents Cite verified Cite While every effort has been made to follow citation style rules, there may be some discrepancies. Please refer to the appropriate style manual or other sources if you have any questions. Select Citation Style MLA APA Chicago Manual of Style Copy Citation Share Share Share to social media Facebook X URL https://www.britannica.com/biography/Andrew-Cuomo Feedback External Websites Feedback Corrections? Updates? Omissions? Let us know if you have suggestions to improve this article (requires login). Feedback Type Select a type (Required) Factual Correction Spelling/Grammar Correction Link Correction Additional Information Other Your Feedback Submit Feedback Thank you for your feedback Our editors will review what you’ve submitted and determine whether to revise the article. External Websites The New York Times - The Rise and Fall of Andrew Cuomo Official Site of Andrew Cuomo Official Site of Andrew M. Cuomo, Governor of New York State ABC News - Who is Andrew Cuomo? Here's what you need to know about the New York Governor's fall from power Britannica Websites Articles from Britannica Encyclopedias for elementary and high school students. Andrew Cuomo - Student Encyclopedia (Ages 11 and up) Ask the Chatbot a Question Also known as: Andrew Mark Cuomo Written and fact-checked by The Editors of Encyclopaedia Britannica Encyclopaedia Britannica's editors oversee subject areas in which they have extensive knowledge, whether from years of experience gained by working on that content or via study for an advanced degree. They write new content and verify and edit content received from contributors. The Editors of Encyclopaedia Britannica Last Updated: May 7, 2025 • Article History Table of Contents Table of Contents Ask the Chatbot Quick Facts In full: Andrew Mark Cuomo (Show more) Born: December 6, 1957, New York , New York , U.S. (age 67) (Show more) Title / Office: governor (2011-2021) , New York (Show more) Political Affiliation: Democratic Party (Show more) Notable Family Members: father Mario Cuomo (Show more) See all related content News • Andrew Cuomo to run for NYC mayor as an independent and a Democrat • May 6, 2025, 1:52 PM ET (CBS) ... (Show more) NYC Mayoral Race: Find Out Who Your Neighborhood Is Funding • May 5, 2025, 5:23 PM ET (New York Times) Watch live: NewsNation’s Cuomo hosts townhall with Trump, Stephen A. Smith • May 1, 2025, 5:30 AM ET (The Hill) Cuomo won’t release consulting clients from his time out of public eye • Apr. 29, 2025, 2:49 AM ET (Politico) Major health care union backs Cuomo’s mayoral bid • Apr. 26, 2025, 2:37 AM ET (Politico) Show less Andrew Cuomo (born December 6, 1957,"
  },
  {
    "candidate": "Cuomo, Andrew M",
    "category": "bio",
    "score": null,
    "link": "https://www.britannica.com/biography/Andrew-Cuomo",
    "text": "New York, New York, U.S.) is an American politician and attorney who served as the governor of New York from 2011 to 2021, when he resigned amid sexual misconduct allegations . He previously served as secretary of Housing and Urban Development (HUD; 1997–2001) under Pres. Bill Clinton and as New York’s attorney general (2007–10). In 2025 Cuomo announced that he was running for mayor of New York City . Early life and education As a teenager in Queens , New York, Cuomo put up posters to help his father, Democrat Mario Cuomo , campaign for state office. Andrew Cuomo graduated from Fordham University in 1979, the year in which his father became New York lieutenant governor. After graduating from Albany Law School (J.D., 1982), he ran the campaign that made his father governor (1983–95). For the next two years Andrew Cuomo worked as his father’s senior adviser in Albany. From assistant district attorney to secretary of HUD In 1984 Cuomo moved to New York City, where he became an assistant district attorney and a partner in the law firm of Blutrich, Falcone & Miller. During this time, he began to focus on the problems of the city’s homeless population, and in 1986 he founded Housing Enterprises for the Less Privileged (HELP), an organization that provided transitional housing for people living on the streets. He continued to advise his father from a distance and managed his successful 1986 gubernatorial reelection campaign. Cuomo’s efforts for the homeless led to his appointment in 1991 to chair the New York City Commission on the Homeless. After Clinton’s election as president in November 1992, Cuomo went to Washington, D.C., to help with the transition to the new administration and stayed to work on housing at the federal level. In May 1993 the U.S. Senate confirmed his appointment to HUD as assistant secretary for Community Planning and Development. Working closely with Vice Pres. Al Gore , Cuomo introduced new government policies to move the homeless into permanent housing with the help of transitional housing and expanded social services. In December 1996 President Clinton nominated Cuomo to become secretary of HUD, a post that he held from 1997 to 2001. Governor of New York Policies and COVID After losing his first New York gubernatorial bid in 2002, Cuomo won election as the state’s attorney general in 2006. He ran again for governor in 2010 and this time was successful in winning the office, handily defeating his Republican opponent, businessman Carl Paladino, in the general election. Cuomo was reelected to a second term in 2014. As governor of New York, he signed legislation in 2011 that legalized same-sex marriage in the state. In late 2014 he announced a ban on fracking , or hydraulic fracturing, citing a state-funded health study that found “significant public health risks” associated with the practice. He also oversaw tax cuts and an increase to the minimum wage . Cuomo faced controversy in 2014 when he abruptly closed a commission he had created the previous year to root out government corruption. Amid allegations that his administration had interfered with the panel, federal authorities conducted an investigation, and in 2016 it was announced that there was insufficient evidence to bring criminal charges. In March 2020 New York City became the epicenter of the COVID-19 pandemic in the United States , and Cuomo gained a national profile with his press briefings, in which he often criticized Pres. Donald Trump ’s response to the crisis. The governor’s popularity rose as many praised his handling of the coronavirus outbreak, and he released American Crisis: Leadership Lessons from the COVID-19 Pandemic (2020). However, he was not without his critics, some of whom accused him of causing unnecessary deaths among nursing-home patients, a population especially hard-hit by COVID-19. Drawing particular criticism was a controversial state policy in which people infected with the virus were sent to nursing homes. Cuomo defended the plan, but in 2021 it was revealed that his administration had undercounted nursing-home deaths. The matter became the subject of an FBI investigation. Sexual misconduct allegations and resignation Another scandal emerged in late 2020 when a series of women began accusing Cuomo of sexual harassment . In addition, there were allegations that he created a toxic workplace. Cuomo denied the claims, and he defended his physical gestures as a way of “convey[ing] warmth, nothing more.” However, the state’s attorney general subsequently launched an investigation. The final report was released in August 2021, and Cuomo was found to have sexually"
  },
  {
    "candidate": "Cuomo, Andrew M",
    "category": "bio",
    "score": null,
    "link": "https://www.britannica.com/biography/Andrew-Cuomo",
    "text": "harassed numerous women “through unwelcome and unwanted touching, as well as by making numerous offensive and sexually suggestive comments.” It also determined that his administration’s response to the accusations had contributed to “an overall hostile work environment.” Cuomo again denied any wrongdoing and accused the report of being biased . Calls for his resignation increased, including within his own party; notably, U.S. Pres. Joe Biden said that he should step down. Facing likely impeachment , Cuomo on August 10 announced his resignation, effective in two weeks. He left office on August 24 and was succeeded by Lieut. Gov. Kathy Hochul , who became New York’s first female governor. Are you a student? Get a special academic rate on Britannica Premium. Subscribe The scandal also ensnared his brother, Chris Cuomo, a TV journalist with CNN . Chris Cuomo offered strategic advice, and once that became public in late 2021, CNN fired him. Return to politics In 2023 there was speculation that Andrew Cuomo would be a candidate in the following year’s Senate race, trying to unseat Kirsten Gillibrand , a Democrat. Cuomo ultimately did not run, but in 2025 he officially entered New York City’s mayoral race. He was one of several candidates challenging the current mayor, Democrat Eric Adams , who was embroiled in a corruption scandal. Personal life In 1990 Cuomo married Kerry Kennedy, daughter of Ethel Kennedy and Robert F. Kennedy, Jr. The couple had three children before divorcing in 2005. That year Cuomo began dating TV chef Sandra Lee. The relationship ended in 2019. Cuomo’s autobiography, All Things Possible: Setbacks and Success in Politics and Life , was published in 2014. The Editors of Encyclopaedia Britannica This article was most recently revised and updated by Amy Tikkanen . Introduction Early life and education From assistant district attorney to secretary of HUD Governor of New York Policies and COVID Sexual misconduct allegations and resignation Policies and COVID Sexual misconduct allegations and resignation Return to politics Personal life Politics, Law & Government World Leaders Governors Andrew Cuomo American politician Andrew Cuomo in 2010 during his second campaign for governor of New York. The run was successful, and he ultimately served between 2011 and 2021. (more) American politician Andrew Cuomo in 2010 during his second campaign for governor of New York. The run was successful, and he ultimately served between 2011 and 2021. American politician Andrew Cuomo in 2010 during his second campaign for governor of New York. The run was successful, and he ultimately served between 2011 and 2021. (more) Andrew Cuomo Table Of Contents Copy Citation Facebook X Our editors will review what you’ve submitted and determine whether to revise the article. The New York Times - The Rise and Fall of Andrew Cuomo Official Site of Andrew Cuomo Official Site of Andrew M. Cuomo, Governor of New York State ABC News - Who is Andrew Cuomo? Here's what you need to know about the New York Governor's fall from power Andrew Cuomo - Student Encyclopedia (Ages 11 and up) Written and fact-checked by The Editors of Encyclopaedia Britannica Last Updated: May 7, 2025 • News • • • May 6, 2025, 1:52 PM ET (CBS) ... (Show more) • ... (Show more) • May 5, 2025, 5:23 PM ET (New York Times) • • May 1, 2025, 5:30 AM ET (The Hill) • • Apr. 29, 2025, 2:49 AM ET (Politico) • • Apr. 26, 2025, 2:37 AM ET (Politico) • Andrew Cuomo (born December 6, 1957, New York, New York, U.S.) is an American politician and attorney who served as the governor of New York from 2011 to 2021, when he resigned amid sexual misconduct allegations . He previously served as secretary of Housing and Urban Development (HUD; 1997–2001) under Pres. Bill Clinton and as New York’s attorney general (2007–10). In 2025 Cuomo announced that he was running for mayor of New York City . Early life and education As a teenager in Queens , New York, Cuomo put up posters to help his father, Democrat Mario Cuomo , campaign for state office. Andrew Cuomo graduated from Fordham University in 1979, the year in which his father became New York lieutenant governor. After graduating from Albany Law School (J.D., 1982), he ran the campaign that made his father governor (1983–95). For the next two years Andrew Cuomo worked as his father’s senior adviser in Albany. From assistant district attorney to secretary of HUD In 1984 Cuomo moved to New York City, where he became an assistant"
  },
  {
    "candidate": "Cuomo, Andrew M",
    "category": "bio",
    "score": null,
    "link": "https://www.britannica.com/biography/Andrew-Cuomo",
    "text": "district attorney and a partner in the law firm of Blutrich, Falcone & Miller. During this time, he began to focus on the problems of the city’s homeless population, and in 1986 he founded Housing Enterprises for the Less Privileged (HELP), an organization that provided transitional housing for people living on the streets. He continued to advise his father from a distance and managed his successful 1986 gubernatorial reelection campaign. Cuomo’s efforts for the homeless led to his appointment in 1991 to chair the New York City Commission on the Homeless. After Clinton’s election as president in November 1992, Cuomo went to Washington, D.C., to help with the transition to the new administration and stayed to work on housing at the federal level. In May 1993 the U.S. Senate confirmed his appointment to HUD as assistant secretary for Community Planning and Development. Working closely with Vice Pres. Al Gore , Cuomo introduced new government policies to move the homeless into permanent housing with the help of transitional housing and expanded social services. In December 1996 President Clinton nominated Cuomo to become secretary of HUD, a post that he held from 1997 to 2001. Governor of New York Policies and COVID After losing his first New York gubernatorial bid in 2002, Cuomo won election as the state’s attorney general in 2006. He ran again for governor in 2010 and this time was successful in winning the office, handily defeating his Republican opponent, businessman Carl Paladino, in the general election. Cuomo was reelected to a second term in 2014. As governor of New York, he signed legislation in 2011 that legalized same-sex marriage in the state. In late 2014 he announced a ban on fracking , or hydraulic fracturing, citing a state-funded health study that found “significant public health risks” associated with the practice. He also oversaw tax cuts and an increase to the minimum wage . Cuomo faced controversy in 2014 when he abruptly closed a commission he had created the previous year to root out government corruption. Amid allegations that his administration had interfered with the panel, federal authorities conducted an investigation, and in 2016 it was announced that there was insufficient evidence to bring criminal charges. In March 2020 New York City became the epicenter of the COVID-19 pandemic in the United States , and Cuomo gained a national profile with his press briefings, in which he often criticized Pres. Donald Trump ’s response to the crisis. The governor’s popularity rose as many praised his handling of the coronavirus outbreak, and he released American Crisis: Leadership Lessons from the COVID-19 Pandemic (2020). However, he was not without his critics, some of whom accused him of causing unnecessary deaths among nursing-home patients, a population especially hard-hit by COVID-19. Drawing particular criticism was a controversial state policy in which people infected with the virus were sent to nursing homes. Cuomo defended the plan, but in 2021 it was revealed that his administration had undercounted nursing-home deaths. The matter became the subject of an FBI investigation. Sexual misconduct allegations and resignation Another scandal emerged in late 2020 when a series of women began accusing Cuomo of sexual harassment . In addition, there were allegations that he created a toxic workplace. Cuomo denied the claims, and he defended his physical gestures as a way of “convey[ing] warmth, nothing more.” However, the state’s attorney general subsequently launched an investigation. The final report was released in August 2021, and Cuomo was found to have sexually harassed numerous women “through unwelcome and unwanted touching, as well as by making numerous offensive and sexually suggestive comments.” It also determined that his administration’s response to the accusations had contributed to “an overall hostile work environment.” Cuomo again denied any wrongdoing and accused the report of being biased . Calls for his resignation increased, including within his own party; notably, U.S. Pres. Joe Biden said that he should step down. Facing likely impeachment , Cuomo on August 10 announced his resignation, effective in two weeks. He left office on August 24 and was succeeded by Lieut. Gov. Kathy Hochul , who became New York’s first female governor. The scandal also ensnared his brother, Chris Cuomo, a TV journalist with CNN . Chris Cuomo offered strategic advice, and once that became public in late 2021, CNN fired him. Return to politics In 2023 there was speculation that Andrew Cuomo would be a candidate in the following year’s Senate race, trying to unseat Kirsten Gillibrand , a Democrat. Cuomo ultimately did"
  },
  {
    "candidate": "Cuomo, Andrew M",
    "category": "bio",
    "score": null,
    "link": "https://www.britannica.com/biography/Andrew-Cuomo",
    "text": "not run, but in 2025 he officially entered New York City’s mayoral race. He was one of several candidates challenging the current mayor, Democrat Eric Adams , who was embroiled in a corruption scandal. Personal life In 1990 Cuomo married Kerry Kennedy, daughter of Ethel Kennedy and Robert F. Kennedy, Jr. The couple had three children before divorcing in 2005. That year Cuomo began dating TV chef Sandra Lee. The relationship ended in 2019. Cuomo’s autobiography, All Things Possible: Setbacks and Success in Politics and Life , was published in 2014. The Editors of Encyclopaedia Britannica This article was most recently revised and updated by Amy Tikkanen ."
  }
]