[
  {
    "candidate": "Diakhate, Abou S",
    "category": "bio",
    "score": null,
    "link": "https://www.abouforyou.com/about.html",
    "text": "Home News Events For the Media Platform Get Involved Platform Abou cares about: Education Every child deserves a quality education. I will secure school resources, expand after-school programs, and ensure opportunities for all Housing Affordable and safe housing is a fundamental right. I will fight to expand affordable housing and protect tenants while encouraging responsible development. Food security No family should face hunger in our community. I will advocate for healthy food, expand local food pantries, and promote urban agriculture initiatives. Health Accessible healthcare is essential for a thriving community. I will push for increased funding for health services, mental health resources, and initiatives to address health disparities in our district. Waterfront development Our waterfront is a treasure that must serve everyone. I will lead efforts to revitalize the Staten Island shoreline for economic growth and environmental preservation. About Abou Abou is a public advocate who cares for the well-being of ordinary citizens working very hard to put food on the table. He is ready to promote political equity and justice for all. A former United Nations officer, he oversaw and implemented an awareness and prevention training program for personnel in United Nations Operations in Cote d’Ivoire (Ivory Coast) for six years. Abou contributed to peace and development in Cote d’Ivoire by advocating for recognition of volunteers; worked with national and International partners to integrate volunteerism into development programming; and mobilized and helped increase the number of volunteers, including experienced UN Volunteers, throughout the world. He is a dedicated civil servant who has been serving the public in the Unified Court System of the State of New York. After immigrating from Senegal two decades ago, he has resided on Staten Island. He worked for Community Health Action of Staten Island for more than 10 years in many community initiatives that served the need of immigrants. This work made him one of the most solicited community organizers and health advocates in Staten Island's immigrant community. Abou has been a driving force in promoting universal access to HIV prevention, treatment, care, and support, and in creating partnerships among civil society, governments, and people living with HIV. Abou has an undergraduate degree from the City University of New York and a graduate degree from Yeshiva University School of Social Work. As an adjunct professor at Wagner College and Medgar Evers College City University of New York, he worked with the City's youth. He is fluent in three languages and is a member of the National Association of Social Workers (NASW). He has received numerous awards for his outstanding contributions throughout his professional and academic career. When he can, Abou fosters his unbridled passion for soccer and tennis. He is married and has a son. Paid for by Abou For City Council 2025 State law prohibits making a contribution in someone elseâs name, reimbursing someone for a contribution made in your name, being reimbursed for a contribution made in your name, or claiming to have made a contribution when a loan is made. For general information or to volunteer, write to abou@abouforyou.com Phone: (347) 951-3643 Sign up for half-hour appointments using Calendly . Abou For You P.O. Box 10475 Staten Island, NY 10301 © 2025 Abou for City Council 2025— All Rights Reserved"
  },
  {
    "candidate": "Diakhate, Abou S",
    "category": "bio",
    "score": null,
    "link": "https://www.abouforyou.com/news.html",
    "text": "Home News Events For the Media Platform Get Involved News The 2023 Staten Island Power 100 : Resilience in Leadership: New York City 2021 Elections : Interview exclusive: Abou Sy Diakhate: MyImpactStory | Abou S. Diakhate, Adjunct professor at Wagner College : Staten Island Advance Articles ‘No hate; no fear: Immigrants are welcome here.’ Pro-migrant rally held on Staten Island For these migrants living in NYC, the long trip from South America was just one leg of the dangerous journey Meeting with S.I. interfaith leaders, mayor emphasizes houses of worship as vital to his administration Immigrant groups applaud City Council bill that’s set to extend NYC vote to 900K non-citizens Paid for by Abou For City Council 2025 State law prohibits making a contribution in someone elseâs name, reimbursing someone for a contribution made in your name, being reimbursed for a contribution made in your name, or claiming to have made a contribution when a loan is made. For general information or to volunteer, write to abou@abouforyou.com Phone: (347) 951-3643 Sign up for half-hour appointments using Calendly . Abou For You P.O. Box 10475 Staten Island, NY 10301 © 2025 Abou for City Council 2025— All Rights Reserved"
  }
]