[
  {
    "candidate": "Diaz, Rosa G",
    "category": "bio",
    "score": null,
    "link": "https://bio.site/RosaGDiaz",
    "text": "Skip to main Rosa G. Diaz Rosa G. Diaz A dedicated mother of three children in the New York City Public Education system. A fierce, knowledgeable and committed parent leader. A dedicated, vocal and invested community advocate supporting families in need. Scheduled a time to meet with me and learn how you can be involved! Submit"
  },
  {
    "candidate": "Diaz, Rosa G",
    "category": "bio",
    "score": null,
    "link": "https://rosacares.com/",
    "text": "More Empowering District 8 Empowering District 8 Empowering District 8 Empowering District 8 Rosa G. Diaz for New York City Council Rosa G. Diaz for New York City Council Empowering District 8 Empowering District 8 Empowering District 8 Empowering District 8 Rosa G. Diaz for New York City Council Rosa G. Diaz for New York City Council Who is Rosa G. Diaz? Who is Rosa G. Diaz? A Mother. A Community Leader. An Advocate for the Underserved. Hi I'm Rosa Diaz! A proud member of the District 8 community. My mission is to keep supporting and advocating for families and the disadvantaged communities. I'm here to tell you that Rosa cares about YOU! Hi I'm Rosa Diaz! A proud member of the District 8 community. My mission is to keep supporting and advocating for families and the disadvantaged communities. I'm here to tell you that Rosa cares about YOU! In my early years, while I was still in my country Peru living with my Grandparents, all I did was go to school, help around the house, go to the corral and run errands. Never thought I was going to be able to make a difference with my experience, knowledge and skills. Since I came to the USA, in early 2000, I cannot say that my life was easier at all. Everything has been a challenge, from learning a new language, adjusting my whole life, losing contact with my family, advocating for myself and translating for my mom in the complicated and challenging New York City Public Educational System. But the need for knowledge, my eagerness to keep learning and advocating has brought me to a higher demand in my passion for helping others in need. As people say, knowledge is power. In my early years, while I was still in my country Peru living with my Grandparents, all I did was go to school, help around the house, go to the corral and run errands. Never thought I was going to be able to make a difference with my experience, knowledge and skills. Since I came to the USA, in early 2000, I cannot say that my life was easier at all. Everything has been a challenge, from learning a new language, adjusting my whole life, losing contact with my family, advocating for myself and translating for my mom in the complicated and challenging New York City Public Educational System. But the need for knowledge, my eagerness to keep learning and advocating has brought me to a higher demand in my passion for helping others in need. As people say, knowledge is power. For most of my life, I have been serving, advocating and protecting families’ rights, especially many immigrant families in my neighborhood who do not know their rights in this country, USA. My work began when I started volunteering at East Harlem Community Partnership, a division of the Administration for Children Services. I empathize with all the current services and resources people need, from serving food, food pantry, clothing drive, Christmas events, learning a new language support etc. I saw my work making a difference in people’s lives and soon became my passion. Then, partnering with other non-profits doing the work, I began to welcome new migrants, educate them about the Department of Education's complicated system and how to enroll their child in school and all the wonderful opportunities and resources there are for families. I can truly say that I am proud of supporting and being able to provide safe, and accountable support to those in great need. This is why I started to support non-profit organizations that fully concentrate on helping the immigrant population and their direct needs. For most of my life, I have been serving, advocating and protecting families’ rights, especially many immigrant families in my neighborhood who do not know their rights in this country, USA. My work began when I started volunteering at East Harlem Community Partnership, a division of the Administration for Children Services. I empathize with all the current services and resources people need, from serving food, food pantry, clothing drive, Christmas events, learning a new language support etc. I saw my work making a difference in people’s lives and soon became my passion. Then, partnering with other non-profits doing the work, I began to welcome new migrants, educate them about the Department of Education's complicated system and how to enroll their child in school and all the wonderful opportunities and resources there are for families. I can truly say"
  },
  {
    "candidate": "Diaz, Rosa G",
    "category": "bio",
    "score": null,
    "link": "https://rosacares.com/",
    "text": "that I am proud of supporting and being able to provide safe, and accountable support to those in great need. This is why I started to support non-profit organizations that fully concentrate on helping the immigrant population and their direct needs. Rosa G. Diaz has extensive experience volunteering in the community. From Community Advocate working with other non-profit organizations and as a bilingual Paralegal for almost two decades for the Law Office of Terilli & Tintle, and educating others on their legal and human rights. Rosa G. Diaz has extensive experience volunteering in the community. From Community Advocate working with other non-profit organizations and as a bilingual Paralegal for almost two decades for the Law Office of Terilli & Tintle, and educating others on their legal and human rights. Rosa G. Diaz has been coordinating the Cada Paso/Every Step Program in East Harlem for a decade. A program that supports children and parents in being physically active, socializing, and learning about all the services in East Harlem. From education guidance, financial institutions, healthcare services, and current food pantries in East Harlem. Rosa G. Diaz has been coordinating the Cada Paso/Every Step Program in East Harlem for a decade. A program that supports children and parents in being physically active, socializing, and learning about all the services in East Harlem. From education guidance, financial institutions, healthcare services, and current food pantries in East Harlem. Being an active member of the community, continuing the advocacy for individuals in need and creating a safe environment for our elders and our future leaders, our children. Being an active member of the community, continuing the advocacy for individuals in need and creating a safe environment for our elders and our future leaders, our children. My Promises to You My Promises to You Immigration Reform Equitable Education for All Equitable Education for All I will work closely with city government to improve our immigration policy in the city. I believe human rights should be at the forefront of all policy. We need to advocate for change NOW! I will work closely with city government to improve our immigration policy in the city. I believe human rights should be at the forefront of all policy. We need to advocate for change NOW! Equitable Education for All Equitable Education for All Equitable Education for All I have been a fierce advocate for equitable education for all. I will continue fighting for youth and parents to receive the most high quality education for our city despite economic, language and special needs barriers. I have been a fierce advocate for equitable education for all. I will continue fighting for youth and parents to receive the most high quality education for our city despite economic, language and special needs barriers. Affordable Housing Equitable Education for All Affordable Housing I will work closely with the city and developers to provide innovation in affordable housing. I want to bring back rent to own to our neighborhoods so our community can experience genuine socioeconomic empowerment. I will work closely with the city and developers to provide innovation in affordable housing. I want to bring back rent to own to our neighborhoods so our community can experience genuine socioeconomic empowerment. Donate Today Your financial support allows me to run a successful campaign. Your community support comes without a price. Provide your email below to get involved in our campaign. Every voice and every human matters. Your financial support allows me to run a successful campaign. Your community support comes without a price. Provide your email below to get involved in our campaign. Every voice and every human matters. Get involved! Copyright © 2025 Rosa Cares - All Rights Reserved. Copyright © 2025 Rosa Cares - All Rights Reserved. Paid for by Rosa Diaz for City Council District 8 2025 Paid for by Rosa Diaz for City Council District 8 2025 Rosa Cares Campaign | EIN: 33-2793762 Rosa Cares Campaign | EIN: 33-2793762 Powered by Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
  }
]