[
  {
    "candidate": "Diaz, David A",
    "category": "bio",
    "score": null,
    "link": "https://www.cbsnews.com/newyork/news/david-diaz-death-cbs-news-new-york/",
    "text": "Latest U.S. Diddy Trial World Politics Entertainment HealthWatch MoneyWatch Crime Space Sports Brand Studio U.S. Diddy Trial World Politics Entertainment HealthWatch MoneyWatch Crime Space Sports Brand Studio Local News Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas Live CBS News 24/7 Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas 48 Hours 60 Minutes CBS News 24/7 Baltimore Bay Area Boston Chicago Colorado Detroit Los Angeles Miami Minnesota New York Philadelphia Pittsburgh Sacramento Texas 48 Hours 60 Minutes Shows 48 Hours 60 Minutes America Decides CBS Evening News CBS Mornings CBS Morning News CBS Reports CBS Saturday Morning The Daily Report The Dish Face the Nation Sunday Morning The Takeout The Uplift 48 Hours 60 Minutes America Decides CBS Evening News CBS Mornings CBS Morning News CBS Reports CBS Saturday Morning The Daily Report The Dish Face the Nation Sunday Morning The Takeout The Uplift CBS News Investigates CBS News Confirmed CBS Village Podcasts Newsletters Download Our App CBS News Team Executive Team Brand Studio Paramount+ Join Our Talent Community RSS Feeds Davos Interviews A Moment With... Innovators & Disruptors Economy 4.0 CBS News Investigates CBS News Confirmed CBS Village Podcasts Newsletters Download Our App CBS News Team Executive Team Brand Studio Paramount+ Join Our Talent Community RSS Feeds Davos Interviews A Moment With... Innovators & Disruptors Economy 4.0 New York | News Weather Congestion Pricing Sports Video New York Shows Your Home Team All News NY News Bronx News Brooklyn News Harlem News Long Island News Northern Suburbs Queens News NJ News CT News Investigations Politics Education Transportation Crime Housing Arts & Entertainment Climate & Environment Health & Wellness Aging & Caregiving First Alert Weather Radars & Maps CBS2 Weather Map CBS2 Weather Watchers First Alert Weather 101 Share Photos & Videos All Sports Giants Yankees Knicks Rangers Islanders Jets Mets Nets Devils CBS Sports HQ Odds Latest News CBS New York Investigates Book Club with Mary Calvi Class Act with Chris Wragge #BetterTogether Breaking The Stigma Furry Friend Finder Sandy The 5:33 | Legacy of the LIRR Massacre On The Dot with David Schechter: Wildfires & Climate Change Climate Change: Protecting our Planet Station Info WCBS-TV WLNY-TV Contact Us Advertise Contests & Promotions Galleries Links & Numbers Download Our App Watch CBS News Local News David Diaz's death touches NYC and CBS News New York. He was the consummate \"reporter's reporter\" By Dave Carlin Dave Carlin Dave Carlin has covered major national news stories and events in the past four decades including Superstorm Sandy and its tri-state impacts, Hurricane Hugo in South Carolina and Iniki on Kauai, Hawaii. He also covered the Space Shuttle Program, 1989 San Francisco Earthquake, numerous Southern California wildfires, the trial and execution of serial killer Ted Bundy in Florida, the 1994 police shooting death of Tyke the eacaped Cirus Elephant on the streets of Honolulu, 2009's Miracle on the Hudson, the NYC Mayoral administrations of Bloomberg through Adams and more. Read Full Bio Dave Carlin Updated on: March 18, 2025 / 11:08 AM EDT / CBS New York Consummate reporter David Diaz's death touches NYC and CBS News New York Consummate reporter David Diaz's death touches NYC and CBS News New York 03:26 Television journalist and educator David Diaz, who spent decades covering New York City and the Tri-State Area, died last week at the age of 82. Here at CBS News New York, we were lucky that he shared his remarkable abilities, generous spirit and infectious smile with us and our viewers. \"New York City guy\" who could do it all Diaz's television news career spanned three decades. He relentlessly pursued the truth, with qualities tough and tender, like the city he loved. The tragedy of 9/11 was reported by him with abundant skill and empathy. \"A reporter's reporter. New York City guy. Hard scrabble, you know, bringing himself up and wanted to bring others up as well,\" CBS Evening News anchor Maurice Dubois said of his former colleague. \"He understood New York City like very few journalist know and that was David Diaz. He was a consummate professional, a charming, charming man,\" CBS News New York anchor Mary Calvi said. \"He was a legend,\" CBS News New York's Jennifer Jones said. Diaz spent decades telling insightful stories Diaz was born in Puerto Rico in 1942, and from"
  },
  {
    "candidate": "Diaz, David A",
    "category": "bio",
    "score": null,
    "link": "https://www.cbsnews.com/newyork/news/david-diaz-death-cbs-news-new-york/",
    "text": "the age of 3 he was raised in Washington Heights. He was educated at Fordham Prep, City College, and Columbia University. He had been a community activist and newspaper reporter when he was hired by NBC, where he spent 15 years. He then spent more than 12 years here at CBS News New York. \"I first met David Diaz when I was a print reporter and we went on a complicated trip to South America and Central America. He was able to take this complex story with multiple, multiple locations and cut in the field and feed a piece back and be on the evening news every single night. He was able to do it and make it look so incredibly effortless,\" CBS News New York political reporter Marcia Kramer said. \"There was David. You sent him out, you knew you were gonna get the story,\" CBS News New York associate producer Wanda Prisinzano said. \"He did it all, from anchoring, field anchoring, reporting. If you needed something, he was always there,\" CBS News New York field operations manager Brian Lowder added. \"A mentor\" and so much more Family members say in recent years Diaz lived with a form of dementia that diminished his gifts of communication, but added even as his words faded, his spirit never did. \"He was such a mentor. He was a mentor from when I first met him and 1993 and then after he left Channel 2, which was huge loss to journalism in general. Then he wanted to keep helping, so he teaches. I miss him. I know it's a big hole in so many people's lives,\" CBS News New York anchor and reporter Cindy Hsu added. Diaz is survived by his daughters, Elena, Nina, son-in-law Jonathan and his wife, Andrea. More from CBS News NYC Mayor Adams announces new mixed-income housing for Staten Island NYC entrepreneurs on what you need to know to start a business NYC Mayor Eric Adams meets with President Trump at White House First Alert Forecast: Fantastic weather weekend in NYC area In: New York City Journalism CBS Dave Carlin Dave Carlin has covered major national news stories and events in the past four decades including Superstorm Sandy and its tri-state impacts, Hurricane Hugo in South Carolina and Iniki on Kauai, Hawaii. He also covered the Space Shuttle Program, 1989 San Francisco Earthquake, numerous Southern California wildfires, the trial and execution of serial killer Ted Bundy in Florida, the 1994 police shooting death of Tyke the eacaped Cirus Elephant on the streets of Honolulu, 2009's Miracle on the Hudson, the NYC Mayoral administrations of Bloomberg through Adams and more. Twitter Facebook © 2025 CBS Broadcasting Inc. All Rights Reserved. Featured Local Savings David Diaz's death touches NYC and CBS News New York. He was the consummate \"reporter's reporter\" Dave Carlin Updated on: March 18, 2025 / 11:08 AM EDT / CBS New York Consummate reporter David Diaz's death touches NYC and CBS News New York Consummate reporter David Diaz's death touches NYC and CBS News New York 03:26 Television journalist and educator David Diaz, who spent decades covering New York City and the Tri-State Area, died last week at the age of 82. Here at CBS News New York, we were lucky that he shared his remarkable abilities, generous spirit and infectious smile with us and our viewers. \"New York City guy\" who could do it all Diaz's television news career spanned three decades. He relentlessly pursued the truth, with qualities tough and tender, like the city he loved. The tragedy of 9/11 was reported by him with abundant skill and empathy. \"A reporter's reporter. New York City guy. Hard scrabble, you know, bringing himself up and wanted to bring others up as well,\" CBS Evening News anchor Maurice Dubois said of his former colleague. \"He understood New York City like very few journalist know and that was David Diaz. He was a consummate professional, a charming, charming man,\" CBS News New York anchor Mary Calvi said. \"He was a legend,\" CBS News New York's Jennifer Jones said. Diaz spent decades telling insightful stories Diaz was born in Puerto Rico in 1942, and from the age of 3 he was raised in Washington Heights. He was educated at Fordham Prep, City College, and Columbia University. He had been a community activist and newspaper reporter when he was hired by NBC, where he spent 15 years. He then spent more than 12 years here at CBS News New York. \"I"
  },
  {
    "candidate": "Diaz, David A",
    "category": "bio",
    "score": null,
    "link": "https://www.cbsnews.com/newyork/news/david-diaz-death-cbs-news-new-york/",
    "text": "first met David Diaz when I was a print reporter and we went on a complicated trip to South America and Central America. He was able to take this complex story with multiple, multiple locations and cut in the field and feed a piece back and be on the evening news every single night. He was able to do it and make it look so incredibly effortless,\" CBS News New York political reporter Marcia Kramer said. \"There was David. You sent him out, you knew you were gonna get the story,\" CBS News New York associate producer Wanda Prisinzano said. \"He did it all, from anchoring, field anchoring, reporting. If you needed something, he was always there,\" CBS News New York field operations manager Brian Lowder added. \"A mentor\" and so much more Family members say in recent years Diaz lived with a form of dementia that diminished his gifts of communication, but added even as his words faded, his spirit never did. \"He was such a mentor. He was a mentor from when I first met him and 1993 and then after he left Channel 2, which was huge loss to journalism in general. Then he wanted to keep helping, so he teaches. I miss him. I know it's a big hole in so many people's lives,\" CBS News New York anchor and reporter Cindy Hsu added. Diaz is survived by his daughters, Elena, Nina, son-in-law Jonathan and his wife, Andrea. More from CBS News NYC Mayor Adams announces new mixed-income housing for Staten Island NYC entrepreneurs on what you need to know to start a business NYC Mayor Eric Adams meets with President Trump at White House First Alert Forecast: Fantastic weather weekend in NYC area New York City Journalism CBS Dave Carlin has covered major national news stories and events in the past four decades including Superstorm Sandy and its tri-state impacts, Hurricane Hugo in South Carolina and Iniki on Kauai, Hawaii. He also covered the Space Shuttle Program, 1989 San Francisco Earthquake, numerous Southern California wildfires, the trial and execution of serial killer Ted Bundy in Florida, the 1994 police shooting death of Tyke the eacaped Cirus Elephant on the streets of Honolulu, 2009's Miracle on the Hudson, the NYC Mayoral administrations of Bloomberg through Adams and more. © 2025 CBS Broadcasting Inc. All Rights Reserved. Featured Local Savings More from CBS News NYC Mayor Adams announces new mixed-income housing for Staten Island NYC Mayor Adams announces new mixed-income housing for Staten Island NYC entrepreneurs on what you need to know to start a business NYC entrepreneurs on what you need to know to start a business NYC Mayor Eric Adams meets with President Trump at White House NYC Mayor Eric Adams meets with President Trump at White House First Alert Forecast: Fantastic weather weekend in NYC area First Alert Forecast: Fantastic weather weekend in NYC area ©2025 CBS Broadcasting Inc. All Rights Reserved. CBS News App CBS News App Chrome Chrome Safari Safari"
  }
]