[
  {
    "candidate": "Durchin, Zahava",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Zahava_Durchin",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Zahava Durchin Zahava Durchin Zahava Durchin Democratic Party Candidate, New York City Council District 44 June 24, 2025 Education Independence University, Utah Campus, 2021 Send Ballotpedia contact information for this person Zahava Durchin ( Democratic Party ) is running for election to the New York City Council to represent District 44 . She declared candidacy for the Democratic primary scheduled on June 24, 2025 . Durchin completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Zahava Durchin earned a degree from Independence University in 2021. Her career experience includes working as in healthcare. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 44 Incumbent Simcha Felder and Zahava Durchin are running in the Democratic primary for New York City Council District 44 on June 24, 2025. Candidate Simcha Felder Zahava Durchin Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Zahava Durchin completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Durchin's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. My name is Zahava Durchin. I am running for New York City Council, District 44. Have you ever felt like “New York Politicians” are out of touch with the needs of Real Working Class New Yorkers? Well, that feeling is what motivated me to run for New York City Council. For the last 10 years, I worked in the healthcare industry, while studying healthcare management, philosophy, and politics. I understand that New Yorkers need leaders who will work for the best interests of \"We the people\" - Not Big Corporations. We need leaders who understand the cost of living crisis - and my plan to fight the cost of living crisis includes affordable rent, healthcare, and wages that reflect the cost of living. We need affordable housing and healthcare coverage that covers ALL New Yorkers, regardless of income or employment status. New Yorkers don't deserve to go into debt over a hospital bill - and with The New York Health Act, that will never happen again. If you Agree that it is time for the next generation of leaders to step up and introduce fresh ideas to voters, vote for Zahava. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Support the New York Health Act Support policies that link minimum wage increases to the NYC cost of living My vision for housing justice: no one in District 44 pays unreasonable rent to live in their own community. My Rent Control plan includes eliminating Non-refundable Application Fees and advocating for affordable housing projects that cap rent at the following levels per month. Studios: $600. 1-Bedroom: $800. 2-Bedroom: $1,000. 3-Bedroom: $1,600. 4-Bedroom: $1,800. I will advocate for incentives that reduce the financial pressure on property owners, allowing them to offer affordable rents without losing profit Why"
  },
  {
    "candidate": "Durchin, Zahava",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Zahava_Durchin",
    "text": "is this good for the economy? New Yorkers will have more money each month to support local NYC Businesses, which will lead to a stronger economy. You save money on rent prices = more money going back into NYC Economy Support the New York Health Act Support policies that link minimum wage increases to the NYC cost of living My vision for housing justice: no one in District 44 pays unreasonable rent to live in their own community. My Rent Control plan includes eliminating Non-refundable Application Fees and advocating for affordable housing projects that cap rent at the following levels per month. Studios: $600. 1-Bedroom: $800. 2-Bedroom: $1,000. 3-Bedroom: $1,600. 4-Bedroom: $1,800. I will advocate for incentives that reduce the financial pressure on property owners, allowing them to offer affordable rents without losing profit Why is this good for the economy? New Yorkers will have more money each month to support local NYC Businesses, which will lead to a stronger economy. You save money on rent prices = more money going back into NYC Economy Studios: $600. 1-Bedroom: $800. 2-Bedroom: $1,000. 3-Bedroom: $1,600. 4-Bedroom: $1,800. I will advocate for incentives that reduce the financial pressure on property owners, allowing them to offer affordable rents without losing profit What areas of public policy are you personally passionate about? Affordable housing and healthcare and childcare and transportation and higher education. A living wage for all New Yorkers. Who do you look up to? Whose example would you like to follow, and why? I feel inspired by leaders of many industries: Artists like Taylor Swift and Ethel Cain and Julien Baker, Athletes like Simone Biles and Junko Tabei, a Japanese mountaineer, and the first woman to climb Mount Everest and the Seven Summits, climbing the highest mountain on every continent, Activists like Marsha P. Johnson and Harvey Milk and Greta Thunberg. I feel inspired by politicians who give me hope for a better future, like Bernie Sanders, AOC, and Vice President Kamala Harris. What characteristics or principles are most important for an elected official? Integrity. Empathy. Accountability. Communication with voters, and welcoming questions from voters. Respect for Diversity- Elected officials must value the diverse backgrounds, and experiences of voters, to guarantee all voices are heard and represented. What qualities do you possess that you believe would make you a successful officeholder? A strong passion for social justice, healthcare justice, housing justice, and a living wage for all New Yorkers. What do you believe are the core responsibilities for someone elected to this office? Introduce and vote on proposed NYC laws. Negotiate NYC budget with the Mayor. Monitor NYC agencies such as the Department of Education and the NYPD to make sure they serve all New Yorkers fairly. What legacy would you like to leave? Building a pathway to affordable housing, healthcare, education, child care, and a living wage, that will lead to a safer NYC for all New York Families. What is your favorite book? Why? My favorite book is a picture book called \"Pride: The Story of Harvey Milk and the Rainbow Flag\", Written by Rob Sanders, illustrated by Steven Salerno. The first time I read this book, I learned about the history of the Pride Flag, starting in 1978 with social activist Harvey Milk and designer Gilbert Baker. I read this book every time I feel like I need a reminder of how important it is to always keep fighting for equality. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? For the last 10 years, I worked in the healthcare industry, while studying healthcare management, philosophy, history, and politics. I have a strong passion for research, and social justice. I believe previous experience in government is helpful, but I do not believe it should be REQUIRED, because it is an impossible starting point - everyone must start somewhere, every time you start a new job, in a new industry, you are starting with no previous experience. What kind of skills or expertise do you believe would be the most helpful for the holders of this office to possess? I think a passion for social justice is the most important skill - the passion to make the world a better place, and fight for a better future. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or"
  },
  {
    "candidate": "Durchin, Zahava",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Zahava_Durchin",
    "text": "she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 9, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 9, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024"
  },
  {
    "candidate": "Durchin, Zahava",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Zahava_Durchin",
    "text": "presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]