[
  {
    "candidate": "Edwards, Khari",
    "category": "bio",
    "score": null,
    "link": "https://www.khariedwards2025.com/meet-khari",
    "text": "top of page Menu Menu Close Close Meet Khari Meet Khari Policy Policy Events Events Volunteer Volunteer Media Newsroom Press Videos Media Newsroom Newsroom Press Press Videos Videos Meet Khari Meet Khari Policy Policy Events Events Volunteer Volunteer Media Newsroom Press Videos Media Newsroom Newsroom Press Press Videos Videos CONTRIBUTE Meet Khari Edwards: Visionary Leader for Brooklyn Borough President Meet Khari Edwards: Visionary Leader for Brooklyn Borough President Khari Edwards, a devoted family man and son of immigrants, has dedicated over 25 years to serving Brooklyn's diverse communities. As a candidate for Brooklyn Borough President, Khari is driven by a commitment to proactive leadership, fostering deep community relationships, and delivering accessible solutions that address the needs of all Brooklyn residents. He lives in Crown Heights with his wife, Jahmila, and their three children, Ethan, Niah, and Myles, embodying the spirit and resilience of Brooklyn. Extensive Experience in Public Service and Community Advocacy Extensive Experience in Public Service and Community Advocacy Throughout his career, Khari has worked with elected officials, non-profits, and city agencies focusing on reducing racial, health, and civic disparities. Currently, as the Head of Corporate Responsibility at Ayr Wellness, he promotes inclusivity and opportunities in the cannabis industry. Previously, Khari spent eight years as Vice President of External Affairs at Brookdale Hospital, where he spearheaded initiatives that built community trust and enhanced access to healthcare for over 1.3 million residents. Community Leadership and Educational Engagement Community Leadership and Educational Engagement Khari's passion for community service is also evident in his personal projects. He founded the “It Starts Here” program, which connects students with victims of gun violence and has mobilized hundreds of union members, healthcare professionals, and community leaders to tackle disparities in East Brooklyn. Additionally, Khari holds significant roles including Brooklyn Council President for Make A Wish NY and has served on various educational and community boards, reflecting his commitment to fostering a better environment for education and community welfare. Education and Deep Brooklyn Roots Education and Deep Brooklyn Roots Khari’s educational journey through St. Mark’s Day School, Midwood High School, and Thomas Edison University has equipped him with a profound understanding of the borough’s needs and potentials. His deep roots and extensive experience uniquely position him to lead Brooklyn with an innovative and inclusive approach. Vote Khari Edwards: Dedicated, Proactive, and Community-Focused Vote Khari Edwards: Dedicated, Proactive, and Community-Focused With a lifetime of commitment to the people and prosperity of Brooklyn, Khari Edwards is prepared to take his passion and experience to the next level. He's ready to work tirelessly, embodying the true Brooklyn spirit, to create a borough that works for everyone. Elect Khari Edwards for a united, progressive, and thriving Brooklyn. Meet Khari Meet Khari Policy Policy Events Events Volunteer Volunteer Media Newsroom Press Videos Media Newsroom Newsroom Press Press Videos Videos Meet Khari Meet Khari Policy Policy Events Events Volunteer Volunteer Media Newsroom Press Videos Media Newsroom Newsroom Press Press Videos Videos bottom of page"
  }
]