[
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Hatem El-Gamasy Hatem El-Gamasy Hatem El-Gamasy Republican Party Candidate, New York City Council District 45 June 24, 2025 Education Menoufia University, Egypt Seton Hall University Personal LinkedIn Hatem El-Gamasy ( Republican Party ) is running for election to the New York City Council to represent District 45 . He is on the ballot in the Republican primary on June 24, 2025 . El-Gamasy completed Ballotpedia's Candidate Connection survey in 2024. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Hatem El-Gamasy earned a bachelor's degree from Menoufia University in Egypt and a graduate degree from Seton Hall University. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 45 Incumbent Farah Louis is running in the Democratic primary for New York City Council District 45 on June 24, 2025. Candidate Farah Louis Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 45 Elijah Diaz and Hatem El-Gamasy are running in the Republican primary for New York City Council District 45 on June 24, 2025. Candidate Submit photo Elijah Diaz Hatem El-Gamasy There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Hatem El-Gamasy completed Ballotpedia's Candidate Connection survey in 2024. The survey questions appear in bold and are followed by El-Gamasy's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. My name is Hatem (pronounced “Ha-Tim”), and I’m a proud Egyptian-American Brooklynite with a strong sense of community and a passion for helping others. Growing up in a small village in Egypt, I learned the value of hard work and collaboration while farming with my family. My mother’s determination for us to have access to education inspired me to become the first in my family to earn a bachelor’s degree and later teach ESL in Egyptian public schools. In Brooklyn, I’ve embraced my role as a neighbor and community member, volunteering at the New York Foundling Hospital, teaching ESL to immigrants at Columbia University’s Community Impact Center, and assisting asylum seekers at the Church of St. Francis of Assisi. I’ve also run a small business, which deepened my understanding of the struggles small business owners face. My love for this diverse district led me to pursue a master’s degree in international relations and publish a book highlighting critical social issues. Now, encouraged by neighbors and friends, I’m running for New York City Council in District 45. My candidacy is built on community values and a commitment to ensuring our diverse voices are heard. Together,"
  },
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "we can secure a seat at the table and demand the change we deserve. Join me—our unity is our strength. In Brooklyn, I’ve embraced my role as a neighbor and community member, volunteering at the New York Foundling Hospital, teaching ESL to immigrants at Columbia University’s Community Impact Center, and assisting asylum seekers at the Church of St. Francis of Assisi. I’ve also run a small business, which deepened my understanding of the struggles small business owners face. My love for this diverse district led me to pursue a master’s degree in international relations and publish a book highlighting critical social issues. Now, encouraged by neighbors and friends, I’m running for New York City Council in District 45. My candidacy is built on community values and a commitment to ensuring our diverse voices are heard. Together, we can secure a seat at the table and demand the change we deserve. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Reduce and Simplify City Laws: Have you gotten a ticket for double parking in a bus lane just for stopping in front of your home to pick up family members or unload groceries? You’re not alone. This is just one example of how our city has become overregulated, complicating our daily lives without solving real problems. It’s like those drug commercials on TV that claim to treat one condition but cause twenty other side effects. New York City is one of the most regulated cities in the country, with rules governing nearly every aspect of our daily life. While many of these regulations aim to protect public safety and fairness, the sheer volume and complexity have unintended consequences—burdening small businesses, and residents alike. Support for Small Business: In New York City, nearly half of our 220,000 small businesses are owned and run by hard-working immigrants. These businesses are the backbone of our local economy. Money spent at local businesses tends to stay in the neighborhood, supporting the entire community. Small business owners work long hours and must navigate a maze of complex city requirements, regulations, and laws just to stay afloat. Many of these regulations are confusing and open to multiple interpretations, making it hard for business owners to fight against fines and easy for city agencies to use them as a source of revenue. As a former small business owner, supporting small businesses is my top priority. Support For families: The more hard-earned money you pay to the City in fines and tickets issued under confusing laws and regulations, the less you have to secure food and essentials for your family. Overregulation drives up costs and complicates daily life. From traffic rules that make it hard to drive or park, to housing regulations that discourage landlords from maintaining affordable units, to restrictive childcare requirements—these layers of bureaucracy often make life harder for the people who work the hardest. It doesn’t have to be this way. NYC needs smarter, simpler regulations that work with residents and businesses—not against them. By streamlining outdated and unnecessary rules, we can strike a better balance. Reduce and Simplify City Laws: Have you gotten a ticket for double parking in a bus lane just for stopping in front of your home to pick up family members or unload groceries? You’re not alone. This is just one example of how our city has become overregulated, complicating our daily lives without solving real problems. It’s like those drug commercials on TV that claim to treat one condition but cause twenty other side effects. New York City is one of the most regulated cities in the country, with rules governing nearly every aspect of our daily life. While many of these regulations aim to protect public safety and fairness, the sheer volume and complexity have unintended consequences—burdening small businesses, and residents alike. Have you gotten a ticket for double parking in a bus lane just for stopping in front of your home to pick up family members or unload groceries? You’re not alone. This is just one example of how our city has become overregulated, complicating our daily lives without solving real problems. It’s like those drug commercials on TV that claim to treat one condition but cause twenty other side effects. Support for Small Business: In New York City, nearly half of our 220,000 small businesses are owned and run by hard-working immigrants. These businesses are the backbone of our"
  },
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "local economy. Money spent at local businesses tends to stay in the neighborhood, supporting the entire community. Small business owners work long hours and must navigate a maze of complex city requirements, regulations, and laws just to stay afloat. Many of these regulations are confusing and open to multiple interpretations, making it hard for business owners to fight against fines and easy for city agencies to use them as a source of revenue. As a former small business owner, supporting small businesses is my top priority. Support For families: The more hard-earned money you pay to the City in fines and tickets issued under confusing laws and regulations, the less you have to secure food and essentials for your family. Overregulation drives up costs and complicates daily life. From traffic rules that make it hard to drive or park, to housing regulations that discourage landlords from maintaining affordable units, to restrictive childcare requirements—these layers of bureaucracy often make life harder for the people who work the hardest. It doesn’t have to be this way. NYC needs smarter, simpler regulations that work with residents and businesses—not against them. By streamlining outdated and unnecessary rules, we can strike a better balance. What areas of public policy are you personally passionate about? I am passionate about public policies that directly improve the daily lives of our community. My priorities include reducing and simplifying city laws to cut through bureaucratic red tape, supporting small businesses as the backbone of our local economy, ensuring food security for children and families, and holding landlords accountable by ending unfair tax breaks for those who neglect tenant needs. I am also deeply committed to addressing the mismanagement of our city funds. I support prioritizing people’s needs and advocate for transparency and strong accountability mechanisms. People deserve to know how city agencies spend public money, how spending is prioritized, and how funds are ensured to be used as intended. Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? The Alchemist by Brazilian novelist Paulo Coelho is a magical book that ignites my spark and fuels my imagination to pursue my dreams. This captivating story follows the journey of a young dreamer from Andalusia, Spain, across the deserts of North Africa. Along the way, he faces unexpected dangers and an uncertain fate as he quests to reach Egypt in search of a treasure he dreamed of near the Pyramids. My favorite line from the book is, “When you want something, all the universe conspires in helping you to achieve it.” Throughout the story, Santiago, the main character, reflects on how the fear of failure can hold us back from pursuing our dreams. The book reminds us to follow our hearts, because, as it says, “Wherever your heart is, there you will find your treasure.” What characteristics or principles are most important for an elected official? An elected official must prioritize integrity, transparency, and accountability. They should listen to their constituents, advocate for their needs without bias, and lead with empathy and fairness. Above all, they must be committed to serving the people—not personal or party agendas—and remain steadfast in putting the community’s interests first. That is why I am running as an independent: to be solely committed to the people in my district. I want my candidacy to be a community candidacy, focused on the issues that matter to our constituents. I will not let my campaign drift into partisan battles, pointless sophistry, or hypothetical debates that have no relevance to the real concerns of the people I seek to serve and represent. What do you believe are the core responsibilities for someone elected to this office? Listening to the concerns of the people, advocating for their needs, and fighting for fair policies that improve daily life are the core responsibilities of any elected official. This means passing laws that prioritize the demands and needs of the people we represent while holding government agencies accountable for delivering results. Most importantly, it’s about being a true representative of the community—ensuring every voice is heard and every family has a fair shot at success. For me, putting people first is my top priority. That is why I am running as an independent—to fully represent the people of my district, the neighbors I relate to and live among, and nothing else. What was your very first job? How long did you have it? I grew up farming alongside my family, cultivating"
  },
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "crops on our land. When I reached high school, I earned my first money working in wheat threshing—despite my family’s objections. It was hard work, but I loved the independence of earning my own income. My very first job after graduating college with a bachelor’s degree in education was teaching ESL in Egyptian public schools. I taught for seven years, and it became my true passion. Being a teacher allowed me to inspire young minds, connect with my community, and develop invaluable skills like active listening and problem-solving. I loved every moment of it, and I still miss teaching to this day. Are there any little-known powers or responsibilities held by this office that you believe more people should be aware of? One little-known yet critical responsibility of the New York City Council is its role as the city’s legislative body, entrusted with making laws that impact every aspect of daily life in the Big Apple—from housing and education to public safety and transportation. Despite this, voter turnout for local elections has reached historic lows, with only 23.3% of eligible voters participating in the 2021 mayoral and City Council general election, according to the New York City Campaign Finance Board. This lack of participation shows that many New Yorkers may not realize just how much the City Council shapes their lives. It’s essential to raise awareness about the power of this office and encourage more residents to engage in local elections. Strong voter participation can lead to better representation and ensure that the Council reflects the needs and priorities of all New Yorkers. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? I don’t believe prior experience in government or politics is necessary to serve effectively as a member of the New York City Council or any other public office. What matters most is having a deep understanding of the community you represent—its daily struggles, its most urgent needs, and its aspirations for the future. An elected official must be connected to the people they serve, listen to their concerns, and advocate for their demands. Familiarity with the district and the willingness to stand up for the community are far more valuable than prior political experience. I believe leadership is about serving people, not about resumes or titles. What are your views on financial transparency and government accountability? In 2023, in District 45, the New York City Council approved $191 million in tax breaks for one of the City's worst landlords—identified by city officials as having over 3,000 unresolved housing code violations. In 2024, the New York City Council, along with the mayor and the Brooklyn Borough President, approved $1–3 million for a dog park in Bed-Stuy—a neighborhood within our city where public schools are underfunded and many families struggle to make ends meet. These decisions have eroded trust in government for many, as they reflect a pattern of misplaced priorities. In fact, trust in government is at an all-time low, both in New York City and nationwide, as highlighted by studies from organizations like Pew Research Center. Perceived inefficiencies, corruption, mismanagement of public funds, and frustration with government services all contribute to this growing sentiment of disillusionment. That is why I believe financial transparency and government accountability are non-negotiable for restoring trust between elected officials and the people they serve. Taxpayers have a right to know exactly how their money is being spent and whether it’s being used effectively to meet their needs. This means ensuring full transparency in budgeting, requiring clear and accessible reporting from city agencies, and establishing strong accountability mechanisms to track results. I will fight to cut wasteful spending, end the mismanagement of resources, and prioritize investments that directly benefit our community in District 45. These decisions have eroded trust in government for many, as they reflect a pattern of misplaced priorities. In fact, trust in government is at an all-time low, both in New York City and nationwide, as highlighted by studies from organizations like Pew Research Center. Perceived inefficiencies, corruption, mismanagement of public funds, and frustration with government services all contribute to this growing sentiment of disillusionment. That is why I believe financial transparency and government accountability are non-negotiable for restoring trust between elected officials and the people they serve. Taxpayers have a right to know exactly how their money is being spent and whether it’s being used effectively to meet their needs. Note: Ballotpedia reserves the right to edit Candidate Connection survey"
  },
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on December 29, 2024. ↑ Information submitted to Ballotpedia through the Candidate Connection survey on December 29, 2024. v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Republican Party Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100"
  },
  {
    "candidate": "El-Gamasy, Hatem",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hatem_El-Gamasy",
    "text": "votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]