[
  {
    "candidate": "Encarnacion, Elsie R",
    "category": "bio",
    "score": null,
    "link": "https://www.elsieforcouncil.com/",
    "text": "0 0 Open Menu Close Menu Open Menu Close Menu ELSIE ENCARNACION: Community Over Competition Building District 8’s Future, Together Fighting for East Harlem and the South Bronx Support Elsie Get Involved Meet Elsie Elsie Encarnacion, a lifelong resident of District 8, has dedicated over a decade to advocating for affordable housing, quality education, and economic empowerment. Driven by the needs of East Harlem and the South Bronx, Elsie’s work centers on uplifting her community, always putting people before politics. Learn More Community-Centric Impact Through her roles as Chief of Staff to Deputy Speaker Diana Ayala and Director of Youth Services to City Council Speaker Melissa Mark-Viverito, Elsie remains committed to creating real change. Her initiative, ‘Community Over Competition,’ embodies her belief in putting community voices first, ensuring they guide every decision. “Engagement has always been the foundation of my work. Our future lies in the strength of our community and the power of collaboration.” Elsie Encarnacion Join Elsie on this journey to uplift District 8. Together, we can create a brighter future for East Harlem and the South Bronx. JOIN ELSIE TODAY DONATE GET INVOLVED ELSIE ENCARNACION: ELSIE ENCARNACION: ELSIE ENCARNACION: Community Over Competition Community Over Competition Building District 8’s Future, Together Building District 8’s Future, Together Fighting for East Harlem and the South Bronx Fighting for East Harlem and the South Bronx Fighting for East Harlem and the South Bronx Meet Elsie Meet Elsie Elsie Encarnacion, a lifelong resident of District 8, has dedicated over a decade to advocating for affordable housing, quality education, and economic empowerment. Driven by the needs of East Harlem and the South Bronx, Elsie’s work centers on uplifting her community, always putting people before politics. Elsie Encarnacion, a lifelong resident of District 8, has dedicated over a decade to advocating for affordable housing, quality education, and economic empowerment. Driven by the needs of East Harlem and the South Bronx, Elsie’s work centers on uplifting her community, always putting people before politics. Community-Centric Impact Through her roles as Chief of Staff to Deputy Speaker Diana Ayala and Director of Youth Services to City Council Speaker Melissa Mark-Viverito, Elsie remains committed to creating real change. Her initiative, ‘Community Over Competition,’ embodies her belief in putting community voices first, ensuring they guide every decision. “Engagement has always been the foundation of my work. Our future lies in the strength of our community and the power of collaboration.” Elsie Encarnacion Join Elsie on this journey to uplift District 8. Together, we can create a brighter future for East Harlem and the South Bronx. JOIN ELSIE TODAY About Elsie About Elsie Priorities Priorities Contact Contact Donate Donate Subscribe Sign up with your email address to receive news and updates. Sign Up"
  }
]