[
  {
    "candidate": "Endeley, Saint Jermaine*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Saint_Jermaine_Endeley",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Saint Jermaine Endeley Saint Jermaine Endeley Saint Jermaine Endeley This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Democratic Party August 5, 2024 Personal Facebook Personal Instagram Personal LinkedIn Saint Jermaine Endeley ( Democratic Party ) ran for election for President of the United States. He lost as a write-in in the Democratic convention on August 5, 2024 . Endeley also ran for election to the U.S. House to represent New York's 11th Congressional District . He did not appear on the ballot for the Democratic primary on June 25, 2024 . Endeley also ran for election to the U.S. House to represent New York's 1st Congressional District . He did not appear on the ballot for the Democratic primary on June 25, 2024 . Contents 1 Elections 1.1 2024 1.1.1 Endorsements 1 Elections 1.1 2024 1.1.1 Endorsements 1.1 2024 1.1.1 Endorsements 1.1.1 Endorsements 2 Campaign themes 2.1 2024 2 Campaign themes 2.1 2024 2.1 2024 3 Campaign finance summary 3 Campaign finance summary 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Elections Elections 2024 2024 See also: New York's 1st Congressional District election, 2024 New York's 1st Congressional District election, 2024 (June 25 Democratic primary) New York's 1st Congressional District election, 2024 (June 25 Republican primary) General election General election for U.S. House New York District 1 Incumbent Nicholas J. LaLota defeated John Avlon in the general election for U.S. House New York District 1 on November 5, 2024. Candidate % Votes ✔ Nicholas J. LaLota (R / Conservative Party) 55.2 226,285 John Avlon (D) 44.8 183,540 Other/Write-in votes 0.1 275 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 410,100 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Patrick Denman (Independent) Jarrett Matthews Adorno (Independent) George Devolder-Santos (Independent) Ryan Kalata (Independent) Democratic primary election Democratic primary for U.S. House New York District 1 John Avlon defeated Nancy Goroff in the Democratic primary for U.S. House New York District 1 on June 25, 2024. Candidate % Votes ✔ John Avlon 70.1 19,383 Nancy Goroff 29.9 8,253 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 27,636 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Kyle Hill (D) James Gaughran (D) Andy DeCecco (D) Craig Herskowitz (D) Saint Jermaine Endeley (D) Republican primary election The Republican primary election was canceled. Incumbent Nicholas J. LaLota advanced from the Republican primary for U.S. House New York District 1. Withdrawn or disqualified candidates George Devolder-Santos (R) Darrion Stewart (R) Conservative Party primary election The Conservative Party primary election was canceled. Incumbent Nicholas J. LaLota advanced from the Conservative Party primary for U.S. House New York District 1. Withdrawn or disqualified candidates Daniel Foti (Conservative Party) See also: New York's 11th Congressional District election, 2024 New York's 11th Congressional District election, 2024 (June 25 Democratic primary) New York's 11th Congressional District election, 2024 (June 25 Republican primary) General election General election for U.S. House New York District 11 Incumbent Nicole Malliotakis defeated Andrea Morse in the general election for U.S. House New York District 11 on November 5, 2024. Candidate % Votes ✔ Nicole Malliotakis (R / Conservative Party) 63.8 167,099 Andrea Morse (D) 35.8 93,586 Other/Write-in votes 0.4 1,043 Incumbents are"
  },
  {
    "candidate": "Endeley, Saint Jermaine*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Saint_Jermaine_Endeley",
    "text": "bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 261,728 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election The Democratic primary election was canceled. Andrea Morse advanced from the Democratic primary for U.S. House New York District 11. Withdrawn or disqualified candidates Saint Jermaine Endeley (D) Sarah Blas (D) Republican primary election The Republican primary election was canceled. Incumbent Nicole Malliotakis advanced from the Republican primary for U.S. House New York District 11. Withdrawn or disqualified candidates Nicholas Robbins (R) Conservative Party primary election The Conservative Party primary election was canceled. Incumbent Nicole Malliotakis advanced from the Conservative Party primary for U.S. House New York District 11. Endorsements Endorsements Ballotpedia did not identify endorsements for Endeley in this election. Campaign themes Campaign themes 2024 2024 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Saint Jermaine Endeley did not complete Ballotpedia's 2024 Candidate Connection survey. Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Saint Jermaine Endeley did not complete Ballotpedia's 2024 Candidate Connection survey. Campaign finance summary Campaign finance summary Note: The finance data shown here comes from the disclosures required of candidates and parties. Depending on the election or state, this may represent only a portion of all the funds spent on their behalf. Satellite spending groups may or may not have expended funds related to the candidate or politician on whose page you are reading this disclaimer. Campaign finance data from elections may be incomplete. For elections to federal offices, complete data can be found at the FEC website . Click here for more on federal campaign finance law and here for more on state campaign finance law. 2024* President of the United States Lost convention $0 N/A** 2024* U.S. House New York District 1 Withdrew primary $0 N/A** 2024* U.S. House New York District 11 Withdrew primary $0 N/A** Grand total $0 N/A** Sources: OpenSecrets , Federal Elections Commission ***This product uses the openFEC API but is not endorsed or certified by the Federal Election Commission (FEC). Sources: OpenSecrets , Federal Elections Commission ***This product uses the openFEC API but is not endorsed or certified by the Federal Election Commission (FEC). * Data from this year may not be complete ** Data on expenditures is not available for this election cycle Note: Totals above reflect only available data. See also See also 2024 Elections Government Newsletters External links External links Search Google News for this topic Personal Facebook Instagram LinkedIn Personal Facebook Instagram LinkedIn Footnotes Footnotes v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2024 challenger 2024 convention (defeated) Democratic Party Marquee, primary candidate, 2024 New York President of the United States candidate, 2024 U.S. House candidate (Withdrew), 2024 U.S. House candidate, 2024 U.S. House candidates United States of America Ballotpedia features 604,594 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's"
  },
  {
    "candidate": "Endeley, Saint Jermaine*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Saint_Jermaine_Endeley",
    "text": "on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's"
  },
  {
    "candidate": "Endeley, Saint Jermaine*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Saint_Jermaine_Endeley",
    "text": "2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]