[
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hector_Feliciano",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Hector Feliciano Hector Feliciano Hector Feliciano This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Democratic Party June 25, 2024 Education Boricua College, 2018 Campaign website Personal Facebook Hector Feliciano ( Democratic Party ) ran for election to the New York State Assembly to represent District 84 . He lost in the Democratic primary on June 25, 2024 . Feliciano completed Ballotpedia's Candidate Connection survey in 2024. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2024 2.1.1 Campaign finance 2.1.2 Endorsements 2.2 2022 2 Elections 2.1 2024 2.1.1 Campaign finance 2.1.2 Endorsements 2.1 2024 2.1.1 Campaign finance 2.1.1 Campaign finance 2.1.2 Endorsements 2.1.2 Endorsements 2.2 2022 2.2 2022 3 Campaign themes 3.1 2024 3.2 2022 3 Campaign themes 3.1 2024 3.1 2024 3.2 2022 3.2 2022 4 Campaign finance summary 4 Campaign finance summary 5 See also 5 See also 6 External links 6 External links 7 Footnotes 7 Footnotes Biography Biography Hector Feliciano was born in New York, New York . He attended Manhattan Community College and earned a graduate degree from Boricua College in 2018. His career experience includes working as an educator and administrator. [1] Elections Elections 2024 2024 See also: New York State Assembly elections, 2024 General election General election for New York State Assembly District 84 Incumbent Amanda Septimo defeated Rosaline Nieves and Tyreek Goodman in the general election for New York State Assembly District 84 on November 5, 2024. Candidate % Votes ✔ Amanda Septimo (Working Families Party / D) 76.8 20,303 Submit photo Rosaline Nieves (R) 20.1 5,328 Tyreek Goodman (Conservative Party) 2.9 760 Other/Write-in votes 0.2 59 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 26,450 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for New York State Assembly District 84 Incumbent Amanda Septimo defeated Hector Feliciano in the Democratic primary for New York State Assembly District 84 on June 25, 2024. Candidate % Votes ✔ Amanda Septimo 72.1 1,511 Submit photo Hector Feliciano 27.0 565 Other/Write-in votes 0.9 19 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 2,095 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election The Republican primary election was canceled. Rosaline Nieves advanced from the Republican primary for New York State Assembly District 84. Conservative Party primary election The Conservative Party primary election was canceled. Tyreek Goodman advanced from the Conservative Party primary for New York State Assembly District 84. Working Families Party primary election The Working Families Party primary election was canceled. Incumbent Amanda Septimo advanced from the Working Families Party primary for New York State Assembly District 84. Campaign finance Campaign finance Endorsements Endorsements Ballotpedia did not identify endorsements for Feliciano in this election. 2022 2022 See also: New York State Assembly elections, 2022 General election General election for New York State Assembly District 84 Incumbent Amanda Septimo defeated Rosaline Nieves in the general election for New York State Assembly District 84 on November 8, 2022. Candidate % Votes ✔ Amanda Septimo (D / Working Families Party) 83.4 10,188 Submit photo Rosaline Nieves (R) 16.5 2,017 Other/Write-in votes 0.1 10 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total"
  },
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hector_Feliciano",
    "text": "votes: 12,215 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for New York State Assembly District 84 Incumbent Amanda Septimo defeated Alberto Torres and Hector Feliciano in the Democratic primary for New York State Assembly District 84 on June 28, 2022. Candidate % Votes ✔ Amanda Septimo 49.9 1,850 Submit photo Alberto Torres 34.9 1,296 Submit photo Hector Feliciano 14.7 545 Other/Write-in votes 0.5 18 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 3,709 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election The Republican primary election was canceled. Rosaline Nieves advanced from the Republican primary for New York State Assembly District 84. Working Families Party primary election The Working Families Party primary election was canceled. Incumbent Amanda Septimo advanced from the Working Families Party primary for New York State Assembly District 84. Campaign themes Campaign themes 2024 2024 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Hector Feliciano completed Ballotpedia's Candidate Connection survey in 2024. The survey questions appear in bold and are followed by Feliciano's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. 84th Assembly District resident for the past 30 years Boricua College Master program graduate in Human Services. I belive in education and providing resources to the community to lead to overcome poverty, mental health, and substances abuse issues. Providing a quality of live for all our residents. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Elect your neighbor not a stranger to represent you in Albany Come out and vote Together we can make a difference Elect your neighbor not a stranger to represent you in Albany Come out and vote Together we can make a difference What areas of public policy are you personally passionate about? Public health issues Who do you look up to? Whose example would you like to follow, and why? My mother What characteristics or principles are most important for an elected official? Persistence What qualities do you possess that you believe would make you a successful officeholder? Persistence honest What do you believe are the core responsibilities for someone elected to this office? Commitment with the constituents What legacy would you like to leave? Education for everyone What is the first historical event that happened in your lifetime that you remember? How old were you at the time? The lost of my parents in a 30 day time I was 54 years pld What was your very first job? How long did you have it? Dish washer I worked for 2 years What was the last song that got stuck in your head? John Lennon the words of all the people living in peace What is something that has been a struggle in your life? Poverty What do you believe is the ideal relationship between the governor and state legislature? Understanding the issues that effect the people What do you perceive to be your state's greatest challenges over the next decade? The isilum of new people and Crime Do you believe that it’s beneficial for state legislators to have previous experience in government or politics? No Do you believe it’s beneficial to build relationships with other legislators? Please explain your answer. Yes Is there a particular legislator, past or present, whom you want to model yourself after? No Are you interested in running for a different political office (for example, the U.S."
  },
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hector_Feliciano",
    "text": "Congress or governor) in the future? Yes Both sitting legislators and candidates for office hear many personal stories from the residents of their district. Is there a story that you’ve heard that you found particularly touching, memorable, or impactful? One of the resident's of the District told me that she was attacted by another resident that had mental health issues I identified with her on a similar story when I was thrown with a cup of hot oatmeal while I was on my way to work. Should the legislature oversee or grant the use of emergency powers? Yes What is the first bill you would introduce if elected? Mandatory mental health treatment What committees interest you? Education Finanace and Environmen What are your views on financial transparency and government accountability? Commitment and honesty is key to lead a community Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. 2022 2022 Hector Feliciano did not complete Ballotpedia's 2022 Candidate Connection survey. Campaign finance summary Campaign finance summary Note: The finance data shown here comes from the disclosures required of candidates and parties. Depending on the election or state, this may represent only a portion of all the funds spent on their behalf. Satellite spending groups may or may not have expended funds related to the candidate or politician on whose page you are reading this disclaimer. Campaign finance data from elections may be incomplete. For elections to federal offices, complete data can be found at the FEC website . Click here for more on federal campaign finance law and here for more on state campaign finance law. 2024* New York State Assembly District 84 Lost primary $0 $0 2022 New York State Assembly District 84 Lost primary $0 $0 Grand total $0 $0 Sources: OpenSecrets , Federal Elections Commission ***This product uses the openFEC API but is not endorsed or certified by the Federal Election Commission (FEC). Sources: OpenSecrets , Federal Elections Commission ***This product uses the openFEC API but is not endorsed or certified by the Federal Election Commission (FEC). * Data from this year may not be complete See also See also 2024 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York State Assembly District 84 Website Candidate New York State Assembly District 84 Website Personal Facebook Personal Facebook Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 20, 2024 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 20, 2024 Speaker of the House: v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2022 challenger 2022 primary (defeated) 2024 challenger 2024 primary (defeated) Democratic Party New York New York State Assembly candidate, 2022 New York State Assembly candidate, 2024 State House candidate, 2022 State House candidate, 2024 State house candidates Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I"
  },
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hector_Feliciano",
    "text": "request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly"
  },
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Hector_Feliciano",
    "text": "podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Feliciano, Hector*",
    "category": "bio",
    "score": null,
    "link": "https://www.encyclopedia.com/arts/culture-magazines/feliciano-hector",
    "text": "EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily Arts Arts Culture magazines Culture magazines Feliciano, Hector Feliciano, Hector Feliciano, Hector gale views updated FELICIANO, Hector FELICIANO, Hector. American, b. 1952?. Genres: History, Documentaries/Reportage. Career: Editor in chief of the World Media Network (newspaper syndicate), NYC. Worked for the City of Paris Cultural Affairs Bureau, Paris, France; journalist for the Washington Post, Washington, DC, and the Los Angeles Times, Los Angeles , CA; also worked as an investigator of stolen art and a lecturer. Publications: NONFICTION: (with D. Senecal and others) A New York , 1988; Musee disparu, 1995, trans. as The Lost Museum: The Nazi Conspiracy to Steal the World's Greatest Works of Art, 1997. Contributor to periodicals. Address: c/o Basic Books, 10 East 53rd St., New York , NY 10022, U.S.A. Writers Directory 2005 × Cite this article Pick a style below, and copy the text for your bibliography. Cite this article Pick a style below, and copy the text for your bibliography. MLA Chicago APA \" Feliciano, Hector . \" Writers Directory 2005 . . Encyclopedia.com. 6 May. 2025 < https://www.encyclopedia.com > . < > \"Feliciano, Hector .\" Writers Directory 2005 . . Encyclopedia.com. (May 6, 2025). https://www.encyclopedia.com/arts/culture-magazines/feliciano-hector \"Feliciano, Hector .\" Writers Directory 2005 . . Retrieved May 06, 2025 from Encyclopedia.com: https://www.encyclopedia.com/arts/culture-magazines/feliciano-hector Citation styles Encyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA). Within the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list. Because each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites: Modern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/ Notes: Most online reference entries and articles do not have page numbers. Therefore, that information is unavailable for most Encyclopedia.com content. However, the date of retrieval is often important. Refer to each style’s convention regarding the best way to format page numbers and retrieval dates. In addition to the MLA, Chicago, and APA styles, your school, university, publication, or institution may have its own requirements for citations. Therefore, be sure to refer to those guidelines when editing your bibliography or works cited list. More From encyclopedia.com About this article Feliciano, Hector Updated About encyclopedia.com content Print Article You Might Also Like NEARBY TERMS Felician College: Tabular Data Felician College: Narrative Description Felicia's Journey Felicia Felici, Pericle Felice, Cynthia (1942–) Félibien des Avaux, André Felguérez, Manuel (1928–) FELF Feleky, GéZa feldspathoid feldspathic wacke feldspathic greywacke Feldshuh, Tovah Feldsher Feldpfeife Feldpartita Feldmühle Nobel AG Feldmann, Doug 1970- Feldman, Wilhelm Feldman, Stephen M. 1955- Feldman, Shimshon Simon Feldman, Sandra Feldman, Robert S. 1947- (Robert Stephen Feldman) Feldman, Richard 1952- (Richard Jay Feldman) Feliciano, José (1945–) Feliciano, José (1945—) Felicia’s Journey Felicidades Felicissimus and Agapitus, Ss. Felicitas (d. 203) Felicitas of Rome (d. 162?) felicitate felicitous felicity Felin, M. Sindy feline Felinto (Barbosa de Lima), Marilene Felipe Felipe Herrera Lane Felis Felix Blanchard felix culpa Félix Edouard Justin Emile Borel Felix Hausdorff Félix Hubert D'Hérelle Felix I, Pope, St. Felix II, Antipope Felix III (II), Pope, St. Felix IV (III), Pope, St. Subscribe to our newsletter Sign up with your email address to receive news and updates. We respect your privacy. Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved. © 2019 Encyclopedia.com | All rights reserved."
  }
]