[
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://www.lukeflorczak.nyc/",
    "text": "top of page Home About Events Home About About Events Events Discover Issues District 4 Social Media Products Discover Issues Issues District 4 District 4 Social Media Social Media Products Products Veteran Resources Department of Veteran Services Homes for Vets VFW No. 7096 Veteran Resources Department of Veteran Services Department of Veteran Services Homes for Vets Homes for Vets VFW No. 7096 VFW No. 7096 Donate Donate Join Our List! Join Our List! Join Our List! Join Our List! Join Our List! Join Our List! Subscribe Thank you for helping us make a difference! Thank you for helping us make a difference! Thank you for helping us make a difference! Thank you for helping us make a difference! Thank you for helping us make a difference! About Luke About Luke About Luke About Luke About Luke About Luke About Luke About Luke Luke Florczak, a former Marine Musician, studied Music Composition at the University of the Pacific and Political Science at John Jay College of Criminal Justice. He sits on the executive board for the Eleanor Roosevelt Independent Democrats (formerly Eleanor Roosevelt Democratic Club) and volunteered to carry out dozens of various campaign duties for sitting Councilman Keith Powers' most recent race. Luke advocates for the veteran community in New York City by working in the John Jay Office of Military and Veteran Services and supporting veteran organizations such as the New York Central Office for Veterans Affairs and Hope for the Warriors, a national non-profit dedicated to providing comprehensive support for service members, veterans, and their families Luke Florczak, a former Marine Musician, studied Music Composition at the University of the Pacific and Political Science at John Jay College of Criminal Justice. He sits on the executive board for the Eleanor Roosevelt Independent Democrats (formerly Eleanor Roosevelt Democratic Club) and volunteered to carry out dozens of various campaign duties for sitting Councilman Keith Powers' most recent race. Luke advocates for the veteran community in New York City by working in the John Jay Office of Military and Veteran Services and supporting veteran organizations such as the New York Central Office for Veterans Affairs and Hope for the Warriors, a national non-profit dedicated to providing comprehensive support for service members, veterans, and their families Luke Florczak, a former Marine Musician, studied Music Composition at the University of the Pacific and Political Science at John Jay College of Criminal Justice. He sits on the executive board for the Eleanor Roosevelt Independent Democrats (formerly Eleanor Roosevelt Democratic Club) and volunteered to carry out dozens of various campaign duties for sitting Councilman Keith Powers' most recent race. Luke advocates for the veteran community in New York City by working in the John Jay Office of Military and Veteran Services and supporting veteran organizations such as the New York Central Office for Veterans Affairs and Hope for the Warriors, a national non-profit dedicated to providing comprehensive support for service members, veterans, and their families Having served honorably in the United States Marine Corps, Luke knows what it means to represent something bigger than oneself. He hopes to be a voice for the almost quarter million veterans that lack a proper voice in the city council and the thousands of New Yorkers who he's had the privilege to call neighbor for the last several years. The issues faced by veterans living in the city are not theirs alone; homelessness, public safety, better access to health services, and affordable housing options are issues our district shares. By tackling these issues in our community, Luke hopes to also effect change for all veterans in the city. Having served honorably in the United States Marine Corps, Luke knows what it means to represent something bigger than oneself. He hopes to be a voice for the almost quarter million veterans that lack a proper voice in the city council and the thousands of New Yorkers who he's had the privilege to call neighbor for the last several years. The issues faced by veterans living in the city are not theirs alone; homelessness, public safety, better access to health services, and affordable housing options are issues our district shares. By tackling these issues in our community, Luke hopes to also effect change for all veterans in the city. Having served honorably in the United States Marine Corps, Luke knows what it means to represent something bigger than oneself. He hopes to be a voice for the almost quarter million veterans that lack a proper voice in the city council and"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://www.lukeflorczak.nyc/",
    "text": "the thousands of New Yorkers who he's had the privilege to call neighbor for the last several years. The issues faced by veterans living in the city are not theirs alone; homelessness, public safety, better access to health services, and affordable housing options are issues our district shares. By tackling these issues in our community, Luke hopes to also effect change for all veterans in the city. As a musician and author, Luke understands the power that the arts can have in government and sees the arts as fundamental to a thriving community. Luke believes creative ideas to the challenging issues we face today are the way toward robust, long-lasting solutions. As a musician and author, Luke understands the power that the arts can have in government and sees the arts as fundamental to a thriving community. Luke believes creative ideas to the challenging issues we face today are the way toward robust, long-lasting solutions. As a musician and author, Luke understands the power that the arts can have in government and sees the arts as fundamental to a thriving community. Luke believes creative ideas to the challenging issues we face today are the way toward robust, long-lasting solutions. Upcoming Events Upcoming Events Upcoming Events Upcoming Events Email Email Email Email Email lukas@florczak4citycouncil.com lukas@florczak4citycouncil.com lukas@florczak4citycouncil.com lukas@florczak4citycouncil.com Follow Follow Follow Follow Follow Donate Donate Home About Events Home About Events Discover Issues District 4 Social Media Products Discover Issues District 4 Social Media Products Veteran Resources Department of Veteran Services Homes for Vets VFW No. 7096 Veteran Resources Department of Veteran Services Homes for Vets VFW No. 7096 More More Paid for by the Paid for by the Committee to Elect Lukas Florczak Committee to Elect Lukas Florczak Lukas Florczak is a former member of the U.S. Marine Corps. Use of his military rank, job titles, and photographs in uniform does not imply endorsement by the Department of the Navy or the Department of Defense. Lukas Florczak is a former member of the U.S. Marine Corps. Use of his military rank, job titles, and photographs in uniform does not imply endorsement by the Department of the Navy or the Department of Defense. Lukas Florczak is a former member of the U.S. Marine Corps. Use of his military rank, job titles, and photographs in uniform does not imply endorsement by the Department of the Navy or the Department of Defense. bottom of page"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "Contact Us Contact Us 212-886-5867 212-886-5867 info@murrayhillnyc.org info@murrayhillnyc.org Facebook-f Facebook-f Instagram Instagram About About Murray Hill History of Murray Hill Preservation in Murray Hill The Association Officers & Trustees MHNA Comittees Visiting Murray Hill Benefits of Being a MHNA Member About About Murray Hill History of Murray Hill Preservation in Murray Hill The Association About Murray Hill About Murray Hill History of Murray Hill History of Murray Hill Preservation in Murray Hill Preservation in Murray Hill The Association The Association Officers & Trustees MHNA Comittees Visiting Murray Hill Benefits of Being a MHNA Member Officers & Trustees Officers & Trustees MHNA Comittees MHNA Comittees Visiting Murray Hill Visiting Murray Hill Benefits of Being a MHNA Member Benefits of Being a MHNA Member Events Events Catalog Catalog News News Forum Forum Membership Membership Card Merchant Discounts Business Directory Resources Membership Membership Card Membership Card Merchant Discounts Merchant Discounts Business Directory Business Directory Resources Resources Join Join Login Login 0 My Shopping Cart $ Park Avenue Day Adopt a Tree Keep Murray Hill Green & Clean Cultural Medallion Program Custom Amount Authorize.Net - Credit Card First Name * * Last Name No Yes Company Name Email Address * * This is a secure SSL encrypted payment. Card Number * * CVC * * Cardholder Name * * Expiration * * Country * United States Canada United Kingdom Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darrussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo, Democratic People's Republic Congo, Republic of Cook Islands Costa Rica Cote d'Ivoire Croatia/Hrvatska Cuba Cyprus Island Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt Equatorial Guinea El Salvador Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Greece Ghana Gibraltar Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Holy See (City Vatican State) Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Island Poland Portugal Puerto Rico Qatar Reunion Island Romania Russian Federation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and the Grenadines San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovak Republic Slovenia Solomon Islands Somalia South Africa South Georgia South Korea Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Islands Eswatini Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Togo Tokelau Tonga Thailand Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands (British) Virgin Islands (USA) Wallis and Futuna Islands Western Sahara Western Samoa Yemen Yugoslavia Zambia Zimbabwe * Address 1 * * Address 2 City * * State * Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming American Samoa Canal Zone Commonwealth of the Northern Mariana Islands Federated States of Micronesia Guam Marshall Islands Northern Mariana Islands Palau Philippine Islands Puerto Rico Trust Territory of the Pacific Islands Virgin Islands Armed Forces - Americas Armed Forces - Europe, Canada, Middle East, Africa Armed Forces - Pacific State * Zip / Postal Code * * Donation Total: $10,000 Donation Total: $10,000 Newsletters Lukas Florczak (District 4 City Council candidate) – Meet the Candidates 2025! Updated on April 2, 2025 by MHNA No Comments on Lukas Florczak (District 4 City"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "Council candidate) – Meet the Candidates 2025! The Murray Hill Neighborhood Association reached out to all the candidates running for office in 2025 that intersect our neighborhood (Mayor, Manhattan Borough President, City Council District 2, and City Council District 4, etc.) with questions sourced directly from our members via our Ask the Candidates questionnaire . See the candidate’s answers below. How you would improve our streets and quality of life? Using the discretionary fund granted to each city councilor, I would survey the neighborhood associations (Like Murray Hill, Lenox Hill, Carnegie Hill, and Stuytown) along with Community Board 6 and 8 to formulate a comprehensive yearly list of street improvements. Categorized from “In most need of repair” to “Convenient”, I would see to these improvements year on year. I see the uptick in traffic fatalities and injuries as more of a public safety matter than a quality of life issue, but when it comes to e-bikes and how they seem to have taken over sidewalks and streets, I intend to submit policies which address the ability to identify these bikes so that traffic cops may be able to issue traffic violations. At the moment, there is no way for them to do this. My amendment to a bill passed by the City Council last year (written by Keith Powers) looks to add IR reflectors to the batteries of e-bikes which are currently registered with the city. This will present the opportunity to finally identify bikers that break the law, issue fines, and properly regulate violations that occur. There is also a need for many crosswalks in our district to be properly lit at night. By adding street lights that cover an entire crosswalk, not just small portions of them, drivers and bikers will be able to properly see pedestrians. I believe these measures along with pushing NYPD to properly enforce traffic violations, the safety in this district will greatly improve. When it comes to quality of life, I am a huge advocate for an increased importance in local art and supporting local artist. This district includes the Met, Carnegie Hall, the MOMA, the Frick, and Guggenheim (to name just a few of the world class institutes). A representative of such a district should be aware of what all the Arts can do to strengthen community as well as improving our overall neighborhood. The arts bring people together who might otherwise not see eye-to-eye. The arts in school boost an interest in learning and provide incredible outlets to creativity which children and teens might not normally ever have access to. As the future City Councilman, I will champion the arts in our vibrant district and showcase the talent of our budding generations. How are you going to handle the illegal migrant situation that has escalated into NYC? Immigration is an integral facet of our country. The process to becoming a citizen is in desperate need of reform. Of course this reform needs to be addressed at the federal level and it seems likely that the current administration has no intention of streamlining the process. That being said, for those that come into our country and commit crimes, they should be prosecuted to the fullest extent of the law just as any person within our borders might expect. However this also includes the guarantee of Due Process – a feature of a democracy hoping to be a leading example throughout the world. What I will do regarding this issue is implore precincts to change their current policy of catch and release (Which goes for all individuals which find themselves facing serious criminal charges). It’s should be common sense that the NYPD can hold individuals being charged with grand theft or a violent crime or any other serious violation until their court hearing. How can housing become more affordable and not just for low income candidates? City of Yes, in providing additional units around the city will help to lower overall costs of housing. This is simple economics. Effort should also be put on landlords that look to increase yearly rental costs by extreme percentages (I was personally affected by this several years ago when my old landlord looked to raise rent by almost 11%). There must also be efforts done to create new pilot projects and policies with fresh eyes, aimed at investment opportunities for low income and medium income families and individuals. How would you address homelessness and mental illness in NYC? Homelessness and Mental Illness is an issue that hits"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "close to home with me, as many happen to be veterans. As the only veteran running for local office, helping veterans is a high priority for me. One issue I hear regarding homeless shelters has to do with trust. Many living on the streets are aware of shelters but don’t trust those who oversee them. I have listened to many personal accounts of a current loophole being exploited by these facilities where veterans are signed into and admitted to NIH housing only to be thrown out the back door to preserve availability. These facilities receive funding from the federal government based on the number of individuals that sign in each night. This is outrageous and needs to be reformed. There also needs to be a higher emphasis put toward rehabilitation centers rather than static shelters. The actual number of NYC homeless will never truly be known because most don’t live on the street where they can be counted – they live on friend’s couches or their cars. It’s these groups of people that are desperately clinging on and need that little bit of help which a rehabilitation center might provide. In the case of mental illness, our Borough President Mark Levine has touted the reopening of a mental health facility on Randall’s Island. This facility will the be the test bed for if these kinds of facilities can make a come back, provided that they operate with compassion and modern approaches which were lacking in the 1980’s. I believe that by championing these several solutions, there will be improvement over time when it comes to the homeless and mentally ill. How would you support the Murray Hill Neighborhood Association? I believe in a blend of trustee and delegate methods of representation. As with most things, a moderate blend of these two theories, provides the best foundation for someone going into representative politics. The Murray Hill Neighborhood Association is one of these groups across the district that I would be honored to directly represent in the city council. I would be a human megaphone, regarding issues we currently deal with or issues that may arise during the course of the term. As the only candidate in this race living in Murray Hill (I’m a resident of Tudor City), calling for improvements or tackling issues in the neighborhood means improving my literal backyard and making it the best it can be. Of course I will be honored to represent every neighborhood of District 4, it would mean the world to me to be the City Council representative for my local neighborhood association. Bio Luke Florczak, a former Marine Musician, studied Music Composition at the University of the Pacific and Political Science at John Jay College of Criminal Justice. He sits on the executive board for the Eleanor Roosevelt Independent Democrats (formerly Eleanor Roosevelt Democratic Club) and volunteered to carry out dozens of various campaign duties for sitting Councilman Keith Powers’ most recent race. Luke advocates for the veteran community in New York City by working in the John Jay Office of Military and Veteran Services and supporting veteran organizations such as the New York Central Office for Veterans Affairs and Hope for the Warriors, a national non-profit dedicated to providing comprehensive support for service members, veterans, and their families. Having served honorably in the United States Marine Corps, Luke knows what it means to represent something bigger than oneself. He hopes to be a voice for the thousands of New Yorkers who he’s had the privilege to call neighbor for the last several years along with the almost quarter million veterans that have lacked a proper voice in the City Council for the past decade. By tackling the issues in our community like public safety, homelessness, better access to health services, and affordable housing options, Luke hopes to effect change for all New Yorkers. As a musician and author, Luke understands the power that the arts can have in government and sees the arts as fundamental to a thriving community. Luke believes creative ideas to the challenging issues we face today are the way toward robust, long-lasting solutions. https://lukeflorczak.nyc Share: Lukas Florczak (District 4 City Council candidate) – Meet the Candidates 2025! Updated on April 2, 2025 by MHNA by No Comments on Lukas Florczak (District 4 City Council candidate) – Meet the Candidates 2025! on Lukas Florczak (District 4 City Council candidate) – Meet the Candidates 2025! The Murray Hill Neighborhood Association reached out to all the candidates running for office"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "in 2025 that intersect our neighborhood (Mayor, Manhattan Borough President, City Council District 2, and City Council District 4, etc.) with questions sourced directly from our members via our Ask the Candidates questionnaire . See the candidate’s answers below. How you would improve our streets and quality of life? Using the discretionary fund granted to each city councilor, I would survey the neighborhood associations (Like Murray Hill, Lenox Hill, Carnegie Hill, and Stuytown) along with Community Board 6 and 8 to formulate a comprehensive yearly list of street improvements. Categorized from “In most need of repair” to “Convenient”, I would see to these improvements year on year. I see the uptick in traffic fatalities and injuries as more of a public safety matter than a quality of life issue, but when it comes to e-bikes and how they seem to have taken over sidewalks and streets, I intend to submit policies which address the ability to identify these bikes so that traffic cops may be able to issue traffic violations. At the moment, there is no way for them to do this. My amendment to a bill passed by the City Council last year (written by Keith Powers) looks to add IR reflectors to the batteries of e-bikes which are currently registered with the city. This will present the opportunity to finally identify bikers that break the law, issue fines, and properly regulate violations that occur. There is also a need for many crosswalks in our district to be properly lit at night. By adding street lights that cover an entire crosswalk, not just small portions of them, drivers and bikers will be able to properly see pedestrians. I believe these measures along with pushing NYPD to properly enforce traffic violations, the safety in this district will greatly improve. When it comes to quality of life, I am a huge advocate for an increased importance in local art and supporting local artist. This district includes the Met, Carnegie Hall, the MOMA, the Frick, and Guggenheim (to name just a few of the world class institutes). A representative of such a district should be aware of what all the Arts can do to strengthen community as well as improving our overall neighborhood. The arts bring people together who might otherwise not see eye-to-eye. The arts in school boost an interest in learning and provide incredible outlets to creativity which children and teens might not normally ever have access to. As the future City Councilman, I will champion the arts in our vibrant district and showcase the talent of our budding generations. How are you going to handle the illegal migrant situation that has escalated into NYC? Immigration is an integral facet of our country. The process to becoming a citizen is in desperate need of reform. Of course this reform needs to be addressed at the federal level and it seems likely that the current administration has no intention of streamlining the process. That being said, for those that come into our country and commit crimes, they should be prosecuted to the fullest extent of the law just as any person within our borders might expect. However this also includes the guarantee of Due Process – a feature of a democracy hoping to be a leading example throughout the world. What I will do regarding this issue is implore precincts to change their current policy of catch and release (Which goes for all individuals which find themselves facing serious criminal charges). It’s should be common sense that the NYPD can hold individuals being charged with grand theft or a violent crime or any other serious violation until their court hearing. How can housing become more affordable and not just for low income candidates? City of Yes, in providing additional units around the city will help to lower overall costs of housing. This is simple economics. Effort should also be put on landlords that look to increase yearly rental costs by extreme percentages (I was personally affected by this several years ago when my old landlord looked to raise rent by almost 11%). There must also be efforts done to create new pilot projects and policies with fresh eyes, aimed at investment opportunities for low income and medium income families and individuals. How would you address homelessness and mental illness in NYC? Homelessness and Mental Illness is an issue that hits close to home with me, as many happen to be veterans. As the only veteran running for local office, helping veterans"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "is a high priority for me. One issue I hear regarding homeless shelters has to do with trust. Many living on the streets are aware of shelters but don’t trust those who oversee them. I have listened to many personal accounts of a current loophole being exploited by these facilities where veterans are signed into and admitted to NIH housing only to be thrown out the back door to preserve availability. These facilities receive funding from the federal government based on the number of individuals that sign in each night. This is outrageous and needs to be reformed. There also needs to be a higher emphasis put toward rehabilitation centers rather than static shelters. The actual number of NYC homeless will never truly be known because most don’t live on the street where they can be counted – they live on friend’s couches or their cars. It’s these groups of people that are desperately clinging on and need that little bit of help which a rehabilitation center might provide. In the case of mental illness, our Borough President Mark Levine has touted the reopening of a mental health facility on Randall’s Island. This facility will the be the test bed for if these kinds of facilities can make a come back, provided that they operate with compassion and modern approaches which were lacking in the 1980’s. I believe that by championing these several solutions, there will be improvement over time when it comes to the homeless and mentally ill. How would you support the Murray Hill Neighborhood Association? I believe in a blend of trustee and delegate methods of representation. As with most things, a moderate blend of these two theories, provides the best foundation for someone going into representative politics. The Murray Hill Neighborhood Association is one of these groups across the district that I would be honored to directly represent in the city council. I would be a human megaphone, regarding issues we currently deal with or issues that may arise during the course of the term. As the only candidate in this race living in Murray Hill (I’m a resident of Tudor City), calling for improvements or tackling issues in the neighborhood means improving my literal backyard and making it the best it can be. Of course I will be honored to represent every neighborhood of District 4, it would mean the world to me to be the City Council representative for my local neighborhood association. Bio Luke Florczak, a former Marine Musician, studied Music Composition at the University of the Pacific and Political Science at John Jay College of Criminal Justice. He sits on the executive board for the Eleanor Roosevelt Independent Democrats (formerly Eleanor Roosevelt Democratic Club) and volunteered to carry out dozens of various campaign duties for sitting Councilman Keith Powers’ most recent race. Luke advocates for the veteran community in New York City by working in the John Jay Office of Military and Veteran Services and supporting veteran organizations such as the New York Central Office for Veterans Affairs and Hope for the Warriors, a national non-profit dedicated to providing comprehensive support for service members, veterans, and their families. Having served honorably in the United States Marine Corps, Luke knows what it means to represent something bigger than oneself. He hopes to be a voice for the thousands of New Yorkers who he’s had the privilege to call neighbor for the last several years along with the almost quarter million veterans that have lacked a proper voice in the City Council for the past decade. By tackling the issues in our community like public safety, homelessness, better access to health services, and affordable housing options, Luke hopes to effect change for all New Yorkers. As a musician and author, Luke understands the power that the arts can have in government and sees the arts as fundamental to a thriving community. Luke believes creative ideas to the challenging issues we face today are the way toward robust, long-lasting solutions. https://lukeflorczak.nyc Share: Post navigation Previous Post Previous post: Virginia Maloney (District 4 City Council candidate) – Meet the Candidates 2025! Next Post Next post: Faith Bondy (District 4 City Council candidate) – Meet the Candidates 2025! Leave A Comment Cancel Reply Leave A Comment Your Comment All comments are held for moderation. Save my name, email, and website in this browser for the next time I comment. Related Posts 0 Newsletters Park Avenue Day 2025 Will Celebrate Community & Culture on Saturday, May 17th! May"
  },
  {
    "candidate": "Florczak, Lukas",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/lukas-florczak-district-4-city-council-candidate-ask-the-candidates-2025/",
    "text": "12, 2025 by MHNA Park Avenue Day 2025 Will Celebrate Community & Culture on Saturday, May 17th! May 12, 2025 by MHNA by 0 Newsletters Michel Bassompierre’s Monumental Sculptures Debut Ahead of Park Avenue Day 2025 May 12, 2025 by MHNA Michel Bassompierre’s Monumental Sculptures Debut Ahead of Park Avenue Day 2025 May 12, 2025 by MHNA by 0 Newsletters Park Avenue Day 2025 Silent Auction Donations May 12, 2025 by MHNA Park Avenue Day 2025 Silent Auction Donations May 12, 2025 by MHNA by MHNA The Murray Hill Neighborhood Association is dedicated to preserving, beautifying and improving Manhattan’s historic Murray Hill neighborhood. © The Murray Hill Neighborhood Association | Website by Escope © © Website by Escope CONTACT US The Murray Hill Neighborhood Association, P.O. Box 1897 New York, NY 10156-1897 U.S.A. The Murray Hill Neighborhood Association, P.O. Box 1897 New York, NY 10156-1897 U.S.A. Email: info@murrayhillnyc.org Email: info@murrayhillnyc.org QUICK LINKS Privacy Policy Privacy Policy Contact Us Contact Us Social links Facebook Facebook Instagram Instagram Linkedin Linkedin Report There was a problem reporting this post. Harassment Harassment or bullying behavior Inappropriate Contains mature or sensitive content Misinformation Contains misleading or false information Offensive Contains abusive or derogatory content Suspicious Contains spam, fake content or potential malware Other Report note Block Member? Please confirm you want to block this member. You will no longer be able to: See blocked member's posts Mention this member in posts Message this member Add this member as a connection Please note: This action will also remove this member from your connections and send a report to the site admin. Please allow a few minutes for this process to complete. Report"
  }
]