[
  {
    "candidate": "Foley, Joseph",
    "category": "bio",
    "score": null,
    "link": "http://www.joefoleytrumpet.com/bio",
    "text": "Cart 0 Cart 0 Gallery Back Cart 0 Cart 0 Gallery On the job Friends and Colleagues Family, Memories, and Laughs On the job Friends and Colleagues Family, Memories, and Laughs “ ” “ ” Joseph Damian Foley , a native of Concord, New Hampshire, enjoys a varied career as a much sought after performer, conductor, and educator. His performances have taken him to more than a dozen countries on four continents with some of the world’s greatest ensembles. As an orchestral musician, Foley is principal trumpet of the Rhode Island Philharmonic, the Portland Symphony Orchestra, and the River Oaks Chamber Orchestra (ROCO) of Houston, TX. Recently he was engaged as Guest Principal Trumpet with the Pacific Symphony on their international tour to China, performing Mussorgsky’s Pictures at an Exhibition. He has also performed and toured with such prestigious ensembles as the Boston Symphony, the Boston Pops, the Metropolitan Opera, the Royal Ballet of London, and the New York Philharmonic. He is a former founding member of the Atlantic Brass Quintet, which garnered grand prizes at six international chamber music competitions during his tenure, including the International Brass Quintet Competition in Narbonne, France. In addition he has performed with the Boston Symphony Brass Quintet, the Empire Brass, Burning River Brass, the Metropolitan Opera Brass, ALEA III, and at the Santa Fe, Buzzard’s Bay, and Newport Chamber Music Festivals. An active soloist, he has performed with the Boston Pops Orchestra, the Boston Classical Orchestra, the Boston Landmarks Orchestra, the Rhode Island Philharmonic, the River Oaks Chamber Orchestra, the Pro Arte Chamber orchestra, and at Carnegie’s Weill Recital Hall. Foley was soloist in the world premiere of the Trumpet Concerto by Harold Shapero, and recently gave the first live performance of Nan Schwartz’s beautiful Angels Among Us. His first CD, “Nightsongs”, was met with critical acclaim. Mr. Foley is Professor of Music at Rhode Island College and on the Trumpet Faculty of The Boston Conservatory at Berklee. Along with colleagues from the Boston Symphony and Metropolitan Opera, they formed the New England Virtual Trumpet Seminar (NEVTS) to reach students around the world in an online format. In addition to his performing and teaching duties, he is an active conductor and Music Director of the Rhode Island College Wind Ensemble and Concert Jazz Band. Foley attended Boston University as a Trustee Scholar (full four year academic scholarship), where he studied trumpet with Roger Voisin, Rolf Smedvig, and Peter Chapman, and composition with Samuel Headrick. He received both his Bachelor of Music and Master of Music degrees there, and was twice given the award for \"Outstanding Brass Player.\" He also studied with James Pandolfi, Vince Penzerella, Julio Tancredi, and Arnold Jacobs. A clinician for Conn-Selmer/Vincent Bach Corporation, he has given clinics and master classes around the world. “ ”"
  },
  {
    "candidate": "Foley, Joseph",
    "category": "bio",
    "score": null,
    "link": "http://www.joefoleytrumpet.com/contact-1",
    "text": "Cart 0 Cart 0 Gallery Back Cart 0 Cart 0 Gallery On the job Friends and Colleagues Family, Memories, and Laughs On the job Friends and Colleagues Family, Memories, and Laughs Contact Joe"
  }
]