[
  {
    "candidate": "Fossella, Griffin",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/griffin-fossella-son-of-staten-island-borough-president-announces-run-for-city-council-seat.html",
    "text": "Set weather Set weather Back To Main Menu Close Current - Mostly Sunny Tonight Low - Mostly Sunny Tomorrow High - Mostly Sunny View full weather report Politics Griffin Fossella, son of Staten Island borough president, announces run for City Council seat Updated: Feb. 08, 2025, 4:55 p.m. | Published: Feb. 08, 2025, 4:21 p.m. | Griffin Fossella has announced a bid for the South Shore City Council seat. He made the announcement at La Fontana in Oakwood on Feb. 8, 2025. (Staten Island Advance/Annalise Knudson) Annalise Knudson By Annalise Knudson | aknudson@siadvance.com STATEN ISLAND, N.Y. — Griffin Fossella, who comes from a storied Staten Island family known for its service to the borough, is ready to make a name for himself. Fossella, 27, was surrounded by dozens of family, friends and supporters at La Fontana in Oakwood on Saturday afternoon as he announced he was running for the 51st Council District seat vacated by former Councilmember Joseph Borelli . Fossella is the son of current Borough President Vito Fossella, who also served as the South Shore councilman from 1994 to 1997. A 2015 graduate of Monsignor Farrell High School in Oakwood, Fossella has worked in financial services in the private sector. He cited a “unique opportunity” that led him to announce his bid for City Council, and his love for Staten Island. “Many of you are probably wondering why on earth I’m doing this,” Fossella said, who was born and raised in Great Kills. “I can tell you in one sentence: I love Staten Island. Given the opportunity to serve as your councilman, I promise to fight day and night for you, and I know that it is a privilege and massive responsibility to be an elective representative.” Griffin Fossella is joined by dozens of family, friends, and supporters as he announces his run for the South Shore City Council seat. (Staten Island Advance/Annalise Knudson) Annalise Knudson Fossella explained he had a “front-row view” of his father working for the people of Staten Island. “I know full well that it is not a 9 to 5 job, it’s 24/7,” said the younger Fossella. “During the campaign, I look forward to talking with anyone about any issue that matters to them or their families. If you elect me as your councilman, I will work around the clock for all of my constituents, regardless of your political ideology.” Fossella said he felt safe growing up on Staten Island, but but wonders what childhood would be like for kids growing up on the borough today; he cited the prevalence of drug use and violence in other boroughs. “It’s no secret that a lot of bad stuff is happening not too far from us, and if we don’t hold government accountable, before we know it, the problems of the other boroughs will become our own,” he said. His father Vito Fossella told the Advance/SILive.com he was filled with immense pride, and added his son’s heart is “in the right place.” “I think at the core of it is — he said it in one sentence — we love Staten Island. We want to do what’s best for the people of Staten Island, fight on their behalf, fight against people who want to hurt Staten Island,” said the borough president. The borough president won the special election to the New York City Council in April 1994 to represent the South Shore. He was then reelected in November the same year, and served until 1997. Vito Fossella was elected as congressman in 1997, representing Staten Island and South Brooklyn for 11 years. He has served as Staten Island’s borough president since 2022. Lou Tobacco, president and CEO of Monsignor Farrell High School, said he has known Griffin “his entire life,” and was looking forward to Griffin’s path into politics. “Today, we celebrate the next generation of leadership, a new voice with fresh ideas, but with the same deep love for Staten Island that has always been at the heart of our community,” said Tobacco. Lou Tobacco, CEO and president of Monsignor Farrell High School, introduced Griffin Fossella to a crowd at La Fontana in Oakwood on Feb. 8, 2025. (Staten Island Advance/Annalise Knudson) Annalise Knudson Borelli’s resignation kick-started a special election to fill the seat. A mayoral proclamation declared April 29 as the date for the 51st Council District’s special election. Typically, special elections take place the first Tuesday about 80 days after an office holder’s resignation, and are held on a non-partisan basis. That"
  },
  {
    "candidate": "Fossella, Griffin",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/griffin-fossella-son-of-staten-island-borough-president-announces-run-for-city-council-seat.html",
    "text": "means candidates will appear without party lines and there will be no primary contests ahead of the special election. Griffin Fossella is the latest candidate to run for the seat. So far, three candidates have said that they’ll be running in the special election: Frank Morano , Clifford Hagen and Jeffrey Horowitz. “The community response to my announcement has been outstanding, and I’m proud of the groundswell of support we’ve received from nearly every elected official in the borough,” Morano told the Advance/SILive.com. “I welcome everyone in the race and look forward to working with grassroots voters, community leaders, and the Staten Island Republican and Conservative Parties to deliver a big win this April. I have a long record of service on the community board, with non-profits in the borough, and in efforts to change New York for the better. I’m proud of my resume, and that’s what I’ll be talking about in this campaign.” Hagen said: “That’s what’s terrific about this Special Election: Anyone with community support is welcome to campaign for the vacated seat. I’m sure Griffin is a fine, young man.” Horowitz told the Advance/SILive.com he believes “everybody has the right to run.” “I believe whoever can win will serve Staten Island great,” said Horowitz. “Whoever wins in April will hopefully win the primary in June, but whoever wins, I do hope they serve the best ... We live in a democracy where anybody can run and I’m very thankful for that.” Voters on the South Shore will likely be familiar with special elections, as their two most recent representatives in the City Council took office that way. Borelli succeeded his predecessor — Vincent Ignizio, current deputy executive director for the New York City Board of Elections — after he left for a job at Catholic Charities of Staten Island in 2015. Ignizio took office in 2007 after his City Council predecessor, current State Sen. Andrew Lanza, left for the state Legislature. If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. Griffin Fossella has announced a bid for the South Shore City Council seat. He made the announcement at La Fontana in Oakwood on Feb. 8, 2025. (Staten Island Advance/Annalise Knudson) Annalise Knudson Annalise Knudson By Annalise Knudson | aknudson@siadvance.com STATEN ISLAND, N.Y. — Griffin Fossella, who comes from a storied Staten Island family known for its service to the borough, is ready to make a name for himself. Fossella, 27, was surrounded by dozens of family, friends and supporters at La Fontana in Oakwood on Saturday afternoon as he announced he was running for the 51st Council District seat vacated by former Councilmember Joseph Borelli . Fossella is the son of current Borough President Vito Fossella, who also served as the South Shore councilman from 1994 to 1997. A 2015 graduate of Monsignor Farrell High School in Oakwood, Fossella has worked in financial services in the private sector. He cited a “unique opportunity” that led him to announce his bid for City Council, and his love for Staten Island. “Many of you are probably wondering why on earth I’m doing this,” Fossella said, who was born and raised in Great Kills. “I can tell you in one sentence: I love Staten Island. Given the opportunity to serve as your councilman, I promise to fight day and night for you, and I know that it is a privilege and massive responsibility to be an elective representative.” Griffin Fossella is joined by dozens of family, friends, and supporters as he announces his run for the South Shore City Council seat. (Staten Island Advance/Annalise Knudson) Annalise Knudson Annalise Knudson Fossella explained he had a “front-row view” of his father working for the people of Staten Island. “I know full well that it is not a 9 to 5 job, it’s 24/7,” said the younger Fossella. “During the campaign, I look forward to talking with anyone about any issue that matters to them or their families. If you elect me as your councilman, I will work around the clock for all of my constituents, regardless of your political ideology.” Fossella said he felt safe growing up on Staten Island, but but wonders what childhood would be like for kids"
  },
  {
    "candidate": "Fossella, Griffin",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/griffin-fossella-son-of-staten-island-borough-president-announces-run-for-city-council-seat.html",
    "text": "growing up on the borough today; he cited the prevalence of drug use and violence in other boroughs. “It’s no secret that a lot of bad stuff is happening not too far from us, and if we don’t hold government accountable, before we know it, the problems of the other boroughs will become our own,” he said. His father Vito Fossella told the Advance/SILive.com he was filled with immense pride, and added his son’s heart is “in the right place.” “I think at the core of it is — he said it in one sentence — we love Staten Island. We want to do what’s best for the people of Staten Island, fight on their behalf, fight against people who want to hurt Staten Island,” said the borough president. The borough president won the special election to the New York City Council in April 1994 to represent the South Shore. He was then reelected in November the same year, and served until 1997. Vito Fossella was elected as congressman in 1997, representing Staten Island and South Brooklyn for 11 years. He has served as Staten Island’s borough president since 2022. Lou Tobacco, president and CEO of Monsignor Farrell High School, said he has known Griffin “his entire life,” and was looking forward to Griffin’s path into politics. “Today, we celebrate the next generation of leadership, a new voice with fresh ideas, but with the same deep love for Staten Island that has always been at the heart of our community,” said Tobacco. Lou Tobacco, CEO and president of Monsignor Farrell High School, introduced Griffin Fossella to a crowd at La Fontana in Oakwood on Feb. 8, 2025. (Staten Island Advance/Annalise Knudson) Annalise Knudson Annalise Knudson Borelli’s resignation kick-started a special election to fill the seat. A mayoral proclamation declared April 29 as the date for the 51st Council District’s special election. Typically, special elections take place the first Tuesday about 80 days after an office holder’s resignation, and are held on a non-partisan basis. That means candidates will appear without party lines and there will be no primary contests ahead of the special election. Griffin Fossella is the latest candidate to run for the seat. So far, three candidates have said that they’ll be running in the special election: Frank Morano , Clifford Hagen and Jeffrey Horowitz. “The community response to my announcement has been outstanding, and I’m proud of the groundswell of support we’ve received from nearly every elected official in the borough,” Morano told the Advance/SILive.com. “I welcome everyone in the race and look forward to working with grassroots voters, community leaders, and the Staten Island Republican and Conservative Parties to deliver a big win this April. I have a long record of service on the community board, with non-profits in the borough, and in efforts to change New York for the better. I’m proud of my resume, and that’s what I’ll be talking about in this campaign.” Hagen said: “That’s what’s terrific about this Special Election: Anyone with community support is welcome to campaign for the vacated seat. I’m sure Griffin is a fine, young man.” Horowitz told the Advance/SILive.com he believes “everybody has the right to run.” “I believe whoever can win will serve Staten Island great,” said Horowitz. “Whoever wins in April will hopefully win the primary in June, but whoever wins, I do hope they serve the best ... We live in a democracy where anybody can run and I’m very thankful for that.” Voters on the South Shore will likely be familiar with special elections, as their two most recent representatives in the City Council took office that way. Borelli succeeded his predecessor — Vincent Ignizio, current deputy executive director for the New York City Board of Elections — after he left for a job at Catholic Charities of Staten Island in 2015. Ignizio took office in 2007 after his City Council predecessor, current State Sen. Andrew Lanza, left for the state Legislature. If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media"
  },
  {
    "candidate": "Fossella, Griffin",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/griffin-fossella-son-of-staten-island-borough-president-announces-run-for-city-council-seat.html",
    "text": "and other third-party partners in accordance with our Privacy Policy. Footer Navigation Community Rules Contact Us Advertise with us About SILive.com Accessibility Statement SILive.com Staten Island Advance Newsletters Manage Your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Reprints View E-Edition Entertainment High School Sports Business Sports Betting News Opinion Rentals Autos Classifieds Obituaries Jobs Real Estate Mobile apps Videos Weather News Post a job Archives Local Life Special Sections Post a classified ad Sell/rent your home Search Sell your car Sponsor Content Facebook Twitter YouTube Instagram RSS Your Privacy Choices Privacy Policy | User Agreement | | Ad Choices | Disclaimer Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement , (updated 8/1/2024) and acknowledgement of our Privacy Policy , and Your Privacy Choices and Rights (updated 1/1/2025). © 2025 Advance Local Media LLC. All rights reserved ( About Us ). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rules apply to all content you upload or otherwise submit to this site. YouTube's privacy policy is available here and YouTube's terms of service is available here . Ad Choices"
  }
]