[
  {
    "candidate": "Frias, Ramses",
    "category": "bio",
    "score": null,
    "link": "https://www.ramsesfornyc.com/",
    "text": "top of page HOME HOME DONATE DONATE VOLUNTEER VOLUNTEER HOST A FUNDRAISER HOST A FUNDRAISER DONATE DONATE REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NYC CITY COUNCIL DISTRICT 25 Ramses' Vision for District 25 Ramses' Vision for District 25 Ramses' Vision for District 25 Ramses' Vision for District 25 Ramses' Vision for District 25 Restore quality of life for residents and businesses. Restore quality of life for residents and businesses. Restore quality of life for residents and businesses. Restore Educate the community for growth and understanding. Educate the community for growth and understanding. Educate the community for growth and understanding. Educate Build a safer, better future for all. Build a safer, better future for all. Build a safer, better future for all. Build Unite communities for shared success. Unite communities for shared success. Unite communities for shared success. Instill pride, glory, and respect in the community. Instill pride, glory, and respect in the community. Instill pride, glory, and respect in the community. Lift the voice of the people to ensure their needs are heard. Lift the voice of the people to ensure their needs are heard. Lift the voice of the people to ensure their needs are heard. Drive small business engagement with community to boost economic growth. Drive small business engagement with community to boost economic growth. Drive small business engagement with community to boost economic growth. GET INVOLVED TODAY GET INVOLVED TODAY ENDORSED BY CURTIS SLIWA ENDORSED BY CURTIS SLIWA ENDORSED BY CURTIS SLIWA ENDORSED BY CURTIS SLIWA ENDORSED BY CURTIS SLIWA ENDORSED BY CURTIS SLIWA Follow Ramses on social media: Follow Ramses on social media: Follow Ramses on social media: Follow Ramses on social media: Follow Ramses on social media: Paid for by Ramses Frias for New York Paid for by Ramses Frias for New York Paid for by Ramses Frias for New York Paid for by Ramses Frias for New York bottom of page"
  }
]