[
  {
    "candidate": "Gates, Sabrina",
    "category": "bio",
    "score": null,
    "link": "https://www.gatescambridge.org/biography/18626/",
    "text": "Programme The scholarship The experience The University The scholarship The experience The University Apply Eligibility Criteria Timeline How to apply How we select Eligibility Criteria Timeline How to apply How we select Our Scholars Directory News Films Magazines Directory News Films Magazines About The Trust People Contact The Trust People Contact 25th Anniversary Gates Cambridge 25th anniversary overview The Impact Prize 2025 Gates Cambridge 25th anniversary overview The Impact Prize 2025 Members Current Scholars Alumni Current Scholars Alumni Search Search Biography Home Biography Print Share Sabrina Hu Scholar United States 2023 PhD Chemistry Queens' College Growing up in Houston, Texas, I experienced and saw firsthand the destructive impacts of climate change as hurricanes increased in both frequency and severity over only the last decade. While attending Washington University in St. Louis, I found myself drawn to chemistry not only because of its unique way of understanding our world, but also because of its unmatched ability to drive technological innovation, better the lives of others, and protect our natural environment. During my PhD in Chemistry, I will focus on synthesizing and applying a particular class of supramolecular cages. These complex architectures can utilize host-guest chemistry in a variety of applications related to climate change mitigation and adaptation, from providing a greener way to perform industrial chemical separations to solar-driven desalination. Additionally, I hope to use my scientific background to contribute to climate policy in the ongoing effort to address the complicated, interdisciplinary issue of climate change and its effects. I am honored to join the Gates Cambridge community, comprised of people who are all dedicating their studies to improving the world for both our generation and those that come after us. Previous Education Washington University Chemistry 2023 Sabrina Hu Scholar United States 2023 PhD Chemistry Queens' College Growing up in Houston, Texas, I experienced and saw firsthand the destructive impacts of climate change as hurricanes increased in both frequency and severity over only the last decade. While attending Washington University in St. Louis, I found myself drawn to chemistry not only because of its unique way of understanding our world, but also because of its unmatched ability to drive technological innovation, better the lives of others, and protect our natural environment. During my PhD in Chemistry, I will focus on synthesizing and applying a particular class of supramolecular cages. These complex architectures can utilize host-guest chemistry in a variety of applications related to climate change mitigation and adaptation, from providing a greener way to perform industrial chemical separations to solar-driven desalination. Additionally, I hope to use my scientific background to contribute to climate policy in the ongoing effort to address the complicated, interdisciplinary issue of climate change and its effects. I am honored to join the Gates Cambridge community, comprised of people who are all dedicating their studies to improving the world for both our generation and those that come after us. Previous Education Washington University Chemistry 2023 Programme The scholarship The experience The University Apply Eligibility Criteria Timeline How to apply How we select Our Scholars Yearbooks Directory News Films Magazines About The Trust People Contact © 2025 Gates Cambridge Trust Privacy and cookies Data Protection Modern Slavery Statement Disclaimer Web Design by Chameleon Studios Programme The scholarship The experience The University The scholarship The experience The University Apply Eligibility Criteria Timeline How to apply How we select Eligibility Criteria Timeline How to apply How we select Our Scholars Directory News Films Magazines Directory News Films Magazines About The Trust People Contact The Trust People Contact 25th Anniversary Gates Cambridge 25th anniversary overview The Impact Prize 2025 Gates Cambridge 25th anniversary overview The Impact Prize 2025 Members Current Scholars Alumni Current Scholars Alumni"
  }
]