[
  {
    "candidate": "Gennaro, James F",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/james-gennaro/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 24 James F. Gennaro Rego Park, Forest Hills, Kew Gardens Hills, Pomonok-Electchester-Hillcrest, Fresh Meadows-Utopia, Jamaica Estates-Holliswood, Jamaica Hills-Briarwood, Mount Hebron & Cedar Grove Cemeteries, Jamaica, Flushing Meadows-Corona Park Biography James “Jim” F. Gennaro is a Democratic member of the New York City Council, where he represents the 24th Council District and chairs the Council’s Committee on Environmental Protection, Resiliency & Waterfronts. Gennaro served his first terms from 2002 to 2013. Although most closely associated with nationally-acclaimed environmental lawmaking, Gennaro authored more than 50 laws covering many issues, including increasing protections for women against domestic violence, protecting consumers from unscrupulous bankruptcy counselors, and in 2013, he authored and passed a law that raises the age of sale of tobacco products and e-cigarettes to 21, known as the “Tobacco 21” law, the first-in-the-nation law of its kind. In 2020, Tobacco 21 was adopted as national policy. A recent issue of the New England Journal of Medicine states that the Tobacco 21 movement has saved “countless lives” across the United States. Since his return to the City Council in 2021, Gennaro has continued to be the guiding hand of environmental policy in New York City. The main focus of his work has been on holding the city accountable to its stated emissions goals and pushing for greater storm resiliency in the face of more frequent superstorms. He has also been one of the strongest voices on the council calling on the state to institute a dangerousness standard for the courts in order to stem the rising tide of crimes the city is facing. Biography James “Jim” F. Gennaro is a Democratic member of the New York City Council, where he represents the 24th Council District and chairs the Council’s Committee on Environmental Protection, Resiliency & Waterfronts. Gennaro served his first terms from 2002 to 2013. Although most closely associated with nationally-acclaimed environmental lawmaking, Gennaro authored more than 50 laws covering many issues, including increasing protections for women against domestic violence, protecting consumers from unscrupulous bankruptcy counselors, and in 2013, he authored and passed a law that raises the age of sale of tobacco products and e-cigarettes to 21, known as the “Tobacco 21” law, the first-in-the-nation law of its kind. In 2020, Tobacco 21 was adopted as national policy. A recent issue of the New England Journal of Medicine states that the Tobacco 21 movement has saved “countless lives” across the United States. Since his return to the City Council in 2021, Gennaro has continued to be the guiding hand of environmental policy in New York City. The main focus of his work has been on holding the city accountable to its stated emissions goals and pushing for greater storm resiliency in the face of more frequent superstorms. He has also been one of the strongest voices on the council calling on the state to institute a dangerousness standard for the courts in order to stem the rising tide of crimes the city is facing. Biography News Staff Directory District Office 83-15 Parsons Boulevard Jamaica, NY 11432 718-217-4969 phone Legislative Office 250 Broadway Suite 1773 New York, NY 10007 212-788-6956 phone Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Gennaro, James F",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/james-gennaro/news/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 24 James F. Gennaro Rego Park, Forest Hills, Kew Gardens Hills, Pomonok-Electchester-Hillcrest, Fresh Meadows-Utopia, Jamaica Estates-Holliswood, Jamaica Hills-Briarwood, Mount Hebron & Cedar Grove Cemeteries, Jamaica, Flushing Meadows-Corona Park Council Member Gennaro, Local Electeds & Community Leaders Host Sold-Out Diwali at Queens College December 7, 2021 The Annual Tradition Took Place this Saturday, November 13, at Queens College’s LeFrak Concert Hall (November 15, 2021– Flushing, New York) … READ MORE – On Saturday, November 13, New York City Council Member James F. Gennaro and District Leader Neeta Jain were joined by a number of elected officials and local leaders for the New York City Council’s Diwali Festival – a celebration of the festival of lights. Council Member Gennaro, Local Electeds & Community Leaders Host Sold-Out Diwali at Queens College December 7, 2021 The Annual Tradition Took Place this Saturday, November 13, at Queens College’s LeFrak Concert Hall (November 15, 2021– Flushing, New York) … READ MORE – On Saturday, November 13, New York City Council Member James F. Gennaro and District Leader Neeta Jain were joined by a number of elected officials and local leaders for the New York City Council’s Diwali Festival – a celebration of the festival of lights. Biography News Staff Directory District Office 83-15 Parsons Boulevard Jamaica, NY 11432 718-217-4969 phone Legislative Office 250 Broadway Suite 1773 New York, NY 10007 212-788-6956 phone Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]