[
  {
    "candidate": "Gibbs, Edward*",
    "category": "bio",
    "score": null,
    "link": "https://nyassembly.gov/mem/Edward-Gibbs/bio/",
    "text": "Assemblymember Edward Gibbs Assembly District 68 Home About Welcome Letter Biography District Map Welcome Letter Biography District Map Newsroom Press Releases Publications News Articles Press Releases Publications News Articles Media Photos Video Photos Video Legislation Committee Membership Contact Important Links Assembly Home Contact Join email list Map & Offices Biography Assemblymember Edward “Eddie” Gibbs represents New York’s 68th district, which encompasses East Harlem and Randall’s Island as well as parts of the Upper East Side and Central Harlem. At heart, Eddie is a community organizer who was shaped by his upbringing in East Harlem where he grew up with limited financial resources and tough prospects for the future. Even before he held an official title, he dedicated his life to serving and supporting his neighbors. As the first formerly incarcerated person to serve in the New York State Legislature, and only the second to serve in any U.S. state legislature, Eddie brings a critical perspective to Albany. At only 17 years old, Eddie turned himself in after committing a crime. He served time in prison and then returned to the community where he was dedicated to creating positive change. He credits his incarceration with turning his life around and is motivated as an elected official to make sure that everyone has chances in life right from the start, free from violence and poverty. As a community leader for over two decades, Eddie has held annual coat drives for seniors and people experiencing homelessness, Thanksgiving dinners, Christmas toy giveaways, back-to-school supply drives for underprivileged kids and numerous other events. At the height of the COVID-19 pandemic, Eddie cared for vulnerable seniors and distributed food, water and PPE. He often sat with elderly people in the community to help them find vaccine appointments, sometimes walking neighbors to their appointments. His leadership has also extended past New York; Eddie responded to the Flint, Mich., water crisis by bringing three vehicles filled with water to the city. In his role as an activist, Eddie has also protested police brutality, took part in the Occupy Wall Street movement and was arrested with 11 other members of the National Action Network for protesting one of President Trump’s Supreme Court nominations. Eddie received his Associate Degree in business administration from Cayuga Community College. Assemblymember Edward “Eddie” Gibbs represents New York’s 68th district, which encompasses East Harlem and Randall’s Island as well as parts of the Upper East Side and Central Harlem. At heart, Eddie is a community organizer who was shaped by his upbringing in East Harlem where he grew up with limited financial resources and tough prospects for the future. Even before he held an official title, he dedicated his life to serving and supporting his neighbors. As the first formerly incarcerated person to serve in the New York State Legislature, and only the second to serve in any U.S. state legislature, Eddie brings a critical perspective to Albany. At only 17 years old, Eddie turned himself in after committing a crime. He served time in prison and then returned to the community where he was dedicated to creating positive change. He credits his incarceration with turning his life around and is motivated as an elected official to make sure that everyone has chances in life right from the start, free from violence and poverty. As a community leader for over two decades, Eddie has held annual coat drives for seniors and people experiencing homelessness, Thanksgiving dinners, Christmas toy giveaways, back-to-school supply drives for underprivileged kids and numerous other events. At the height of the COVID-19 pandemic, Eddie cared for vulnerable seniors and distributed food, water and PPE. He often sat with elderly people in the community to help them find vaccine appointments, sometimes walking neighbors to their appointments. His leadership has also extended past New York; Eddie responded to the Flint, Mich., water crisis by bringing three vehicles filled with water to the city. In his role as an activist, Eddie has also protested police brutality, took part in the Occupy Wall Street movement and was arrested with 11 other members of the National Action Network for protesting one of President Trump’s Supreme Court nominations. Eddie received his Associate Degree in business administration from Cayuga Community College. Assemblymember Edward “Eddie” Gibbs represents New York’s 68th district, which encompasses East Harlem and Randall’s Island as well as parts of the Upper East Side and Central Harlem. At heart, Eddie is a community organizer who was shaped by his upbringing in East Harlem where he grew up"
  },
  {
    "candidate": "Gibbs, Edward*",
    "category": "bio",
    "score": null,
    "link": "https://nyassembly.gov/mem/Edward-Gibbs/bio/",
    "text": "with limited financial resources and tough prospects for the future. Even before he held an official title, he dedicated his life to serving and supporting his neighbors. As the first formerly incarcerated person to serve in the New York State Legislature, and only the second to serve in any U.S. state legislature, Eddie brings a critical perspective to Albany. At only 17 years old, Eddie turned himself in after committing a crime. He served time in prison and then returned to the community where he was dedicated to creating positive change. He credits his incarceration with turning his life around and is motivated as an elected official to make sure that everyone has chances in life right from the start, free from violence and poverty. As a community leader for over two decades, Eddie has held annual coat drives for seniors and people experiencing homelessness, Thanksgiving dinners, Christmas toy giveaways, back-to-school supply drives for underprivileged kids and numerous other events. At the height of the COVID-19 pandemic, Eddie cared for vulnerable seniors and distributed food, water and PPE. He often sat with elderly people in the community to help them find vaccine appointments, sometimes walking neighbors to their appointments. His leadership has also extended past New York; Eddie responded to the Flint, Mich., water crisis by bringing three vehicles filled with water to the city. In his role as an activist, Eddie has also protested police brutality, took part in the Occupy Wall Street movement and was arrested with 11 other members of the National Action Network for protesting one of President Trump’s Supreme Court nominations. Eddie received his Associate Degree in business administration from Cayuga Community College."
  },
  {
    "candidate": "Gibbs, Edward*",
    "category": "bio",
    "score": null,
    "link": "https://www.sothebys.com/en/about/team/edward-gibbs",
    "text": "Islamic Art Modern & Contemporary Middle East Indian & Himalayan Art Edward Gibbs Chairman | Middle East and India Biography Edward Gibbs joined Sotheby’s in 2003. He advises private, corporate and institutional collectors across Europe, North America, North Africa, The Middle East, South Asia and throughout the Muslim world. He oversees three major auction categories: Arts of the Islamic World, Art of Imperial India and Contemporary Arab, Iranian and Turkish Art. Mr Gibbs’ career exemplifies his passion for Islamic Art, which began in 1988 with a visit to al-Andalus and the Great Mosque of Cordova. Prior to joining Sotheby's, he served for seven years as lecturer in Islamic Art at the School of Oriental and African Studies (SOAS) at the University of London, where he set up the innovative Foundation Course in Asian Art with Sotheby’s Institute of Art. In 1997, he was invited by the British Council to co-curate the exhibition Traditions of Respect: Britain and Islamic Cultures to mark the 50th anniversary of the independence of India and Pakistan. The exhibition was opened by Her Majesty Queen Elizabeth II in Lahore and New Delhi. Mr Gibbs worked for two years with The Abu Dhabi Islands Archaeological Survey (ADIAS) on Marawah Island off shore Abu Dhabi under the patronage of HH Sheikh Mohammed bin Zayed al Nahyan. He went on to excavate the Mamluk Period fortress at Homs, Syria, as part of the British-Syrian Archaeological Project at Homs Citadel. Earlier in his career, he spent several years travelling across the Middle East carrying out research and excavations in Egypt, Syria and the Arabian Gulf. Mr Gibbs has lectured at the University of London, the British Museum, the Victoria & Albert Museum, the Honolulu Academy of Arts and the Museum of Islamic Art, Doha. In 1997, as visiting scholar at the British Museum, he catalogued The Godman Collection of Iznik Ceramics and in 2000, he was visiting scholar at the Art Institute of Chicago and the Gayer-Anderson Museum in Cairo. Mr Gibbs has an MA with Honours from Cambridge University and an MA with Distinction from the University of London. Read Less Read More Contact Information edward.gibbs@sothebys.com +44 20 7293 5332 More from Sotheby's Type: video Category: Type: featured Category: Type: story Category: Type: featured Category: Type: story Category: Type: story Category: Type: story Category: Type: story Category: Type: video Category: Type: featured Category: Type: video Category: Type: featured Category: Upcoming Auctions Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category: Type: auction Category:"
  }
]