[
  {
    "candidate": "Gillespie, Dr. Brandon D",
    "category": "bio",
    "score": null,
    "link": "https://drbrandonformayor.com/f/meet-dr",
    "text": "JOIN OUR EMAIL LIST NYC Thrives Together NYC Thrives Together New York City needs bold leadership that prioritizes people over politics. As a lifelong advocate, I am committed to making NYC a city where affordable housing is a right, not a privilege, where public safety is smart, fair, and community-centered, and where mental health services are accessible to all. My vision is a stronger, more united city that works for the people. Together, we can thrive. New York City needs bold leadership that prioritizes people over politics. As a lifelong advocate, I am committed to making NYC a city where affordable housing is a right, not a privilege, where public safety is smart, fair, and community-centered, and where mental health services are accessible to all. My vision is a stronger, more united city that works for the people. Together, we can thrive. Meet Dr. Brandon I'm running for mayor because I believe New York City can thrive when we prioritize people over politics and take real action to solve our most pressing challenges. With bold leadership, we can create a city that is more affordable, safer, and more connected—where every New Yorker has the opportunity to succeed. I'm running for mayor because I believe New York City can thrive when we prioritize people over politics and take real action to solve our most pressing challenges. With bold leadership, we can create a city that is more affordable, safer, and more connected—where every New Yorker has the opportunity to succeed. POLICY PRIORITIES POLICY PRIORITIES Dr. Brandon’s Vision for a Stronger, More Connected New York City Dr. Brandon’s mayoral campaign is built on a bold, results-driven vision that prioritizes people over politics. His leadership is focused on delivering real solutions to New Yorkers’ most pressing challenges, ensuring that the city remains a place where everyone has access to opportunity, stability, and well-being. Dr. Brandon’s mayoral campaign is built on a bold, results-driven vision that prioritizes people over politics. His leadership is focused on delivering real solutions to New Yorkers’ most pressing challenges, ensuring that the city remains a place where everyone has access to opportunity, stability, and well-being. Affordable Housing for All Dr. Brandon believes that housing is a human right, and New York City must take a proactive and innovative approach to making it accessible to all. His “Housing for All” initiative prioritizes permanent housing as a foundation for stability, ensuring that those experiencing homelessness receive support before other interventions. He plans to expand publicly owned affordable housing, prevent unfair evictions, and curb corporate real estate greed that drives up costs. Additionally, he will invest in converting vacant and underutilized properties into housing, ensuring that affordability is not just a short-term fix but a lasting reality for New Yorkers. Dr. Brandon believes that housing is a human right, and New York City must take a proactive and innovative approach to making it accessible to all. His “Housing for All” initiative prioritizes permanent housing as a foundation for stability, ensuring that those experiencing homelessness receive support before other interventions. He plans to expand publicly owned affordable housing, prevent unfair evictions, and curb corporate real estate greed that drives up costs. Additionally, he will invest in converting vacant and underutilized properties into housing, ensuring that affordability is not just a short-term fix but a lasting reality for New Yorkers. Economic Stability, Workforce Development & Youth Employment Economic opportunity should be within reach for every New Yorker. Dr. Brandon will fight for fair wages, expanded access to subsidized services like childcare and healthcare, and targeted job training programs that connect people to high-growth industries. His plan includes creating more opportunities for young people through a Youth Employment & Parks Program, which will provide paid jobs in conservation, recreation, and environmental education. By investing in vocational training, apprenticeships, and workforce development, he aims to build a more resilient and equitable economy. Economic opportunity should be within reach for every New Yorker. Dr. Brandon will fight for fair wages, expanded access to subsidized services like childcare and healthcare, and targeted job training programs that connect people to high-growth industries. His plan includes creating more opportunities for young people through a Youth Employment & Parks Program, which will provide paid jobs in conservation, recreation, and environmental education. By investing in vocational training, apprenticeships, and workforce development, he aims to build a more resilient and equitable economy. Transportation & Public Safety Dr. Brandon envisions a city where public transportation is more reliable, safer, and controlled by those who"
  },
  {
    "candidate": "Gillespie, Dr. Brandon D",
    "category": "bio",
    "score": null,
    "link": "https://drbrandonformayor.com/f/meet-dr",
    "text": "understand New York’s needs. He will advocate for city-run transit solutions such as expanded bus rapid transit (BRT), ferry services, and protected bike lanes. Public safety remains a key priority, and his approach balances increased NYPD Transit Bureau officers with mental health crisis teams and transit safety ambassadors to ensure the subway system is both secure and welcoming. Investments in better lighting, well-maintained stations, and anti-harassment initiatives will contribute to a safer commute for all. Dr. Brandon envisions a city where public transportation is more reliable, safer, and controlled by those who understand New York’s needs. He will advocate for city-run transit solutions such as expanded bus rapid transit (BRT), ferry services, and protected bike lanes. Public safety remains a key priority, and his approach balances increased NYPD Transit Bureau officers with mental health crisis teams and transit safety ambassadors to ensure the subway system is both secure and welcoming. Investments in better lighting, well-maintained stations, and anti-harassment initiatives will contribute to a safer commute for all. A People-First Economy: Business Growth & Worker Protections Small businesses are the backbone of New York City, and Dr. Brandon is committed to creating a thriving entrepreneurial environment. He will expand access to city-backed grants, low-interest loans, and technical support for small businesses, ensuring they can grow and succeed. At the same time, he will push for stronger worker protections, fair wages, and ethical labor practices that prevent corporate exploitation. His vision includes fostering cooperative business models that allow workers to have ownership stakes in the businesses they help build, creating a more equitable and sustainable local economy. Small businesses are the backbone of New York City, and Dr. Brandon is committed to creating a thriving entrepreneurial environment. He will expand access to city-backed grants, low-interest loans, and technical support for small businesses, ensuring they can grow and succeed. At the same time, he will push for stronger worker protections, fair wages, and ethical labor practices that prevent corporate exploitation. His vision includes fostering cooperative business models that allow workers to have ownership stakes in the businesses they help build, creating a more equitable and sustainable local economy. Mental Health & Community Wellbeing Dr. Brandon understands that mental health is just as important as physical health, and he is dedicated to making mental health care more accessible across the city. He will expand the TeenSpace program into Young AdultSpace , offering free virtual therapy and career counseling for individuals aged 13-25. His plan includes integrating mental health screenings into schools, workplaces, and community centers to ensure early intervention. Additionally, he will prioritize culturally competent and language-accessible mental health care, ensuring that every New Yorker receives support that is tailored to their needs. Dr. Brandon understands that mental health is just as important as physical health, and he is dedicated to making mental health care more accessible across the city. He will expand the TeenSpace program into Young AdultSpace , offering free virtual therapy and career counseling for individuals aged 13-25. His plan includes integrating mental health screenings into schools, workplaces, and community centers to ensure early intervention. Additionally, he will prioritize culturally competent and language-accessible mental health care, ensuring that every New Yorker receives support that is tailored to their needs. Immigrant Protections & Economic Integration Immigrants help New York thrive. Dr. Brandon will expand legal services and ensure all New Yorkers, regardless of status, have access to education, healthcare, and jobs. While working with the federal government, Dr. Brandon will prioritize our immigrant values and keep NYC a safe, welcoming place for all. Immigrants help New York thrive. Dr. Brandon will expand legal services and ensure all New Yorkers, regardless of status, have access to education, healthcare, and jobs. While working with the federal government, Dr. Brandon will prioritize our immigrant values and keep NYC a safe, welcoming place for all. Data Protection & Digital Rights As technology continues to shape everyday life, Dr. Brandon will prioritize digital privacy and cybersecurity to protect New Yorkers from data breaches and corporate overreach. He will push for comprehensive digital privacy laws that prevent the misuse of personal information and ensure that government agencies and businesses comply with strict transparency and security measures. As technology continues to shape everyday life, Dr. Brandon will prioritize digital privacy and cybersecurity to protect New Yorkers from data breaches and corporate overreach. He will push for comprehensive digital privacy laws that prevent the misuse of personal information and ensure that government agencies and businesses comply with strict transparency and"
  },
  {
    "candidate": "Gillespie, Dr. Brandon D",
    "category": "bio",
    "score": null,
    "link": "https://drbrandonformayor.com/f/meet-dr",
    "text": "security measures. Community Engagement & Transparent Governance Dr. Brandon believes that city government should be responsive and accountable to the people it serves. He will strengthen and empower community boards, ensuring that local voices are at the forefront of decision-making. His administration will hold regular town halls and community feedback sessions, creating a direct line of communication between City Hall and the people of New York. Additionally, he will establish clear progress metrics and publicly accessible reports so that New Yorkers can see exactly how their government is working for them. Dr. Brandon believes that city government should be responsive and accountable to the people it serves. He will strengthen and empower community boards, ensuring that local voices are at the forefront of decision-making. His administration will hold regular town halls and community feedback sessions, creating a direct line of communication between City Hall and the people of New York. Additionally, he will establish clear progress metrics and publicly accessible reports so that New Yorkers can see exactly how their government is working for them. With a focus on action, innovation, and community-driven solutions, Dr. Brandon is ready to lead New York City into a future that prioritizes affordability, opportunity, and well-being for all. With a focus on action, innovation, and community-driven solutions, Dr. Brandon is ready to lead New York City into a future that prioritizes affordability, opportunity, and well-being for all. Press Room Press Room We Need Your Support Copyright © 2025 PAID FOR BY BRANDON GILLESPIE FOR MAYOR Copyright © 2025 PAID FOR BY BRANDON GILLESPIE FOR MAYOR This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
  },
  {
    "candidate": "Gillespie, Dr. Brandon D",
    "category": "bio",
    "score": null,
    "link": "https://brandonshow.com/about-dr-brandon/",
    "text": "ABOUT Dr. Brandon Gillespie is a content creator, digital strategist, adjunct professor and therapist based in New York City. He is known for his online presence and unique perspectives on current events, politics, and culture. Gillespie is the host of “The Brandon Show,” a digital show and YouTube channel where he discusses a variety of topics, including social justice, entertainment, and personal development. Gillespie is an advocate for social justice and often uses his platform to promote causes and amplify voices that are underrepresented. He has been involved in various initiatives aimed at empowering marginalized communities and raising awareness about issues such as police brutality, racial injustice, and LGBTQ+ rights. Gillespie has also worked as a digital strategist and consultant for a variety of brands and organizations. He has helped businesses and individuals grow their online presence and reach new audiences through social media marketing and content creation. In addition to his work as a content creator and digital strategist, Gillespie is also a motivational speaker and coach. He uses his experiences and insights to help people overcome challenges and achieve their goals, and ultimately live better lives. THE BRANDON SHOW Be bold. Be brave. be you. Socials Facebook YouTube Instagram"
  }
]