[
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "Contact Us Contact Us 212-886-5867 212-886-5867 info@murrayhillnyc.org info@murrayhillnyc.org Facebook-f Facebook-f Instagram Instagram About About Murray Hill History of Murray Hill Preservation in Murray Hill The Association Officers & Trustees MHNA Comittees Visiting Murray Hill Benefits of Being a MHNA Member About About Murray Hill History of Murray Hill Preservation in Murray Hill The Association About Murray Hill About Murray Hill History of Murray Hill History of Murray Hill Preservation in Murray Hill Preservation in Murray Hill The Association The Association Officers & Trustees MHNA Comittees Visiting Murray Hill Benefits of Being a MHNA Member Officers & Trustees Officers & Trustees MHNA Comittees MHNA Comittees Visiting Murray Hill Visiting Murray Hill Benefits of Being a MHNA Member Benefits of Being a MHNA Member Events Events Catalog Catalog News News Forum Forum Membership Membership Card Merchant Discounts Business Directory Resources Membership Membership Card Membership Card Merchant Discounts Merchant Discounts Business Directory Business Directory Resources Resources Join Join Login Login 0 My Shopping Cart $ Park Avenue Day Adopt a Tree Keep Murray Hill Green & Clean Cultural Medallion Program Custom Amount Authorize.Net - Credit Card First Name * * Last Name No Yes Company Name Email Address * * This is a secure SSL encrypted payment. Card Number * * CVC * * Cardholder Name * * Expiration * * Country * United States Canada United Kingdom Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darrussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo, Democratic People's Republic Congo, Republic of Cook Islands Costa Rica Cote d'Ivoire Croatia/Hrvatska Cuba Cyprus Island Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt Equatorial Guinea El Salvador Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Greece Ghana Gibraltar Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Holy See (City Vatican State) Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Island Poland Portugal Puerto Rico Qatar Reunion Island Romania Russian Federation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and the Grenadines San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovak Republic Slovenia Solomon Islands Somalia South Africa South Georgia South Korea Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Islands Eswatini Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Togo Tokelau Tonga Thailand Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands (British) Virgin Islands (USA) Wallis and Futuna Islands Western Sahara Western Samoa Yemen Yugoslavia Zambia Zimbabwe * Address 1 * * Address 2 City * * State * Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming American Samoa Canal Zone Commonwealth of the Northern Mariana Islands Federated States of Micronesia Guam Marshall Islands Northern Mariana Islands Palau Philippine Islands Puerto Rico Trust Territory of the Pacific Islands Virgin Islands Armed Forces - Americas Armed Forces - Europe, Canada, Middle East, Africa Armed Forces - Pacific State * Zip / Postal Code * * Donation Total: $10,000 Donation Total: $10,000 Newsletters Andrea Gordillo (District 2 City Council candidate) – Meet the Candidates 2025! Updated on April 2, 2025 by MHNA No Comments on Andrea Gordillo (District 2 City"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "Council candidate) – Meet the Candidates 2025! The Murray Hill Neighborhood Association reached out to all the candidates running for office in 2025 that intersect our neighborhood (Mayor, Manhattan Borough President, City Council District 2, and City Council District 4, etc.) with questions sourced directly from our members via our Ask the Candidates questionnaire . See the candidate’s answers below. How you would improve our streets and quality of life? In New York City space is at a premium, including space on our streets. As a city, we must put people before cars and reimagine our streets as spaces for safety, connection, and clean air. The ability to efficiently and safely transit our streets is essential. That means building physically protected bus and bike lanes, widening sidewalks, and redesigning intersections to prioritize pedestrians. We must also crack down on illegal parking, placard abuse, and reckless driving and biking through consistent enforcement and automated systems. Slowing traffic, enforcing bus lanes, and assuring that corridors like Second and Third Avenues quieter, smoother, and safer for everyone — especially bus riders, cyclists, seniors, and children. Paint isn’t protection; we need real infrastructure that reflects the value of every life on our streets. But we also need to go beyond safety and think about livability. That means expanding tree cover, turning curbside parking into public space, and investing in green infrastructure that cools and cleans our air. Community input — especially from longtime residents like yourselves — should drive these changes, with deep outreach and transparency. I’m committed to a vision of our neighborhoods that centers care, equity, and dignity, so that every New Yorker can move through their city with ease, joy, and confidence. We all deserve streets that support health, not harm. How are you going to handle the illegal migrant situation that has escalated into NYC? Immigrants helped build New York City. When my parents first came to the United States, they got married and started a new life in Queens. Like many New Yorkers, they worked hard and grueling hours, and my father eventually became a public health official. I believe the American Dream is worth fighting for, that our immigration system is broken, and every level of government has failed to effectively manage the influx of immigration in our City. The city has wasted millions on irresponsible and expensive vendors, and immigrant families and children have been subject to instability and homelessness, causing lower quality of life for all people. Newly arrived immigrants want to work, and our city has floundered in facilitating and expediting that process. As your Councilmember, I will work with the Mayor and the Government to authorize local work authorizations. More jobs and workforce = lower costs of goods. I will also work with my future colleagues to identify and survey areas in the city that need city workers and identify longer term housing opportunities, and not shelters, so that immigrants can settle into our city as they have for generations. I will also work with regional governments and localities to coordinate resettlement more effectively. How can housing become more affordable and not just for low income candidates? The rent is too damn high — not just for low-income households, but for working- and middle-class New Yorkers, too. I’ve lived that reality. As Chair of my Community Board, I’ve fought to protect and expand affordable housing — from rent-stabilized units and HDFCs to community land trusts — and as your Councilperson, I’ll push even further to preserve and create housing that’s truly affordable, not just on paper, but in people’s lives. We’re living through a historic housing shortage and affordability crisis, and we need to build more housing as NYC has historically in the post war period. We also need to deploy comprehensive tools that support all New Yorkers — not just the lowest-income, but those caught in the growing gap between too much rent and not enough help. That means expanding homeownership opportunities like Mitchell-Lama and down payment assistance programs, building housing on the public land that we have in our district, and pass the Community Opportunity to Purchase Act. If elected, I will hire a housing division within my council office to assist tenants repairs, protect tenants from eviction and harassment, and create a registry of vacant units to bring warehoused housing back into use. Middle-income New Yorkers are the backbone of this city, and I’ll fight for a future where they can stay, thrive, and put down roots — without fear of"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "displacement. How would you address homelessness and mental illness in NYC? Homelessness and mental illness are not crimes — they are serious public health and housing issues, and as your Councilwoman, I will treat them that way. I believe every New Yorker deserves dignity, safety, and support, no matter their housing status. That starts with lowering the rent and expanding access to permanent housing. I’ve already identified units of 100% affordable housing that I plan to build in my district, and I’ll work with my colleagues to build even more across the city for working families and those most at risk of displacement. We must also fix our broken shelter and mental health systems. I’ll push the Department of Homeless Services to construct single-room Safe Haven shelters that offer privacy, safety, and a real path off the streets — because shared dorms often deter people from seeking help. As Community Board chair, I have seen individuals refuse shelter for this very reason more times than is acceptable. I’ll fight to reform the CityFHEPS voucher system, eliminate administrative delays, and hold landlords accountable for illegal discrimination, so more New Yorkers can actually use their vouchers. I support a community-first responder model that sends mental health professionals, not police, to de-escalate crises. I’ll fight to expand programs like B-HEARD and fund community centers, youth programs, and health institutions that effectively prevent homelessness before it begins with thoughtful partnership and analysis. These policies are an urgent and necessary step toward restoring humanity and hope to a city that far too often leaves people behind. How would you support the Murray Hill Neighborhood Association? For the last decade, I have led cultural, policy, and democratic institutions in Manhattan, from the Loisaida Inc., to Coalition for a District Alternative, guided by the principle of co-governance. Collaboration with community members and organizations is critical to successfully solving our most pressing problems, and I know through experience that neighborhood groups want to meaningfully contribute to the betterment of our communities. I commit to working with MHNA on legislative and budget priorities that are important to residents. I am committed to consistently meeting with and sincerely listening to the concerns and perspectives of Murray Hill Neighborhood Association members so that together, we can work to build a safer, more livable, more affordable community. Bio Andrea Gordillo is a proud daughter of Peruvian immigrants and a deeply rooted community leader in Lower Manhattan. A former organizer and lifelong advocate for racial and economic justice, Andrea’s path has taken her from unionizing dining hall workers in Boston to leading cultural and community institutions throughout District 2 like Loisaida Inc., Fourth Arts Block, The Clemente Soto Vélez Cultural Center, and The Public Theater. Throughout that time, she has marshaled millions in public and community investments, has served hundreds of residents and families through world class community programming, and spearheaded resiliency initiatives. She is the Chairperson of Manhattan’s Community Board 3, where she has led the diverse board through complex challenges the past two years. Shaped by her family’s sacrifices and her own struggles with housing and healthcare insecurity, Andrea is running for City Council to fight for a more just, equitable, and sustainable New York — one where every New Yorker has the chance to thrive, no matter where they come from. https://andreagordillo.nyc/ Share: Andrea Gordillo (District 2 City Council candidate) – Meet the Candidates 2025! Updated on April 2, 2025 by MHNA by No Comments on Andrea Gordillo (District 2 City Council candidate) – Meet the Candidates 2025! on Andrea Gordillo (District 2 City Council candidate) – Meet the Candidates 2025! The Murray Hill Neighborhood Association reached out to all the candidates running for office in 2025 that intersect our neighborhood (Mayor, Manhattan Borough President, City Council District 2, and City Council District 4, etc.) with questions sourced directly from our members via our Ask the Candidates questionnaire . See the candidate’s answers below. How you would improve our streets and quality of life? In New York City space is at a premium, including space on our streets. As a city, we must put people before cars and reimagine our streets as spaces for safety, connection, and clean air. The ability to efficiently and safely transit our streets is essential. That means building physically protected bus and bike lanes, widening sidewalks, and redesigning intersections to prioritize pedestrians. We must also crack down on illegal parking, placard abuse, and reckless driving and biking through consistent enforcement and automated systems. Slowing traffic,"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "enforcing bus lanes, and assuring that corridors like Second and Third Avenues quieter, smoother, and safer for everyone — especially bus riders, cyclists, seniors, and children. Paint isn’t protection; we need real infrastructure that reflects the value of every life on our streets. But we also need to go beyond safety and think about livability. That means expanding tree cover, turning curbside parking into public space, and investing in green infrastructure that cools and cleans our air. Community input — especially from longtime residents like yourselves — should drive these changes, with deep outreach and transparency. I’m committed to a vision of our neighborhoods that centers care, equity, and dignity, so that every New Yorker can move through their city with ease, joy, and confidence. We all deserve streets that support health, not harm. How are you going to handle the illegal migrant situation that has escalated into NYC? Immigrants helped build New York City. When my parents first came to the United States, they got married and started a new life in Queens. Like many New Yorkers, they worked hard and grueling hours, and my father eventually became a public health official. I believe the American Dream is worth fighting for, that our immigration system is broken, and every level of government has failed to effectively manage the influx of immigration in our City. The city has wasted millions on irresponsible and expensive vendors, and immigrant families and children have been subject to instability and homelessness, causing lower quality of life for all people. Newly arrived immigrants want to work, and our city has floundered in facilitating and expediting that process. As your Councilmember, I will work with the Mayor and the Government to authorize local work authorizations. More jobs and workforce = lower costs of goods. I will also work with my future colleagues to identify and survey areas in the city that need city workers and identify longer term housing opportunities, and not shelters, so that immigrants can settle into our city as they have for generations. I will also work with regional governments and localities to coordinate resettlement more effectively. How can housing become more affordable and not just for low income candidates? The rent is too damn high — not just for low-income households, but for working- and middle-class New Yorkers, too. I’ve lived that reality. As Chair of my Community Board, I’ve fought to protect and expand affordable housing — from rent-stabilized units and HDFCs to community land trusts — and as your Councilperson, I’ll push even further to preserve and create housing that’s truly affordable, not just on paper, but in people’s lives. We’re living through a historic housing shortage and affordability crisis, and we need to build more housing as NYC has historically in the post war period. We also need to deploy comprehensive tools that support all New Yorkers — not just the lowest-income, but those caught in the growing gap between too much rent and not enough help. That means expanding homeownership opportunities like Mitchell-Lama and down payment assistance programs, building housing on the public land that we have in our district, and pass the Community Opportunity to Purchase Act. If elected, I will hire a housing division within my council office to assist tenants repairs, protect tenants from eviction and harassment, and create a registry of vacant units to bring warehoused housing back into use. Middle-income New Yorkers are the backbone of this city, and I’ll fight for a future where they can stay, thrive, and put down roots — without fear of displacement. How would you address homelessness and mental illness in NYC? Homelessness and mental illness are not crimes — they are serious public health and housing issues, and as your Councilwoman, I will treat them that way. I believe every New Yorker deserves dignity, safety, and support, no matter their housing status. That starts with lowering the rent and expanding access to permanent housing. I’ve already identified units of 100% affordable housing that I plan to build in my district, and I’ll work with my colleagues to build even more across the city for working families and those most at risk of displacement. We must also fix our broken shelter and mental health systems. I’ll push the Department of Homeless Services to construct single-room Safe Haven shelters that offer privacy, safety, and a real path off the streets — because shared dorms often deter people from seeking help. As Community Board chair, I have seen individuals"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "refuse shelter for this very reason more times than is acceptable. I’ll fight to reform the CityFHEPS voucher system, eliminate administrative delays, and hold landlords accountable for illegal discrimination, so more New Yorkers can actually use their vouchers. I support a community-first responder model that sends mental health professionals, not police, to de-escalate crises. I’ll fight to expand programs like B-HEARD and fund community centers, youth programs, and health institutions that effectively prevent homelessness before it begins with thoughtful partnership and analysis. These policies are an urgent and necessary step toward restoring humanity and hope to a city that far too often leaves people behind. How would you support the Murray Hill Neighborhood Association? For the last decade, I have led cultural, policy, and democratic institutions in Manhattan, from the Loisaida Inc., to Coalition for a District Alternative, guided by the principle of co-governance. Collaboration with community members and organizations is critical to successfully solving our most pressing problems, and I know through experience that neighborhood groups want to meaningfully contribute to the betterment of our communities. I commit to working with MHNA on legislative and budget priorities that are important to residents. I am committed to consistently meeting with and sincerely listening to the concerns and perspectives of Murray Hill Neighborhood Association members so that together, we can work to build a safer, more livable, more affordable community. Bio Andrea Gordillo is a proud daughter of Peruvian immigrants and a deeply rooted community leader in Lower Manhattan. A former organizer and lifelong advocate for racial and economic justice, Andrea’s path has taken her from unionizing dining hall workers in Boston to leading cultural and community institutions throughout District 2 like Loisaida Inc., Fourth Arts Block, The Clemente Soto Vélez Cultural Center, and The Public Theater. Throughout that time, she has marshaled millions in public and community investments, has served hundreds of residents and families through world class community programming, and spearheaded resiliency initiatives. She is the Chairperson of Manhattan’s Community Board 3, where she has led the diverse board through complex challenges the past two years. Shaped by her family’s sacrifices and her own struggles with housing and healthcare insecurity, Andrea is running for City Council to fight for a more just, equitable, and sustainable New York — one where every New Yorker has the chance to thrive, no matter where they come from. https://andreagordillo.nyc/ Share: Post navigation Previous Post Previous post: Allie Ryan (District 2 City Council candidate) – Meet the Candidates 2025! Next Post Next post: Harvey Epstein (District 2 City Council candidate) – Meet the Candidates 2025! Leave A Comment Cancel Reply Leave A Comment Your Comment All comments are held for moderation. Save my name, email, and website in this browser for the next time I comment. Related Posts 0 Newsletters Park Avenue Day 2025 Will Celebrate Community & Culture on Saturday, May 17th! May 12, 2025 by MHNA Park Avenue Day 2025 Will Celebrate Community & Culture on Saturday, May 17th! May 12, 2025 by MHNA by 0 Newsletters Michel Bassompierre’s Monumental Sculptures Debut Ahead of Park Avenue Day 2025 May 12, 2025 by MHNA Michel Bassompierre’s Monumental Sculptures Debut Ahead of Park Avenue Day 2025 May 12, 2025 by MHNA by 0 Newsletters Park Avenue Day 2025 Silent Auction Donations May 12, 2025 by MHNA Park Avenue Day 2025 Silent Auction Donations May 12, 2025 by MHNA by MHNA The Murray Hill Neighborhood Association is dedicated to preserving, beautifying and improving Manhattan’s historic Murray Hill neighborhood. © The Murray Hill Neighborhood Association | Website by Escope © © Website by Escope CONTACT US The Murray Hill Neighborhood Association, P.O. Box 1897 New York, NY 10156-1897 U.S.A. The Murray Hill Neighborhood Association, P.O. Box 1897 New York, NY 10156-1897 U.S.A. Email: info@murrayhillnyc.org Email: info@murrayhillnyc.org QUICK LINKS Privacy Policy Privacy Policy Contact Us Contact Us Social links Facebook Facebook Instagram Instagram Linkedin Linkedin Report There was a problem reporting this post. Harassment Harassment or bullying behavior Inappropriate Contains mature or sensitive content Misinformation Contains misleading or false information Offensive Contains abusive or derogatory content Suspicious Contains spam, fake content or potential malware Other Report note Block Member? Please confirm you want to block this member. You will no longer be able to: See blocked member's posts Mention this member in posts Message this member Add this member as a connection Please note: This action will also remove this member from your connections and send a report to the site admin. Please allow a few minutes"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://murrayhillnyc.org/andrea-gordillo-district-2-city-council-candidate-ask-the-candidates-2025/",
    "text": "for this process to complete. Report"
  },
  {
    "candidate": "Gordillo, Andrea",
    "category": "bio",
    "score": null,
    "link": "https://nyunews.com/news/2025/02/27/beyond-andrea-gordillo/",
    "text": "403 Forbidden Access to this resource on the server is denied! Please be advised that LiteSpeed Technologies Inc. is not a web hosting company and, as such, has no control over content found on this site."
  }
]