[
  {
    "candidate": "Hagen, Clifford A",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/public-educator-a-democrat-announces-candidacy-for-south-shore-nyc-council-seat.html",
    "text": "Set weather Set weather Back To Main Menu Close Current - Mostly Sunny Tonight Low - Mostly Sunny Tomorrow High - Mostly Sunny View full weather report Public educator, a Democrat, announces candidacy for South Shore NYC Council seat Updated: Feb. 03, 2025, 7:37 p.m. | Published: Feb. 03, 2025, 7:19 p.m. | Cliff Hagen addresses supporters during a campaign launch in New Springville, Monday, Feb.3, 2025. (Staten Island Advance/Paul Liotta) By Paul Liotta | pliotta@siadvance.com STATEN ISLAND, N.Y. — A registered Democrat announced his hope Monday to ride a non-partisan special election to victory in the most Republican City Council District in the five boroughs. Clifford Hagen , 58, of Eltingville, announced his candidacy for the 51st Council District seat recently vacated by Councilman Joseph Borelli (R-South Shore) . A lifelong Staten Islander, Hagen made his announcement outside Police Officer Rocco Laurie Intermediate School (I.S. 72), where he has been a special education teacher since 1994. “My family has lived, loved and learned on Staten Island for more than 300 years,‘’ he said. ”I am born and raised here on Staten Island, and I embrace the independent, fair minded, conservative spirit of our borough. “Other parts of New York City have little or no concern for our neighborhoods, our parks, our safety. As a city councilman, I will speak up and speak out in support of our children, our safety, our little corner of New York City.” Mayor Eric Adams declared Monday that the special election for the Council District will be held April 29. It so far features three candidates who say they’re running — Hagen, Frank Morano, and Jeffrey Horowitz. Hagen’s announcement came near the 51st Council District’s border, but he resides relatively deep in its territory. Republican Borough President Vito Fossella also recently appointed him to serve on the South Shore’s Community Board 3. When asked about his own political leanings, Hagen confirmed that he is a registered Democrat, but said he only became so about three years ago after a life of independent voting. A review of public records confirmed that Hagen joined the Democratic Party in November 2022 after spending most of his voting life unaffiliated. The candidate said his registration decision was motivated, in part, by his role in the non-profit world. Hagen has been a local environmentalist for decades, serving as a longtime member and president of the Protectors of Pine Oak Woods, one of the Island’s leading environmental advocacy groups. He also sought to establish his conservative bona fides Monday, saying one of his top priorities would be the fight against congestion pricing, largely not under the purview of the New York City Council. Hagen has been party to a federal lawsuit seeking to block congestion pricing, which Michael Mulgrew, head of the United Federation of Teachers, brought in January 2024 . Undoubtedly one of the most prominent non-Republicans to run for the Council seat in recent memory, Hagen will likely have an uphill battle in a district controlled by Republicans since its establishment in 1992. Candidates will run unaffiliated in the April 29 election, but Hagen said Monday that he would seek the office in the November general election as a Democrat whether he wins or loses in the spring. Of his opponents, Horowitz is also a Democrat, and Morano recently became a registered Republican after years of independence similar to Hagen’s. The latter said Monday that he hopes a broader Staten Island independent streak helps guide him to victory in April. “I think the folks on Staten Island are concerned with Staten Island issues, and they don’t necessarily come down to the party,” he said. “It’s about who’s working for the community, and that’s not a party issue.” Morano has won the support of Borelli and some of the local Republican party’s elected establishment. Assemblyman Michael Tannousis (R-East Shore/South Brooklyn), who chairs the local party, and Councilman David Carr (R-Mid-Island/South Brooklyn) joined Borelli for Morano’s campaign launch Jan. 26. Voters on the South Shore will likely be familiar with special elections as two of its most recently elected representatives in the City Council took office that way. Borelli succeeded his predecessor — Vincent Ignizio, current deputy executive director for the New York City Board of Elections — after he left for a job at Catholic Charities of Staten Island in 2015. Ignizio took office in 2007 after his Council predecessor, State Sen. Andrew Lanza (R-South Shore), left for the state Senate. MORE POLITICAL NEWS ‘All part of the process,’"
  },
  {
    "candidate": "Hagen, Clifford A",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/public-educator-a-democrat-announces-candidacy-for-south-shore-nyc-council-seat.html",
    "text": "Adams sidesteps Staten Island Dems’ Cuomo endorsements as he slams former Gov. Advocate for Staten Island Liberian community, NYC employee launches City Council bid City Council candidate, ex-wife of slain NYPD officer, withdraws candidacy When should voters expect results in Staten Island special election? City Council candidate Fossella calls out Morano for backing scam artist’s parole If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. Cliff Hagen addresses supporters during a campaign launch in New Springville, Monday, Feb.3, 2025. (Staten Island Advance/Paul Liotta) (Staten Island Advance/Paul Liotta) By Paul Liotta | pliotta@siadvance.com STATEN ISLAND, N.Y. — A registered Democrat announced his hope Monday to ride a non-partisan special election to victory in the most Republican City Council District in the five boroughs. Clifford Hagen , 58, of Eltingville, announced his candidacy for the 51st Council District seat recently vacated by Councilman Joseph Borelli (R-South Shore) . A lifelong Staten Islander, Hagen made his announcement outside Police Officer Rocco Laurie Intermediate School (I.S. 72), where he has been a special education teacher since 1994. “My family has lived, loved and learned on Staten Island for more than 300 years,‘’ he said. ”I am born and raised here on Staten Island, and I embrace the independent, fair minded, conservative spirit of our borough. “Other parts of New York City have little or no concern for our neighborhoods, our parks, our safety. As a city councilman, I will speak up and speak out in support of our children, our safety, our little corner of New York City.” Mayor Eric Adams declared Monday that the special election for the Council District will be held April 29. It so far features three candidates who say they’re running — Hagen, Frank Morano, and Jeffrey Horowitz. Hagen’s announcement came near the 51st Council District’s border, but he resides relatively deep in its territory. Republican Borough President Vito Fossella also recently appointed him to serve on the South Shore’s Community Board 3. When asked about his own political leanings, Hagen confirmed that he is a registered Democrat, but said he only became so about three years ago after a life of independent voting. A review of public records confirmed that Hagen joined the Democratic Party in November 2022 after spending most of his voting life unaffiliated. The candidate said his registration decision was motivated, in part, by his role in the non-profit world. Hagen has been a local environmentalist for decades, serving as a longtime member and president of the Protectors of Pine Oak Woods, one of the Island’s leading environmental advocacy groups. He also sought to establish his conservative bona fides Monday, saying one of his top priorities would be the fight against congestion pricing, largely not under the purview of the New York City Council. Hagen has been party to a federal lawsuit seeking to block congestion pricing, which Michael Mulgrew, head of the United Federation of Teachers, brought in January 2024 . Undoubtedly one of the most prominent non-Republicans to run for the Council seat in recent memory, Hagen will likely have an uphill battle in a district controlled by Republicans since its establishment in 1992. Candidates will run unaffiliated in the April 29 election, but Hagen said Monday that he would seek the office in the November general election as a Democrat whether he wins or loses in the spring. Of his opponents, Horowitz is also a Democrat, and Morano recently became a registered Republican after years of independence similar to Hagen’s. The latter said Monday that he hopes a broader Staten Island independent streak helps guide him to victory in April. “I think the folks on Staten Island are concerned with Staten Island issues, and they don’t necessarily come down to the party,” he said. “It’s about who’s working for the community, and that’s not a party issue.” Morano has won the support of Borelli and some of the local Republican party’s elected establishment. Assemblyman Michael Tannousis (R-East Shore/South Brooklyn), who chairs the local party, and Councilman David Carr (R-Mid-Island/South Brooklyn) joined Borelli for Morano’s campaign launch Jan. 26. Voters on the South Shore will likely be familiar with special elections as two of its most recently elected representatives in the City"
  },
  {
    "candidate": "Hagen, Clifford A",
    "category": "bio",
    "score": null,
    "link": "https://www.silive.com/politics/2025/02/public-educator-a-democrat-announces-candidacy-for-south-shore-nyc-council-seat.html",
    "text": "Council took office that way. Borelli succeeded his predecessor — Vincent Ignizio, current deputy executive director for the New York City Board of Elections — after he left for a job at Catholic Charities of Staten Island in 2015. Ignizio took office in 2007 after his Council predecessor, State Sen. Andrew Lanza (R-South Shore), left for the state Senate. MORE POLITICAL NEWS ‘All part of the process,’ Adams sidesteps Staten Island Dems’ Cuomo endorsements as he slams former Gov. Advocate for Staten Island Liberian community, NYC employee launches City Council bid City Council candidate, ex-wife of slain NYPD officer, withdraws candidacy When should voters expect results in Staten Island special election? City Council candidate Fossella calls out Morano for backing scam artist’s parole If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. Footer Navigation Community Rules Contact Us Advertise with us About SILive.com Accessibility Statement SILive.com Staten Island Advance Newsletters Manage Your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Reprints View E-Edition Entertainment High School Sports Business Sports Betting News Opinion Rentals Autos Classifieds Obituaries Jobs Real Estate Mobile apps Videos Weather News Post a job Archives Local Life Special Sections Post a classified ad Sell/rent your home Search Sell your car Sponsor Content Facebook Twitter YouTube Instagram RSS Your Privacy Choices Privacy Policy | User Agreement | | Ad Choices | Disclaimer Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement , (updated 8/1/2024) and acknowledgement of our Privacy Policy , and Your Privacy Choices and Rights (updated 1/1/2025). © 2025 Advance Local Media LLC. All rights reserved ( About Us ). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rules apply to all content you upload or otherwise submit to this site. YouTube's privacy policy is available here and YouTube's terms of service is available here . Ad Choices"
  }
]