[
  {
    "candidate": "Hanif, Shahana",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shahana-hanif/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 39 Shahana Hanif Kensington, Borough Park, Windsor Terrace, Park Slope, Gowanus, Carroll Gardens, Cobble Hill, Boerum Hill, and the Columbia Waterfront Biography Council Member Shahana Hanif represents New York City’s 39th Council District, which includes parts of Kensington, Borough Park, Windsor Terrace, Park Slope, Gowanus, Carroll Gardens, Cobble Hill, Boerum Hill, and the Columbia Waterfront. She is the first Bangladeshi and Muslim woman elected to the New York City Council and the first woman to represent the 39th District. Born and raised in the 39th District to Bangladeshi immigrant parents, Council Member Hanif has dedicated her career to advocating for working-class families and advancing a city built on care, equity, and safety. Her personal battle with Lupus, diagnosed at age 17, and her experiences with the challenging healthcare system and City services, inspired her commitment to public service. During her first term, she successfully led the passage of a resolution designating May as Lupus Awareness Month in NYC. Before her election, Council Member Hanif served as the Director of Organizing and Community Engagement in the office of former District 39 Council Member Brad Lander. There, she spearheaded Participatory Budgeting, an initiative that empowers New Yorkers to have a say in how City funds are allocated in their neighborhoods. She continues to champion Participatory Budgeting to enhance civic engagement and strengthen local democracy. Since her election in 2021, Council Member Hanif has passed significant legislation, including Local Law 85 (2023) , which mandates universal residential composting; Local Laws 75 and 76 (2022) , which protect and expand abortion rights in NYC; and Local Law 161 (2023) , which created a pioneering Immigrant Workers Bill of Rights. She also enacted Local Law 45 (2024) , providing survivors of domestic violence with free lock changes, personal safety alarms, and door and window repairs. Her advocacy led to the establishment of 4th Street Plaza in Park Slope, the expansion of Kensington Plaza, and the creation of a protected bike lane on 2nd Avenue and 9th Street in Gowanus. In her second term, she is focusing on advancing Intro. 210 , the Stop Shelter Evictions Act, aimed at removing caps on shelter stays for asylum seekers and their school-aged children. Council Member Hanif serves as Co-Chair of the Progressive Caucus, where she has led efforts to end solitary confinement in NYC jails and advance the How Many Stops Act for greater police transparency. Previously, she chaired the Immigration Committee and established Promise NYC, a childcare program for undocumented immigrant families. She also co-chairs the Task Force to Combat Hate. A vocal advocate for peace, Council Member Hanif was among the first City Council Members to call for an immediate permanent bilateral ceasefire in Gaza that includes the return of all hostages and political prisoners. You can follow Council Member Shahana Hanif on X and Instagram at @CMShahanaHanif. Committees Task Force to Combat Hate (Co-Chair) Committee on Immigration Committee on Criminal Justice Committee on Education Committee on Cultural Affairs, Libraries, and International Intergroup Relations Committee on Government Operations, State & Federal Legislation Committee on Mental Health, Disabilities, and Addictions Caucuses Progressive Caucus (Co-Chair) Black, Latino, and Asian Caucus Women’s Caucus Bluesky X Facebook Instagram Biography Council Member Shahana Hanif represents New York City’s 39th Council District, which includes parts of Kensington, Borough Park, Windsor Terrace, Park Slope, Gowanus, Carroll Gardens, Cobble Hill, Boerum Hill, and the Columbia Waterfront. She is the first Bangladeshi and Muslim woman elected to the New York City Council and the first woman to represent the 39th District. Council Member Shahana Hanif represents New York City’s 39th Council District, which includes parts of Kensington, Borough Park, Windsor Terrace, Park Slope, Gowanus, Carroll Gardens, Cobble Hill, Boerum Hill, and the Columbia Waterfront. She is the first Bangladeshi and Muslim woman elected to the New York City Council and the first woman to represent the 39th District. Born and raised in the 39th District to Bangladeshi immigrant parents, Council Member Hanif has dedicated her career to advocating for working-class families and advancing a city built on care, equity, and safety. Her personal battle with Lupus, diagnosed at age 17, and her experiences with the challenging healthcare system and City services, inspired her commitment to public service. During her first term, she successfully led the passage of a resolution designating May as Lupus Awareness Month in NYC. Born and raised in the 39th"
  },
  {
    "candidate": "Hanif, Shahana",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shahana-hanif/",
    "text": "District to Bangladeshi immigrant parents, Council Member Hanif has dedicated her career to advocating for working-class families and advancing a city built on care, equity, and safety. Her personal battle with Lupus, diagnosed at age 17, and her experiences with the challenging healthcare system and City services, inspired her commitment to public service. During her first term, she successfully led the passage of a resolution designating May as Lupus Awareness Month in NYC. Before her election, Council Member Hanif served as the Director of Organizing and Community Engagement in the office of former District 39 Council Member Brad Lander. There, she spearheaded Participatory Budgeting, an initiative that empowers New Yorkers to have a say in how City funds are allocated in their neighborhoods. She continues to champion Participatory Budgeting to enhance civic engagement and strengthen local democracy. Before her election, Council Member Hanif served as the Director of Organizing and Community Engagement in the office of former District 39 Council Member Brad Lander. There, she spearheaded Participatory Budgeting, an initiative that empowers New Yorkers to have a say in how City funds are allocated in their neighborhoods. She continues to champion Participatory Budgeting to enhance civic engagement and strengthen local democracy. Since her election in 2021, Council Member Hanif has passed significant legislation, including Local Law 85 (2023) , which mandates universal residential composting; Local Laws 75 and 76 (2022) , which protect and expand abortion rights in NYC; and Local Law 161 (2023) , which created a pioneering Immigrant Workers Bill of Rights. She also enacted Local Law 45 (2024) , providing survivors of domestic violence with free lock changes, personal safety alarms, and door and window repairs. Her advocacy led to the establishment of 4th Street Plaza in Park Slope, the expansion of Kensington Plaza, and the creation of a protected bike lane on 2nd Avenue and 9th Street in Gowanus. In her second term, she is focusing on advancing Intro. 210 , the Stop Shelter Evictions Act, aimed at removing caps on shelter stays for asylum seekers and their school-aged children. Since her election in 2021, Council Member Hanif has passed significant legislation, including Local Law 85 (2023) , which mandates universal residential composting; Local Laws 75 and 76 (2022) , which protect and expand abortion rights in NYC; and Local Law 161 (2023) , which created a pioneering Immigrant Workers Bill of Rights. She also enacted Local Law 45 (2024) , providing survivors of domestic violence with free lock changes, personal safety alarms, and door and window repairs. Her advocacy led to the establishment of 4th Street Plaza in Park Slope, the expansion of Kensington Plaza, and the creation of a protected bike lane on 2nd Avenue and 9th Street in Gowanus. In her second term, she is focusing on advancing Intro. 210 , the Stop Shelter Evictions Act, aimed at removing caps on shelter stays for asylum seekers and their school-aged children. Council Member Hanif serves as Co-Chair of the Progressive Caucus, where she has led efforts to end solitary confinement in NYC jails and advance the How Many Stops Act for greater police transparency. Previously, she chaired the Immigration Committee and established Promise NYC, a childcare program for undocumented immigrant families. She also co-chairs the Task Force to Combat Hate. Council Member Hanif serves as Co-Chair of the Progressive Caucus, where she has led efforts to end solitary confinement in NYC jails and advance the How Many Stops Act for greater police transparency. Previously, she chaired the Immigration Committee and established Promise NYC, a childcare program for undocumented immigrant families. She also co-chairs the Task Force to Combat Hate. A vocal advocate for peace, Council Member Hanif was among the first City Council Members to call for an immediate permanent bilateral ceasefire in Gaza that includes the return of all hostages and political prisoners. A vocal advocate for peace, Council Member Hanif was among the first City Council Members to call for an immediate permanent bilateral ceasefire in Gaza that includes the return of all hostages and political prisoners. You can follow Council Member Shahana Hanif on X and Instagram at @CMShahanaHanif. You can follow Council Member Shahana Hanif on X and Instagram at @CMShahanaHanif. Committees Task Force to Combat Hate (Co-Chair) Committee on Immigration Committee on Immigration Committee on Criminal Justice Committee on Criminal Justice Committee on Education Committee on Education Committee on Cultural Affairs, Libraries, and International Intergroup Relations Committee on Cultural Affairs, Libraries, and International Intergroup Relations Committee on Government Operations,"
  },
  {
    "candidate": "Hanif, Shahana",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shahana-hanif/",
    "text": "State & Federal Legislation Committee on Government Operations, State & Federal Legislation Committee on Mental Health, Disabilities, and Addictions Committee on Mental Health, Disabilities, and Addictions Caucuses Progressive Caucus (Co-Chair) Black, Latino, and Asian Caucus Women’s Caucus Bluesky Bluesky X X Facebook Facebook Instagram Instagram Biography News Press Releases & Statements Press Releases & Statements Meet Our Team Constituent Services Participatory Budgeting (PB) The Impact of Participatory Budgeting (PB) The Impact of Participatory Budgeting (PB) Take Action Locally: Support District 39 Neighbors Light the Way BK Community Town Hall – Event Recap & Highlights Light the Way BK Community Town Hall – Event Recap & Highlights Legislative Record Sign Up For Email Updates City Directory Join our team! We’re hiring a Part-time Constituent Services Liaison. District Office 197 Bond Street, 1st Floor Brooklyn, NY 11217 Phone: (718) 499-1090 Legislative Office 250 Broadway, Suite 1731 New York, NY 10007 Phone: 212-788-6969 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]