[
  {
    "candidate": "Hankerson, Tyrell D",
    "category": "bio",
    "score": null,
    "link": "https://www.tyhankerson.com/",
    "text": "top of page CHIP IN $10 TO SUPPORT TY HANKERSON CHIP IN $10 TO SUPPORT TY HANKERSON Home Home About About Issues Issues Endorsements Endorsements Contact Contact VOLUNTEER VOLUNTEER DONATE DONATE WE HAVE UNFINISHED BUSINESS. WE HAVE UNFINISHED BUSINESS. WE HAVE UNFINISHED BUSINESS. GET INVOLVED GET INVOLVED GET INVOLVED GET INVOLVED GET INVOLVED GET INVOLVED Join Our Campaign Join Our Campaign Join Our Campaign Join Our Campaign Join Our Campaign Join Our Campaign Real change comes from neighbors like you stepping up to make a difference. Every volunteer hour, every small donation, every conversation matters. Real change comes from neighbors like you stepping up to make a difference. Every volunteer hour, every small donation, every conversation matters. Real change comes from neighbors like you stepping up to make a difference. Every volunteer hour, every small donation, every conversation matters. Real change comes from neighbors like you stepping up to make a difference. Every volunteer hour, every small donation, every conversation matters. Sign up to join our grassroots movement today . Sign up to join our grassroots movement today . Sign up to join our grassroots movement today . Sign up to join our grassroots movement today . Sign up to join our grassroots movement today * * * * By providing your mobile phone number, you are giving consent to receive calls and SMS/MMS messages to that number from the Ty for NYC Campaign. Msg frequency varies. Msg & data rates may apply. More information at tyhankerson.com/privacy * By providing your mobile phone number, you are giving consent to receive calls and SMS/MMS messages to that number from the Ty for NYC Campaign. Msg frequency varies. Msg & data rates may apply. More information at tyhankerson.com/privacy * By providing your mobile phone number, you are giving consent to receive calls and SMS/MMS messages to that number from the Ty for NYC Campaign. Msg frequency varies. Msg & data rates may apply. More information at tyhankerson.com/privacy * SUBMIT Join the conversation. Join the conversation. Join the conversation. Join the conversation. Join the conversation. Join the conversation. Volunteer​ Volunteer​ Volunteer​ Volunteer​ Volunteer​ Volunteer​ SIGN UP SIGN UP Register to Vote Register to Vote Register to Vote Register to Vote Register to Vote Register to Vote REGISTER ONLINE REGISTER ONLINE Check Your Status Check Your Status Check Your Status Check Your Status Check Your Status Check Your Status VOTING INFORMATION VOTING INFORMATION DONATE DONATE VOLUNTEER VOLUNTEER Be Part of the Movement Be Part of the Movement Be Part of the Movement Be Part of the Movement Be Part of the Movement Be Part of the Movement Be Part of the Movement Get Invlolved Our community fought for and won millions in resources for Southeast Queens. Ty Hankerson will deliver on those promises—and fight for more. Our community fought for and won millions in resources for Southeast Queens. Ty Hankerson will deliver on those promises—and fight for more. Our community fought for and won millions in resources for Southeast Queens. Ty Hankerson will deliver on those promises—and fight for more. Ty Hankerson will deliver on those promises—and fight for more. ABOUT ABOUT ABOUT ABOUT ABOUT Democrat Tyrell \"Ty\" Hankerson represents a new generation of leadership in Southeast Queens. Born and raised in South Ozone Park, Ty has dedicated his entire life to public service, making accountability and transparency in government a top priority. Democrat Democrat Democrat Tyrell \"Ty\" Hankerson Tyrell \"Ty\" Hankerson Tyrell \"Ty\" Hankerson represents a new generation of leadership in Southeast Queens. Born and raised in South Ozone Park, Ty has dedicated his entire life to public service, making accountability and transparency in government a top priority. represents a new generation of leadership in Southeast Queens. Born and raised in South Ozone Park, Ty has dedicated his entire life to public service, making accountability and transparency in government a top priority. ​ ​ ​ ​ ​ ​ From his early days in the 106th Precinct Law Enforcement Explorers Program to organizing the historic Code Black protest that gained national attention, Ty has consistently shown what engaged leadership looks like. ​ ​ From his early days in the 106th Precinct Law Enforcement Explorers Program to organizing the historic Code Black protest that gained national attention, Ty has consistently shown what engaged leadership looks like. ​ ​ From his early days in the 106th Precinct Law Enforcement Explorers Program to organizing the historic Code Black protest that gained national attention, Ty has consistently shown what engaged leadership looks like. ​ ​ ​ Currently as"
  },
  {
    "candidate": "Hankerson, Tyrell D",
    "category": "bio",
    "score": null,
    "link": "https://www.tyhankerson.com/",
    "text": "Chief of Staff to NYC Council Speaker Adrienne Adams , Ty has been at the forefront of delivering vital resources for our community. ​ From expanded access to youth and senior services to improved educational facilities and infrastructure investments, Ty's extensive, hands-on experience in city government has proven essential in getting things done for Southeast Queens families. Currently as Chief of Staff to NYC Council Speaker Adrienne Adams , Ty has been at the forefront of delivering vital resources for our community. Currently as Chief of Staff to NYC Council Speaker Adrienne Adams , Ty has been at the forefront of delivering vital resources for our community. Chief of Staff to NYC Council Speaker Adrienne Adams ​ ​ ​ From expanded access to youth and senior services to improved educational facilities and infrastructure investments, Ty's extensive, hands-on experience in city government has proven essential in getting things done for Southeast Queens families. From expanded access to youth and senior services to improved educational facilities and infrastructure investments, Ty's extensive, hands-on experience in city government has proven essential in getting things done for Southeast Queens families. ​ ​ ​ ​ ​ ​ ​ ​ Now, Ty is running to represent District 28 in the New York City Council. Join our campaign to build a stronger, safer and more prosperous Southeast Queens that works for all of us. ​ ​ ​ ​ ​ ​ Now, Ty is running to represent District 28 in the New York City Council. Join our campaign to build a stronger, safer and more prosperous Southeast Queens that works for all of us. Now, Ty is running to represent District 28 in the New York City Council. Join our campaign to build a stronger, safer and more prosperous Southeast Queens that works for all of us. Be Part of the Movement. Be Part of the Movement. Be Part of the Movement. Be Part of the Movement. Be Part of the Movement. Be Part of the Movement. DONATE DONATE VOLUNTEER VOLUNTEER ON THE ISSUES ON THE ISSUES ON THE ISSUES ON THE ISSUES ON THE ISSUES ON THE ISSUES Building a Stronger, More Unified District 28 for All. Building a Stronger, More Unified District 28 for All. Building a Stronger, More Unified District 28 for All. Building a Stronger, More Unified District 28 for All. Building a Stronger, More Unified District 28 for All. Building a Stronger, More Unified District 28 for All. Ty Hankerson has seen firsthand how City Hall really works—and where it fails our communities. As Chief of Staff to the Council Speaker, he's navigated the system to deliver resources while fighting against the bureaucratic roadblocks that hold our neighborhoods back. Ty Hankerson has seen firsthand how City Hall really works—and where it fails our communities. As Chief of Staff to the Council Speaker, he's navigated the system to deliver resources while fighting against the bureaucratic roadblocks that hold our neighborhoods back. Ty Hankerson has seen firsthand how City Hall really works—and where it fails our communities. As Chief of Staff to the Council Speaker, he's navigated the system to deliver resources while fighting against the bureaucratic roadblocks that hold our neighborhoods back. Ty Hankerson has seen firsthand how City Hall really works—and where it fails our communities. ​ ​ ​ Ty is running for City Council to use this unique perspective to deliver affordable housing, safer streets, quality education, expanded senior services, and improved infrastructure to every corner of District 28 . Ty is running for City Council to use this unique perspective to deliver affordable housing, safer streets, quality education, expanded senior services, and improved infrastructure to every corner of District 28 . Ty is running for City Council to use this unique perspective to deliver affordable housing, safer streets, quality education, expanded senior services, and improved infrastructure to every corner of District 28 . Ty is running for City Council to use this unique perspective to deliver affordable housing, safer streets, quality education, expanded senior services, and improved infrastructure to every corner of District 28 to use this unique perspective to deliver and to every corner of District 28 . ​ ​ ​ ​ ​ ​ ​ ​ SEE TY'S PLAN SEE TY'S PLAN Keep Southeast Queens Affordable Keep Southeast Queens Affordable Keep Southeast Queens Affordable Keep Southeast Queens Affordable Keep Southeast Queens Affordable Keep Southeast Queens Affordable SEE TY'S PLAN SEE TY'S PLAN Make Our Streets Safer and Government Accountable Make Our Streets Safer and Government Accountable Make Our Streets Safer and"
  },
  {
    "candidate": "Hankerson, Tyrell D",
    "category": "bio",
    "score": null,
    "link": "https://www.tyhankerson.com/",
    "text": "Government Accountable Make Our Streets Safer and Government Accountable Make Our Streets Safer and Government Accountable Make Our Streets Safer and Government Accountable SEE TY'S PLAN SEE TY'S PLAN Expand Services for Our Seniors Expand Services for Our Seniors Expand Services for Our Seniors Expand Services for Our Seniors Expand Services for Our Seniors Expand Services for Our Seniors SEE TY'S PLAN SEE TY'S PLAN Deliver Quality Education and Youth Programs Deliver Quality Education and Youth Programs Deliver Quality Education and Youth Programs Deliver Quality Education and Youth Programs Deliver Quality Education and Youth Programs Deliver Quality Education and Youth Programs SEE TY'S PLAN SEE TY'S PLAN Fix What's Broken, Build What's Next Fix What's Broken, Build What's Next Fix What's Broken, Build What's Next Fix What's Broken, Build What's Next Fix What's Broken, Build What's Next Fix What's Broken, Build What's Next SEE TY'S PLAN SEE TY'S PLAN STAY UPDATED STAY UPDATED STAY UPDATED STAY UPDATED STAY UPDATED STAY UPDATED Sign up to get updates from the campaign. Sign up to get updates from the campaign. Sign up to get updates from the campaign. Sign up to get updates from the campaign. * * Submit Thank you for your Support Thank you for your Support Thank you for your Support Thank you for your Support Thank you for your Support Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council Every donation helps get us closer to sending Ty to the New York City Council $28 $50 $250 Other Thank you for your Support Thank you for your Support Thank you for your Support Chip in today and support Sharifa for Civil Court Judge campaign Chip in today and support Sharifa for Civil Court Judge campaign Chip in today and support Sharifa for Civil Court Judge campaign Chip in today and support Sharifa for Civil Court Judge campaign Chip in today $100 $100 $250 $250 $500 $500 OTHER OTHER Home Home About About Volunteer Volunteer Donate Donate PAID FOR BY TYRELL HANKERSON / TY FOR NYC PAID FOR BY TYRELL HANKERSON / TY FOR NYC PAID FOR BY TYRELL HANKERSON / TY FOR NYC PAID FOR BY TYRELL HANKERSON / TY FOR NYC Designed by Connective Strategies Designed by Connective Strategies Designed by Connective Strategies Designed by Connective Strategies Designed by Connective Strategies Connective Strategies Connective Strategies Connective Strategies Donate By Mail Donate By Mail Donate By Mail Donate By Mail Donate By Mail Donate By Mail Donate By Mail To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: To contribute via personal check, please mail a check payable to “ Ty For NYC ” with the form below and send to: Ty For NYC Ty For NYC Ty For NYC Ty For NYC Ty For NYC Ty For NYC Ty For NYC Ty For NYC 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C 163-29 130 Avenue, 7C Jamaica, NY 11436 ​ ​ Jamaica, NY 11436 Jamaica, NY 11436 Jamaica, NY 11436 Jamaica, NY 11436 Jamaica, NY 11436 Jamaica, NY 11436"
  },
  {
    "candidate": "Hankerson, Tyrell D",
    "category": "bio",
    "score": null,
    "link": "https://www.tyhankerson.com/",
    "text": "​ ​ ​ ​ ​ ​ ​ ​ DONATE BY MAIL FORM DONATE BY MAIL FORM Get In touch: Get In touch: Get In touch: Get In touch: Get In touch: Get In touch: Get In touch: (646) 354-9573 (646) 354-9573 (646) 354-9573 (646) 354-9573 (646) 354-9573 (646) 354-9573 (646) 354-9573 info@tyhankerson.com info@tyhankerson.com info@tyhankerson.com info@tyhankerson.com info@tyhankerson.com info@tyhankerson.com info@tyhankerson.com Privacy Policy I Accessibility Privacy Policy I Accessibility Privacy Policy I Accessibility Privacy Policy I Accessibility Privacy Policy I Accessibility Privacy Policy Accessibility bottom of page"
  }
]