[
  {
    "candidate": "Haque, Shah S",
    "category": "bio",
    "score": null,
    "link": "https://www.shahfornyc.com/",
    "text": "top of page DONATE VISION VISION ABOUT ABOUT GET INVOLVED GET INVOLVED SHAH HAQUE REPUBLICAN FOR NEW YORK CITY COUNCIL DISTRICT 25 REPUBLICAN FOR NEW YORK CITY COUNCIL DISTRICT 25 VISION & PRIORITIES VISION & PRIORITIES 01 01 SAFE SAFE NEIGHBORHOODS NEIGHBORHOODS Combat rising crime to restore safety and peace of mind in our communities. 02 RESPONSIBLE IMMIGRATION Revitalize our local economy by supporting small businesses and cutting red tape. 03 03 ECONOMIC REVIVAL Revitalize our local economy by supporting small businesses and cutting red tape. 04 04 TAX RELIEF Lower taxes to alleviate the financial burden on families and stimulate economic growth. 05 05 LAW & ORDER Uphold the rule of law to ensure justice, safety, and a thriving community. MEET SHAH MEET SHAH Shah Shahidul Haque is a dedicated human rights activist and the founder of World Human Rights Development USA. For over 30 years, he has been a steadfast advocate for immigrant rights in New York City, working tirelessly to support and empower immigrant communities. Since migrating to the United States in 1985, Shah has immersed himself in voluntary activities that promote social justice and equality. ​ ​ Throughout his extensive career in community activism, Shah has collaborated with local leaders and community organizations to advance the well-being of his constituents. He has been instrumental in helping small businesses navigate challenges, providing them with the support they need to thrive. Additionally, Shah has focused on delivering relief to underserved populations in local communities, ensuring that resources and opportunities are accessible to all. His efforts reflect a deep commitment to addressing critical social issues and advocating for those who are often overlooked. ​ ​ Now, bringing his passion and experience to the forefront, Shah Shahidul Haque is bidding for office to represent New York City Council District 25. His campaign is rooted in the values he has championed throughout his life—human rights, community empowerment, and social justice. Shah aims to leverage his decades of activism to address pressing concerns such as public safety, responsible immigration, and support for small businesses. He is committed to being a voice for all residents, ensuring that the community's needs are met with integrity and dedication. THE BEST WAY TO PREDICT THE FUTURE IS TO CREATE IT GET INVOLVED AND IMPACT OUR CAMPAIGN JOIN TEAM SHAH JOIN TEAM SHAH JOIN TEAM SHAH * * * SUBMIT WE'RE GRATEFUL FOR YOUR SUPPORT! WE'RE GRATEFUL FOR YOUR SUPPORT! Shah needs your support! Contribute now to help make his vision a reality and our community a better place. Shah needs your support! Contribute now to help make his vision a reality and our community a better place. $25 $50 $50 $100 $100 $175 $175 DONATE VISION VISION ABOUT ABOUT GET INVOLVED GET INVOLVED X INSTAGRAM FACEBOOK ​ ​ © 2024 by Shah for NYC © 2024 by Shah for NYC VISION VISION ABOUT ABOUT GET INVOLVED GET INVOLVED ALEN BLANCO HARNANDEZ 2035 bottom of page"
  }
]