[
  {
    "candidate": "Harrison, Linda T",
    "category": "bio",
    "score": null,
    "link": "https://hsph.harvard.edu/profile/linda-harrison/",
    "text": "Search Search Search Close search bar Harvard T.H. Chan School of Public Health Degrees & Programs Admissions Faculty & Research Open Search Bar Open Primary Navigation Degrees & Programs Degrees & Programs Degree Program Finder Master’s Degrees Doctoral Degrees Joint and Combined Degrees Interdisciplinary Concentrations Executive and Continuing Education Fellowships and Special Programs Undergraduate and High School Programs Degrees & Programs Degree Program Finder Master’s Degrees Doctoral Degrees Joint and Combined Degrees Interdisciplinary Concentrations Master’s Degrees Doctoral Degrees Joint and Combined Degrees Interdisciplinary Concentrations Executive and Continuing Education Fellowships and Special Programs Undergraduate and High School Programs Admissions Admissions Applying to a Degree Program Tuition and Financial Aid Why Harvard Chan? Upcoming Admissions Events and Webinars Policies and Disclosures Admissions Applying to a Degree Program Tuition and Financial Aid Why Harvard Chan? Upcoming Admissions Events and Webinars Policies and Disclosures Faculty & Research Faculty & Research Faculty and Researcher Profiles Academic Departments Research Centers, Institutes, and Labs Resources for Researchers Faculty & Research Faculty and Researcher Profiles Academic Departments Research Centers, Institutes, and Labs Resources for Researchers News & Events News Newsletters For the Media Events Topics The Studio HPH Magazine News Newsletters For the Media Newsletters For the Media Events Topics The Studio HPH Magazine Student Life Student Life Community Student Resources Career Development Life in Boston Housing Student Organizations and Opportunities International Student Experience Graduation Orientation Student Life Community Student Resources Career Development Life in Boston Housing Student Organizations and Opportunities International Student Experience Graduation Orientation Alumni & Friends Alumni & Friends Get Involved Impact Events Alumni Hub Support Harvard Chan School Alumni & Friends Get Involved Impact Events Alumni Hub Support Harvard Chan School Who We Are Mission and Vision The Harvard Chan Principles of Citizenship Research Impact Diversity and Inclusion Initiatives Leadership Philanthropic Impact Location and Facilities Facts and Figures History Contact Mission and Vision The Harvard Chan Principles of Citizenship The Harvard Chan Principles of Citizenship Research Impact Diversity and Inclusion Initiatives Leadership Philanthropic Impact Location and Facilities Facts and Figures History Contact Home Home Faculty and Researcher Profiles Faculty and Researcher Profiles Linda Harrison Linda Harrison Research Scientists Linda Harrison Research Scientist Biostatistics, Harvard T.H. Chan School of Public Health Departments Department of Biostatistics Jump to Section Related Links github bibliography STATtr@k:masterstoPhD Biography Linda's Catalyst Profile Education and Training MMATH, Mathematics University of Oxford MSc, Medical Statistics London School of Hygiene and Tropical Medicine PhD, Biostatistics Harvard Graduate School of Arts and Sciences Publications An evaluation of confidence intervals for a cumulative proportion to enable decisions at interim reviews of single-arm trials. Weir IR, Harrison LJ. Contemp Clin Trials 2024 03 PMID: 38253253 An evaluation of confidence intervals for a cumulative proportion to enable decisions at interim reviews of single-arm trials. Weir IR, Harrison LJ. Contemp Clin Trials 2024 03 PMID: 38253253 Readability and beyond - Health literacy and numeracy and COVID-19 communications in early childhood education: Are we communicating effectively? Dahm MR, Bull R, Sadow L, Tran D, Zurynski Y, Amin J, Hadley F, Harrison LJ, Waniganayake M, Wong S, Degotardi S. Patient Educ Couns 2023 09 PMID: 37270932 Readability and beyond - Health literacy and numeracy and COVID-19 communications in early childhood education: Are we communicating effectively? Dahm MR, Bull R, Sadow L, Tran D, Zurynski Y, Amin J, Hadley F, Harrison LJ, Waniganayake M, Wong S, Degotardi S. Patient Educ Couns 2023 09 PMID: 37270932 Macro-structural predictors of Australian family day care quality. Char V, Harrison LJ, Li H. Front Public Health 2025 PMID: 37275487 Macro-structural predictors of Australian family day care quality. Char V, Harrison LJ, Li H. Front Public Health 2025 PMID: 37275487 Sample size calculation for randomized trials via inverse probability of response weighting when outcome data are missing at random. Harrison LJ, Wang R. Stat Med 2023 05 20 PMID: 36880120 Sample size calculation for randomized trials via inverse probability of response weighting when outcome data are missing at random. Harrison LJ, Wang R. Stat Med 2023 05 20 PMID: 36880120 Nasal and Plasma Severe Acute Respiratory Syndrome Coronavirus 2 RNA Levels Are Associated With Timing of Symptom Resolution in the ACTIV-2 Trial of Nonhospitalized Adults With Coronavirus Disease 2019. Li Y, Harrison LJ, Chew KW, Currier JS, Wohl DA, Daar ES, Evering TH, Wu R, Giganti M, Ritz J, Javan AC, Coombs RW, Moser C, Hughes MD, Eron JJ, Smith DM, Li JZ. Clin Infect Dis 2023 02 18 PMID: 36210483 Nasal and Plasma Severe Acute Respiratory Syndrome Coronavirus 2 RNA Levels Are Associated With Timing"
  },
  {
    "candidate": "Harrison, Linda T",
    "category": "bio",
    "score": null,
    "link": "https://hsph.harvard.edu/profile/linda-harrison/",
    "text": "of Symptom Resolution in the ACTIV-2 Trial of Nonhospitalized Adults With Coronavirus Disease 2019. Li Y, Harrison LJ, Chew KW, Currier JS, Wohl DA, Daar ES, Evering TH, Wu R, Giganti M, Ritz J, Javan AC, Coombs RW, Moser C, Hughes MD, Eron JJ, Smith DM, Li JZ. Clin Infect Dis 2023 02 18 PMID: 36210483 View more publications Unleash your potential at Harvard Chan School. In addition to our degree programs, we offer highly targeted executive and continuing education, directed and taught by Harvard faculty. Harvard T.H. Chan School of Public Health Administrative Offices Public Health Resources Jobs my.harvard Intranet Make a Gift Contact Report Issue / Leave Feedback Accessibility Digital Accessibility Privacy Statement Nondiscrimination Policy Report Copyright Infringement Report Security Issue Trademark Notice Public health insights in your inbox. Stay connected with newsletters on climate, nutrition, communication — and the latest from Harvard Chan School. youtube youtube linkedin linkedin instagram instagram tiktok tiktok threads threads"
  },
  {
    "candidate": "Harrison, Linda T",
    "category": "bio",
    "score": null,
    "link": "https://wikibious.com/linda-harrison/",
    "text": "Menu Menu Home Actor Actress Biography Youtuber Linda Harrison Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts 05/18/2024 by Anne Tyler Linda Harrison is a Miss America finalist, former Miss Maryland since 1965, and an international award-winning actress, producer and director. After playing Nova in the sci-fi classic Planet of the Apes, Linda Harrison became a household name. What is Linda Harrison’s net worth? Salary, Earnings As an actress, Linda Harrison earns a lot of money that she can use to support herself. Her current net worth is estimated to be $1 million. Additionally, she earns between $19,564 and $207,748 per year in the United States. Where was Linda Harrison born? Ethnicity, Nationality, Family, Education In Berlin, Maryland, Linda Harrison was born on July 26, 1945. She is currently 78 years old and a US citizen. Her parents, Anglo-Americans Isaac Burbage Harrison and Ida Virginia Melson, gave birth to her 74 years ago. Her mother worked as a beautician and her father owned a daycare center. He had played with her two older sisters, Kay and Gloria, as well as her two younger sisters, Jane and Josh, during her youth. Fast facts Full name: Birthdate: Age: Horoscope: Lucky number: Lucky stone: Lucky color: Best partner for marriage: Gender: Profession: Country: Height: Civil status: Divorce Heritage Salary eye color Hair color place of birth Nationality Ethnicity Father Mother Siblings Children IMDB wiki Linda Harrison June 26, 1945 78 years Cancer 6 Moonstone Silver Taurus, Pisces, Scorpio Female Actress, Director USA 5 ft 5 in (1.65 m) single Richard Zanuck $1 million $19,564 – $207,748 US Light Brunette Berlin, Maryland American Anglo-American Harrison Burbage Ida Virginia Melson Four (Kay, Gloria, Jane and Josh) Two (Harrison Zanuck and Dean Zanuck) IMDB wiki How did Linda Harrison begin her professional career? At the post-premiere reception, Linda Harrison met producer Richard D. Zanuck, with whom she later signed the typical seven-year contract with Fox. Even the studio’s Talent Training School had accepted her. Films He had his film debut with The Fat Spy. She starred in the 1996 film Way. Among other films, Way Out, A Married Man’s Guide, Planet of the Apes as Nova, Below the Planet of the Apes and Airport 1975. He is currently working on Midnight Massacre, Planet of the Apes and Don’t Say No Until I Finish Talking: Richard D. Zanuck’s Story. Televised programs He played Biker Chick in Men Against Evil that same year (1996). Who’s afraid of Diana Prince? Batman and other television shows have featured her in the past. Bracken’s World and The Tonight Show Starring Johnny Carson. He also made his television debut in Switch, Behind the Planet of the Apes, Barnaby Jones and Inside Edition. Co-director and co-producer She contributed as co-director and executive producer on the 2014-2015 film Midnight Massacre. She also created the documentary Behind the Planet of the Apes, which details the making of the first five Planet of the Apes films in 1998. Linda Harrison’s Achievements She has won several honors, including Miss Maryland, the International Fantastic Film Festival of Catalonia, the Honorary Mary, and runner-up in the Miss America contest in 1965. As an actress, she earns a lot of money that she could use to support herself. Her current net worth is estimated to be $1 million. Additionally, she earns between $19,564 and $207,748 per year in the United States. Is Linda Harrison single? Relationship Linda Harrison is a single woman with no children. She is single at the moment. She is simply concentrating on her profession and giving herself more time. On the other hand, she assumes the identity of Nonnie, who is madly in love with Patty, while on set. Even now, she was beginning to question her own biological choices. Regarding her former union, she married American producer Richard D. Zanuck, whose credits include the films Driving Miss Daisy, Deep Impact and Cocoon. The lovebirds married on October 26, 1969. Harrison and Dean Zanuck, the couple’s two sons, are also theirs. Unfortunately, after nine years of marriage, they divorced on January 23, 1978. He rarely talks about his private life in the media or in public, and has not made any open statements about his relationships. She has also been able to keep it a secret. How tall is Linda Harrison? Weight, hair color Linda Harrison weighs 55 kilograms and is 5 feet 6 inches tall. She also has light eyes and beautiful brown hair. Quick Facts Real Name Update Soon Nick Name Update Soon"
  },
  {
    "candidate": "Harrison, Linda T",
    "category": "bio",
    "score": null,
    "link": "https://wikibious.com/linda-harrison/",
    "text": "Date of Birth Update Soon Age Update Soon Birth Place Update Soon Height (Tall) Update Soon Weight Update Soon Body Measurement Update Soon Net Worth (approx…) Update Soon Personal Life and Family Father Update Soon Mother Update Soon Sister Update Soon Brother Update Soon Marital Status Update Soon Husband (Spouse) Update Soon Boyfriend Update Soon Children Update Soon Hobbies Update Soon Smoking & Drinking Update Soon Father’s name is Not Available. We have no more Information about his Father; we will try to collect information and update soon. The mother’s name is Not Available. We have no more Information about his Father; we will try to collect information and update soon. Also, we have no idea about his brother and sister, and we don’t know their names either. But we are trying hard to collect all the information about him and will update you soon. His Girlfriend/boyfriend’s name is Not Available. They are in relation from previous few years of a strong relationship. We have no information about his girlfriend/boyfriend. But we are sure that it is not available and his spouse’s name is not available. Now, his relationship is perfect. We have no more information about his spouse. Also, we have no information about his son and daughter. We can’t say their name. If you know some information, please comment below. Education and Favorite Things Primary Education Update Soon College or University Update Soon Qualification Update Soon Favorite Sport Update Soon Favorite City/ Country Update Soon Daily Habits Work Time 10 AM to 8 PM Workout Time 8 AM to 9 AM Travel Update Soon Breakfast, Lunch & Dinner Update Soon Facebook, Instagram & Twitter Facebook Update Soon Instagram Update Soon Twitter Update Soon Net Worth The Estimated Net worth is $80K – USD $85k. Monthly Income/Salary (approx.) $80K – $85k USD Net Worth (approx.) $4 million- $6 million USD Categories People Tags Linda Harrison Nicole Collier Paggi Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts Al-Mang Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts Linda Harrison Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts 05/18/2024 by Anne Tyler Anne Tyler Anne Tyler Linda Harrison is a Miss America finalist, former Miss Maryland since 1965, and an international award-winning actress, producer and director. After playing Nova in the sci-fi classic Planet of the Apes, Linda Harrison became a household name. What is Linda Harrison’s net worth? Salary, Earnings As an actress, Linda Harrison earns a lot of money that she can use to support herself. Her current net worth is estimated to be $1 million. Additionally, she earns between $19,564 and $207,748 per year in the United States. Where was Linda Harrison born? Ethnicity, Nationality, Family, Education In Berlin, Maryland, Linda Harrison was born on July 26, 1945. She is currently 78 years old and a US citizen. Her parents, Anglo-Americans Isaac Burbage Harrison and Ida Virginia Melson, gave birth to her 74 years ago. Her mother worked as a beautician and her father owned a daycare center. He had played with her two older sisters, Kay and Gloria, as well as her two younger sisters, Jane and Josh, during her youth. Fast facts Full name: Birthdate: Age: Horoscope: Lucky number: Lucky stone: Lucky color: Best partner for marriage: Gender: Profession: Country: Height: Civil status: Divorce Heritage Salary eye color Hair color place of birth Nationality Ethnicity Father Mother Siblings Children IMDB wiki Linda Harrison June 26, 1945 78 years Cancer 6 Moonstone Silver Taurus, Pisces, Scorpio Female Actress, Director USA 5 ft 5 in (1.65 m) single Richard Zanuck $1 million $19,564 – $207,748 US Light Brunette Berlin, Maryland American Anglo-American Harrison Burbage Ida Virginia Melson Four (Kay, Gloria, Jane and Josh) Two (Harrison Zanuck and Dean Zanuck) IMDB wiki How did Linda Harrison begin her professional career? At the post-premiere reception, Linda Harrison met producer Richard D. Zanuck, with whom she later signed the typical seven-year contract with Fox. Even the studio’s Talent Training School had accepted her. Films He had his film debut with The Fat Spy. She starred in the 1996 film Way. Among other films, Way Out, A Married Man’s Guide, Planet of the Apes as Nova, Below the Planet of the Apes and Airport 1975. He is currently working on Midnight Massacre, Planet of the Apes and Don’t Say No Until I Finish Talking: Richard D. Zanuck’s Story. Televised programs He played Biker Chick in Men Against Evil that same year (1996). Who’s afraid of Diana Prince? Batman and other"
  },
  {
    "candidate": "Harrison, Linda T",
    "category": "bio",
    "score": null,
    "link": "https://wikibious.com/linda-harrison/",
    "text": "television shows have featured her in the past. Bracken’s World and The Tonight Show Starring Johnny Carson. He also made his television debut in Switch, Behind the Planet of the Apes, Barnaby Jones and Inside Edition. Co-director and co-producer She contributed as co-director and executive producer on the 2014-2015 film Midnight Massacre. She also created the documentary Behind the Planet of the Apes, which details the making of the first five Planet of the Apes films in 1998. Linda Harrison’s Achievements She has won several honors, including Miss Maryland, the International Fantastic Film Festival of Catalonia, the Honorary Mary, and runner-up in the Miss America contest in 1965. As an actress, she earns a lot of money that she could use to support herself. Her current net worth is estimated to be $1 million. Additionally, she earns between $19,564 and $207,748 per year in the United States. Is Linda Harrison single? Relationship Linda Harrison is a single woman with no children. She is single at the moment. She is simply concentrating on her profession and giving herself more time. On the other hand, she assumes the identity of Nonnie, who is madly in love with Patty, while on set. Even now, she was beginning to question her own biological choices. Regarding her former union, she married American producer Richard D. Zanuck, whose credits include the films Driving Miss Daisy, Deep Impact and Cocoon. The lovebirds married on October 26, 1969. Harrison and Dean Zanuck, the couple’s two sons, are also theirs. Unfortunately, after nine years of marriage, they divorced on January 23, 1978. He rarely talks about his private life in the media or in public, and has not made any open statements about his relationships. She has also been able to keep it a secret. How tall is Linda Harrison? Weight, hair color Linda Harrison weighs 55 kilograms and is 5 feet 6 inches tall. She also has light eyes and beautiful brown hair. Quick Facts Real Name Update Soon Nick Name Update Soon Date of Birth Update Soon Age Update Soon Birth Place Update Soon Height (Tall) Update Soon Weight Update Soon Body Measurement Update Soon Net Worth (approx…) Update Soon Personal Life and Family Father Update Soon Mother Update Soon Sister Update Soon Brother Update Soon Marital Status Update Soon Husband (Spouse) Update Soon Boyfriend Update Soon Children Update Soon Hobbies Update Soon Smoking & Drinking Update Soon Father’s name is Not Available. We have no more Information about his Father; we will try to collect information and update soon. The mother’s name is Not Available. We have no more Information about his Father; we will try to collect information and update soon. Also, we have no idea about his brother and sister, and we don’t know their names either. But we are trying hard to collect all the information about him and will update you soon. His Girlfriend/boyfriend’s name is Not Available. They are in relation from previous few years of a strong relationship. We have no information about his girlfriend/boyfriend. But we are sure that it is not available and his spouse’s name is not available. Now, his relationship is perfect. We have no more information about his spouse. Also, we have no information about his son and daughter. We can’t say their name. If you know some information, please comment below. Education and Favorite Things Primary Education Update Soon College or University Update Soon Qualification Update Soon Favorite Sport Update Soon Favorite City/ Country Update Soon Daily Habits Work Time 10 AM to 8 PM Workout Time 8 AM to 9 AM Travel Update Soon Breakfast, Lunch & Dinner Update Soon Facebook, Instagram & Twitter Facebook Update Soon Instagram Update Soon Twitter Update Soon Net Worth The Estimated Net worth is $80K – USD $85k. Monthly Income/Salary (approx.) $80K – $85k USD Net Worth (approx.) $4 million- $6 million USD Categories People Categories Tags Linda Harrison Tags Nicole Collier Paggi Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts Al-Mang Wikipedia, Biography, Age, Family, Height, Net Worth, Fast Facts © 2025 Wikibious"
  }
]