[
  {
    "candidate": "Harris, John R",
    "category": "bio",
    "score": null,
    "link": "https://supersabresociety.com/biography/john-harris/",
    "text": "Today in History – April 5, 1962 – 1962 Neil Armstrong takes X-15 to 54,600m Neil Armstrong and the X-15 by Bob van der Linden, Posted on Tue, July 23, 2019, Aeronautics Department, Smithsonian National Air and Space Museum “Released from duty in mid-1952, Armstrong returned to Purdue where he earned his degree in aeronautical engineering in 1955. His love of flight and engineering drew him to the National Advisory Read More » Today in History – April 5, 1962 – 1962 Neil Armstrong takes X-15 to 54,600m Neil Armstrong and the X-15 by Bob van der Linden, Posted on Tue, July 23, 2019, Aeronautics Department, Smithsonian National Air and Space Museum “Released from duty in mid-1952, Armstrong returned to Purdue where he earned his degree in aeronautical engineering in 1955. His love of flight and engineering drew him to the National Advisory Join The SSS Join The SSS Update My Bio Update My Bio Main Menu Home History About The SSS Headed West Biographies Today in F-100 History SSS Caterpillar Wall of Honor F-100 Information Friends of the Super Sabre N. American F-100 Super Sabre About The SSS Headed West Biographies Today in F-100 History SSS Caterpillar Wall of Honor F-100 Information Friends of the Super Sabre N. American F-100 Super Sabre Galleries The Intake About The Intake: Journal The Intake: Journal of the Super Sabre Society – Archives About The Intake: Journal The Intake: Journal of the Super Sabre Society – Archives What’s New Contact John R. Harris Home Home Biography Biography Biographies Biographies John R. Harris John R. Harris John R. Harris John R. Harris Preferred Name: Jack Nickname/Call Sign: Misty 10 Date of Birth: September 26, 1936 Highest Military Grade: Select Hometown: ME Headed West Date: March 11, 2017 Biography Pilot Information Headed West Album After flying as Misty 10 in Vietnam, Jack Harris flew the F-111 for 17 years, retired and flew for a small airline. Units Assigned 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, England/Ramstein; AB, German (F-100) 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, “Misty 10”, Woodbridge UK (F-100F) Pease AFB, NH/England (FB-111) Awards & Decorations Flight Info F-100 F FB-111 Military & Civilian Education Civilian Education: University of Bridgeport John R. Harris, Col USAF, Ret., “Headed West” on March 11, 2017. Sept 26, 1936-March 11, 2017 Kittery ], ME – Retired Col Jack Harris passed away on March 11, 2017. Even as a young man, Jack’s first love was flying. After graduation from the U of Bridgeport Jack joined the Air Force. He flew the F-100 in England, Germany and Vietnam. Later he flew the FB111 at Pease and a second tour in England. While in Vietnam Jack was an F100F Forward Air Controller call sign “Misty”10. Their missions were over North Vietnam. Bud Day was their first commander. Jack was also a member of the Super Sabre Society, dedicated to preserving the history of the F100. Jack is survived by his wife Alison, two children Matthew Harris and Lindsay Harris Shapleigh and two grandchildren; Michael Shapleigh age 3 and William Shapleigh age 1. Jack was a lover of sailing and skiing and will be greatly missed by his family. Services: A Memorial service [was] held on Saturday, April 22, 2017 at the First Congregational Church of Kittery Point, Pepperrell Road, Kittery Point, ME. Interment with full military honors will follow in the First Congregational Church of Kittery Point Cemetery. In lieu of flowers, memorial contributions may be made to St. Jude Children’s Research Hospital, 501 St Jude Place Memphis, TN 38105, ( https://shop.stjude.org/GiftCatalog/openSingleMonthlyDonationForm.do?sourceCode=IIQ160788777<=) or online at: https://shop.stjude.org/GiftCatalog/donation.do?cID=14262pD=24671&sc_icid=wtg-lz-donatenow. Album Slideshow Slideshow Click To View Wall of Honor Location John R. Harris After flying as Misty 10 in Vietnam, Jack Harris flew the F-111 for 17 years, retired and flew for a small airline. Units Assigned 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, England/Ramstein; AB, German (F-100) 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, “Misty 10”, Woodbridge UK (F-100F) Pease AFB, NH/England (FB-111) Awards & Decorations Flight Info F-100 F FB-111 Military & Civilian Education Civilian Education: University of Bridgeport Units Assigned 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, England/Ramstein; AB, German (F-100) 417th Tactical Fighter Squadron/5th Tactical Fighter Wing, “Misty 10”, Woodbridge UK (F-100F) Pease AFB, NH/England (FB-111) Awards & Decorations Flight Info F-100 F FB-111 Military & Civilian Education Civilian Education: University of Bridgeport John R. Harris, Col USAF, Ret., “Headed West” on March 11, 2017. Sept 26, 1936-March 11, 2017 Kittery ], ME – Retired Col Jack Harris passed away"
  },
  {
    "candidate": "Harris, John R",
    "category": "bio",
    "score": null,
    "link": "https://supersabresociety.com/biography/john-harris/",
    "text": "on March 11, 2017. Even as a young man, Jack’s first love was flying. After graduation from the U of Bridgeport Jack joined the Air Force. He flew the F-100 in England, Germany and Vietnam. Later he flew the FB111 at Pease and a second tour in England. While in Vietnam Jack was an F100F Forward Air Controller call sign “Misty”10. Their missions were over North Vietnam. Bud Day was their first commander. Jack was also a member of the Super Sabre Society, dedicated to preserving the history of the F100. Jack is survived by his wife Alison, two children Matthew Harris and Lindsay Harris Shapleigh and two grandchildren; Michael Shapleigh age 3 and William Shapleigh age 1. Jack was a lover of sailing and skiing and will be greatly missed by his family. Services: A Memorial service [was] held on Saturday, April 22, 2017 at the First Congregational Church of Kittery Point, Pepperrell Road, Kittery Point, ME. Interment with full military honors will follow in the First Congregational Church of Kittery Point Cemetery. In lieu of flowers, memorial contributions may be made to St. Jude Children’s Research Hospital, 501 St Jude Place Memphis, TN 38105, ( https://shop.stjude.org/GiftCatalog/openSingleMonthlyDonationForm.do?sourceCode=IIQ160788777<=) or online at: https://shop.stjude.org/GiftCatalog/donation.do?cID=14262pD=24671&sc_icid=wtg-lz-donatenow. Album Slideshow Slideshow Click To View Click To View Wall of Honor Location Wall of Honor Location Our Mission The mission of the Super Sabre Society is to preserve the history of the F-100 Super Sabre and the men who flew the aircraft. Follow Us Super Sabre Society Scroll to Top"
  }
]