[
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Henry_Cecil_Leon",
    "text": "Main menu Main page Main page Contents Contents Current events Current events Random article Random article About Wikipedia About Wikipedia Contact us Contact us Help Help Learn to edit Learn to edit Community portal Community portal Recent changes Recent changes Upload file Upload file Special pages Special pages Search Appearance Donate Donate Create account Create account Log in Log in Personal tools Donate Donate Create account Create account Log in Log in learn more Contributions Contributions Talk Talk Contents (Top) 1 Biography 1 Biography 2 Works Toggle Works subsection 2.1 Novels 2.2 Short story collections 2.3 Non-fiction 2 Works Toggle Works subsection 2.1 Novels 2.1 Novels 2.2 Short story collections 2.2 Short story collections 2.3 Non-fiction 2.3 Non-fiction 3 See also 3 See also 4 References 4 References 5 External links 5 External links Toggle the table of contents Henry Cecil Leon Henry Cecil Leon 2 languages Français Français مصرى مصرى Edit links Article Article Talk Talk English Read Read Edit Edit View history View history Tools Read Read Edit Edit View history View history What links here What links here Related changes Related changes Upload file Upload file Permanent link Permanent link Page information Page information Cite this page Cite this page Get shortened URL Get shortened URL Download QR code Download QR code Download as PDF Download as PDF Printable version Printable version Wikidata item Wikidata item Henry Cecil Leon ( 1902-09-19 ) 19 September 1902 London , England ( 1902-09-19 ) 1902-09-19 London , England 23 May 1976 (1976-05-23) (aged 73) (1976-05-23) St Paul's School, London King's College, Cambridge Barrister, judge & writer Barrister, judge & writer Military career United Kingdom British Army 1939–1945 Queen's Royal Regiment (West Surrey) World War II MC Henry Cecil Leon , MC (19 September 1902 – 23 May 1976), who wrote under the pen-names Henry Cecil and Clifford Maxwell , was British barrister, judge, and a writer of fiction about the British legal system . Biography [ edit ] [ edit ] He was born near London in 1902 and was educated at St Paul's School and King's College, Cambridge . He was called to the bar in 1923. During the Second World War, he served in the 1/5th Battalion, Queen's Royal Regiment (West Surrey) , and received the Military Cross in 1944. In 1949, he was appointed a county court judge , a position he held until 1967. He used these experiences as inspiration for his work. His books typically feature educated and genteel fraudsters and blackmailers who lay ludicrously ingenious plots exploiting loopholes in the legal system. There are several recurring characters, such as the drunken solicitor Mr Tewkesbury and the convoluted and exasperating witness Colonel Brain. He writes well about the judicial process, usually through the eyes of a young barrister but sometimes from the viewpoint of the judge; Friends at Court contains a memorable snub from a county court judge to a barrister who is trying to patronise him. Cecil did not believe that judges should be too remote from the public: in Sober as a Judge , a High Court judge , in a case where the ingredients of a martini are of some importance, states drily that he will ignore the convention by which he should inquire \"what is a martini?\" and instead gives the recipe for the cocktail himself. His 1955 novel Brothers in Law was made into a film in 1957 and, later, a television and radio series starring Richard Briers . While at Paramount Pictures , Alfred Hitchcock worked on adapting No Bail for the Judge for the screen several times between 1954 and 1960, and hoped to co-star Audrey Hepburn , Laurence Harvey , and John Williams , but the film was never produced. As Henry Cecil, he appeared as a castaway on the BBC Radio programme Desert Island Discs on 8 July 1972. [ 1 ] The programme was not archived by the BBC, but an unofficial tape copy was among a collection of over 90 episodes discovered by an amateur researcher and placed online in 2022. [ 2 ] [ ] [ ] He also reviewed the Rowland case in the Celebrated Trials series published by David & Charles in 1975. The 1946 trial of Walter Rowland was for the murder of Olive Balchin , who had been found battered to death on a bomb site on Deansgate , Manchester. A hammer had been found near the body, and the police identified Rowland with three witnesses. He protested his"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Henry_Cecil_Leon",
    "text": "innocence from the dock and afterwards. He was found guilty and hanged at Strangeways Prison in 1947. Another man confessed to the killing, but his evidence was ignored when the original judgment was reviewed by the Court of Criminal Appeal . Cecil concludes in his book that Rowland was indeed guilty. Works [ edit ] [ edit ] Novels [ edit ] [ edit ] The Painswick Line (1951) No Bail for the Judge (1952) Ways and Means (1952) Natural Causes (1953) According to the Evidence (1954) Brothers in Law (1955) Friends at Court (1956) Much in Evidence (1957) (US title: The Long Arm ) Sober as a Judge (1958) Settled Out of Court (1959) I Married the Girl (1960, as Clifford Maxwell) Alibi for a Judge (1960) Daughters in Law (1961) Unlawful Occasions (1962) Independent Witness (1963) Fathers in Law (1965) (US title: A Child Divided ) The Asking Price (1966) A Woman Named Anne (1967) No Fear or Favour (1968) (US title: The Blackmailers ) Tell You What I'll Do (1969) The Buttercup Spell (1971) The Wanted Man (1972) Truth With Her Boots On (1974) Cross Purposes (1976) Hunt the Slipper (1977) Short story collections [ edit ] [ edit ] Full Circle (1948) Portrait of a Judge (1964) Brief Tales from the Bench (1968) Non-fiction [ edit ] [ edit ] Brief to Counsel (1958) Not Such an Ass (1961) Tipping the Scales (1964) Know About English Law (1965) A Matter of Speculation: the Case of Lord Cochrane (1965) The English Judge (1970) Just Within the Law (1975) (autobiography) See also [ edit ] [ edit ] List of unproduced Hitchcock projects References [ edit ] [ edit ] ^ \"Desert Island Discs - Castaway : Henry Cecil\" . BBC Online . BBC . Retrieved 13 October 2022 . ^ \"Desert Island Discs - Castaway : Henry Cecil\" . BBC Online . BBC . Retrieved 13 October 2022 . . Retrieved 13 October 2022 13 October ^ \"BBC Radio 4 - Desert Island Discs - A full list of the rescued episodes of Desert Island Discs\" . BBC . Retrieved 13 October 2022 . ^ \"BBC Radio 4 - Desert Island Discs - A full list of the rescued episodes of Desert Island Discs\" . BBC . Retrieved 13 October 2022 . . Retrieved 13 October 2022 13 October External links [ edit ] [ edit ] List of some of his works Biography and list of works Henry Cecil Leon at IMDb ISNI VIAF FAST WorldCat ISNI ISNI VIAF VIAF FAST FAST WorldCat WorldCat Germany United States France BnF data Japan Australia Czech Republic Netherlands Sweden Israel Catalonia Germany Germany United States United States France France BnF data BnF data Japan Japan Australia Australia Czech Republic Czech Republic Netherlands Netherlands Sweden Sweden Israel Israel Catalonia Catalonia FID FID FID Trove Deutsche Biographie Trove Trove Deutsche Biographie Deutsche Biographie IdRef SNAC IdRef IdRef SNAC SNAC 1902 births 1976 deaths 20th-century English judges 20th-century English novelists 20th-century English male writers English male novelists County Court judges (England and Wales) Queen's Royal Regiment officers Recipients of the Military Cross People educated at St Paul's School, London Alumni of King's College, Cambridge Military personnel from London Articles with short description Short description is different from Wikidata Use dmy dates from October 2021 Use British English from May 2012 Pages using infobox military person with embed Articles with hCards This page was last edited on 12 May 2025, at 06:56 (UTC) . (UTC) Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Toggle the table of contents Henry Cecil Leon 2 languages Add topic"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://horseracinghof.com/hall-of-famers/sir-henry-cecil/",
    "text": "About Hall of Famers History Meet The Panel Features Voting About Hall of Famers History Meet The Panel Voting Features Sir Henry Cecil Sir Henry Cecil was one of the most successful and much-loved trainers of the past century and today we announce his posthumous induction into the QIPCO British Champions Series Hall of Fame. Sir Henry Cecil was one of the most successful and much-loved trainers of the past century and today we announce his posthumous induction into the QIPCO British Champions Series Hall of Fame. Sir Henry Cecil was one of the most successful and much-loved trainers of the past century and today we announce his posthumous induction into the QIPCO British Champions Series Hall of Fame. It was ten years ago this week (October 2012) that the late, great Cecil acclaimed his most celebrated masterpiece, Frankel, as possibly the greatest racehorse there has ever been, after the magnificent colt had signed off his flawless 14-race career with victory in the QIPCO Champion Stakes on QIPCO British Champions Day at Ascot. “He’s the best I’ve ever had, the best I’ve ever seen,” he said. “I’d be very surprised if there’s ever been anything better.” It was ten years ago this week (October 2012) that the late, great Cecil acclaimed his most celebrated masterpiece, Frankel, as possibly the greatest racehorse there has ever been, after the magnificent colt had signed off his flawless 14-race career with victory in the QIPCO Champion Stakes on QIPCO British Champions Day at Ascot. “He’s the best I’ve ever had, the best I’ve ever seen,” he said. “I’d be very surprised if there’s ever been anything better.” Emotions ran high as the ten-time Champion Trainer, who had been battling cancer for several years, greeted his unbeaten superstar in front of Her Majesty The Queen and a sell-out crowd. Frankel was his crowning glory and enriched the lives of all racing fans, as he still does today via his prolific exploits as a stallion. Emotions ran high as the ten-time Champion Trainer, who had been battling cancer for several years, greeted his unbeaten superstar in front of Her Majesty The Queen and a sell-out crowd. Frankel was his crowning glory and enriched the lives of all racing fans, as he still does today via his prolific exploits as a stallion. Frankel’s dazzling haul of Group 1 wins – the Dewhurst, QIPCO 2000 Guineas, St James’s Palace Stakes, Sussex Stakes (twice), Queen Elizabeth II Stakes, Lockinge, Queen Anne, Juddmonte International and QIPCO Champion Stakes – were something to behold, with the ailing Cecil suggesting his penultimate scintillating success, at York, had made him feel 20 years younger. Frankel’s dazzling haul of Group 1 wins – the Dewhurst, QIPCO 2000 Guineas, St James’s Palace Stakes, Sussex Stakes (twice), Queen Elizabeth II Stakes, Lockinge, Queen Anne, Juddmonte International and QIPCO Champion Stakes – were something to behold, with the ailing Cecil suggesting his penultimate scintillating success, at York, had made him feel 20 years younger. Frankel was all heart when winning his final race on QIPCO British Champions Day Would the exuberant bay, owned by the late Prince Khalid Abdullah, have scaled such heights had he been trained by someone else? We will never know for sure, of course, but what we can be certain of is that Cecil, who had nurtured so many other aces before him, was the perfect tutor. Would the exuberant bay, owned by the late Prince Khalid Abdullah, have scaled such heights had he been trained by someone else? We will never know for sure, of course, but what we can be certain of is that Cecil, who had nurtured so many other aces before him, was the perfect tutor. Eight months after Frankel’s final flourish, Cecil himself slipped away. His death, at the age of 70, just days before his beloved Royal Ascot, triggered an outpouring of adoration around the globe. Eight months after Frankel’s final flourish, Cecil himself slipped away. His death, at the age of 70, just days before his beloved Royal Ascot, triggered an outpouring of adoration around the globe. The sport’s followers had long revered him, and not just for the way he guided the careers of numerous household names from Warren Place in Newmarket. Cecil was charming, sensitive, playful and eccentric rolled into one, not to mention unfailingly modest and polite. He had a flamboyant dress sense, with his quirks and one-liners adding to his theatrical manner. In his final years, he also showed tremendous courage and"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://horseracinghof.com/hall-of-famers/sir-henry-cecil/",
    "text": "determination in fighting his illness. The sport’s followers had long revered him, and not just for the way he guided the careers of numerous household names from Warren Place in Newmarket. Cecil was charming, sensitive, playful and eccentric rolled into one, not to mention unfailingly modest and polite. He had a flamboyant dress sense, with his quirks and one-liners adding to his theatrical manner. In his final years, he also showed tremendous courage and determination in fighting his illness. He was not prone to hyperbole, even after training 25 British Classic winners, but a clue when he had a good thoroughbred on his hands would be when he walked away from the press pack, only to sometimes return and add another detail about him or her. He was not prone to hyperbole, even after training 25 British Classic winners, but a clue when he had a good thoroughbred on his hands would be when he walked away from the press pack, only to sometimes return and add another detail about him or her. Cecil was born in Aberdeen and had a twin brother, David, plus two older brothers. Their mother, Rohays, was the daughter of a baronet, while their father, also Henry, was the younger brother of Lord Amherst of Hackney. Only a fortnight before the birth of the twins, Cecil Sr, 28, was killed in action with the Parachute Regiment in North Africa. Cecil was born in Aberdeen and had a twin brother, David, plus two older brothers. Their mother, Rohays, was the daughter of a baronet, while their father, also Henry, was the younger brother of Lord Amherst of Hackney. Only a fortnight before the birth of the twins, Cecil Sr, 28, was killed in action with the Parachute Regiment in North Africa. Rohays moved her young family to Wickhambrook, near Newmarket, where her late husband had been given a house and farm by his brother. There she met five-time champion trainer Captain Cecil Boyd-Rochfort, who was based at Freemason Lodge, and the couple were soon married. Rohays moved her young family to Wickhambrook, near Newmarket, where her late husband had been given a house and farm by his brother. There she met five-time champion trainer Captain Cecil Boyd-Rochfort, who was based at Freemason Lodge, and the couple were soon married. Henry had no background in horses and, by his own admission, was not good at much at all as a youngster, other than having fun. He became assistant trainer to his stepfather in late 1964 and, when he retired, four years later, took over what remained of his string, initially at Freemason Lodge before moving to rented accommodation in Hamilton Road. By now, he was also married to the first of his three wives, Julie Murless, daughter of legendary trainer Sir Noel Murless. Henry had no background in horses and, by his own admission, was not good at much at all as a youngster, other than having fun. He became assistant trainer to his stepfather in late 1964 and, when he retired, four years later, took over what remained of his string, initially at Freemason Lodge before moving to rented accommodation in Hamilton Road. By now, he was also married to the first of his three wives, Julie Murless, daughter of legendary trainer Sir Noel Murless. Wollow was one of Cecil’s early stable stars The success of Wolver Hollow in the 1969 Eclipse provided an early clue that Cecil would succeed and, by 1976, he had been crowned champion for the first time, thanks in no small part to Wollow, who won the 2000 Guineas, Eclipse, Sussex Stakes and Juddmonte International. Before Frankel came along, Cecil had always heralded him as the best horse he had trained. The success of Wolver Hollow in the 1969 Eclipse provided an early clue that Cecil would succeed and, by 1976, he had been crowned champion for the first time, thanks in no small part to Wollow, who won the 2000 Guineas, Eclipse, Sussex Stakes and Juddmonte International. Before Frankel came along, Cecil had always heralded him as the best horse he had trained. Cecil’s initial title success enabled him to secure Warren Place, from where Murless had trained. It would be his home and workplace for virtually the rest of his life, with a flag raised each time a Group 1 win was achieved. Cecil’s initial title success enabled him to secure Warren Place, from where Murless had trained. It would be his home and workplace for virtually the rest"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://horseracinghof.com/hall-of-famers/sir-henry-cecil/",
    "text": "of his life, with a flag raised each time a Group 1 win was achieved. Cecil won the title again in 1978, 1979, 1982, 1984, 1985, 1987, 1988, 1990 and 1993. Only Alec Taylor, who won the championship a dozen times between 1907 and 1925, has ever been champion on more occasions. Cecil won the title again in 1978, 1979, 1982, 1984, 1985, 1987, 1988, 1990 and 1993. Only Alec Taylor, who won the championship a dozen times between 1907 and 1925, has ever been champion on more occasions. Cecil won the Trainers Championship an incredible 10 times In his entry books, by way of motivation, Cecil would draw 150 squares at the back and colour them in each time he had a winner. He required an extra 30 squares in 1987, when his mighty haul included a record seven winners at Royal Ascot, at a time when the meeting ran for only four days. In his entry books, by way of motivation, Cecil would draw 150 squares at the back and colour them in each time he had a winner. He required an extra 30 squares in 1987, when his mighty haul included a record seven winners at Royal Ascot, at a time when the meeting ran for only four days. His stable jockeys included four champions – Joe Mercer, Lester Piggott, Steve Cauthen and Kieren Fallon – with American ace Cauthen providing an insight into what it was like to ride for him. “Henry had a great sense of humour,” Cauthen said. “He was a super intelligent guy and really knew how to place his horses. The atmosphere during most of the time I was up at Warren Place was just fantastic. He had a great manner, he didn’t miss a beat and his attention to detail was paramount. I was fortunate to ride for a lot of great trainers, but there was nobody above him.” His stable jockeys included four champions – Joe Mercer, Lester Piggott, Steve Cauthen and Kieren Fallon – with American ace Cauthen providing an insight into what it was like to ride for him. “Henry had a great sense of humour,” Cauthen said. “He was a super intelligent guy and really knew how to place his horses. The atmosphere during most of the time I was up at Warren Place was just fantastic. He had a great manner, he didn’t miss a beat and his attention to detail was paramount. I was fortunate to ride for a lot of great trainers, but there was nobody above him.” Steve Cauthen was one of Cecil’s stable jockeys It was Cauthen who rode Cecil’s first two Derby winners, Slip Anchor (1985) and Reference Point (1987). The former, a superb seven-length winner from the front, carried the colours of Lord Howard de Walden, one of Cecil’s biggest supporters, while the latter went on to land the King George VI and Queen Elizabeth Stakes and the St Leger. Commander In Chief was Cecil’s third Derby winner in 1993, having been unraced as a two-year-old, and would follow up in the Irish version. Oath was his fourth victor six years later, having begun his career with Roger Charlton. It was Cauthen who rode Cecil’s first two Derby winners, Slip Anchor (1985) and Reference Point (1987). The former, a superb seven-length winner from the front, carried the colours of Lord Howard de Walden, one of Cecil’s biggest supporters, while the latter went on to land the King George VI and Queen Elizabeth Stakes and the St Leger. Commander In Chief was Cecil’s third Derby winner in 1993, having been unraced as a two-year-old, and would follow up in the Irish version. Oath was his fourth victor six years later, having begun his career with Roger Charlton. Cecil had a reputation for being particularly adept at training fillies, and perhaps it was no coincidence that he landed six renewals of the 1000 Guineas plus eight editions of the Oaks. He also won the Nassau Stakes on eight occasions, along with the Coronation Stakes and Yorkshire Oaks five times. Cecil had a reputation for being particularly adept at training fillies, and perhaps it was no coincidence that he landed six renewals of the 1000 Guineas plus eight editions of the Oaks. He also won the Nassau Stakes on eight occasions, along with the Coronation Stakes and Yorkshire Oaks five times. One In A Million, Bosra Sham, Diminuendo, Indian Skimmer, Ramruma and Midday were among his most acclaimed fillies, although the best of"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://horseracinghof.com/hall-of-famers/sir-henry-cecil/",
    "text": "them was almost certainly Oh So Sharp, who won the 1000 Guineas, Oaks and St Leger in 1985, the three races which comprise the Fillies’ Triple Crown, having earlier won the Solario Stakes, Fillies’ Mile and Nell Gwyn Stakes. Oh So Sharp had particularly long ears, a physical trait that Cecil liked in his horses, and she had the distinction of providing owner Sheikh Mohammed with his first British Classic victory. One In A Million, Bosra Sham, Diminuendo, Indian Skimmer, Ramruma and Midday were among his most acclaimed fillies, although the best of them was almost certainly Oh So Sharp, who won the 1000 Guineas, Oaks and St Leger in 1985, the three races which comprise the Fillies’ Triple Crown, having earlier won the Solario Stakes, Fillies’ Mile and Nell Gwyn Stakes. Oh So Sharp had particularly long ears, a physical trait that Cecil liked in his horses, and she had the distinction of providing owner Sheikh Mohammed with his first British Classic victory. Slip Anchor gave Cecil his first taste of Derby success Oh So Sharp was Cecil’s first Oaks winner, with his eighth and last, Light Shift in 2007, confirming his return to the top table after several lean seasons when the number of horses in his care dwindled. Just two years earlier, following a series of setbacks and personal problems, he had only 12 winners and many assumed it was only a matter of time before he retired, but Cecil refused to throw in the towel. “I’d have hated to go out as an also-ran,” he said. Oh So Sharp was Cecil’s first Oaks winner, with his eighth and last, Light Shift in 2007, confirming his return to the top table after several lean seasons when the number of horses in his care dwindled. Just two years earlier, following a series of setbacks and personal problems, he had only 12 winners and many assumed it was only a matter of time before he retired, but Cecil refused to throw in the towel. “I’d have hated to go out as an also-ran,” he said. His third wife, Jane, who he married in 2008, supported him staunchly on and off the racecourse in his final years. After his death, she took over the stable of her late husband and saddled Noble Mission, a brother of Frankel, to win the QIPCO Champion Stakes in 2014 before announcing her retirement the following year. His third wife, Jane, who he married in 2008, supported him staunchly on and off the racecourse in his final years. After his death, she took over the stable of her late husband and saddled Noble Mission, a brother of Frankel, to win the QIPCO Champion Stakes in 2014 before announcing her retirement the following year. At the time of his death, the 75 winners Cecil accumulated at Royal Ascot was a record. Sir Michael Stoute and Aidan O’Brien have since overtaken him, helped by the meeting being extended to five days, in 2002, and extra races being added. He landed the Gold Cup four years in succession between 1979 and 1982 thanks to two-time winners Le Moss and Ardross, while brilliant miler Kris, who won 14 of his 16 races, was among his five winners of the St James’s Palace Stakes. At the time of his death, the 75 winners Cecil accumulated at Royal Ascot was a record. Sir Michael Stoute and Aidan O’Brien have since overtaken him, helped by the meeting being extended to five days, in 2002, and extra races being added. He landed the Gold Cup four years in succession between 1979 and 1982 thanks to two-time winners Le Moss and Ardross, while brilliant miler Kris, who won 14 of his 16 races, was among his five winners of the St James’s Palace Stakes. Lady Jayne Cecil with 2014 QIPCO Champions Stakes winner, Noble Mission The Sir Henry Cecil Stakes, a Listed race run at Newmarket, is run in Sir Henry’s memory every July and its roll of honour includes the brilliant Baaeed, an emphatic winner in 2021. The Galtres Stakes at York in August, has also carried his name since 2014, while The Henry Cecil Open Weekend in September, when Newmarket trainers collectively throw open their doors to the public, also remembers him on an annual basis. The Sir Henry Cecil Stakes, a Listed race run at Newmarket, is run in Sir Henry’s memory every July and its roll of honour includes the brilliant Baaeed, an emphatic winner in 2021. The Galtres Stakes"
  },
  {
    "candidate": "Henry, Cecil",
    "category": "bio",
    "score": null,
    "link": "https://horseracinghof.com/hall-of-famers/sir-henry-cecil/",
    "text": "at York in August, has also carried his name since 2014, while The Henry Cecil Open Weekend in September, when Newmarket trainers collectively throw open their doors to the public, also remembers him on an annual basis. Cecil, knighted in 2011 for his services to racing, would himself have been a wonderful host and, no doubt, would have also relished showing off his cherished rose garden, which helped raise money for charitable causes. Cecil, knighted in 2011 for his services to racing, would himself have been a wonderful host and, no doubt, would have also relished showing off his cherished rose garden, which helped raise money for charitable causes. He becomes the second trainer to be inducted into the QIPCO British Champions Series Hall Of Fame after Vincent O’Brien. He becomes the second trainer to be inducted into the QIPCO British Champions Series Hall Of Fame after Vincent O’Brien. He becomes the second trainer to be inducted into the QIPCO British Champions Series Hall Of Fame after Vincent O’Brien. Play Career Highlights Champion Trainer Champion Trainer for the first time, with Wollow his stable star First Derby success Slip Anchor is the first of his four Derby winners. Oh So Sharp wins the 1000 Guineas, Oaks and St Leger in the same year A tenth Trainers Championship Champion Trainer for a tenth and final time. Only Alec Taylor, with 12 wins, has been champion on more occasions Fourth Derby Oath gives him his fourth Derby success Eighth Oaks Light Shift gives Cecil an eighth triumph in the Oaks 14 from 14 Frankel wins all 14 of his races, ten of them in Group 1 company, and is lauded as the greatest racehorse there has been Be The First Sign up to keep up to date with the latest on the QIPCO British Champions Series Hall of Fame. Hall of Famers History Meet The Panel About Hall Of Fame British Champions Series Privacy Policy Terms Sign Up For Updates"
  }
]