[
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://www.romeohitlallforny.com/",
    "text": "0 0 Sign up to volunteer! Request a yard sign! “ Our neighborhoods needs a representative with deep community ties, a track record of serving the community, and a bold vision for Oueens and New York City. That’s why I’m running for City Council – to serve the 28th District and the community that raised me ” — Romeo DONATE NOW About Romeo About Romeo About Romeo Romeo grew up, got married, and raised his two children here in Queens. He’s been active in his community for over 25 years, as a business owner in South Ozone Park, a community service leader for the Brooklyn & Queens Lions Club, and a fierce advocate for the people of Queens and New York City. Romeo serves as District Governor for the Brooklyn & Queens Lions Club, a Queens-based branch of an international service organization dedicated to improving health, well-being, and community ties in a branch’s local community. Under Romeo’s leadership, the Lions Club engages in community-building events like the annual Christmas tree lighting event in Richmond Hill and yearly back-to-school giveaways and crucial community service efforts including feeding families in need during disasters like Hurricane Sandy and the COVID-19 pandemic. Romeo’s commitment to serving his community extends far beyond the Lions Club. He’s worked with elected officials and community advocates for cleaner streets and more green space; he’s been honored by local law enforcement for his work against violence; and he helped lead the effort to install a “Little Guyana” sign at the Ozone Park-Lefferts Blvd Station train station. Romeo also serves in the NYPD’s Community Partners Program and as a member of Queens Community Board 10 for 17 years. Romeo is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM Name * First Name Last Name Email * Subject * Message * Thank you! - ENDORSEMENTS - SENATOR JOSEPH P. ADDABBO, JR. NYS Senate, District 15 SENATOR ROXANNE J. PERSAUD NYS Senate, District 19 ASSEMBLYWOMAN STACEY PHEFFER AMATO NYS Assembly, District 23 ASSEMBLYWOMAN JENIFER RAJKUMAR NYS Assembly, District 38 DISTRICT LEADER FRANK P. GULLUSCIO NYS Assembly District 23 DISTRICT LEADER RICHARD DAVID NYS Assembly District 31 Sign up to volunteer! Request a yard sign! “ ” About Romeo About Romeo About Romeo About Romeo Romeo grew up, got married, and raised his two children here in Queens. He’s been active in his community for over 25 years, as a business owner in South Ozone Park, a community service leader for the Brooklyn & Queens Lions Club, and a fierce advocate for the people of Queens and New York City. Romeo serves as District Governor for the Brooklyn & Queens Lions Club, a Queens-based branch of an international service organization dedicated to improving health, well-being, and community ties in a branch’s local community. Under Romeo’s leadership, the Lions Club engages in community-building events like the annual Christmas tree lighting event in Richmond Hill and yearly back-to-school giveaways and crucial community service efforts including feeding families in need during disasters like Hurricane Sandy and the COVID-19 pandemic. Romeo’s commitment to serving his community extends far beyond the Lions Club. He’s worked with elected officials and community advocates for cleaner streets and more green space; he’s been honored by local law enforcement for his work against violence; and he helped lead the effort to install a “Little Guyana” sign at the Ozone Park-Lefferts Blvd Station train station. Romeo also serves in the NYPD’s Community Partners Program and as a member of Queens Community Board 10 for 17 years. Romeo is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM JOIN OUR TEAM * First Name Last Name * * * Thank you! - ENDORSEMENTS - SENATOR JOSEPH P. ADDABBO, JR. NYS Senate, District 15 SENATOR ROXANNE J. PERSAUD NYS Senate, District 19 ASSEMBLYWOMAN STACEY PHEFFER AMATO NYS Assembly, District 23 ASSEMBLYWOMAN JENIFER RAJKUMAR NYS Assembly, District 38 DISTRICT LEADER FRANK P. GULLUSCIO NYS Assembly District 23 DISTRICT LEADER RICHARD DAVID NYS Assembly District 31 PAID FOR BY ROMEO 2025"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "Home Pros Home Pros Jobs News All By Neighborhood Acts of Kindness Airport Business Dining & Nightlife Entertainment Health Kids & Education Opinion Obituaries Police & Fire Real Estate Transportation All All By Neighborhood Acts of Kindness Airport Business Dining & Nightlife Entertainment Health Kids & Education Opinion Obituaries Police & Fire Real Estate Transportation Best of Things to Do Local Events Submit an Event Guide to Queens 2023 Business Events Games Local Events Submit an Event Guide to Queens 2023 Business Events Games Contact Digital Editions Our Network amNY Brooklyn Paper Brownstoner Bronx Times Gay City News LI Press Dan’s Papers Behind the Hedges Airport Voice amNY Brooklyn Paper Brownstoner Bronx Times Gay City News LI Press Dan’s Papers Behind the Hedges Airport Voice Real Estate Webinars Podcasts Search: Home Pros Home Pros Jobs News All By Neighborhood Acts of Kindness Airport Business Dining & Nightlife Entertainment Health Kids & Education Opinion Obituaries Police & Fire Real Estate Transportation All All By Neighborhood Acts of Kindness Airport Business Dining & Nightlife Entertainment Health Kids & Education Opinion Obituaries Police & Fire Real Estate Transportation Best of Things to Do Local Events Submit an Event Guide to Queens 2023 Business Events Games Local Events Submit an Event Guide to Queens 2023 Business Events Games Contact Digital Editions Our Network amNY Brooklyn Paper Brownstoner Bronx Times Gay City News LI Press Dan’s Papers Behind the Hedges Airport Voice amNY Brooklyn Paper Brownstoner Bronx Times Gay City News LI Press Dan’s Papers Behind the Hedges Airport Voice Real Estate Webinars Podcasts Search: Search: Search: News By Neighborhood Acts of Kindness Airport Business Dining & Nightlife Entertainment Health Kids & Education Opinion Obituaries Police & Fire Real Estate Transportation Things to Do Submit an Event Guide to Queens 2023 Business Events Games Our Network amNY Brooklyn Paper Brownstoner Bronx Times Gay City News LI Press Dan’s Papers Behind the Hedges Airport Voice Home Pros Home Pros Jobs Best of Contact Digital Editions Real Estate Webinars Podcasts Politics Candidate Profile: Romeo Hitlall for City Council District 28 By Athena Dawson Posted on January 24, 2025 Romeo Hitlal, a local real estate broker and long time South Ozone Park resident has announced his bid for Speaker Adams’ City Council District 28 seat. Courtesy of Romeo Hitlall. A local Southeast Queens real estate broker has put his hat in the ring for the race for City Council District 28. Romeo Hitlall is a South Ozone Park resident campaigning in the 2025 Democratic Primary for District 28 in the race to succeed City Council Speaker Adrienne Adams’ seat. District 28 encompasses the neighborhoods of Jamaica, Richmond Hill, Rochdale Village , and South Ozone Park. Hitlall spoke to QNS about his inaugural run for public office. A community activist for the past 25 years, Hitall has a vision of bringing the district back to its former glory by addressing public safety, affordable housing, sanitation, and quality of life issues. Close Get the Full Story News, events, culture and more — delivered to you. Thank you for subscribing! Email Sign Up “ Being a resident of District 28 for the past 25 years, living here, growing up here, having my business here, having my kids growing up here in this community, I’ve seen the changes, from better to worse,” Hitlall said. “As a resident, as a business owner, I want to bring this community back to where I think everyone in the district would love to see,” he said. Public Safety Hitlall said that regarding public safety reform, he’s focused on implementing policies to improve driver and pedestrian safety by deterring speeding drivers. This includes more stop signs, speed bumps, and other street safety infrastructure. Hitlall added that he intends to advocate for keeping the NYPD’s gang database, officially known as the Criminal Group Database(CGD), in operation. The CGD has been in operation since 2013 and has approximately 16,000 entries. “ That is something that they definitely need to keep because it helps policing, it helps the district attorney, it helps everybody,” Hitlall said. The database has previously been at the center of controversy , as opponents argue that it targets young adults and is disproportionately made up of minority racial groups. A group of city council members introduced Int360 in 2022, which proposed the abolishment of the database and the prohibition of any successors of the database. A number of city council members, including Queens Council Members Tiffany Caban, Julie Won, and Shekar Krishnan, co-sponsored Int360-2022. The database"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "was the center of a five-year-long investigation by the New York City Department of Investigation (DOI). A report released in 2023 from the DOI’s office of the inspector general of the NYPD concluded that the investigation did not identify a relationship between inclusion in the CGD and any individual adverse outcomes. However, it did make 17 recommendations to “strengthen policies and practices” in using the database. Sanitation Regarding sanitation, Hitlall said that he wants to focus on cleaning up the commercial corridors of Liberty Avenue, Lefferts Boulevard, Baisley Boulevard, Guy Brewer Boulevard, and Rockaway Boulevard. Hitlall said that driving down the corridors is remeinsicant of a “dump”, and that sanitation problems are riddled throughout the district. Hitlall said he’s taken the initiative to reach out to the DSNY, NYPD, and elected officials to enact walkthroughs of problem areas in the district. For the past six to eight months, an ongoing effort has been in effect to issue summonses to illegal fruit vendors and seize and discard their products. “ I’ve been in the community for the past 30 years, and everyone pretty much knows me, and they always reach out to me, you know, down the block, this is happening, and they’re sending pictures…but I took it upon myself to be responsible to go out there on the ground and to see what’s happening,” Hitlall said. Housing With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. “With 25 years in real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. Public Servant Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” About the Author Athena Dawson Hi! My name is Athena Dawson and I am the Southeastern Queens reporter for QNS. I received my Bachelors and Masters degrees from Hofstra University. Do you have a news tip? Email me at adawson@schnepsmedia.com Candidate Profile: Romeo Hitlall for City Council District 28 By Athena Dawson By Athena Dawson Posted on January 24, 2025 Posted on A local Southeast Queens real estate broker has put his hat in the ring for the race for City Council District 28. A local Southeast Queens real estate broker has put his hat in the ring for the race for City Council District 28. Romeo Hitlall is a South Ozone Park resident campaigning in the 2025 Democratic Primary for District 28 in the race to succeed City Council Speaker Adrienne Adams’ seat. District 28 encompasses the neighborhoods of Jamaica, Richmond Hill, Rochdale Village , and South Ozone Park. Romeo Hitlall is a South Ozone Park resident campaigning in the 2025 Democratic Primary for District 28 in the race to succeed City Council Speaker Adrienne Adams’ seat. District 28 encompasses the neighborhoods of Jamaica, Richmond Hill, Rochdale Village , and South Ozone Park. Hitlall spoke to QNS about his inaugural run for public office. A community activist for the past 25 years, Hitall has a vision of bringing the district back to its former glory by addressing public safety, affordable housing, sanitation, and quality of life issues. Hitlall spoke to QNS about his inaugural run for public office. A community activist for the past 25 years, Hitall has a vision of bringing the district back to its former glory by addressing public safety, affordable housing, sanitation, and quality of life issues. Close Get the Full Story Sign Up “ Being a resident of District 28 for the past 25 years, living here, growing up here, having my business here, having my kids growing up here in this community, I’ve seen the changes, from better to worse,” Hitlall said. “As a resident, as a business owner, I want to bring this community back to where I think everyone in the district would love to see,” he said. “ Being a resident of District 28 for the past 25 years, living here, growing up here, having my business here, having my kids growing up here in this community, I’ve seen the changes, from better to worse,” Hitlall said. “As a resident, as a business owner, I want to bring this community back to where I think everyone in the district would love to see,” he said. Public Safety Hitlall said that regarding public safety reform, he’s focused on implementing policies to improve driver and pedestrian safety by deterring speeding drivers. This includes more stop signs, speed bumps, and other street safety infrastructure. Hitlall added that he intends to advocate for keeping the NYPD’s gang database, officially known as the Criminal Group Database(CGD), in operation. The CGD has been in operation since 2013 and has approximately 16,000 entries. “ That is something that they definitely need to keep because it helps policing, it helps the district attorney, it helps everybody,” Hitlall said. The database has previously been"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "at the center of controversy , as opponents argue that it targets young adults and is disproportionately made up of minority racial groups. A group of city council members introduced Int360 in 2022, which proposed the abolishment of the database and the prohibition of any successors of the database. A number of city council members, including Queens Council Members Tiffany Caban, Julie Won, and Shekar Krishnan, co-sponsored Int360-2022. The database was the center of a five-year-long investigation by the New York City Department of Investigation (DOI). A report released in 2023 from the DOI’s office of the inspector general of the NYPD concluded that the investigation did not identify a relationship between inclusion in the CGD and any individual adverse outcomes. However, it did make 17 recommendations to “strengthen policies and practices” in using the database. Sanitation Regarding sanitation, Hitlall said that he wants to focus on cleaning up the commercial corridors of Liberty Avenue, Lefferts Boulevard, Baisley Boulevard, Guy Brewer Boulevard, and Rockaway Boulevard. Hitlall said that driving down the corridors is remeinsicant of a “dump”, and that sanitation problems are riddled throughout the district. Hitlall said he’s taken the initiative to reach out to the DSNY, NYPD, and elected officials to enact walkthroughs of problem areas in the district. For the past six to eight months, an ongoing effort has been in effect to issue summonses to illegal fruit vendors and seize and discard their products. “ I’ve been in the community for the past 30 years, and everyone pretty much knows me, and they always reach out to me, you know, down the block, this is happening, and they’re sending pictures…but I took it upon myself to be responsible to go out there on the ground and to see what’s happening,” Hitlall said. Housing With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. “With 25 years in real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. Public Servant Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” Hitlall said that regarding public safety reform, he’s focused on implementing policies to improve driver and pedestrian safety by deterring speeding drivers. This includes more stop signs, speed bumps, and other street safety infrastructure. Hitlall said that regarding public safety reform, he’s focused on implementing policies to improve driver and pedestrian safety by deterring speeding drivers. This includes more stop signs, speed bumps, and other street safety infrastructure. Hitlall added that he intends to advocate for keeping the NYPD’s gang database, officially known as the Criminal Group Database(CGD), in operation. The CGD has been in operation since 2013 and has approximately 16,000 entries. “ That is something that they definitely need to keep because it helps policing, it helps the district attorney, it helps everybody,” Hitlall said. Hitlall added that he intends to advocate for keeping the NYPD’s gang database, officially known as the Criminal Group Database(CGD), in operation. The CGD has been in operation since 2013 and has approximately 16,000 entries. “ That is something that they definitely need to keep because it helps policing, it helps the district attorney, it helps everybody,” Hitlall said. The database has previously been at the center of controversy , as opponents argue that it targets young adults and is disproportionately made up of minority racial groups. A group of city council members introduced Int360 in 2022, which proposed the abolishment of the database and the prohibition of any successors of the database. A number of city council members, including Queens Council Members Tiffany Caban, Julie Won, and Shekar Krishnan, co-sponsored Int360-2022. The database has previously been at the center of controversy , as opponents argue that it targets young adults and is disproportionately made up of minority racial groups. A group of city council members introduced Int360 in 2022, which proposed the abolishment of the database and the prohibition of any successors of the database. A number of city council members, including Queens Council Members Tiffany Caban, Julie Won, and Shekar Krishnan, co-sponsored Int360-2022. , as opponents argue that it targets young adults and is disproportionately made up of minority racial groups. A group of city council members introduced Int360 in 2022, which proposed the abolishment of the database and the prohibition of any successors of the database. The database was the center of a five-year-long investigation by the New York City Department of Investigation (DOI). A report released in 2023 from the DOI’s office of the inspector general of the NYPD concluded that the investigation did not identify a relationship between inclusion in the CGD and any individual adverse outcomes. However, it did make 17 recommendations to “strengthen policies and practices” in using the database. The database was the center of a five-year-long investigation by the"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "New York City Department of Investigation (DOI). A report released in 2023 from the DOI’s office of the inspector general of the NYPD concluded that the investigation did not identify a relationship between inclusion in the CGD and any individual adverse outcomes. However, it did make 17 recommendations to “strengthen policies and practices” in using the database. five-year-long investigation by the New York City Department of Investigation (DOI). A report released in 2023 from the DOI’s office of the inspector general of the NYPD concluded that the investigation did not identify a relationship between inclusion in the CGD and any individual adverse outcomes. However, it did Sanitation Regarding sanitation, Hitlall said that he wants to focus on cleaning up the commercial corridors of Liberty Avenue, Lefferts Boulevard, Baisley Boulevard, Guy Brewer Boulevard, and Rockaway Boulevard. Hitlall said that driving down the corridors is remeinsicant of a “dump”, and that sanitation problems are riddled throughout the district. Hitlall said he’s taken the initiative to reach out to the DSNY, NYPD, and elected officials to enact walkthroughs of problem areas in the district. For the past six to eight months, an ongoing effort has been in effect to issue summonses to illegal fruit vendors and seize and discard their products. “ I’ve been in the community for the past 30 years, and everyone pretty much knows me, and they always reach out to me, you know, down the block, this is happening, and they’re sending pictures…but I took it upon myself to be responsible to go out there on the ground and to see what’s happening,” Hitlall said. Housing With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. “With 25 years in real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. Public Servant Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” Regarding sanitation, Hitlall said that he wants to focus on cleaning up the commercial corridors of Liberty Avenue, Lefferts Boulevard, Baisley Boulevard, Guy Brewer Boulevard, and Rockaway Boulevard. Hitlall said that driving down the corridors is remeinsicant of a “dump”, and that sanitation problems are riddled throughout the district. Regarding sanitation, Hitlall said that he wants to focus on cleaning up the commercial corridors of Liberty Avenue, Lefferts Boulevard, Baisley Boulevard, Guy Brewer Boulevard, and Rockaway Boulevard. Hitlall said that driving down the corridors is remeinsicant of a “dump”, and that sanitation problems are riddled throughout the district. Hitlall said he’s taken the initiative to reach out to the DSNY, NYPD, and elected officials to enact walkthroughs of problem areas in the district. For the past six to eight months, an ongoing effort has been in effect to issue summonses to illegal fruit vendors and seize and discard their products. Hitlall said he’s taken the initiative to reach out to the DSNY, NYPD, and elected officials to enact walkthroughs of problem areas in the district. For the past six to eight months, an ongoing effort has been in effect to issue summonses to illegal fruit vendors and seize and discard their products. “ I’ve been in the community for the past 30 years, and everyone pretty much knows me, and they always reach out to me, you know, down the block, this is happening, and they’re sending pictures…but I took it upon myself to be responsible to go out there on the ground and to see what’s happening,” Hitlall said. “ I’ve been in the community for the past 30 years, and everyone pretty much knows me, and they always reach out to me, you know, down the block, this is happening, and they’re sending pictures…but I took it upon myself to be responsible to go out there on the ground and to see what’s happening,” Hitlall said. Housing With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. “With 25 years in real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. Public Servant Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.”"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. With the recent passage of the City of Yes for Housing by the city council, affordable housing has been a hot-button topic for Southeast Queens residents. Prior to the passage of the City of Yes for Housing, many southeastern Queens homeowners, including District 28 residents, protested for months against the massive rezoning initiative. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. Hitlall acknowledged that while the need for affordable housing is a universal issue, he has concerns that the initiative falls short in addressing affordable housing access in Southeast Queens. “With 25 years in"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. “With 25 years in real estate and 17 years on Community Board 10, I understand our community’s unique challenges. The rushed process of City of Yes failed to provide adequate answers about its impact here. I’m committed to working with partners and residents to create real affordable housing solutions and help long-time homeowners, especially seniors, stay in their homes,” he said. Public Servant Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. Hitlall feels that his background as a long-term business owner and civically and socially involved resident makes him “the people’s candidate.” He’s been a member of Queens Community Board 10 (CB10) for the past 17 years, which he said is a longstanding reflection of his civic engagement. Hitlall said that his engagement in community organizations has allowed him to know the community and their needs. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. He has also committed much of his time to community service as an active member of the Lions Club for the past 12 years. Hitlall said that from 2012 onwards, he was the charter president of his chapter, successfully growing his charter from 20 members to over 100 members. During his time as Charter President of the Richmond Hill-South Ozone Park Lions Club, Hitlall led an array of initiatives, including an annual Thanksgiving turkey giveaway, community health fairs, annual holiday giveaways, and school supplies giveaways. Hitlall (sixth from left) spearheaded a Thanksgiving turkey giveaway initiative while serving as Charter President Richmond Hill-South Ozone Park Lions Club Richmond Hill-South Ozone Park Lions Club One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. One of his most notable achievements was assisting in leading the community effort to install the Little Guyana Avenue sign, which was unveiled on May 29, 2021, at the intersection of Lefferts Boulevard and Liberty Avenue. Additionally, Hitlall spearheaded the effort to install a “Welcome to Little Guyana” sign at the A Train Subway Station in Richmond Hill on March 22.2024. “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” “ That was historic for our community because it took a while… we rallied around elected officials and, you know, it took a lot of petitions from the communities, civic organizations,” he said. “ It’s a large Guyanese population…in Richmond Hill, South Ozone Park and Jamaica. ”I thought it was a great idea, especially on Liberty Avenue to have that there.” Hitlall recently made history on July 1st, 2024, when he was sworn in as the first Indo-Guyanese District Governor for Brooklyn and Queens in the 106-year history of Lions District 20K1. One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” One of Hitlall’s ( left from center) highlighted achievements included his advocacy for the Welcome to Little Guyana sign at the MTA’s Ozone Park Lefferts Blvd A train. station. Courtesy of Romeo Hitlall As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. As for his business, Hitlall is the CEO and owner of NMCRA Connectors Realty in South Ozone Park and has worked as a real estate broker since 2000. His company focuses on residential, commercial, and apartment rental real estate. Hitlall feels his experience as a business owner gives him an intimate understanding of the issues other business owners in his district and around New York City may face. Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall has taken a seemingly down-to-earth approach to his candidacy. ”I already know I am not a politician. I’m a regular person. I’m a business owner. I grew up here. I grew up in Southeast Queens. I grew up in District 28 all my life. I went to Hillcrest High School,” he said. “My kids grew up in South Ozone Park.” Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. Hitlall said he knows what it takes to live in District 28, to be a homeowner and provide for a family. He feels that if elected, he can focus on bringing back safety and peace of mind to residents in his district. “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “I want the best for our community… I want our kids in the community to be able to walk to the deli down the block and not worry, he said. “I want our seniors to be able to take a stroll in the afternoon and not worry they’re going to get robbed.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” “ We want to live a comfortable life. We want to be able to live that life. And yes, we can do it.” About the Author Athena Dawson Hi! My name is Athena Dawson and I am the Southeastern Queens reporter for QNS. I received my Bachelors and Masters degrees from Hofstra University. Do you have a news tip? Email me at adawson@schnepsmedia.com More in Politics More in Maspeth RV fire destroys iconic GoodFellas Diner, reignites debate over illegal street dwellings Maspeth RV fire destroys iconic GoodFellas Diner, reignites debate over illegal street dwellings NYC Mayor’s Race: Cuomo gets $1.5M in public funds, but CFB withholds another $622K over alleged ‘improper coordination’ with super PAC NYC Mayor’s Race: Cuomo gets $1.5M in public funds, but CFB withholds another $622K over alleged ‘improper coordination’ with super PAC coordination’ Rockaway residents criticize Pheffer Amato for withdrawing support for NY HEAT Act Rockaway residents criticize Pheffer Amato for withdrawing support for NY HEAT Act withdrawing Court Square fountain removed as part of"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "planned renovations to Court Square Park Court Square fountain removed as part of planned renovations to Court Square Park renovations Jobs in New York Add your job Maaluh Bengali Speaking Caregiver Maaluh Bengali Speaking Caregiver Maaluh Bengali Speaking Caregiver GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company PREPREP.NET Front Desk Lobby Attendant PREPREP.NET Front Desk Lobby Attendant PREPREP.NET Front Desk Lobby Attendant View all jobs… Things to do in Queens Post an Event Today, 6:30 pm WellLife Network 2025 Gala: Wings of Change, Empowering Wellness TWA Hotel JFK Airport Today, 6:30 pm WellLife Network 2025 Gala: Wings of Change, Empowering Wellness TWA Hotel JFK Airport TWA Hotel JFK Airport Today, 11 pm End of the Line Standup @ QED – Astoria’s only late-night comedy showcase QED Astoria Today, 11 pm End of the Line Standup @ QED – Astoria’s only late-night comedy showcase QED Astoria QED Astoria Tomorrow, 7 pm Louis Armstrong Legacy Monthly Jazz Jams Flushing Town Hall Tomorrow, 7 pm Louis Armstrong Legacy Monthly Jazz Jams Flushing Town Hall Flushing Town Hall May 15, all day The Lot at Culture Lab LIC – Free Outdoor Concerts in May! Culture Lab LIC May 15, all day The Lot at Culture Lab LIC – Free Outdoor Concerts in May! Culture Lab LIC Culture Lab LIC May 15, 10 am AAWIC 25th Film Festival LaGuardia Community College May 15, 10 am AAWIC 25th Film Festival LaGuardia Community College LaGuardia Community College May 15, 10 am 25th African American Film Festival LaGuardia Community College May 15, 10 am 25th African American Film Festival LaGuardia Community College LaGuardia Community College View All Events… Latest News Four cars with massive rooftop speakers seized at College Point car meetup: NYPD Four cars with massive rooftop speakers seized at College Point car meetup: NYPD DOT launches safety study to reimagine Conduit Avenue, a crash-prone corridor linking Brooklyn and Queens DOT launches safety study to reimagine Conduit Avenue, a crash-prone corridor linking Brooklyn and Queens crash-prone Construction completes on Sunnyside 52, bringing 5-story condo and retail hub to 52nd Street Construction completes on Sunnyside 52, bringing 5-story condo and retail hub to 52nd Street Construction Tipsy Tequila and Taco Bar opens at former Pour House spot in Bayside Tipsy Tequila and Taco Bar opens at former Pour House spot in Bayside Addabbo Family Health Center opens $20M annex in Rockaway to expand care access Addabbo Family Health Center opens $20M annex in Rockaway to expand care access Get Queens in your inbox Close Sign Up Dining & Nightlife Tipsy Tequila and Taco Bar opens at former Pour House spot in Bayside Tipsy Tequila and Taco Bar opens at former Pour House spot in Bayside Flushing BID kicks off 4th annual Restaurant Week with $20 deals at 19 restaurants Flushing BID kicks off 4th annual Restaurant Week with $20 deals at 19 restaurants restaurants Celebrate Cinco de Mayo at these Mexican restaurants in Queens Celebrate Cinco de Mayo at these Mexican restaurants in Queens restaurants High-end Mediterranean restaurant to replace shuttered TGI Friday’s on Austin Street in Forest Hills High-end Mediterranean restaurant to replace shuttered TGI Friday’s on Austin Street in Forest Hills Mediterranean Little Caesars Pizza officially opens new Middle Village location Little Caesars Pizza officially opens new Middle Village location Entertainment Southeast Queens to host first-ever Jazz and Heritage Bike Tour on May 17 Southeast Queens to host first-ever Jazz and Heritage Bike Tour on May 17 Astoria’s Chateau Le Woof to host Pledge Kindness Pet Parade May 17 Astoria’s Chateau Le Woof to host Pledge Kindness Pet Parade May 17 Astoria’s NY Hall of Science debuts CityWorks, its largest exhibition in over a decade NY Hall of Science debuts CityWorks, its largest exhibition in over a decade Bayside gallery unveils new exhibit by acclaimed NYC artist Tenesh Webber Bayside gallery unveils new exhibit by acclaimed NYC artist Tenesh Webber Afternoon tea meets floral charm at Ora La Casa De Las Flores in Sunnyside Afternoon tea meets floral charm at Ora La Casa De Las Flores in Sunnyside Police & Fire Suspect sought after man stabbed to death on Corona street corner late Saturday: NYPD Suspect sought after man stabbed to death on Corona street corner late Saturday: NYPD Queens NYPD grad who survived knife attack as cadet fulfills dream to serve Queens NYPD grad who survived knife"
  },
  {
    "candidate": "Hitlall, Romeo",
    "category": "bio",
    "score": null,
    "link": "https://qns.com/2025/01/candidate-romeo-hitlall-city-council-district-28/",
    "text": "attack as cadet fulfills dream to serve Mayor Adams applauds new state budget that expands involuntary commitment powers for those with mental illness Mayor Adams applauds new state budget that expands involuntary commitment powers for those with mental illness involuntary MTA worker assaulted in unprovoked umbrella attack at Ridgewood subway station: NYPD MTA worker assaulted in unprovoked umbrella attack at Ridgewood subway station: NYPD Sixth man indicted for robbery, kidnapping and fatal shooting of drug dealer in Bayside: Feds Sixth man indicted for robbery, kidnapping and fatal shooting of drug dealer in Bayside: Feds More from Around New York amNY BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large at large Gay City News PHOTOS: Iris House’s Women as the Face of AIDS Summit PHOTOS: Iris House’s Women as the Face of AIDS Summit AIDS Summit Schneps Podcasts Eric Scott Reed, Thank You For Coming Out Eric Scott Reed, Thank You For Coming Out Coming Out New York Family DOT Reveals Family-Friendly Bike Routes DOT Reveals Family-Friendly Bike Routes Family-Friendly Bike Routes Things to do in Queens Queens’ job board Contact Us Contact Us Networking Events Networking Events Jobs Jobs Home Pros Home Pros Real Estate Real Estate Advertise Advertise Newsletter Newsletter © QNS 2025 Schneps Media © QNS 2025 Schneps Media Privacy Policy Privacy Policy Terms of Use Terms of Use Sections Sections Jobs Events Home Pros Contact"
  }
]