[
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Bryan_Hodge_Vasquez",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Bryan Hodge Vasquez Bryan Hodge Vasquez Bryan Hodge Vasquez Democratic Party Candidate, New York City Council District 14 June 24, 2025 Education New York University Pace University School of Law Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Personal LinkedIn Bryan Hodge Vasquez ( Democratic Party ) is running for election to the New York City Council to represent District 14 . He is on the ballot in the Democratic primary on June 24, 2025 . [source] Hodge Vasquez completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Bryan Hodge Vasquez was born in New York, New York . He earned a bachelor's degree from New York University and a law degree from the Pace University School of Law. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 14 Incumbent Pierina Sanchez , Fernando Cabrera , and Bryan Hodge Vasquez are running in the Democratic primary for New York City Council District 14 on June 24, 2025. Candidate Pierina Sanchez Fernando Cabrera Bryan Hodge Vasquez Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Bryan Hodge Vasquez completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Hodge Vasquez's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Bryan’s story begins in the Bronx, born to hardworking Dominican parents—a small business owner and a university teacher—who instilled in him the values of perseverance and community. Seeking a safer environment, they moved beyond city limits, but Bryan’s weekend visits to the West Bronx maintained his Dominican heritage and family ties, shaping his passion for equity and justice. At NYU, Bryan immersed himself in Political Science, Public Policy, and Management, then furthered his dedication to advocacy at Pace Law School. In each role—whether at the NYC Council resolving housing disputes or in Washington, D.C. alongside Congressman Adriano Espaillat—Bryan always championed underserved communities. During the COVID-19 crisis, he organized food and mask distributions, alongside annual turkey giveaways for struggling families. His commitment to justice was powerfully demonstrated after the tragic death of William Figuera. When footage showed investigators violating Figuera’s dignity, Bryan swiftly organized a community fundraiser, raising $2,500 for the family. This act underscored his unwavering belief that every life deserves respect and that no family should face hardship alone. From the Bronx to Capitol Hill, Bryan remains an Afro-Latino champion of empowerment—using his legal and policy expertise to foster a more equitable future for all. At NYU, Bryan immersed himself in Political Science, Public Policy, and Management, then furthered his dedication to advocacy at Pace Law School. In each role—whether at the NYC Council resolving housing disputes or in Washington, D.C. alongside Congressman Adriano Espaillat—Bryan always championed underserved communities. During the COVID-19 crisis, he organized food and mask distributions, alongside annual turkey giveaways for struggling families. His commitment to justice was powerfully demonstrated after the tragic death of William Figuera. When footage showed investigators violating Figuera’s"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Bryan_Hodge_Vasquez",
    "text": "dignity, Bryan swiftly organized a community fundraiser, raising $2,500 for the family. This act underscored his unwavering belief that every life deserves respect and that no family should face hardship alone. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Bryan is tackling the Bronx’s ongoing housing crisis—marked by collapsing buildings, rising rents, and increased fires—by ensuring every family can afford a safe, stable home. He will build more housing that truly meets local income levels, integrating community input and essential services. Through stricter building code enforcement, regular inspections, and improved funding for repairs, Bryan aims to prevent tragedies and protect residents. He’ll also fight to cap skyrocketing water bills and property taxes that drive up rent. Finally, Bryan’s plan expands pathways to homeownership with down payment assistance, low-interest loans, and community land trusts, helping more families stay and thrive in District 14. Bryan is committed to safer streets in District 14 by combining immediate crime reduction with long-term solutions. He advocates more policing—paired with community engagement, better training, and accountability—to deter crime and build trust. He believes addressing minor offenses prevents larger crimes and supports restoring judicial discretion to handle them effectively. Beyond enforcement, he’ll invest in community-led violence interruption programs and mental health support. Youth engagement is key to his vision, with mentorship, after-school programs, and career training guiding young people toward success and leadership. Bryan’s plan eases financial burdens on hardworking families by tackling the biggest drivers of high living costs. He will fight to cap water and energy rates so no one must choose between rent and utilities. By expanding the Earned Income Tax Credit, Bryan ensures more take-home pay for essentials, like groceries. He will also push to lower grocery prices—cutting fees and supporting local producers—so every family can afford healthy meals. Finally, he’ll protect app-based delivery drivers with fair conditions and platform access. These reforms help lower costs and enable West Bronx families to thrive. Bryan is tackling the Bronx’s ongoing housing crisis—marked by collapsing buildings, rising rents, and increased fires—by ensuring every family can afford a safe, stable home. He will build more housing that truly meets local income levels, integrating community input and essential services. Through stricter building code enforcement, regular inspections, and improved funding for repairs, Bryan aims to prevent tragedies and protect residents. He’ll also fight to cap skyrocketing water bills and property taxes that drive up rent. Finally, Bryan’s plan expands pathways to homeownership with down payment assistance, low-interest loans, and community land trusts, helping more families stay and thrive in District 14. Bryan is committed to safer streets in District 14 by combining immediate crime reduction with long-term solutions. He advocates more policing—paired with community engagement, better training, and accountability—to deter crime and build trust. He believes addressing minor offenses prevents larger crimes and supports restoring judicial discretion to handle them effectively. Beyond enforcement, he’ll invest in community-led violence interruption programs and mental health support. Youth engagement is key to his vision, with mentorship, after-school programs, and career training guiding young people toward success and leadership. Bryan’s plan eases financial burdens on hardworking families by tackling the biggest drivers of high living costs. He will fight to cap water and energy rates so no one must choose between rent and utilities. By expanding the Earned Income Tax Credit, Bryan ensures more take-home pay for essentials, like groceries. He will also push to lower grocery prices—cutting fees and supporting local producers—so every family can afford healthy meals. Finally, he’ll protect app-based delivery drivers with fair conditions and platform access. These reforms help lower costs and enable West Bronx families to thrive. What areas of public policy are you personally passionate about? Bryan is passionate about public policies that improve the quality of life for all residents in the West Bronx. Housing is a core focus for him, with a commitment to creating truly affordable, safe homes by addressing collapsing buildings and skyrocketing rents. He also prioritizes public safety, advocating for practical solutions to reduce crime and restore peace in the community. Bryan believes in providing economic relief to hardworking families by expanding tax credits and lowering everyday costs like groceries and utilities. His transportation policies focus on improving bus reliability, expanding “Fair Fares,” and ensuring bike lane safety. What legacy would you like to leave? Bryan envisions a legacy where every child in the Northwest Bronx grows up feeling safe, inspired,"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Bryan_Hodge_Vasquez",
    "text": "and supported in reaching their highest aspirations. Drawing on his experiences in the Bronx Supreme Court, the US Congress, and the NYC Council, he seeks to shape policies that not only strengthen family stability—such as affordable housing and improved public safety—but also spark the imaginations of young people through robust educational programs and youth mentorship initiatives. He recognizes that the complex levers of government can sometimes hinder opportunity, so he strives to use his legal and political acumen to open doors instead of closing them. Yet for Bryan, policy is only part of the story. He wants to meet families where they are, ensuring children have welcoming spaces—whether that’s in local schools, community centers, or public parks—where they can learn, dream, and grow without fear. Bryan’s ultimate hope is that tomorrow’s generation looks back and sees a community transformed by determined leadership and a collective belief in the limitless potential of every child. By combining the practical know-how of government with a deeply human sense of compassion, he aims to leave behind neighborhoods where young people thrive, families stay connected, and the next generation feels empowered to shape their own future. He recognizes that the complex levers of government can sometimes hinder opportunity, so he strives to use his legal and political acumen to open doors instead of closing them. Yet for Bryan, policy is only part of the story. He wants to meet families where they are, ensuring children have welcoming spaces—whether that’s in local schools, community centers, or public parks—where they can learn, dream, and grow without fear. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? Bryan believes that prior experience in government or politics can be immensely advantageous for anyone seeking public office, especially during challenging times marked by collapsing buildings, surging grocery prices, and escalating violent crime. His own tenure at the NYC Council, combined with his legal education in the Bronx Supreme Court, laid a foundation of practical skills and deep familiarity with governmental processes. By working directly on housing and landlord-tenant issues, and later alongside Congressman Adriano Espaillat in Washington, D.C., he gained critical insight into how to utilize the levers of power to effect meaningful change. For Bryan, however, experience is only one part of the equation. He recognizes that genuine leadership also requires empathy, a strong moral compass, and unwavering dedication to the community. His years of advocacy—organizing essential resources during COVID-19, fighting against injustice in court, and standing up for families who have experienced tragic losses—demonstrate his commitment to serving others. In his view, understanding how to navigate political structures is most effective when paired with the drive to champion equity and justice for all. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 14 Website Facebook Twitter Instagram Candidate New York City Council District 14 Website Facebook Twitter Instagram Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on January 7, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on January 7, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Bryan_Hodge_Vasquez",
    "text": "and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,596 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Bryan_Hodge_Vasquez",
    "text": "administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://www.bxtimes.com/bryan-hodge-bronx-district-14-city-council-seat/",
    "text": "Home Pros Home Pros Jobs News All By Neighborhood Arts Business Coronavirus Development Education En Español Health Lifestyle Police & Fire Politics Sports Opinion Transit All All By Neighborhood Arts Business Coronavirus Development Education En Español Health Lifestyle Police & Fire Politics Sports Opinion Transit Best of Things to Do Local Events Post an Event Business Events Games Local Events Post an Event Business Events Games Contact Us Subscribe Our Network amNY Bronx Family Brooklyn Paper Brownstoner Caribbean Life Gay City News QNS amNY Bronx Family Brooklyn Paper Brownstoner Caribbean Life Gay City News QNS Digital Editions Print Subscriptions Webinars Podcasts Search: Home Pros Home Pros Jobs News All By Neighborhood Arts Business Coronavirus Development Education En Español Health Lifestyle Police & Fire Politics Sports Opinion Transit All All By Neighborhood Arts Business Coronavirus Development Education En Español Health Lifestyle Police & Fire Politics Sports Opinion Transit Best of Things to Do Local Events Post an Event Business Events Games Local Events Post an Event Business Events Games Contact Us Subscribe Our Network amNY Bronx Family Brooklyn Paper Brownstoner Caribbean Life Gay City News QNS amNY Bronx Family Brooklyn Paper Brownstoner Caribbean Life Gay City News QNS Digital Editions Print Subscriptions Webinars Podcasts Search: Search: Search: News All All By Neighborhood Arts Business Coronavirus Development Education En Español Health Lifestyle Police & Fire Politics Sports Opinion Transit Things to Do Post an Event Business Events Games Our Network amNY Bronx Family Brooklyn Paper Brownstoner Caribbean Life Gay City News QNS Home Pros Home Pros Jobs Best of Contact Us Subscribe Digital Editions Print Subscriptions Webinars Podcasts Politics Bryan Hodge Vasquez announces candidacy for Bronx’s District 14 City Council seat By Emily Swanson Posted on July 26, 2024 Bryan Hodge Vasquez will challenge incumbent Pierina Sanchez for the District 14 City Council seat. Photo courtesy Hodge Vasquez campaign Community advocate Bryan Hodge Vasquez announced on July 26 that he will challenge incumbent Council Member Pierina Sanchez for the District 14 seat. Sanchez was elected in 2022 for a term that runs through the end of 2025. With the municipal primary election about a year away, many candidates like Hodge Vasquez are planning now for what is sure to be a hot election cycle with all 51 council seats — plus the mayoralty — up for grabs. In an Instagram post announcing his candidacy, Hodge Vasquez pointed to a theme he said reverberates throughout the district, which includes the neighborhoods of Morris Heights, Fordham, Bedford Park, Van Cortlandt Village and Kingsbridge. “Rent’s up, Crime’s up, and Price’s up. But quality of Life? Down, he said. “It’s time to prioritize Solutions Over Slogans.” Close Get the Full Story News, events, culture and more — delivered to you. Thank you for subscribing! Email Sign Up Hodge Vasquez, who attended NYU and Pace University’s School of Law, was recently the campaign manager for Leonardo Coello’s unsuccessful primary bid for the District 77 State Assembly seat . Through the campaign work, Hodge Vasquez made many connections and garnered support from the Bronx community, according to information from his campaign. Hodge Vasquez belongs to the Dominican, LGTBQ and Afro-Latino communities, the announcement said. His LinkedIn profile shows he was recently a law fellow with the City Council and was previously a legal extern with the New York State Supreme Court and legislative intern for both the U.S. Congress and New York City Council. Reach Emily Swanson at eswanson@schnepsmedia.com or (646) 717-0015. For more coverage, follow us on Twitter, Facebook and Instagram @bronxtimes About the Author Emily Swanson Emily Swanson is a reporter at the Bronx Times and recent graduate of the CUNY Craig Newmark Graduate School of Journalism. Originally from Minneapolis, MN, she now lives in the South Bronx neighborhood of Port Morris. She enjoys cooking, photography and rooting for the Knicks, Liberty and Yankees. Bryan Hodge Vasquez announces candidacy for Bronx’s District 14 City Council seat By Emily Swanson By Emily Swanson Posted on July 26, 2024 Posted on Bryan Hodge Vasquez will challenge incumbent Pierina Sanchez for the District 14 City Council seat. Community advocate Bryan Hodge Vasquez announced on July 26 that he will challenge incumbent Council Member Pierina Sanchez for the District 14 seat. Sanchez was elected in 2022 for a term that runs through the end of 2025. With the municipal primary election about a year away, many candidates like Hodge Vasquez are planning now for what is sure to be a hot election cycle with all 51 council seats — plus"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://www.bxtimes.com/bryan-hodge-bronx-district-14-city-council-seat/",
    "text": "the mayoralty — up for grabs. In an Instagram post announcing his candidacy, Hodge Vasquez pointed to a theme he said reverberates throughout the district, which includes the neighborhoods of Morris Heights, Fordham, Bedford Park, Van Cortlandt Village and Kingsbridge. “Rent’s up, Crime’s up, and Price’s up. But quality of Life? Down, he said. “It’s time to prioritize Solutions Over Slogans.” Close Get the Full Story News, events, culture and more — delivered to you. Thank you for subscribing! Email Sign Up Hodge Vasquez, who attended NYU and Pace University’s School of Law, was recently the campaign manager for Leonardo Coello’s unsuccessful primary bid for the District 77 State Assembly seat . Through the campaign work, Hodge Vasquez made many connections and garnered support from the Bronx community, according to information from his campaign. Hodge Vasquez belongs to the Dominican, LGTBQ and Afro-Latino communities, the announcement said. His LinkedIn profile shows he was recently a law fellow with the City Council and was previously a legal extern with the New York State Supreme Court and legislative intern for both the U.S. Congress and New York City Council. Reach Emily Swanson at eswanson@schnepsmedia.com or (646) 717-0015. For more coverage, follow us on Twitter, Facebook and Instagram @bronxtimes Community advocate Bryan Hodge Vasquez announced on July 26 that he will challenge incumbent Council Member Pierina Sanchez for the District 14 seat. Sanchez was elected in 2022 for a term that runs through the end of 2025. With the municipal primary election about a year away, many candidates like Hodge Vasquez are planning now for what is sure to be a hot election cycle with all 51 council seats — plus the mayoralty — up for grabs. Sanchez was elected in 2022 for a term that runs through the end of 2025. With the municipal primary election about a year away, many candidates like Hodge Vasquez are planning now for what is sure to be a hot election cycle with all 51 council seats — plus the mayoralty — up for grabs. In an Instagram post announcing his candidacy, Hodge Vasquez pointed to a theme he said reverberates throughout the district, which includes the neighborhoods of Morris Heights, Fordham, Bedford Park, Van Cortlandt Village and Kingsbridge. In an Instagram post announcing his candidacy, Hodge Vasquez pointed to a theme he said reverberates throughout the district, which includes the neighborhoods of Morris Heights, Fordham, Bedford Park, Van Cortlandt Village and Kingsbridge. “Rent’s up, Crime’s up, and Price’s up. But quality of Life? Down, he said. “It’s time to prioritize Solutions Over Slogans.” “Rent’s up, Crime’s up, and Price’s up. But quality of Life? Down, he said. “It’s time to prioritize Solutions Over Slogans.” Close Get the Full Story Sign Up Hodge Vasquez, who attended NYU and Pace University’s School of Law, was recently the campaign manager for Leonardo Coello’s unsuccessful primary bid for the District 77 State Assembly seat . Through the campaign work, Hodge Vasquez made many connections and garnered support from the Bronx community, according to information from his campaign. Hodge Vasquez, who attended NYU and Pace University’s School of Law, was recently the campaign manager for Leonardo Coello’s unsuccessful primary bid for the District 77 State Assembly seat . Through the campaign work, Hodge Vasquez made many connections and garnered support from the Bronx community, according to information from his campaign. Hodge Vasquez belongs to the Dominican, LGTBQ and Afro-Latino communities, the announcement said. His LinkedIn profile shows he was recently a law fellow with the City Council and was previously a legal extern with the New York State Supreme Court and legislative intern for both the U.S. Congress and New York City Council. Hodge Vasquez belongs to the Dominican, LGTBQ and Afro-Latino communities, the announcement said. His LinkedIn profile shows he was recently a law fellow with the City Council and was previously a legal extern with the New York State Supreme Court and legislative intern for both the U.S. Congress and New York City Council. Reach Emily Swanson at eswanson@schnepsmedia.com or (646) 717-0015. For more coverage, follow us on Twitter, Facebook and Instagram @bronxtimes Reach Emily Swanson at eswanson@schnepsmedia.com or (646) 717-0015. For more coverage, follow us on Twitter, Facebook and Instagram @bronxtimes About the Author Emily Swanson Emily Swanson is a reporter at the Bronx Times and recent graduate of the CUNY Craig Newmark Graduate School of Journalism. Originally from Minneapolis, MN, she now lives in the South Bronx neighborhood of Port Morris. She enjoys cooking, photography and"
  },
  {
    "candidate": "Hodge Vasquez, Bryan",
    "category": "bio",
    "score": null,
    "link": "https://www.bxtimes.com/bryan-hodge-bronx-district-14-city-council-seat/",
    "text": "rooting for the Knicks, Liberty and Yankees. More in Politics More in NYC Mayor’s Race: Cuomo gets $1.5M in public funds, but CFB withholds another $622K over alleged ‘improper coordination’ with super PAC NYC Mayor’s Race: Cuomo gets $1.5M in public funds, but CFB withholds another $622K over alleged ‘improper coordination’ with super PAC coordination’ AOC meetings with Lander, Mamdani spur talk of possible mayoral endorsement AOC meetings with Lander, Mamdani spur talk of possible mayoral endorsement endorsement Adams meets with President Trump in DC to discuss ‘infrastructure, other funding items’ Adams meets with President Trump in DC to discuss ‘infrastructure, other funding items’ ‘infrastructure, Final state budget includes Gov. Hochul’s affordability measures as she prepares for tough 2026 re-election fight Final state budget includes Gov. Hochul’s affordability measures as she prepares for tough 2026 re-election fight affordability re-election Jobs in New York Add your job PREPREP.NET Front Desk Lobby Attendant PREPREP.NET Front Desk Lobby Attendant PREPREP.NET Front Desk Lobby Attendant Maaluh Bengali Speaking Caregiver Maaluh Bengali Speaking Caregiver Maaluh Bengali Speaking Caregiver GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company GreenMax Capital Group Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company View all jobs… Crime BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large Bronx man fatally stabbed on Mother’s Day amid citywide surge in weekend violence Bronx man fatally stabbed on Mother’s Day amid citywide surge in weekend violence Double shooting in the Bronx leaves man dead, woman wounded: cops Double shooting in the Bronx leaves man dead, woman wounded: cops Bronx man sentenced in NYCHA corruption case Bronx man sentenced in NYCHA corruption case Driver who killed beloved Bronx coach surrenders to police Driver who killed beloved Bronx coach surrenders to police Things to do in the Bronx Post an Event Today, 10 am The LEGO® Botanical Garden Pop-Up at NY Botanical Garden New York Botanical Garden Today, 10 am The LEGO® Botanical Garden Pop-Up at NY Botanical Garden New York Botanical Garden New York Botanical Garden Today, 10 am Dinosaur Safari Bronx Zoo Today, 10 am Dinosaur Safari Bronx Zoo Bronx Zoo Today, 3:30 pm Bronx Week: Button making Workshop Morrisania Library Today, 3:30 pm Bronx Week: Button making Workshop Morrisania Library Morrisania Library Today, 4 pm Get Your Craft Together: Crochet Hunts Point Library Today, 4 pm Get Your Craft Together: Crochet Hunts Point Library Hunts Point Library Today, 4 pm Get Your Craft Together: Painting Hunts Point Library Today, 4 pm Get Your Craft Together: Painting Hunts Point Library Hunts Point Library Today, 4 pm Allerton Multimedia Studio: Fun with Photography Allerton Library Today, 4 pm Allerton Multimedia Studio: Fun with Photography Allerton Library Allerton Library View All Events… News Bronx man fatally stabbed on Mother’s Day amid citywide surge in weekend violence Bronx man fatally stabbed on Mother’s Day amid citywide surge in weekend violence Nonprofit group homes in New York face funding shortfall, leading to staffing crisis Nonprofit group homes in New York face funding shortfall, leading to staffing crisis Bronx Catholics welcome Pope Leo XIV, express hope for a papacy rooted in charity Bronx Catholics welcome Pope Leo XIV, express hope for a papacy rooted in charity Double shooting in the Bronx leaves man dead, woman wounded: cops Double shooting in the Bronx leaves man dead, woman wounded: cops Driver who killed beloved Bronx coach surrenders to police Driver who killed beloved Bronx coach surrenders to police Things to do in the Bronx Home Pros More from Around NYC New York Family DOT Reveals Family-Friendly Bike Routes DOT Reveals Family-Friendly Bike Routes Family-Friendly Bike Routes amNY BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large BREAKING: Teenage girl shot dead outside Bronx high school, suspect at large at large Schneps Podcasts Eric Scott Reed, Thank You For Coming Out Eric Scott Reed, Thank You For Coming Out Coming Out Gay City News PHOTOS: Iris House’s Women as the Face of AIDS Summit PHOTOS: Iris House’s Women as the Face of AIDS Summit AIDS Summit Newsletter Newsletter Contact Us Contact Us Networking Events Networking Events Home Pros Home Pros Advertise Advertise © 2025 Schneps Media © 2025 Schneps Media Privacy Policy Privacy Policy Terms of Use Terms of Use Sections Sections Jobs Home Pros Events Contact"
  }
]