[
  {
    "candidate": "Hudson, Crystal",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/crystal-hudson/bio/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 35 Crystal Hudson Fort Greene, Clinton Hill, Prospect Heights, Crown Heights Biography Crystal Hudson is the Council Member for New York City’s District 35 in Brooklyn, representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. A third-generation Brooklynite and daughter of Jamaican and Honduran immigrants, she was elected in 2021 and made history as the first out gay Black woman ever elected in New York City. Crystal is a public servant committed to making government more accessible for more people. Her commitment to public service is personal and began when her mother started exhibiting signs of what would later be diagnosed as Alzheimer’s disease. As the only child of a single mother, Crystal quickly became the primary caregiver for her mother. She experienced first-hand how difficult it is for working families to navigate complex, bureaucratic systems and access services and resources needed to keep older New Yorkers safe and healthy at home, where they can age in place and maintain their dignity. Crystal is a fierce advocate for older adults and families impacted by Alzheimer’s disease, and is unwavering in her commitment to serving families who are caring for loved ones. Before entering public service, Crystal spent more than a decade working in sports marketing and advertising –– first with the WNBA’s Washington Mystics and NBA’s Washington Wizards and later at Amtrak, where she managed a portfolio of sports, entertainment and multicultural marketing campaigns for the nation’s passenger rail service. Once she entered public service, Crystal served as Co-Director of the Community Outreach Unit at the New York City Council, First Deputy Public Advocate of Community Engagement at the Office of the NYC Public Advocate, and Chief of Operations to the Majority Leader of the City Council. In March 2020, in response to the COVID-19 global pandemic, Crystal founded Greater Prospect Heights Mutual Aid (GPHMA) and rooted the group’s work in core principles of mutual aid learned from people of African descent and those who are indigenous and native to the United States. For two years, GPHMA worked to meet the needs of neighbors experiencing food insecurity and economic instability due to the COVID-19 pandemic –– especially older adults, undocumented immigrants, and those with underlying health conditions. During her first term in the City Council (2022-2023), Crystal introduced 78 bills and passed more legislation than any other first-term member in Brooklyn. She passed the second most bills among all new members and ranked seventh overall in the fifty-one member governing body. Her notable legislative accomplishments last session include her #AgeInPlaceNYC package , the How Many Stops Act, and bills to address the Black maternal mortality crisis and growing discrimination against LGBTQIA+ communities across the country. Crystal is the author of A Black Agenda for New York City , a comprehensive policy plan that provides recommendations for city government to tangibly improve the lives of Black residents across the five boroughs. She previously served as co-chair of the Council’s LGBTQIA+ Caucus, and co-authored The Marsha & Sylvia Plan — a first-of-its-kind policy agenda outlining priorities to support New York City’s growing population of LGBTQIA+ residents. In her first term, Crystal led two large-scale community planning efforts, including a community-led rezoning of Atlantic Avenue , and a land-use framework to ensure community priorities are integrated into the land use processes in District 35. Crystal is currently co-chair of the New York City Council’s Black, Latino, and Asian Caucus. She is a proud graduate of Spelman College and holds a master’s degree from George Washington University. Crystal lives with her wife and daughter in the district she represents. She is the first queer parent in the New York City Council. Biography Crystal Hudson is the Council Member for New York City’s District 35 in Brooklyn, representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. A third-generation Brooklynite and daughter of Jamaican and Honduran immigrants, she was elected in 2021 and made history as the first out gay Black woman ever elected in New York City. Crystal is a public servant committed to making government more accessible for more people. Her commitment to public service is personal and began when her mother started exhibiting signs of what would later be diagnosed as Alzheimer’s disease. As the only child of a single mother, Crystal quickly became the primary caregiver for her mother. She experienced first-hand"
  },
  {
    "candidate": "Hudson, Crystal",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/crystal-hudson/bio/",
    "text": "how difficult it is for working families to navigate complex, bureaucratic systems and access services and resources needed to keep older New Yorkers safe and healthy at home, where they can age in place and maintain their dignity. Crystal is a fierce advocate for older adults and families impacted by Alzheimer’s disease, and is unwavering in her commitment to serving families who are caring for loved ones. Before entering public service, Crystal spent more than a decade working in sports marketing and advertising –– first with the WNBA’s Washington Mystics and NBA’s Washington Wizards and later at Amtrak, where she managed a portfolio of sports, entertainment and multicultural marketing campaigns for the nation’s passenger rail service. Once she entered public service, Crystal served as Co-Director of the Community Outreach Unit at the New York City Council, First Deputy Public Advocate of Community Engagement at the Office of the NYC Public Advocate, and Chief of Operations to the Majority Leader of the City Council. In March 2020, in response to the COVID-19 global pandemic, Crystal founded Greater Prospect Heights Mutual Aid (GPHMA) and rooted the group’s work in core principles of mutual aid learned from people of African descent and those who are indigenous and native to the United States. For two years, GPHMA worked to meet the needs of neighbors experiencing food insecurity and economic instability due to the COVID-19 pandemic –– especially older adults, undocumented immigrants, and those with underlying health conditions. During her first term in the City Council (2022-2023), Crystal introduced 78 bills and passed more legislation than any other first-term member in Brooklyn. She passed the second most bills among all new members and ranked seventh overall in the fifty-one member governing body. Her notable legislative accomplishments last session include her #AgeInPlaceNYC package , the How Many Stops Act, and bills to address the Black maternal mortality crisis and growing discrimination against LGBTQIA+ communities across the country. Crystal is the author of A Black Agenda for New York City , a comprehensive policy plan that provides recommendations for city government to tangibly improve the lives of Black residents across the five boroughs. She previously served as co-chair of the Council’s LGBTQIA+ Caucus, and co-authored The Marsha & Sylvia Plan — a first-of-its-kind policy agenda outlining priorities to support New York City’s growing population of LGBTQIA+ residents. In her first term, Crystal led two large-scale community planning efforts, including a community-led rezoning of Atlantic Avenue , and a land-use framework to ensure community priorities are integrated into the land use processes in District 35. Crystal is currently co-chair of the New York City Council’s Black, Latino, and Asian Caucus. She is a proud graduate of Spelman College and holds a master’s degree from George Washington University. Crystal lives with her wife and daughter in the district she represents. She is the first queer parent in the New York City Council. Home Biography Staff Directory Budget Legislation & Policy District 35 Land Use Framework Atlantic Avenue Mixed Use Plan (AAMUP) Age in Place NYC Age in Place NYC 2.0 A Black Agenda for NYC The Marsha & Sylvia Plan Read PDF Version Legislation (2022-2023) District 35 Land Use Framework Atlantic Avenue Mixed Use Plan (AAMUP) Age in Place NYC Age in Place NYC 2.0 A Black Agenda for NYC The Marsha & Sylvia Plan Read PDF Version Read PDF Version Legislation (2022-2023) News & Media Opinion Press Releases & Statements Opinion Press Releases & Statements Participatory Budgeting Projects (2025) Ballot Supplement (2025) Polling Sites (2025) Winning Projects (2024) Projects (2024) Ballot Supplement (2024) Winning Projects (2023) Projects (2023) Projects (2025) Ballot Supplement (2025) Polling Sites (2025) Winning Projects (2024) Projects (2024) Ballot Supplement (2024) Winning Projects (2023) Projects (2023) Events & Community Resources Community Meetings Rat Task Force Spring Senior Series (2025) Spring Senior Series (2024) Street Co-Namings Summer Youth Series Community Meetings Rat Task Force Spring Senior Series (2025) Spring Senior Series (2024) Street Co-Namings Summer Youth Series Sign Up To Receive Emails District Office 55 Hanson Place, Suite 778 Brooklyn, NY 11217 Phone: 718-260-9191 Fax: 718-398-2808 Legislative Office 250 Broadway, Suite 1762 New York, NY 10007 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact"
  },
  {
    "candidate": "Hudson, Crystal",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/crystal-hudson/bio/",
    "text": "the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]