[
  {
    "candidate": "Huq, Md M*",
    "category": "bio",
    "score": null,
    "link": "https://neurology.med.wayne.edu/profile/af5985",
    "text": "Skip to page menu Skip to menu Skip to main content Login Search Search Neurology Neurology Menu About the department Administration Divisions Faculty Voluntary faculty Medical education Research Grand Rounds Job postings Hospitals Make an appointment Contact us A.H.M. Huq, MD 313 745 5788 313-745-0955 (fax) A.H.M. Huq, MD Narrative Bio Dr. Huq is a Clinical Professor of Pediatrics and Neurology at Wayne State University. He is also the director of Children Hospital of Michigan Gene Bank Research Facility. Dr. Huq received his medical degree in Bangladesh. He received his Ph.D. in Japan and carried out pediatrics, neurology and genetics residency training at Wayne State University and Baylor College of Medicine. He completed his postdoctoral studies at University of British Columbia. He has published on metabolic and neurogenetic disorders and also obtained grant support in these areas. His current research includes genetics of autism, developmental delay and epilepsy. Office Address Graduate Medical Dhaka Medical College, M.D., 1984 Position Title Professor of Pediatrics and Neurology (Clinical) Internships Residency Specialties Fellowships Wayne State University, Child Neurology, 1998-2000; Baylor College of Medicine, Genetics, 1993-1995 and 1995-1996 Interests Neurogenetic disorders, metabolic diseases, autism, neurocutaneous syndrome Publications Huq AHMM , Chugani DC, Hukku B, Serajee FJ. 2002 . Evidence of Somatic Mosaicism in Sturge Weber Syndrome. Neurology 59:780-781 (corresponding author) Nabi R, Zhong H, Serajee FJ and Huq AHMM. 2003 . No association between single nucleotide polymorphisms in DLX6 and Piccolo genes at 7q21-q22 and autism. Am J Med Genet; 119B:98-101 (corresponding author) Zhong H, Serajee FJ, Nabi R and Huq AHMM. 2003 . No association between the EN2 gene and autistic disorder. J Med Genet 40: e4 (corresponding author) Serajee FJ, Zhong H, Nabi R and Huq AHMM. 2003 . The metabotropic glutamate receptor 8 gene at 7q31: partial duplication and possible association with autism.J Med Genet; 40: e42 (corresponding author) Serajee FJ, Nabi R, Zhong H and Huq AHMM. 2003 . Association of INPP1, PIK3CG and TSC2 gene variants with autistic disorder: implications for phosphatidylinositol signaling in autism. J Med Genet, 40: e119 (corresponding author) Serajee FJ, Nabi R, Zhong H and Huq AHMM 2004 . Polymorphisms in xenobiotic metabolism genes and autism. J Child Neurol 19:413 - 7 (corresponding author) ← Return to listing Department of Neurology Detroit Medical Center University Health Center – 8th floor 4201 St. Antoine Detroit, MI 48201 Phone: 313-577-1242 Fax: 313-745-4216 Privacy and University Policies Wayne State University © 2025"
  }
]