[
  {
    "candidate": "Ikezi, Henry",
    "category": "bio",
    "score": null,
    "link": "https://www.voteike.com/henry-ikezi/",
    "text": "Donate Now Home Home Volunteer Volunteer Community Community About Henry Ikezi About Henry Ikezi Media Media Contact Contact Meet Henry Ikezi Meet Henry Ikezi Meet Henry Ikezi Builder, Leader and Advocate. Builder, Leader and Advocate. Builder, Leader and Advocate. As a proud resident of Queens for over three (3) decades, I know the challenges and opportunities that make our borough the most diverse and dynamic in America. My vision is rooted in common sense solutions, economic empowerment, and ensuring a safe, thriving community for all. With over two (2) decades in real estate, I have revitalized distressed neighborhoods, creating over 1,000 homes and improving countless lives. I attended Aviation High School in Queens, received a Bachelor’s Degree in Politics, Economics and Law from SUNY Old Westbury and subsequently studied for a Master’s Degree in Political Science at St. John’s University in Queens. I live, work and build in Queens – because our community deserves the best. My roots in Queens run deep. Unlike politicians who campaign in communities, but do not live in them, I have made a lifelong commitment to live, work and serve in Queens. My vision is clear: a borough that is safer, stronger and filled with opportunities for all residents. I am a leader rooted in Queens, a builder and an advocate who has spent over two (2) decades revitalizing Queens. From creating affordable housing to fighting for small businesses and public safety, I am committed to improving the borough. Now, I am running for Queens Borough President to bring real leadership, real solutions and real change to our communities. My approach goes beyond construction. I focus on neighborhood transformation, economic growth and community well-being. I am not a career politician. I am a problem solver and a fighter for the people. With your support, I am ready to bring real leadership and real solutions to our borough. Please join me in making Queens the home our families deserve. Donate Now As a proud resident of Queens for over three (3) decades, I know the challenges and opportunities that make our borough the most diverse and dynamic in America. My vision is rooted in common sense solutions, economic empowerment, and ensuring a safe, thriving community for all. With over two (2) decades in real estate, I have revitalized distressed neighborhoods, creating over 1,000 homes and improving countless lives. I attended Aviation High School in Queens, received a Bachelor’s Degree in Politics, Economics and Law from SUNY Old Westbury and subsequently studied for a Master’s Degree in Political Science at St. John’s University in Queens. I live, work and build in Queens – because our community deserves the best. My roots in Queens run deep. Unlike politicians who campaign in communities, but do not live in them, I have made a lifelong commitment to live, work and serve in Queens. My vision is clear: a borough that is safer, stronger and filled with opportunities for all residents. I am a leader rooted in Queens, a builder and an advocate who has spent over two (2) decades revitalizing Queens. From creating affordable housing to fighting for small businesses and public safety, I am committed to improving the borough. Now, I am running for Queens Borough President to bring real leadership, real solutions and real change to our communities. My approach goes beyond construction. I focus on neighborhood transformation, economic growth and community well-being. I am not a career politician. I am a problem solver and a fighter for the people. With your support, I am ready to bring real leadership and real solutions to our borough. Please join me in making Queens the home our families deserve. Donate Now Solutions Not Politics! A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future Home Volunteer Community About Henry Ikezi Media Contact Email Facebook Instagram TikTok YouTube X Address: 188-05 Linden Boulevard, St. Albans, NY 11412 © 2025. All rights reserved. Henry Ikezi for Queens Borough President 2025 PAID FOR BY HENRY IKEZI FOR QUEENS BOROUGH PRESIDENT COMMITTEE Menu"
  },
  {
    "candidate": "Ikezi, Henry",
    "category": "bio",
    "score": null,
    "link": "https://www.voteike.com/mission-henry-ike/",
    "text": "Donate Now Home Home Volunteer Volunteer Community Community About Henry Ikezi About Henry Ikezi Media Media Contact Contact Welcome to the campaign of Henry Ikezi, a visionary leader poised to bring transformative change as the next Queens Boro President in 2025. With a steadfast commitment to addressing critical issues plaguing our community, Henry stands as a beacon of hope and progress for the diverse neighborhoods of Queens County, New York City. A Vision for Change: Henry Ikezi’s candidacy is rooted in a profound vision for a safer, more prosperous Queens. His platform focuses on tackling multifaceted challenges such as crime, homelessness, the shelter system, and the migrant crisis that significantly impact the lives of Queens’ residents. Henry firmly believes that a proactive approach, rooted in compassion and community involvement, is pivotal to creating lasting solutions to these complex issues. Expertise in Real Estate and Community Welfare: With a background in real estate, Henry Ikezi brings a unique perspective to the table. His extensive experience has enabled him to understand the fundamental importance of housing stability in people’s lives. Throughout his career, he has worked tirelessly to ensure that individuals and families have access to safe and affordable housing, preventing homelessness and providing support to those in need. Henry’s hands-on approach and practical solutions have positively impacted countless lives across Queens. Championing Small Businesses: Henry Ikezi recognizes the vital role that small businesses play in the fabric of Queens’ communities. He advocates for policies that empower local entrepreneurs, offering them the support and resources necessary to thrive in a competitive landscape. Understanding the challenges faced by small businesses over the past years, Henry is committed to implementing strategies that will revitalize and strengthen Queens’ economic landscape. A Promise of Positive Change: Henry Ikezi stands as a harbinger of change, advocating for a departure from policies that have hindered the growth and prosperity of Queens. His unwavering dedication to fostering a safer environment, providing stable housing, supporting local businesses, and addressing critical societal issues defines his candidacy. Join the Movement: As we move forward, Henry Ikezi invites you to join this movement toward a better, brighter future for Queens County. Together, let’s build a community where safety, prosperity, and opportunity are accessible to all. Vote for Henry Ikezi as Queens Boro President in 2025 and be a part of a transformation that will shape the future of Queens for generations to come. Solutions Not Politics! A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future A Stronger, Safer and More Prosperous Queens. Bringing People Together, Building a Brighter Future Home Volunteer Community About Henry Ikezi Media Contact Email Facebook Instagram TikTok YouTube X Address: 188-05 Linden Boulevard, St. Albans, NY 11412 © 2025. All rights reserved. Henry Ikezi for Queens Borough President 2025 PAID FOR BY HENRY IKEZI FOR QUEENS BOROUGH PRESIDENT COMMITTEE Menu"
  }
]