[
  {
    "candidate": "Joseph, Rita C",
    "category": "bio",
    "score": null,
    "link": "https://www.ritajoseph.com/rita-joseph",
    "text": "top of page CHIP IN $20 TODAY TO HELP RE-ELECT RITA JOSEPH TO THE CITY COUNCIL MEET RITA MEET RITA ON THE ISSUES ON THE ISSUES More More DONATE DONATE After immigrating to the U.S. from Haiti as a child, Rita became civically engaged and began her life of advocacy. While growing up in Flatbush, Rita quickly recognized the power of activism. At just 19 years old, she organized her first rally with a group she co-founded, Haitian Enforcement Against Racism, in order to protest the FDA's discriminatory \"bad blood\" rules that prevented people of Haitian descent from donating blood. The rally succeeded in its mission, and the FDA rescinded the racist rule. Since organizing the rally, which had more than 150,000 people participate, Rita hasn't looked back with her community advocacy. As a teen mom who got a full college scholarship, Rita knows what it means to have to work for what you have. Rita spent her twenties raising two kids while organizing protests against cuts to student MetroCards and police brutality, on top of her full-time job. She organized not because it was easy, but because it was necessary for her community. Since then, she hasn’t stopped working for her neighbors. Rita has deep roots in the community she now represents as City Council Member of District 40. She is an active member of the Holy Innocent Catholic Church, served as Chair of the Neighborhood Advisory Board, and was a part of the Citywide Participatory Budgeting Committee for 2 years. As an educator for many years at PS6, she was able to be a part of changing the lives of thousands of students and even helped her school secure hundreds of thousands of dollars each year for technological improvements. Rita currently serves as the Chair of the Committee on Education and also sits on committees related to public safety, civil and human rights, immigration, oversight and investigations, & children and youth. She is also a member of the Progressive Caucus, Women's Caucus, and Black, Latino, & Asian Caucus. Since joining the City Council in January 2022, Rita has been a part of many major accomplishments including in the most recent City budget, where as a member of the budget negotiating team, she was able to beat back proposed cuts to education, ensuring more than $600 million for our schools, including investments in early education enrollment, Pre-K, mental health, and afterschool programming. Rita Joseph is a proud public school graduate of the now-closed Sarah J. Hale High School. She holds a BS in Liberal Arts from St. Francis College and a dual Master’s in General and Special Education from Touro College. Rita currently lives in Prospect Lefferts Gardens where she raises her 4 children. bottom of page"
  }
]