[
  {
    "candidate": "Joseph, Shakur T",
    "category": "bio",
    "score": null,
    "link": "https://www.shakurforthebronx.com/about",
    "text": "top of page Menu Menu Close Close About Shakur About Shakur The Fight The Fight Events Events Endorsement Endorsement Voting Voting Contact Contact About Shakur About Shakur The Fight The Fight Events Events Endorsement Endorsement Voting Voting Contact Contact Menu Menu Close Close About Shakur About Shakur The Fight The Fight Events Events Endorsement Endorsement Voting Voting Contact Contact CONTRIBUTE VOLUNTEER As someone who has lived through many of the challenges our community faces, I’m committed to creating real change by improving education, ensuring housing stability, addressing food insecurity, or supporting those reentering society after incarceration. As someone who has lived through many of the challenges our community faces, I’m committed to creating real change by improving education, ensuring housing stability, addressing food insecurity, or supporting those reentering society after incarceration. I know what it’s like to feel the weight of these issues firsthand, and I’m dedicated to being a leader who understands and fights for our needs. While I was investing in school, I still faced challenges at home. From an early age, my family was deeply affected by mass incarceration. From my earliest memory, I never had my entire family in one place. All 7 of my brothers encountered the criminal justice system at a young age, resulting in repeated arrests, distrust of the system, and a disruption in my family’s stability. The absence of my brothers during these years meant losing out on access, guidance, and support throughout my middle school life, which ultimately led me to engage in the cycle as well. At the age of 12, I was arrested for larceny of school property because I wanted a laptop at home—something I didn’t have access to or the funds to obtain. Although this was an isolated incident, it was a reality that shaped my childhood, instilling in me a deep understanding of how systemic barriers can tear families apart and influence poor decision-making for children who lack resources, as I did. After my investment in school and my encounter with the criminal justice system, I realized that I needed to create opportunities for myself and gain access to resources to improve my family’s life. High school became a chance for me to do that. At the age of 14, I started working, and throughout my teens, I took on odd jobs to help at home, buy groceries, and contribute to paying bills. The lack of resources my family had pushed me into an adult role early, shifting my focus away from hanging out with peers to becoming a semi-provider for my family. By 16, I had moved out of my mother’s house and began supporting myself. I worked multiple jobs, paid rent, and attended school, often juggling more than I thought I could handle. These struggles taught me the importance of resilience and drive. I know what it’s like to feel overwhelmed by the weight of responsibility, and that’s why I’m committed to supporting others who face similar challenges. My experiences drive my belief that everyone deserves the chance to succeed, and I’ve dedicated my career to making that a reality for people and families in my community. While I was investing in school, I still faced challenges at home. From an early age, my family was deeply affected by mass incarceration. From my earliest memory, I never had my entire family in one place. All 7 of my brothers encountered the criminal justice system at a young age, resulting in repeated arrests, distrust of the system, and a disruption in my family’s stability. The absence of my brothers during these years meant losing out on access, guidance, and support throughout my middle school life, which ultimately led me to engage in the cycle as well. At the age of 12, I was arrested for larceny of school property because I wanted a laptop at home—something I didn’t have access to or the funds to obtain. Although this was an isolated incident, it was a reality that shaped my childhood, instilling in me a deep understanding of how systemic barriers can tear families apart and influence poor decision-making for children who lack resources, as I did. After my investment in school and my encounter with the criminal justice system, I realized that I needed to create opportunities for myself and gain access to resources to improve my family’s life. High school became a chance for me to do that. At the age of 14, I started working, and throughout my teens, I took on odd"
  },
  {
    "candidate": "Joseph, Shakur T",
    "category": "bio",
    "score": null,
    "link": "https://www.shakurforthebronx.com/about",
    "text": "jobs to help at home, buy groceries, and contribute to paying bills. The lack of resources my family had pushed me into an adult role early, shifting my focus away from hanging out with peers to becoming a semi-provider for my family. By 16, I had moved out of my mother’s house and began supporting myself. I worked multiple jobs, paid rent, and attended school, often juggling more than I thought I could handle. These struggles taught me the importance of resilience and drive. I know what it’s like to feel overwhelmed by the weight of responsibility, and that’s why I’m committed to supporting others who face similar challenges. My experiences drive my belief that everyone deserves the chance to succeed, and I’ve dedicated my career to making that a reality for people and families in my community. For over a decade, I’ve dedicated my life to youth development and nonprofit work, building relationships and creating opportunities for others. For over a decade, I’ve dedicated my life to youth development and nonprofit work, building relationships and creating opportunities for others. Through my roles in various nonprofits and education institutions, I’ve had the privilege of working with young people who, like me, have faced hardships in many different ways. I’ve worked in education-centered nonprofit programs that provided wraparound services to students, closing the achievement gap and supporting their emotional and academic growth. I’ve also partnered in organizations focused on suicide prevention and helping youth navigate their identities, ensuring they have the resources and support they need to thrive. Across all of these roles, my mission has always been clear: to create spaces where young people can be seen, heard, and supported in ways that allow them to succeed. This drive to make a difference extends beyond youth development. My campaign is grounded in four core issues that I know are crucial to our community: education, housing, access to food, and supporting those reentering society after incarceration. These are issues I’ve lived through, and they are the same struggles I see families in the Bronx facing every day. My work has always been about building communities where people have the resources they need to thrive—whether in the classroom, at home, or in everyday life. Through my roles in various nonprofits and education institutions, I’ve had the privilege of working with young people who, like me, have faced hardships in many different ways. I’ve worked in education-centered nonprofit programs that provided wraparound services to students, closing the achievement gap and supporting their emotional and academic growth. I’ve also partnered in organizations focused on suicide prevention and helping youth navigate their identities, ensuring they have the resources and support they need to thrive. Across all of these roles, my mission has always been clear: to create spaces where young people can be seen, heard, and supported in ways that allow them to succeed. This drive to make a difference extends beyond youth development. My campaign is grounded in four core issues that I know are crucial to our community: education, housing, access to food, and supporting those reentering society after incarceration. These are issues I’ve lived through, and they are the same struggles I see families in the Bronx facing every day. My work has always been about building communities where people have the resources they need to thrive—whether in the classroom, at home, or in everyday life. In 2020, as our country confronted racial injustice on a large scale, I found myself inspired to do more for my community. In 2020, as our country confronted racial injustice on a large scale, I found myself inspired to do more for my community. Watching people come together to demand better was a powerful reminder that we deserve more than what we’ve been dealing with for so long. That moment wasn’t just about protests; it was about recognizing that our communities have the power to demand change and overcome injustice. That inspiration has stayed with me, and it’s why I’m running for City Council. I believe that the Bronx deserves leadership that sees, hears, and fights for every resident. I’ve been in the same shoes as so many people in our district—working hard, trying to balance responsibilities, and fighting for a better life. That’s why I’m committed to creating opportunities that make life easier and more equitable for everyone. I’m running for City Council because I believe that together, we can build a Bronx where every family has the resources and support they need to thrive."
  },
  {
    "candidate": "Joseph, Shakur T",
    "category": "bio",
    "score": null,
    "link": "https://www.shakurforthebronx.com/about",
    "text": "I invite you to join me in this mission. Let’s work together to create a Bronx where we can all be proud to live, work, and raise our families. Watching people come together to demand better was a powerful reminder that we deserve more than what we’ve been dealing with for so long. That moment wasn’t just about protests; it was about recognizing that our communities have the power to demand change and overcome injustice. That inspiration has stayed with me, and it’s why I’m running for City Council. I believe that the Bronx deserves leadership that sees, hears, and fights for every resident. I’ve been in the same shoes as so many people in our district—working hard, trying to balance responsibilities, and fighting for a better life. That’s why I’m committed to creating opportunities that make life easier and more equitable for everyone. I’m running for City Council because I believe that together, we can build a Bronx where every family has the resources and support they need to thrive. I invite you to join me in this mission. Let’s work together to create a Bronx where we can all be proud to live, work, and raise our families. MEET SHAKUR JOSEPH I’m Shakur Joseph, and I’m running for City Council to amplify the voices of our community in District 16. My campaign is grounded in the radical belief that every resident in the Bronx deserves access to resources and opportunities that allow them to thrive. FOLLOW THE CAMPAIGN JOIN THE FIGHT FOLLOW THE CAMPAIGN JOIN THE FIGHT JOIN THE FIGHT Checks should be made payable to Legacy Campaign - Shakur Joseph 2025 and mailed to 232 W 116th St, PO BOX 12, NY, NY 10026 Checks should be made payable to Legacy Campaign - Shakur Joseph 2025 and mailed to 232 W 116th St, PO BOX 12, NY, NY 10026 Website paid by the Legacy Campaign - Shakur Joseph 2025. Website paid by the Legacy Campaign - Shakur Joseph 2025. CONTRIBUTE Privacy Policy Privacy Policy SUPPORT THE FIGHT SUPPORT THE FIGHT Support Shakur T Joseph for District 16 City Council as we strive for positive change and progress within our communities. Any contributions or donation made will make a difference in shaping the future of our city. Support Shakur T Joseph for District 16 City Council as we strive for positive change and progress within our communities. Any contributions or donation made will make a difference in shaping the future of our city. CONTRIBUTE VOLUNTEER Checks should be made payable to Legacy Campaign - Shakur Joseph 2025 and mailed to 232 W 116th St, PO BOX 12, NY, NY 10026 Checks should be made payable to Legacy Campaign - Shakur Joseph 2025 and mailed to 232 W 116th St, PO BOX 12, NY, NY 10026 Campaign Finance Board limits individual contributions to $1,050. Contributions from corporations and LLCs are prohibited. State law prohibits making a contribution in someone else’s name, reimbursing someone for a contribution made in your name, being reimbursed for a contribution made in your name, or claiming to have made a contribution when a loan is made. Campaign Finance Board limits individual contributions to $1,050. Contributions from corporations and LLCs are prohibited. State law prohibits making a contribution in someone else’s name, reimbursing someone for a contribution made in your name, being reimbursed for a contribution made in your name, or claiming to have made a contribution when a loan is made. Campaign Finance Board limits individual contributions to $1,050. Contributions from corporations and LLCs are prohibited. State law prohibits making a contribution in someone else’s name, reimbursing someone for a contribution made in your name, being reimbursed for a contribution made in your name, or claiming to have made a contribution when a loan is made. About Shakur About Shakur The Fight The Fight Events Events Endorsement Endorsement Voting Voting Contact Contact Go Go bottom of page"
  }
]