[
  {
    "candidate": "Joyner, Scott E",
    "category": "bio",
    "score": null,
    "link": "https://joynerformayor.jimdosite.com/",
    "text": "Home Home Platform My Plan for NYC Platform My Plan for NYC My Plan for NYC Get Involved Get Involved Donate Donate They’ve Failed You. I Won’t. Time for Independent Leadership! #JoynerforMayor #joynerforthepublic Donate Get Involved About me: Scott Joyner is a working-class New Yorker, independent thinker, and problem-solver who is running for mayor to put NYC residents first. Born and raised in the city, Scott has seen firsthand how failed leadership and political games have left hardworking New Yorkers struggling while career politicians protect their own interests. Scott is not a career politician—he’s one of us. He has worked on the ground, understands the daily struggles of working-class families, and believes it's time for real, independent leadership that prioritizes the people over politics. His campaign is built on common-sense solutions, accountability, and a commitment to making NYC a city that works for everyone—not just the wealthy, political insiders, or special interests. As mayor, Scott will focus on: ✔ **Fixing NYCHA** – Holding leadership accountable, improving conditions, speeding up repairs, and modernizing without displacing residents. ✔ **Prioritizing NYC Residents** – Ensuring that jobs, services, and housing opportunities go to New Yorkers first. ✔ **Reforming City Agencies** – Merging inefficient departments, cutting waste, and making government work for the people. ✔ **Safer Streets & Stronger Communities** – Sensible policing reform, youth programs, trade schools, and community centers. ✔ **Lowering the Cost of Living** – Raising wages, reducing taxes through budget efficiency, and cutting unnecessary spending. Scott believes in **transparency, accountability, and bold action**. He is committed to making NYC safer, more affordable, and more efficient—without the empty promises of career politicians. **They’ve Failed You. I Won’t. Time for Independent Leadership!** Join the movement and help bring real change to NYC! Cookie Policy This website uses cookies. You can find more information on the types of cookies used as well as enable individual cookies in their respective categories. You can adjust your settings at any time through the link in the footer of this website. Accept all Reject all Accept only selected"
  }
]