[
  {
    "candidate": "Kagan, Ari",
    "category": "bio",
    "score": null,
    "link": "https://www.thefai.org/profile/ari-kagan",
    "text": "About Policy Areas Publications Programs Ari Kagan Research Fellow Bio Ari Kagan is a Research Fellow at the Foundation for American Innovation, where his work focuses on artificial intelligence. Before joining FAI, he was the founder and CEO at an AI software startup, and helped run a startup incubator at Duke. He holds a BA in Cognitive Science from Yale University. Stay in the loop 2443 Fillmore St. #380-3386 San Francisco, CA 94115-1814 About Contact Us Our Team Our Board Research Events Labs Fellowships Media Bookshop About Contact Us Our Team Our Board Research Events Labs Fellowships Media Bookshop Stay in the loop on our policy events and publications. ©2025 FOUNDATION FOR AMERICAN INNOVATION. ALL RIGHTS RESERVED"
  },
  {
    "candidate": "Kagan, Ari",
    "category": "bio",
    "score": null,
    "link": "https://www.bkreader.com/newsletter/meet-your-candidates-inna-vernikov-and-ari-kagan-run-for-city-council-district-48-10519040",
    "text": "FREE newsletter Support Your Profile Your Subscriptions Support Local News Payment History Sign Out Sign In Register Support Local News Sign up for Daily Headlines Sign up for Notifications Contact Us Home News Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Events About About Us Contact Us Our Team Write for Us About Us Contact Us Our Team Write for Us Advertise Neighborhood Profiles NYC Elections 2025 Home Newsletter Meet Your Candidates: Inna Vernikov And Ari Kagan Run For City Council District 48 Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message Supplied: Inna Vernikov and Ari Kagan Listen to this article Former Council Member Ari Kagan and incumbent Council Member Inna Vernikov are locked in a contentious campaign for south Brooklyn in the District 48 City Council race. Both Kagan and Vernikov are Jewish immigrants from the former Soviet Union block: Vernikov from Ukraine and Kagan from Belarus. Kagan got his start in journalism and made a number of attempts to run for office, inspired by a feeling that politicians who represented him were ignoring the community. Kagan served in the City Council from 2022 to 2023 representing District 47, which encompasses parts of Bay Ridge, Coney Island, Sea Gate, Dyker Heights, Bath Beach and Gravesend. He switched party affiliation in December 2022, becoming a Republican. The following year, he lost his seat to Justin Brannan. Vernikov worked as an attorney before running for City Council in 2021. Vernikov, like Kagan, switched to the Republican Party—although she switched before she ran for office. Three years in, Vernikov said she is proud of her push to curb non-citizen voting, which was recently outlawed by the New York State Court of Appeals , her push to end antisemitism at the City University of New York and increasing the budget for the Police Department. On the issue of policing, both agreed that the NYPD needed more manpower and resources. Kagan said democratic policies are “tough on police and soft on criminals.” Vernikov agreed, saying “police have felt very handcuffed.” Both said they supported President Donald Trump’s immigration policies. “How could I be anti-immigrant if I'm an immigrant?” Vernikov questioned. Kagan similarly said: “I came as an immigrant legally and I followed the letter of the law.” They also believe that antisemitism has been exacerbated by pro-Palestinian advocates following the Oct. 7 attack on Israel by Hamas, and that they were working to defend Jews against antisemitism. The two also shared their love for Israel. The candidates diverged on housing, however. Kagan said property taxes were too high and that seniors living in co-ops needed access to more rebates. He added that late Section 8 disbursements hurt renters and landlords, something he’d work to fast-track. Vernikov, on the other hand, said “I don't think that we actually have a problem with housing.” She did, however, point to her advocacy on homelessness, calling for more homeless people to get housing instead of shelters. “A lot of the radical left believes that they are entitled to be on the street and we should leave them alone,” she added. “Well, I disagree. I think that they're entitled to a dignified living.” The race intensified in late March when Kagan announced his candidacy. Kagan told BK Reader that he decided to jump in as he felt Vernikov had “played games for several months,\" when she was thinking about running for a state senator seat instead. Kagan said her indecision on which race to enter “jeopardized the Republican Party’s ability to recruit and prepare other candidates.\" “My highest priority will always be my constituents, and after careful consideration, I have decided that remaining in my current position in the City Council is where I can best continue representing the thousands of New Yorkers that I have the immense pleasure to serve,\" Vernikov said in a statement when she made her decision to run for reelection. Kagan, who works for state Senator Steve Chan, said he often receives calls from D48 residents, which includes parts of Gravesend, Coney Island, Brighton Beach, Midwood and Sheepshead Bay, about various quality of life issues"
  },
  {
    "candidate": "Kagan, Ari",
    "category": "bio",
    "score": null,
    "link": "https://www.bkreader.com/newsletter/meet-your-candidates-inna-vernikov-and-ari-kagan-run-for-city-council-district-48-10519040",
    "text": "that Vernikov \"has neglected.\" “My question to them was: why do you not call your local council person?” Kagan said, adding that he would host town halls to address constituent concerns. Kagan also accused Vernikov of not supporting fellow Republican candidates, such as state Representatives Alec Brook-Krasny and Michael Novakhov's reelection campaigns. Vernikov pushed back that her office was \"number one in New York City for constituent services\" and that she is \"a consistent, outspoken voice for Republican and conservative values.\" “I've known Ari Kagan for about 15 years and ever since I met him, he's been trying to run for office,” Vernikov added. “And he will do whatever it takes to win a seat, whether it's switching parties, whatever is needed.” Tags: This has been shared 0 times 0 times 0 Shares Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message More Newsletter Reader Feedback Sort Oldest Newest Oldest Newest Show See a typo/mistake? Have a story/tip? Stay in the loop. Get the latest local news delivered directly to your inbox every afternoon, for free! News Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Arts & Entertainment Business & Innovation Health & Wellness Lifestyle & Culture Non-Profit & Community Policy & Government Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Features Best of Brooklyn Black History Month BKLYN Sauce Local Voices Letters From The Editor Spotlight Events Advertise Neighborhood Profiles NYC Elections 2025 About Us Contact Us Privacy Policy Community Guidelines Our Team Write for Us Advertising Sponsored Content © 2025 BKReader"
  }
]