[
  {
    "candidate": "Kefalas, Peter",
    "category": "bio",
    "score": null,
    "link": "https://www.peterkefalas.com/info/about-peter-kefalas/",
    "text": "Donate Donate Menu Home Donate Now Peter Kefalas Brooklyn Staten Island Manhattan Queens The Bronx Talk to Peter Menu Home Donate Now Peter Kefalas Brooklyn Staten Island Manhattan Queens The Bronx Talk to Peter Menu Home Home Donate Now Donate Now Peter Kefalas Peter Kefalas Brooklyn Brooklyn Staten Island Staten Island Manhattan Manhattan Queens Queens The Bronx The Bronx Talk to Peter Talk to Peter Home Home Donate Now Donate Now Peter Kefalas Peter Kefalas Brooklyn Brooklyn Staten Island Staten Island Manhattan Manhattan Queens Queens The Bronx The Bronx Talk to Peter Talk to Peter About Peter Kefalas A New Yorker Who Fights for the People Peter Kefalas is a lifelong New Yorker with deep roots in Queens and a relentless drive to hold those in power accountable. Raised in Rego Park, Peter witnessed firsthand the struggles of hardworking families, watching his single mother juggle multiple jobs while pursuing her education to build a better future for her children. These early experiences instilled in him a profound respect for perseverance, fiscal responsibility, and the importance of standing up for what is right. A Career Built on Accountability and Leadership With decades of experience in business development, sales strategy, and financial consulting, Peter has helped companies expand their market share, streamline operations, and operate within tight budgets. He has worked with businesses of all sizes—from small startups to multinational corporations—developing strategies that promote efficiency and long-term growth. As a small business owner and consultant, Peter has been a trusted partner in fixing, growing, and training sales teams for various companies across multiple industries. His expertise in financial oversight and operational efficiency has made him a respected leader in the private sector—skills that he now applies to advocating for transparency and fiscal discipline in government. Champion for Civic Engagement & Media Transparency For the past year, Peter has been a key figure at QNS Voice (qnsvoice.com), a grassroots media outlet dedicated to covering issues that mainstream news ignores. Through investigative journalism, interviews with political figures, and in-depth reporting, QNS Voice has become a powerful platform exposing government overreach, corruption, and the failures of city leadership. In addition to his media work, Peter is the author of “1984 Bureaucratic Tentacles: Rise and Fall of The Chevron Doctrine,” published on August 3, 2024. His book explores the collapse of the Chevron Doctrine , a legal principle that allowed unchecked bureaucratic power at the federal level. This doctrine’s downfall signals a shift toward greater government accountability—something Peter believes must extend to the state and city levels. A Fighter for the People of NYC Peter has never shied away from a fight when it comes to standing up for the rights of New Yorkers. In 2024, he led a grassroots movement against the construction of homeless shelters in Rego Park that were pushed through without community input. He mobilized residents, organized protests, and brought national attention to the lack of transparency in city planning decisions. Through his activism, media presence, and relentless pursuit of accountability, Peter Kefalas has proven himself to be a champion for everyday New Yorkers. Whether exposing financial mismanagement, pushing for fair policies, or advocating for those whose voices have been ignored, he remains committed to making New York City a place where taxpayers are respected, businesses can thrive, and government operates with integrity. Stay informed. Stay engaged. The fight for a better NYC starts here. Donate Now Donate Now Youtube Youtube Peter Kefalas NYC Comptroller Brooklyn Staten Island Queens The Bronx Manhattan Donate to Make NYC Better Talk to Peter Privacy Terms and Conditions PeterKefalas.com © 2025 . All Rights Reserved. Paid for by Peter Kefalas for NYC Comptroller 2025"
  }
]