[
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Abbey Laurel-Smith Abbey Laurel-Smith Abbey Laurel-Smith Independent Candidate, Mayor of New York November 4, 2025 Education Oxford Brookes University, 2000 Campaign website Campaign Twitter Personal LinkedIn Abbey Laurel-Smith (independent) is running for election for Mayor of New York . He declared candidacy for the general election scheduled on November 4, 2025 . Laurel-Smith completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Abbey Laurel-Smith earned a bachelor's degree from The University of Buckingham and Oxford Brookes University in 2000. His career experience includes working as an artist, heritage manager, and cloud banker. He has been affiliated with ChowBanQ Corp and FreshEddy Inc. [1] Elections Elections 2025 2025 See also: Mayoral election in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. Additional general election candidates will be added here following the primary. General election for Mayor of New York Incumbent Eric Adams , Jean Anglade , Kyle Gutierrez , Abbey Laurel-Smith , and James Walden are running in the general election for Mayor of New York on November 4, 2025. Candidate Eric Adams (Independent) Jean Anglade (Independent) Submit photo Kyle Gutierrez (Independent) Abbey Laurel-Smith (Independent) Submit photo James Walden (Independent) Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for Mayor of New York The following candidates are running in the Democratic primary for Mayor of New York on June 24, 2025. Candidate Adrienne Adams Submit photo Selma Bartholomew Michael Blake Andrew Cuomo Corinne Fisher Brad Lander Deirdre Levy Zohran Kwame Mamdani Zellnor Myrie Paperboy Prince Jessica Ramos Scott Stringer Whitney Tilson There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Cleopatra Fitzgerald (D) Republican primary election Republican primary for Mayor of New York The following candidates are running in the Republican primary for Mayor of New York on June 24, 2025. Candidate Joe Alny Darren Dione Aquino Submit photo Naomi Coley Gonzalo Duran John Harris Submit photo Kris Lord Submit photo James Manning Submit photo Montell Moseley Submit photo Ronen Nahom Fátimazöhra Nouinou Submit photo David Rem Curtis Sliwa There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Abbey Laurel-Smith completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Laurel-Smith's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well."
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Full name is Abbey Laurel-Smith, but everyone calls me \"Smithie\". I am a professional artist, but now work as a cloud banker and a fintech financier. Currently, I am engaged with building \"PalmPay\" - a palm id/screening payment platform that is aimed at defeating rampant shoplifting, theft, all kinds of petty crimes, terrorism as well as identity fraud. I grew up around Columbia University area in the Upper West side of New York City. My main goal - as at now, is to use the full power of blockchain to put the city of New York on a solid digital economical footprint. Make the city of New York safe, secure and sustainable by: - bringing down hyper inflated cost of living by slashing rent and rates by 30% for all New Yorkers'. - make sure retirees are not taxed on their retired income. - aggressively tackle homelessness, vagrancy, petty thefts and crimes on our streets. - set up a citywide agritectural initiative, so we could grow 30% of food and drinks we consume in the city. - adjust payroll to make way for universal healthcare/insurance trust that will fund itself outside city's budget. - adjust zoning law to make way for affordable housing as well as freeze rampant development in Manhattan. - use citywide public works/projects to energize communities outside Manhattan. My main goal - as at now, is to use the full power of blockchain to put the city of New York on a solid digital economical footprint. Make the city of New York safe, secure and sustainable by: - bringing down hyper inflated cost of living by slashing rent and rates by 30% for all New Yorkers'. - make sure retirees are not taxed on their retired income. - aggressively tackle homelessness, vagrancy, petty thefts and crimes on our streets. - set up a citywide agritectural initiative, so we could grow 30% of food and drinks we consume in the city. - adjust payroll to make way for universal healthcare/insurance trust that will fund itself outside city's budget. - adjust zoning law to make way for affordable housing as well as freeze rampant development in Manhattan. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Put New Yorkers' first in all things and in every thing. Protect family budgets by reducing rent and rates by 30%, so New Yorkers' could once again learn to save, loan cash to banks and help bring down interest rates, as well as having a little extra to pay for after school tuition for their kids. Re-zone some strictly commercial areas, to make way for affordable housing, refurbishment jobs, new stream of revenue for landlords and the city. Enact city wide public/community development projects as a way to create jobs, new businesses, new wealth and a source of income for the next generation. Cancel congestion charge - so we don't have to be conditioned to pay to go to work. We are not parolees and should in no way be treated as such. Fix transport system in the city by bringing back a network of tramway system in all the five boroughs rather than waste time and money on digging expensive subway tunnels. Tramways are greener, quieter, cheaper to set up, requires little or low maintenance, plus it offers a better way to see the city. Work on alternative energy sources like building waste burning furnaces to provide electricity for the city. Build turbines to be driven by currents in areas where we have constant ocean waves all year round. Bring much needed dignity and respect to the NYPD, the FDNY, city workers, union workers, taxi cab workers and air port workers. Robustly fund our education system by reducing the interest of private donors, groups and trust funders. Put New Yorkers' first in all things and in every thing. Protect family budgets by reducing rent and rates by 30%, so New Yorkers' could once again learn to save, loan cash to banks and help bring down interest rates, as well as having a little extra to pay for after school tuition for their kids. Re-zone some strictly commercial areas, to make way for affordable housing, refurbishment jobs, new stream of revenue for landlords and the city. Enact city wide public/community development projects as a way to create jobs, new"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "businesses, new wealth and a source of income for the next generation. Protect family budgets by reducing rent and rates by 30%, so New Yorkers' could once again learn to save, loan cash to banks and help bring down interest rates, as well as having a little extra to pay for after school tuition for their kids. Re-zone some strictly commercial areas, to make way for affordable housing, refurbishment jobs, new stream of revenue for landlords and the city. Cancel congestion charge - so we don't have to be conditioned to pay to go to work. We are not parolees and should in no way be treated as such. Fix transport system in the city by bringing back a network of tramway system in all the five boroughs rather than waste time and money on digging expensive subway tunnels. Tramways are greener, quieter, cheaper to set up, requires little or low maintenance, plus it offers a better way to see the city. Work on alternative energy sources like building waste burning furnaces to provide electricity for the city. Build turbines to be driven by currents in areas where we have constant ocean waves all year round. Bring much needed dignity and respect to the NYPD, the FDNY, city workers, union workers, taxi cab workers and air port workers. Robustly fund our education system by reducing the interest of private donors, groups and trust funders. What areas of public policy are you personally passionate about? Tackle criminal justice system by charting a pathway to jobs, education, training, homeownership and other opportunities that has been denied those native New Yorkers' with DUI, DWI and other violations on their ID's and licenses. Who do you look up to? Whose example would you like to follow, and why? Vice Admiral Thomas Cochrane and General Ulysses Grant for their simple and direct focus on duty above anything else.. Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? None comes to mind. What characteristics or principles are most important for an elected official? Be honest, be humble, be open to new ideas, listen to the will of the people. What qualities do you possess that you believe would make you a successful officeholder? I am very creative, adaptive and focused. What do you believe are the core responsibilities for someone elected to this office? General welfare of the city as the city's first executive officer. The well being of the city's residents as a policy maker, and enforcement of legal processes and mandates as a lead officer of the court, because New York and the five boroughs is not only a chartered city, it is also a county. What legacy would you like to leave? I'd love to be remembered as the Mayor who turned the city around by making it safe, secure and sustainable for the generation coming up behind us. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? Watching Berlin Wall being torn apart. I was twenty six then. What was your very first job? How long did you have it? Professional artist and heritage manager for almost forty years now. What is your favorite book? Why? The English history If you could be any fictional character, who would you want to be? Shrek What was the last song that got stuck in your head? The swan lake. What is something that has been a struggle in your life? Afraid of being bored and not having something to do. A mayor is a leader in his or her city. What does that mean to you? It means the Mayor is responsible for advocating and for putting forward policies and administrative decisions that impact lives and well being of the general public. If the mayor in your city is a member of the city council and there's a city manager appointed to handle the day-to-day administration of the city government, what do you believe should be the mayor's top priority in office? Following up on policies and legislations that align with city's long term development, vision and goals - especially in areas where the city, the state, other states as well as the federal government is concerned. If the mayor in your city is not a member of the city council and oversees the day-to-day administration of the city government, what do you believe is the ideal relationship between the"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "mayor and city council? The Mayor is the chief executive in charge of smoothening relations with the public, city departments, other states and the feds whilst the city council is the legislative arm of the city responsible for ordinances, land use and passing city budgets. Both have a working relationship because the Mayor is responsible for making sure that certain policies formulated and adopted by the city council are in the best interest of the city's public. What do you love most about your city? It's non-static but always evolving character. What do you perceive to be your city's greatest challenges over the next decade? Affordable housing or lack of it - with or without green materials. Climate change. Rising sea level. Mental health issues. Homelessness. Aging infrastructure. Public transport issues. Economic disparity. Job and joblessness. Public safety. Quality education and Extremely high cost of living. What do you believe is the ideal relationship between your city and the state government? Relationship would be most ideal if there is a clearly defined line of authority in the areas of transport, funding, investment in energy infrastructure, economic development and public engagements on classroom policies and feedback on the effectiveness of public programs. But lines are blurry. It's hard to know who is calling the shot between city and state. What do you believe is the ideal relationship between your city and the federal government? An ideal relationship is most beneficial to all in the city, it the city and the federal government are aligned together in the areas of politics, economics, culture and even religiosity. But that is tricky because New York City has a fast changing demographic make up of city residents - many of whom have never heard of the constitution talk less of knowing anything about New York city's charter. This alone makes conservatives out of the federal governing body. Tell us your favorite joke. Use to live directly next to a burial ground with my girlfriend when I was a student. And she's fond of paging me \"miss you Smithie, wish you were here!\" any time she gets home before me. What do you believe is the ideal relationship between the mayor's office and law enforcement? The Mayor in New York City doesn't have a given Police power, but the office has the power of a Magistrate. This puts the Mayor's spoil choice of political appointees at loggerheads with who controls the law enforcement department, since the Mayor - at the end of the day is also directly responsible for executing legal processes and mandates issued by the state and city courts. What organizations or individuals have endorsed your campaign? ReBuildUSAtoday-HPAC, ReBuildNewYorkCity, The Know-Nothing Party and The PilGrims Alliance Party of America What are your views on financial transparency and government accountability? I believe it is important for a Mayor or any elected official to make sure public funds are well managed, well administered to, and used for what they were highlighted for. Being transparent - in my opinion, is the best way for the Mayor to make sure his or her administration is responsible to the electorate they are supposed to be serving. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate Mayor of New York Website Twitter Candidate Mayor of New York Website Twitter Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 24, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on March 24, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office |"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 general election Independent Mayor of New York candidate, 2025 Municipal candidate, 2025 Municipal candidates New York Ballotpedia features 604,596 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith",
    "text": "2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Abbey Laurel-Smith (President United States, New York, candidate 2024) Abbey Laurel-Smith (President United States, New York, candidate 2024) Abbey Laurel-Smith (President United States, New York, candidate 2024) Abbey Laurel-Smith (No Party Affiliation) ran for election to President United States in New York on November 5, 2024. [1] Elections 2024 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Abbey Laurel-Smith completed Ballotpedia's Candidate Connection survey in 2024. The survey questions appear in bold and are followed by Laurel-Smith's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Fellow Americans, I am Abbey Laurel-Smith, a Know-Nothing Party of America candidate, with a passion to “rebuild not replace”, running for President, United States, 2024. I am promising a return to Henry Clay’s common “American” sense, as the best way to map out a future for the next generation. This native “Know-Nothing” pedestrian and most realistic approach, I see as the best way to set in place a type of economic security for the coming generation. It is also the best way to secure an environment that is not only sustainable to us all, but one that is safe and adaptive to host a smart and a self regulating technology. I promise to ReBuildUSAtoday by securing its borders. Revise tax codes, credits and exemptions. I will do away with certain rules and regulations as a way to revitalize the economy, re-energize small businesses, drive up the spirit of invention, boost channels of supply nationwide. I will also nurture entrepreneurship in economically depressed communities in the rust belt states, the farm states, and other neglected parts of the United States. Current challenges facing the country today could not be addressed by continuing along the lines of current foreign policies and a military styled economic system that have proven to be harmful and detrimental to how we deal with our own domestic issues... With this in mind, I therefore implore you to put me in charge, sit back, and watch me ReBuildUSAtoday! Fellow Americans, I am Abbey Laurel-Smith, a Know-Nothing Party of America candidate, with a passion to “rebuild not replace”, running for President, United States, 2024. I am promising a return to Henry Clay’s common “American” sense, as the best way to map out a future for the next generation. This native “Know-Nothing” pedestrian and most realistic approach, I see as the best way to set in place a type of economic security for the coming generation. It is also the best way to secure an environment that is not only sustainable to us all, but one that is safe and adaptive to host a smart and a self regulating technology. I promise to ReBuildUSAtoday by securing its borders. Revise tax codes, credits and exemptions. I will do away with certain rules and regulations as a way to revitalize the economy, re-energize small businesses, drive up the spirit of invention, boost channels of supply nationwide. I will also nurture entrepreneurship in economically depressed communities in the rust belt states, the farm states, and other neglected parts of the United States. Current challenges facing the country today could not be addressed by continuing along the lines of current foreign policies and a military styled economic system that have proven to be harmful and detrimental to how we deal with our own domestic issues... With this in mind, I therefore implore you to put me in charge, sit back, and watch me ReBuildUSAtoday! Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? To start a rebuilding process, I am proposing four steps: First is a return to a pre WWII Anglo Protestant economic system that served the country from 1812 to 1942. It is a system that gave precedence to value rate by cancelling out vanguard roles for speculated rates and as inflated rates. Second is a roll back of the state department to its earliest days when it was created around the Baptist and Methodist Churches. As a nation we don’t have a Pope or an Archbishop, yet these two bodies use the powers granted to them by this newly"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "created office in July of 1789 to set up a plan to establish the sovereign state of Liberia in the 1800’s. That helped spread christianity, democracy, liberty and freedom to Africa and beyond. Let's do the same in the Middle East. Third, This is a vote multiplier for my party. I reckon with the fact that this is a placeholder Presidential election. The last time we had anything like this was with Arthur Chester in 1881. It makes sense for the sitting Vice President to uphold a placeholders’ tradition by letting prisoners exercise their Grandfathers’ right to cast a vote for the placeholder President - even if they can’t vote on their right. If immigrants could vote in some states, then I see no reason to continue with this practice of denying full blooded Americans from voting. To start a rebuilding process, I am proposing four steps: First is a return to a pre WWII Anglo Protestant economic system that served the country from 1812 to 1942. It is a system that gave precedence to value rate by cancelling out vanguard roles for speculated rates and as inflated rates. Second is a roll back of the state department to its earliest days when it was created around the Baptist and Methodist Churches. As a nation we don’t have a Pope or an Archbishop, yet these two bodies use the powers granted to them by this newly created office in July of 1789 to set up a plan to establish the sovereign state of Liberia in the 1800’s. That helped spread christianity, democracy, liberty and freedom to Africa and beyond. Let's do the same in the Middle East. Third, This is a vote multiplier for my party. I reckon with the fact that this is a placeholder Presidential election. The last time we had anything like this was with Arthur Chester in 1881. It makes sense for the sitting Vice President to uphold a placeholders’ tradition by letting prisoners exercise their Grandfathers’ right to cast a vote for the placeholder President - even if they can’t vote on their right. If immigrants could vote in some states, then I see no reason to continue with this practice of denying full blooded Americans from voting. What legacy would you like to leave? The President who fix the border. The President who nullify inflated rates, nullify speculated rates and brought back value rate so things could be cheaper. The President who brought back wealth and prosperity to the rust belt states, the farming states and neglected communities in America. The President who invested in industries, farms and mining rather than put it all on the man holding onto land/ landed property and not doing anything with the land. The President who fix the border. The President who nullify inflated rates, nullify speculated rates and brought back value rate so things could be cheaper. The President who brought back wealth and prosperity to the rust belt states, the farming states and neglected communities in America. The President who invested in industries, farms and mining rather than put it all on the man holding onto land/ landed property and not doing anything with the land. What characteristics or principles are most important for an elected official? Honesty. Dignity. Believe in God. Stay true to yourself and use your office to stimulate high employment, low inflation, economic growth and most of all sustainable external balance. Honesty. Dignity. Believe in God. Stay true to yourself and use your office to stimulate high employment, low inflation, economic growth and most of all sustainable external balance. What do you believe are the core responsibilities for someone elected to this office? Be honest and do jot be shy to rise above partisan politics. Be ready to reckon with the fact that current challenges facing the country today could not be addressed by continuing along the lines of current foreign policies and a military styled economic system that has proven to be harmful and detrimental to how we deal with our own domestic economy, border security, wealth disparity, affordable housing and issues of growth we face at home. P{ut yourself aside and do something for God and for Country. Be honest and do jot be shy to rise above partisan politics. Be ready to reckon with the fact that current challenges facing the country today could not be addressed by continuing along the lines of current foreign policies and a military styled economic system that has proven to be harmful and"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "detrimental to how we deal with our own domestic economy, border security, wealth disparity, affordable housing and issues of growth we face at home. P{ut yourself aside and do something for God and for Country. Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? Essay on Longshank, Edward I, King of England. Essay on Thomas Cromwell, the Kings most effective administrator and champion of the North, Scotland and Ireland. Robert Peel, The Prime Minister, the problem solver.. Essay on Longshank, Edward I, King of England. Essay on Thomas Cromwell, the Kings most effective administrator and champion of the North, Scotland and Ireland. Robert Peel, The Prime Minister, the problem solver.. What are your views on financial transparency and government accountability? Spend more money at home, on Americans and on issues that affect them. Create a system that is open and transparent enough for everyone to see and feel how their tax is being spent. Separate aids, from grants, loans, credit and exemptions, so Americans could know what to expect when yearly natural disaster struck. Government is too big, if it embarks on reckless spending abroad. But if it is nicer at home, then it is simply doing right by the people and for the people. Spend more money at home, on Americans and on issues that affect them. Create a system that is open and transparent enough for everyone to see and feel how their tax is being spent. Separate aids, from grants, loans, credit and exemptions, so Americans could know what to expect when yearly natural disaster struck. Government is too big, if it embarks on reckless spending abroad. But if it is nicer at home, then it is simply doing right by the people and for the people. What areas of public policy are you personally passionate about? Border security. Review immigration and tax laws. Bring down cost of living and general healthcare. Penal or Paternal: I will establish care for all Americans by putting an end to the penal practice we inherited from the British. Set up training and professional schools for military wives. Hard to imagine that some counties in the United States haven’t had a birth in the last six months. But if that is the reality in some parts of America of today, then it is the President’s responsibility to the American people to use policy instruments to fix a few bad habits that are fashionable but dangerous and damaging to our traditional values. I will waste no time tackling this. I will not be the President that replace chicken with asparagus i Border security. Review immigration and tax laws. Bring down cost of living and general healthcare. Penal or Paternal: I will establish care for all Americans by putting an end to the penal practice we inherited from the British. Set up training and professional schools for military wives. Hard to imagine that some counties in the United States haven’t had a birth in the last six months. But if that is the reality in some parts of America of today, then it is the President’s responsibility to the American people to use policy instruments to fix a few bad habits that are fashionable but dangerous and damaging to our traditional values. I will waste no time tackling this. I will not be the President that replace chicken with asparagus i What is the first action you would take as president of the United States? Immediate task: 1- Start fixing the border by looking to nullify a few prohibition era laws that are in the way of establishing a single way of dealing with illegal immigrants once apprehended. 2- Remove all contractors or anyone outside government agents and agencies, tasked to provide accommodation and services. Near short term task: Look into land laws that was in the areas affected by these border crossings. Work with the state and local government for an updated domain. Long term: Build new settlements, space monitoring stations and new security apparatus for our combined military in the areas affected. Immediate task: 1- Start fixing the border by looking to nullify a few prohibition era laws that are in the way of establishing a single way of dealing with illegal immigrants once apprehended. 2- Remove all contractors or anyone outside government agents and agencies, tasked to provide accommodation and services. Near short term task: Look into land laws that was in the areas affected by these border"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "crossings. Work with the state and local government for an updated domain. Long term: Build new settlements, space monitoring stations and new security apparatus for our combined military in the areas affected. Why should people vote for you instead of one of your opponents? I am determined to move the nation forward from where we are today. That is why I see and talk differently from other major parties who as of today have become insular and distant from the people. I am determined to move the nation forward from where we are today. That is why I see and talk differently from other major parties who as of today have become insular and distant from the people. Currently, there are 27 constitutional amendments. What should a 28th Amendment to the Constitution say? That the electoral college be abolished. That the President shall be elected by popular vote. That cabinet appointees should be members of Congress. That the electoral college be abolished. That the President shall be elected by popular vote. That cabinet appointees should be members of Congress. What do you support that the majority of your party opposes? The fact that the military served the American public better when it was known as The Army of the United States. That we need to shy away from being The United States Army and get back into a name that not only define role, commitment, pride and manner of conduct for us. The code of conduct of the army of Pershing time is different from what we have today. The fact that the military served the American public better when it was known as The Army of the United States. That we need to shy away from being The United States Army and get back into a name that not only define role, commitment, pride and manner of conduct for us. The code of conduct of the army of Pershing time is different from what we have today. Which previous president do you admire most? Ulysses H Grant. Ulysses H Grant. What would you consider to be the greatest strength of each of the last four presidents (Bush, Obama, Trump, Biden)? Is there anything you would seek to emulate from one or more of them? None is radical enough. I would not wish it on anyone to emulate them. None is radical enough. I would not wish it on anyone to emulate them. What is the most important policy issue none of your competitors are talking about? I am for a radical departure from our current economic outlook and policies or a change from what we have now to what used to be, that is our old Anglo Protestant economic system that was used to build America from 1812 till 1943. My competitors are afraid because they knew nothing about this system and because they simply haven't been in America long enough to experience how this system works. I am for a radical departure from our current economic outlook and policies or a change from what we have now to what used to be, that is our old Anglo Protestant economic system that was used to build America from 1812 till 1943. My competitors are afraid because they knew nothing about this system and because they simply haven't been in America long enough to experience how this system works. If you could have any career outside of political life, what would it be? Shipping, Banking and Freight. Shipping, Banking and Freight. What is a policy you have changed your position on over time? Why did it change? I used to be pro-abortion, but after seeing a few Anglo Protestant communities without a single birth in six months, and after seeing the rate at which people are professing their affinity with the LGBTQ, I changed. I'd love to boost the population of Anglo Protestant Americans the most. They are the most affected. I used to be pro-abortion, but after seeing a few Anglo Protestant communities without a single birth in six months, and after seeing the rate at which people are professing their affinity with the LGBTQ, I changed. I'd love to boost the population of Anglo Protestant Americans the most. They are the most affected. What qualities do you value in a running mate? What qualities would you look for to fill Cabinet positions? My type of running mate would be someone who not only see things the way I see them, but someone who could effortlessly improve on them,"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "get a network of others to do the same at local level, and would not be afraid to query my judgement if in doubt Cabinet appointees have go to be someone who see the whole picture of what my campaign is about and can demonstrate how best to get things done. My type of running mate would be someone who not only see things the way I see them, but someone who could effortlessly improve on them, get a network of others to do the same at local level, and would not be afraid to query my judgement if in doubt Cabinet appointees have go to be someone who see the whole picture of what my campaign is about and can demonstrate how best to get things done. What qualities would you look for in judicial nominees? Experience, knowledge, emotional intelligence and real understanding of the laws of the land. Experience, knowledge, emotional intelligence and real understanding of the laws of the land. The role and powers of the presidency have changed over time. Do you believe that they have changed for the better, and if so, why or why not? As far as I am concerned, the role of the President - as the Head of State, has not been clearly defined. I'd love to sit with the states and draft out an agreement so as to avoid overlap and duplication of roles, offices, laws and regulations. As far as I am concerned, the role of the President - as the Head of State, has not been clearly defined. I'd love to sit with the states and draft out an agreement so as to avoid overlap and duplication of roles, offices, laws and regulations. What would your approach be to foreign policy? Make it secondary to domestic issues. Make it secondary to domestic issues. How should the president use executive orders? As an administrative tool for getting things done. Could be used as a tool for enabling suitable conditions for a sustainable growth. Could be used as a tool for establishing effective \"strategic\" relationship between government, private sector and organized labor. As an administrative tool for getting things done. Could be used as a tool for enabling suitable conditions for a sustainable growth. Could be used as a tool for establishing effective \"strategic\" relationship between government, private sector and organized labor. What was your very first job? How long did you have it? Artist. All my life. Artist. All my life. Who do you look up to? Whose example would you like to follow, and why? I look up to improving on what Ulysses H Grant did as President and as a Radical Republican who put people and the country first. I look up to improving on what Ulysses H Grant did as President and as a Radical Republican who put people and the country first. What qualities do you possess that you believe would make you a successful officeholder? I am a very creative person. I am a very creative person. What is something that has been a struggle in your life? Getting my views out as a candidate. Getting my views out as a candidate. What was the last song that got stuck in your head? Amazing Grace Amazing Grace What is your favorite book? Why? I Lied. My book of unedited poems I published in the early 2000's I Lied. My book of unedited poems I published in the early 2000's Tell us your favorite joke. I crossed the north Atlantic all the way to Florida in a bath tub, using my bed sheet for sail, my bed post for mast and a Chinese lotus electric fan blade for propeller. Was using the stars to plot my way to New York City, but ended up in Miami because a submarine got caught in my fishing line. Knew I was heading the wrong way as soon as I noticed my bath tub was being pulled the other way. I am a damned good sailor after all. I crossed the north Atlantic all the way to Florida in a bath tub, using my bed sheet for sail, my bed post for mast and a Chinese lotus electric fan blade for propeller. Was using the stars to plot my way to New York City, but ended up in Miami because a submarine got caught in my fishing line. Knew I was heading the wrong way as soon as I noticed my bath tub was being pulled the other way."
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "I am a damned good sailor after all. If you could be any fictional character, who would you want to be? Captain Jack Sparrow Captain Jack Sparrow What organizations or individuals have endorsed your campaign? ChowBanQ Corp ChowBanQ Corp What is the first historical event that happened in your lifetime that you remember? How old were you at the time? Seeing Berlin Wall come down on a summer afternoon, and not being able to cheer and join the jolly crowd as a uniformed person in my mid twenties. Seeing Berlin Wall come down on a summer afternoon, and not being able to cheer and join the jolly crowd as a uniformed person in my mid twenties. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. External links Search Google News for this topic Website Twitter Youtube Instagram [1] ↑ Submitted to Ballotpedia's candidate survey in 2024. OOS surveys Ballotpedia features 604,596 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024"
  },
  {
    "candidate": "Laurel-Smith, Abbey",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Abbey_Laurel-Smith_(President_United_States,_New_York,_candidate_2024)",
    "text": "Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]