[
  {
    "candidate": "Lee, Linda",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Linda_Lee_Cadwell",
    "text": "Main menu Main page Main page Contents Contents Current events Current events Random article Random article About Wikipedia About Wikipedia Contact us Contact us Help Help Learn to edit Learn to edit Community portal Community portal Recent changes Recent changes Upload file Upload file Special pages Special pages Search Appearance Donate Donate Create account Create account Log in Log in Personal tools Donate Donate Create account Create account Log in Log in learn more Contributions Contributions Talk Talk Contents (Top) 1 Life and career Toggle Life and career subsection 1.1 Books 1 Life and career Toggle Life and career subsection 1.1 Books 1.1 Books 2 References 2 References 3 External links 3 External links Toggle the table of contents Linda Lee Cadwell Linda Lee Cadwell 20 languages العربية العربية تۆرکجه تۆرکجه Español Español فارسی فارسی Français Français 한국어 한국어 Bahasa Indonesia Bahasa Indonesia Íslenska Íslenska Italiano Italiano Magyar Magyar Norsk bokmål Norsk bokmål Polski Polski Português Português Русский Русский کوردی کوردی Svenska Svenska Türkçe Türkçe Українська Українська Tiếng Việt Tiếng Việt 中文 中文 Edit links Article Article Talk Talk English Read Read Edit Edit View history View history Tools Read Read Edit Edit View history View history What links here What links here Related changes Related changes Upload file Upload file Permanent link Permanent link Page information Page information Cite this page Cite this page Get shortened URL Get shortened URL Download QR code Download QR code Download as PDF Download as PDF Printable version Printable version Wikimedia Commons Wikimedia Commons Wikidata item Wikidata item Lee in 1998 Linda Emery ( 1945-03-21 ) March 21, 1945 (age 80) Everett, Washington , U.S. ( 1945-03-21 ) 1945-03-21 (age 80) Linda Lee University of Washington Teacher martial artist writer Teacher martial artist writer 1964–2001 Notable work Bruce Lee: The Man Only I Knew (1975) The Bruce Lee Story (1989) Bruce Lee ​ ​ ( m. 1964 ; died 1973 ) ​ Tom Bleecker ​ ​ ( m. 1988; div. 1990) ​ Bruce Cadwell ​ ​ ( m. 1991) ​ Bruce Lee ​ ​ ( m. 1964 ; died 1973 ) ​ 1964 1973 Tom Bleecker ​ ​ ( m. 1988; div. 1990) ​ Bruce Cadwell ​ ​ ( m. 1991) ​ Brandon Shannon Brandon Shannon bruceleefoundation .com bruceleefoundation .com Linda Claire Emery Lee Cadwell (née Emery ; born March 21, 1945) [ 1 ] is a retired American teacher and writer, the widow of martial artist and actor Bruce Lee (1940–1973), and the mother of actor Brandon Lee (1965–1993) and actress Shannon Lee (born 1969). [ 2 ] She is the author of the Bruce Lee biography Bruce Lee: The Man Only I Knew , upon which the film Dragon: The Bruce Lee Story (1993) is based, as well as the founder, a former trustee of, and an unpaid advisor of the Bruce Lee Foundation . [ ] [ ] Life and career [ edit ] [ edit ] She was born in Everett, Washington , the daughter of Vivian R. (née Hester; 1911–1998) [ 3 ] and Everett Emery (1910–1950). [ 4 ] [ 5 ] Her family was Baptist and of Swedish, Irish, and English descent. [ 6 ] [ 7 ] [ ] [ ] [ ] [ ] [ ] She met Bruce Lee while she was attending Garfield High School , where Bruce came to give a kung fu demonstration; he was attending the University of Washington at the time. Eventually, she became one of his kung fu students when she was attending the University of Washington, studying to become a doctor. [ 8 ] [ ] They married on August 17, 1964. Linda was a few credits short from graduation. They had two children, Brandon Lee and Shannon Lee . Bruce Lee died suddenly on July 20, 1973, of an allergic reaction to an analgesic . [ 9 ] [ 10 ] [ ] [ ] Linda married Tom Bleecker in 1988, and they divorced in 1990. She later wed stockbroker Bruce Cadwell in 1991 and they lived in Rancho Mirage, California . [ citation needed ] citation needed On March 31, 1993, her son Brandon was accidentally shot to death by a prop gun while filming The Crow . [ 11 ] [ ] Cadwell has continued to promote Bruce Lee's martial art Jeet Kune Do. She retired in 2001, and her daughter Shannon, the current head of the Lee family estate, together with son-in-law Ian Keasler, run the Bruce Lee Foundation, a nonprofit organization"
  },
  {
    "candidate": "Lee, Linda",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Linda_Lee_Cadwell",
    "text": "dedicated to teaching Bruce Lee's philosophy on martial arts and his writing on philosophy. [ citation needed ] citation needed Books [ edit ] [ edit ] Cadwell wrote the 1975 book Bruce Lee: The Man Only I Knew ( ISBN 0-446-89407-9 ), on which the 1993 feature film Dragon: The Bruce Lee Story was based. She was portrayed by actress Lauren Holly in the film adaptation. [ 12 ] She also wrote the 1989 book The Bruce Lee Story ( ISBN 0-89750121-7 ). [ ] References [ edit ] [ edit ] ^ Polly, Matthew (1989). Bruce Lee: A Life . Simon and Schuster. p. 123. ISBN 9781501187636 . ^ Polly, Matthew (1989). Bruce Lee: A Life . Simon and Schuster. p. 123. ISBN 9781501187636 . ^ \"No Charges Filed in Actor's Death During Filming\" . The New York Times . September 6, 1993. ^ \"No Charges Filed in Actor's Death During Filming\" . The New York Times . September 6, 1993. ^ \"My Seattle: Bruce & Brandon Lee, father & son\" . November 23, 2020. ^ \"My Seattle: Bruce & Brandon Lee, father & son\" . November 23, 2020. ^ Lee, Linda; Jack Vaughn; Mike Lee (1989). The Bruce Lee Story . Black Belt Communications. p. 15. ISBN 0897501217 . ^ Lee, Linda; Jack Vaughn; Mike Lee (1989). The Bruce Lee Story . Black Belt Communications. p. 15. ISBN 0897501217 . ^ \"Local News - Lees' grave tender and tour guide - Seattle Times Newspaper\" . Retrieved March 11, 2017 . ^ \"Local News - Lees' grave tender and tour guide - Seattle Times Newspaper\" . Retrieved March 11, 2017 . . Retrieved March 11, 2017 March 11, ^ \"Bruce Lee: Overcoming Resistance With Persistence - Self Improvement Association - Self Improvement Membership - Self Improvement Products\" . January 7, 2012. Archived from the original on January 7, 2012 . Retrieved March 11, 2017 . ^ \"Bruce Lee: Overcoming Resistance With Persistence - Self Improvement Association - Self Improvement Membership - Self Improvement Products\" . January 7, 2012. Archived from the original on January 7, 2012 . Retrieved March 11, 2017 . . Retrieved March 11, 2017 March 11, ^ Little, John (1997). Words of the dragon: interviews 1958-1973 . Tuttle Publishing. p. 36. ISBN 0804831335 . ^ Little, John (1997). Words of the dragon: interviews 1958-1973 . Tuttle Publishing. p. 36. ISBN 0804831335 . ^ Cadwell, Linda Lee (1975). Bruce Lee: the man only I knew . New York: Warner Paperback Library. ISBN 978-0-446-78774-1 . ^ Cadwell, Linda Lee (1975). Bruce Lee: the man only I knew . New York: Warner Paperback Library. ISBN 978-0-446-78774-1 . ^ Campbell, Sid (2006). Remembering the master (illustrated ed.). Blue Snake Books. p. 206. ISBN 1-58394-148-7 . ^ Campbell, Sid (2006). Remembering the master (illustrated ed.). Blue Snake Books. p. 206. ISBN 1-58394-148-7 . ^ \"Bruce Lee died of seizure?\" . The Hindu . India. February 26, 2006. Archived from the original on August 29, 2011 . Retrieved June 3, 2011 . ^ \"Bruce Lee died of seizure?\" . The Hindu . India. February 26, 2006. Archived from the original on August 29, 2011 . Retrieved June 3, 2011 . . Retrieved June 3, 2011 June 3, ^ Pristin, Terry (August 11, 1993). \"Brandon Lee's Mother Claims Negligence Caused His Death : Movies: Linda Lee Cadwell sues 14 entities regarding the actor's 'agonizing pain, suffering and untimely death' last March on the North Carolina set of 'The Crow' \" . The Los Angeles Times . Retrieved December 4, 2010 . ^ Pristin, Terry (August 11, 1993). \"Brandon Lee's Mother Claims Negligence Caused His Death : Movies: Linda Lee Cadwell sues 14 entities regarding the actor's 'agonizing pain, suffering and untimely death' last March on the North Carolina set of 'The Crow' \" . The Los Angeles Times . Retrieved December 4, 2010 . . Retrieved December 4, 2010 December 4, ^ Chase, Donald (October 25, 1992). \"Re-Enter the Dragon\" . The Los Angeles Times . Retrieved September 21, 2010 . ^ Chase, Donald (October 25, 1992). \"Re-Enter the Dragon\" . The Los Angeles Times . Retrieved September 21, 2010 . . Retrieved September 21, 2010 September 21, External links [ edit ] [ edit ] Bruce Lee Foundation website Linda Lee Cadwell at IMDb v t e Filmography Awards and honors Media about Filmography Awards and honors Media about As film director Way of the Dragon (1972, also writer and produced) The Game of Death (1972, also writer) As writer The"
  },
  {
    "candidate": "Lee, Linda",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Linda_Lee_Cadwell",
    "text": "silent flute (1978) The Warrior ( Lee , before created the concept for an other series and then it was finished in Warrior ) Way of the Dragon (1972, also writer and produced) The Game of Death (1972, also writer) Way of the Dragon (1972, also writer and produced) The Game of Death (1972, also writer) The silent flute (1978) The Warrior ( Lee , before created the concept for an other series and then it was finished in Warrior ) The silent flute (1978) The Warrior ( Lee , before created the concept for an other series and then it was finished in Warrior ) Chinese Gung Fu: The Philosophical Art of Self-Defense Tao of Jeet Kune Do Bruce Lee's Fighting Method Bruce Lee Library Bruce Lee: A Warrior's Journey (book) Chinese Gung Fu: The Philosophical Art of Self-Defense Tao of Jeet Kune Do Bruce Lee's Fighting Method Bruce Lee Library Bruce Lee: A Warrior's Journey (book) Jeet Kune Do One-inch punch Straight blast Jeet Kune Do One-inch punch Straight blast Films Hong Kong Bruce Lee: The Man and the Legend (1973) A Dragon Story (1974) Bruce Lee and I (1976) The Dragon Lives (1976) The Man, The Myth (1976) The Real Bruce Lee (1977) A Warrior's Journey (2000) Bruce Lee, My Brother (2010) United States Dragon: The Bruce Lee Story (1993) The Curse of the Dragon (1993) A Warrior's Journey (2000) The Story (2001) The Legend of Bruce Lee (video; 2008) I Am Bruce Lee (2012) Birth of the Dragon (2016) Once Upon a Time in Hollywood (2019) Be Water (2020) Television Spirit of the Dragon (1992) The Lost Interview (1994) The Legend of Bruce Lee (2008) Books The Man Only I Knew (1975) Bruce Lee: A Life (2019) Comics The Deadly Hands of Kung Fu (1976) Hong Kong Bruce Lee: The Man and the Legend (1973) A Dragon Story (1974) Bruce Lee and I (1976) The Dragon Lives (1976) The Man, The Myth (1976) The Real Bruce Lee (1977) A Warrior's Journey (2000) Bruce Lee, My Brother (2010) United States Dragon: The Bruce Lee Story (1993) The Curse of the Dragon (1993) A Warrior's Journey (2000) The Story (2001) The Legend of Bruce Lee (video; 2008) I Am Bruce Lee (2012) Birth of the Dragon (2016) Once Upon a Time in Hollywood (2019) Be Water (2020) Bruce Lee: The Man and the Legend (1973) A Dragon Story (1974) Bruce Lee and I (1976) The Dragon Lives (1976) The Man, The Myth (1976) The Real Bruce Lee (1977) A Warrior's Journey (2000) Bruce Lee, My Brother (2010) Bruce Lee: The Man and the Legend (1973) A Dragon Story (1974) Bruce Lee and I (1976) The Dragon Lives (1976) The Man, The Myth (1976) The Real Bruce Lee (1977) A Warrior's Journey (2000) Bruce Lee, My Brother (2010) Dragon: The Bruce Lee Story (1993) The Curse of the Dragon (1993) A Warrior's Journey (2000) The Story (2001) The Legend of Bruce Lee (video; 2008) I Am Bruce Lee (2012) Birth of the Dragon (2016) Once Upon a Time in Hollywood (2019) Be Water (2020) Dragon: The Bruce Lee Story (1993) The Curse of the Dragon (1993) A Warrior's Journey (2000) The Story (2001) The Legend of Bruce Lee (video; 2008) I Am Bruce Lee (2012) Birth of the Dragon (2016) Once Upon a Time in Hollywood (2019) Be Water (2020) Spirit of the Dragon (1992) The Lost Interview (1994) The Legend of Bruce Lee (2008) Spirit of the Dragon (1992) The Lost Interview (1994) The Legend of Bruce Lee (2008) The Man Only I Knew (1975) Bruce Lee: A Life (2019) The Man Only I Knew (1975) Bruce Lee: A Life (2019) The Deadly Hands of Kung Fu (1976) The Deadly Hands of Kung Fu (1976) Bruce Lee Kung-Fu Master China Warrior Bruce Lee Lives Dragon: The Bruce Lee Story Quest of the Dragon Return of the Legend Bruce Lee Kung-Fu Master China Warrior China Warrior Bruce Lee Lives Dragon: The Bruce Lee Story Quest of the Dragon Return of the Legend Lee Hoi-chuen (father) Grace Ho (mother) Peter Lee (brother) Robert Lee (brother) Linda Emery Lee (wife) Brandon Lee (son) Shannon Lee (daughter) Lee Hoi-chuen (father) Grace Ho (mother) Peter Lee (brother) Robert Lee (brother) Linda Emery Lee (wife) Brandon Lee (son) Shannon Lee (daughter) 41 Cumberland Road Bruceploitation Bruce Li Bruce Le Bruce Lai Bruce Liang Dragon Lee Kato Graves of Bruce and Brandon Lee Long Beach International Karate Championships Statues Hong Kong Los Angeles Mostar Betty"
  },
  {
    "candidate": "Lee, Linda",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Linda_Lee_Cadwell",
    "text": "Ting Chen Zhen Ip Man Warrior Wong Shun Leung Wong Jack Man 41 Cumberland Road Bruceploitation Bruce Li Bruce Le Bruce Lai Bruce Liang Dragon Lee Bruce Li Bruce Le Bruce Lai Bruce Liang Dragon Lee Kato Graves of Bruce and Brandon Lee Long Beach International Karate Championships Statues Hong Kong Los Angeles Mostar Hong Kong Los Angeles Mostar Betty Ting Chen Zhen Ip Man Warrior Wong Shun Leung Wong Jack Man Category Category ISNI VIAF WorldCat ISNI ISNI VIAF VIAF WorldCat WorldCat United States France BnF data Japan Czech Republic Spain Netherlands Croatia Poland United States United States France France BnF data BnF data Japan Japan Czech Republic Czech Republic Spain Spain Netherlands Netherlands Croatia Croatia Poland Poland CiNii CiNii CiNii IdRef IdRef IdRef 1945 births Living people American biographers American women biographers American people of English descent American people of Swedish descent Garfield High School (Seattle) alumni 20th-century American women writers 20th-century American non-fiction writers People from Everett, Washington Writers from Washington (state) American people of Irish descent University of Washington College of Education alumni Family of Bruce Lee Articles with short description Short description is different from Wikidata Use mdy dates from November 2020 Articles with hCards All articles with unsourced statements Articles with unsourced statements from October 2021 This page was last edited on 21 April 2025, at 03:05 (UTC) . (UTC) Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Toggle the table of contents Linda Lee Cadwell 20 languages Add topic"
  }
]