[
  {
    "candidate": "LeGrand, Latoya",
    "category": "bio",
    "score": null,
    "link": "https://legrandforthepeople.com/meet-latoya/",
    "text": "Home Meet Latoya Endorsements In the News Get Involved Contact Us Home Meet Latoya Endorsements In the News Get Involved Contact Us © 2025 Meet Latoya Latoya LeGrand is a devoted advocate, community leader, and fierce champion for equity and opportunity in Southeast Queens. Raised in NYCHA housing and the foster care system, Latoya knows firsthand the struggles that too many families face—and she’s dedicated her life turning those challenges into fuel for change. She earned her Bachelor’s degree from John Jay College of Criminal Justice and built her public service career in the New York State Assembly and Senate, where she focused on advancing legislation around housing, education, and community development. Today, as the Education Committee Chair of Community Board 12Q, she continues fighting to expand educational access and improve outcomes for local students. Latoya is also the founder of Projects II Projects Inc., a nonprofit dedicated to empowering underserved communities. From launching the iDrone NYCHA Program , which introduces youth to STEM through drone technology, to supporting mothers in shelters and guiding families through the IEP process, her work is hands-on and transformative. Through partnerships with organizations like Tiffany & Co. and the Kendra Scott Foundation, she’s brought critical resources and mentorship to those who need them most. Her commitment hasn’t gone unnoticed—Latoya has received numerous community service awards for her leadership and impact. Now, she’s running for New York City Council in District 28 to bring bold, solutions-driven leadership to the neighborhoods she calls home. Latoya LeGrand is ready to fight for housing rights, quality education, youth empowerment, and good jobs. She’s running to ensure every resident of Southeast Queens has the opportunity not just to survive, but to thrive. Donate © 2025 . Created with ❤ using WordPress and Kubio"
  }
]