[
  {
    "candidate": "Leonard, James J",
    "category": "bio",
    "score": null,
    "link": "https://www.leonardwarrenleonard.com/attorney/leonard-james-j/",
    "text": "609-345-5800 Home About James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. Practice Areas Criminal Defense Family Law Government Law Immigration and Naturalization Law Criminal Defense Family Law Government Law Immigration and Naturalization Law Contact Home About James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. Practice Areas Criminal Defense Family Law Government Law Immigration and Naturalization Law Criminal Defense Family Law Government Law Immigration and Naturalization Law Contact Home About James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. Practice Areas Criminal Defense Family Law Government Law Immigration and Naturalization Law Criminal Defense Family Law Government Law Immigration and Naturalization Law Contact Home About James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. James J. Leonard Jr. Rebecca M. Leonard Kenneth M. Warren Jr. Practice Areas Criminal Defense Family Law Government Law Immigration and Naturalization Law Criminal Defense Family Law Government Law Immigration and Naturalization Law Contact  609-345-5800  Aggressive. Professional. Experienced. James J. Leonard Jr. Contact Me: (609) 345-5800 Email me Practice Areas: Criminal Defense (Federal/ State/ Municipal Courts) Domestic Violence Restraining Orders Entertainment Law Biography Mr. Leonard began his career in Criminal Law in 1999 with a two-year internship at the Philadelphia District Attorney’s Office and has distinguished himself as a nationally recognized criminal defense trial attorney over the last 25 years. In 2002, while an associate at a prominent Camden County law firm specializing in criminal defense trial work, Mr. Leonard was one of three attorneys on a defense team that successfully represented two defendants in separate capital murder cases, one in Camden County Superior Court, the other in Burlington County Superior Court. Later that year Mr. Leonard left that firm and started his own practice at the age of 28, specializing in all aspects of aggressive criminal defense litigation in the State of New Jersey. In 2003, Mr. Leonard won two-high profile jury trials that his established his reputation as a highly skilled trial attorney and made him one of the most sought-after criminal defense attorneys in the State of New Jersey. In both cases, the juries found each defendant not guilty of all charges. In 2004, Mr. Leonard successfully represented Vincent McDaniels, a/k/a Omar Salaam, the reputed former head of the Salaams, a notorious Atlantic City based drug gang. Mr. McDaniels was charged as a drug kingpin in a massive 154-count indictment and faced life in prison if he was convicted at trial. Mr. Leonard aggressively negotiated a plea bargain for Mr. McDaniels and had 152 of the 154 charges dismissed, including the kingpin charge, and Mr. McDaniels was released from prison after serving four years and six months. In 2005, Mr. Leonard was retained by Grammy Award winning rap artist Kimberly “Lil Kim” Jones and successfully helped her secure an early release from the Federal Detention Center in Philadelphia, where she was serving a one-year sentence. Shortly after release, Mr. Leonard was filmed interacting with Ms. Jones inside her home for her reality TV series Countdown to Lockdown. In 2007, Mr. Leonard was retained to represent a South Jersey man, who was suspected of being a serial killer, specifically by allegedly murdering four prostitutes and dumping their bodies behind a motel in West Atlantic City. Dubbed “as The Eastbound Strangler”, the case would receive international attention and Mr. Leonard was profiled on Good Morning America, Fox News, CNN, 48 Hours, America’s Most Wanted and in print and digital publications all over the world, including the New York Times. Mr. Leonard’s client, the suspected killer, was eventually released from jail and has remained free ever since, never having been charged with the murders. Mr. Leonard and his client would go on to appear on a documentary television series about the case entitled The Killing Season. In 2007, Mr. Leonard was retained to advise and represent Atlantic City City Council President William “Speedy” Marsh after the Atlantic City Mayor “disappeared” and subsequently resigned. Weeks later, Mr. Leonard stood proudly by Mr. Marsh’s side as he was appointed and sworn in as the new Mayor of Atlantic City. In 2008, Mr. Leonard was retained to represent Anthony Nicodemo, described by the FBI as a soldier in the Bruno / Scarfo La Cosa Nostra Crime Family and a close associate of former reputed mob leader"
  },
  {
    "candidate": "Leonard, James J",
    "category": "bio",
    "score": null,
    "link": "https://www.leonardwarrenleonard.com/attorney/leonard-james-j/",
    "text": "Joseph “Skinny Joey” Merlino on racketeering charges stemming from what law enforcement described as a $60 million-dollar gambling / loan sharking mob-controlled conspiracy that was operating inside of the Borgata Hotel and Casino in Atlantic City. Despite facing more than a decade in prison, Mr. Leonard convinced the Judge not to send Mr. Nicodemo to State prison over the vehement objection of the prosecutor. In 2009, Mr. Leonard would successfully defend a man charged with murder in Camden County Superior Court. After a three-week trial, the jury found Mr. Leonard’s client not guilty of committing the murder. In 2010, Mr. Leonard was retained to represent Nicodemo Scarfo Jr., son of Nicodemo “Little Nicky” Scarfo, the notorious reputed former boss of the Philadelphia / Atlantic City mob on racketeering charges based out of Morris County involving alleged members of the Lucchese Crime Family. Later that year, Mr. Leonard was retained to represent reality TV personality Angelina Pivarnick, star of the reality TV series Jersey Shore, to represent her on charges stemming from an incident inside an Atlantic City casino, which Mr. Leonard successfully had dismissed. In 2012, Mr. Leonard was featured prominently in the best-selling true crime book Mafia Prince: Inside America’s Most Violent Crime Family and The Bloody Fall of La Cosa Nostra, written by former Philadelphia / Atlantic City mob underboss Philip “Crazy Phil” Leonetti, the nephew of Nicodemo “Little Nicky” Scarfo. In 2014, Mr. Leonard was retained to represent Real Housewives of New Jersey star Teresa Giudice. For more than a decade, Mr. Leonard has been general counsel to Ms. Giudice and her family and has appeared with her several times on Real Housewives of New Jersey. Mr. Leonard has been featured in People, US Weekly, the New York Post, the Wall Street Journal and on TMZ , Entertainment Tonight, E! News and Good Morning America , discussing Ms. Giudice. Mr. Leonard was featured prominently in Ms. Giudice’s New York Times Best Selling Memoir Turning The Tables and it’s follow-up Standing Strong. In addition to Ms. Giudice and Ms. Pivarnick, both of whom Mr. Leonard has represented for more than a decade, Mr. Leonard has also represented reality TV personalities on The Real Housewives of Salt Lake City, The Real Housewives of Dallas, Summer House, Sister Wives, 90 Day Fiancé, Love & Hip Hop Miami & more. In addition to representing Lil Kim, Mr. Leonard has also represented hip-hop icons Lil Cease and Foxy Brown. Mr. Leonard still appears daily in criminal courts all over the State of New Jersey at the federal, state and municipal level and has represented fellow attorneys, police officers, firefighters, schoolteachers, doctors, elected officials and individuals from all walks of life providing aggressive and affordable legal representation. Education Villanova University School of Law , Villanova, Pennsylvania 2001 Wesley College , Dover, Delaware B.S. - 1997 Bar Admission New Jersey, 2001 Federal District Court of New Jersey, 2002 Aggressive. Professional. Experienced. James J. Leonard Jr. Contact Me: (609) 345-5800 Practice Areas: Criminal Defense (Federal/ State/ Municipal Courts) Domestic Violence Restraining Orders Entertainment Law Biography Mr. Leonard began his career in Criminal Law in 1999 with a two-year internship at the Philadelphia District Attorney’s Office and has distinguished himself as a nationally recognized criminal defense trial attorney over the last 25 years. In 2002, while an associate at a prominent Camden County law firm specializing in criminal defense trial work, Mr. Leonard was one of three attorneys on a defense team that successfully represented two defendants in separate capital murder cases, one in Camden County Superior Court, the other in Burlington County Superior Court. Later that year Mr. Leonard left that firm and started his own practice at the age of 28, specializing in all aspects of aggressive criminal defense litigation in the State of New Jersey. In 2003, Mr. Leonard won two-high profile jury trials that his established his reputation as a highly skilled trial attorney and made him one of the most sought-after criminal defense attorneys in the State of New Jersey. In both cases, the juries found each defendant not guilty of all charges. In 2004, Mr. Leonard successfully represented Vincent McDaniels, a/k/a Omar Salaam, the reputed former head of the Salaams, a notorious Atlantic City based drug gang. Mr. McDaniels was charged as a drug kingpin in a massive 154-count indictment and faced life in prison if he was convicted at trial. Mr. Leonard aggressively negotiated a plea bargain for Mr. McDaniels and had 152 of the 154 charges dismissed, including"
  },
  {
    "candidate": "Leonard, James J",
    "category": "bio",
    "score": null,
    "link": "https://www.leonardwarrenleonard.com/attorney/leonard-james-j/",
    "text": "the kingpin charge, and Mr. McDaniels was released from prison after serving four years and six months. In 2005, Mr. Leonard was retained by Grammy Award winning rap artist Kimberly “Lil Kim” Jones and successfully helped her secure an early release from the Federal Detention Center in Philadelphia, where she was serving a one-year sentence. Shortly after release, Mr. Leonard was filmed interacting with Ms. Jones inside her home for her reality TV series Countdown to Lockdown. In 2007, Mr. Leonard was retained to represent a South Jersey man, who was suspected of being a serial killer, specifically by allegedly murdering four prostitutes and dumping their bodies behind a motel in West Atlantic City. Dubbed “as The Eastbound Strangler”, the case would receive international attention and Mr. Leonard was profiled on Good Morning America, Fox News, CNN, 48 Hours, America’s Most Wanted and in print and digital publications all over the world, including the New York Times. Mr. Leonard’s client, the suspected killer, was eventually released from jail and has remained free ever since, never having been charged with the murders. Mr. Leonard and his client would go on to appear on a documentary television series about the case entitled The Killing Season. In 2007, Mr. Leonard was retained to advise and represent Atlantic City City Council President William “Speedy” Marsh after the Atlantic City Mayor “disappeared” and subsequently resigned. Weeks later, Mr. Leonard stood proudly by Mr. Marsh’s side as he was appointed and sworn in as the new Mayor of Atlantic City. In 2008, Mr. Leonard was retained to represent Anthony Nicodemo, described by the FBI as a soldier in the Bruno / Scarfo La Cosa Nostra Crime Family and a close associate of former reputed mob leader Joseph “Skinny Joey” Merlino on racketeering charges stemming from what law enforcement described as a $60 million-dollar gambling / loan sharking mob-controlled conspiracy that was operating inside of the Borgata Hotel and Casino in Atlantic City. Despite facing more than a decade in prison, Mr. Leonard convinced the Judge not to send Mr. Nicodemo to State prison over the vehement objection of the prosecutor. In 2009, Mr. Leonard would successfully defend a man charged with murder in Camden County Superior Court. After a three-week trial, the jury found Mr. Leonard’s client not guilty of committing the murder. In 2010, Mr. Leonard was retained to represent Nicodemo Scarfo Jr., son of Nicodemo “Little Nicky” Scarfo, the notorious reputed former boss of the Philadelphia / Atlantic City mob on racketeering charges based out of Morris County involving alleged members of the Lucchese Crime Family. Later that year, Mr. Leonard was retained to represent reality TV personality Angelina Pivarnick, star of the reality TV series Jersey Shore, to represent her on charges stemming from an incident inside an Atlantic City casino, which Mr. Leonard successfully had dismissed. In 2012, Mr. Leonard was featured prominently in the best-selling true crime book Mafia Prince: Inside America’s Most Violent Crime Family and The Bloody Fall of La Cosa Nostra, written by former Philadelphia / Atlantic City mob underboss Philip “Crazy Phil” Leonetti, the nephew of Nicodemo “Little Nicky” Scarfo. In 2014, Mr. Leonard was retained to represent Real Housewives of New Jersey star Teresa Giudice. For more than a decade, Mr. Leonard has been general counsel to Ms. Giudice and her family and has appeared with her several times on Real Housewives of New Jersey. Mr. Leonard has been featured in People, US Weekly, the New York Post, the Wall Street Journal and on TMZ , Entertainment Tonight, E! News and Good Morning America , discussing Ms. Giudice. Mr. Leonard was featured prominently in Ms. Giudice’s New York Times Best Selling Memoir Turning The Tables and it’s follow-up Standing Strong. In addition to Ms. Giudice and Ms. Pivarnick, both of whom Mr. Leonard has represented for more than a decade, Mr. Leonard has also represented reality TV personalities on The Real Housewives of Salt Lake City, The Real Housewives of Dallas, Summer House, Sister Wives, 90 Day Fiancé, Love & Hip Hop Miami & more. In addition to representing Lil Kim, Mr. Leonard has also represented hip-hop icons Lil Cease and Foxy Brown. Mr. Leonard still appears daily in criminal courts all over the State of New Jersey at the federal, state and municipal level and has represented fellow attorneys, police officers, firefighters, schoolteachers, doctors, elected officials and individuals from all walks of life providing aggressive and affordable legal representation. Education Villanova University School of Law"
  },
  {
    "candidate": "Leonard, James J",
    "category": "bio",
    "score": null,
    "link": "https://www.leonardwarrenleonard.com/attorney/leonard-james-j/",
    "text": ", Villanova, Pennsylvania 2001 2001 Wesley College , Dover, Delaware B.S. - 1997 B.S. - 1997 Bar Admission New Jersey, 2001 Federal District Court of New Jersey, 2002 Contact Leonard Warren & Leonard Leonard Warren & Leonard Loading Form... Address 1200 Atlantic Ave Suite 201 Atlantic City, New Jersey 08401 Phone 609-345-5800 Follow on Facebook, opens in a new window Follow on Facebook, opens in a new window Follow on Instagram, opens in a new window Follow on Instagram, opens in a new window © 2025 Leonard Warren & Leonard • All Rights Reserved Disclaimer | Site Map | Privacy Policy | Business Development Solutions by FindLaw Loading Form..."
  }
]