[
  {
    "candidate": "Levy, Deirdre",
    "category": "bio",
    "score": null,
    "link": "https://www.levyfornyc.com/blank",
    "text": "top of page Meet Deirdre Meet Deirdre The Issues The Issues Get Involved Get Involved Donate Donate Meet Deirdre Deirdre Levy is a passionate advocate for social justice, a dedicated educator, and a leader committed to creating a brighter future for all New Yorkers. With deep roots in New York City, Deirdre has devoted her life to empowering communities through education, equity, and innovation. Deirdre Levy is a passionate advocate for social justice, a dedicated educator, and a leader committed to creating a brighter future for all New Yorkers. With deep roots in New York City, Deirdre has devoted her life to empowering communities through education, equity, and innovation. As a self-contained special education teacher of more than 12 years, Deirdre has worked tirelessly to ensure that every student, regardless of ability or background, has access to a quality education. She has worked with students with autism, emotional disabilities, learning disabilities, speech impairment, ADHD, etc. As a self-contained special education teacher of more than 12 years, Deirdre has worked tirelessly to ensure that every student, regardless of ability or background, has access to a quality education. She has worked with students with autism, emotional disabilities, learning disabilities, speech impairment, ADHD, etc. She first started her career as a NYC Teaching Fellow after completing her AmeriCorps midyear with City Year New York. Her policy background began at the University at Albany, where she majored in Public Affairs and Policy and later received her Master of Science in Higher Education Administration and Policy Studies. She believes in the transformative power of learning and has championed programs that promote inclusivity, creativity, and resilience in the classroom. She first started her career as a NYC Teaching Fellow after completing her AmeriCorps midyear with City Year New York. Her policy background began at the University at Albany, where she majored in Public Affairs and Policy and later received her Master of Science in Higher Education Administration and Policy Studies. She believes in the transformative power of learning and has championed programs that promote inclusivity, creativity, and resilience in the classroom. ​ ​ ​ Deirdre’s leadership extends beyond education. She is the founder of NYCFilipinos, an organization that celebrates the culture, contributions, and community of Filipino Americans in New York City. Through this initiative, Deirdre has built bridges across diverse communities and has fostered a sense of belonging and pride among thousands of New Yorkers. This experience led her to co-found and mobilize with other Filipino Americans during the pandemic in an organization called Project Barkada, where she delivered over 100,000 meals with community leaders, chefs to provide for the frontline workers, the homeless and children abroad. Deirdre’s leadership extends beyond education. She is the founder of NYCFilipinos, an organization that celebrates the culture, contributions, and community of Filipino Americans in New York City. Through this initiative, Deirdre has built bridges across diverse communities and has fostered a sense of belonging and pride among thousands of New Yorkers. This experience led her to co-found and mobilize with other Filipino Americans during the pandemic in an organization called Project Barkada, where she delivered over 100,000 meals with community leaders, chefs to provide for the frontline workers, the homeless and children abroad. Support Deirdre - Donate today Support Deirdre - Donate today Every contribution, big or small, helps us reach more voters and spread our message. Donate now to fuel our campaign and be a part of the change we need! Every contribution, big or small, helps us reach more voters and spread our message. Donate now to fuel our campaign and be a part of the change we need! Donate Donate A published author, Deirdre penned Bodega Princess, a children’s book inspired by the true story of a kindergartener tackling food insecurity in Brooklyn. Her work reflects her commitment to addressing systemic issues and inspiring the next generation to be agents of change. A published author, Deirdre penned Bodega Princess, a children’s book inspired by the true story of a kindergartener tackling food insecurity in Brooklyn. Her work reflects her commitment to addressing systemic issues and inspiring the next generation to be agents of change. Deirdre’s vision for New York City is one where everyone—regardless of zip code—can thrive. Her mayoral campaign is rooted in core values of fairness, opportunity, and community-driven solutions. She is committed to addressing critical issues such as affordable housing, equity in education, dignity for disabilities, food security and sustainable economic growth. Deirdre’s vision for New York City is one where everyone—regardless of"
  },
  {
    "candidate": "Levy, Deirdre",
    "category": "bio",
    "score": null,
    "link": "https://www.levyfornyc.com/blank",
    "text": "zip code—can thrive. Her mayoral campaign is rooted in core values of fairness, opportunity, and community-driven solutions. She is committed to addressing critical issues such as affordable housing, equity in education, dignity for disabilities, food security and sustainable economic growth. Paid for by Paid for by Meet Deirdre Meet Deirdre The Issues The Issues Get Involved Get Involved bottom of page"
  }
]