[
  {
    "candidate": "Lopez, Michael A",
    "category": "bio",
    "score": null,
    "link": "https://www.axiomspace.com/team/michael-lopez-alegria",
    "text": "Meet the Team Michael López-Alegría Michael López-Alegría is a decorated astronaut who returned to low-Earth orbit for the sixth time in 2024 as commander of Axiom Mission 3. He also commanded Axiom Space’s first private astronaut mission to the International Space Station (ISS) in 2022, known as Axiom Mission 1. “Mike L-A” (as he’s known to the space community) is involved in both operational and business development efforts within Axiom Space. He has more than 40 years of aviation and space experience with the U.S. Navy and NASA in a variety of roles including Naval Aviator, engineering test pilot and program manager, NASA astronaut, and International Space Station commander. He also holds NASA records for most extravehicular activities (EVAs) or ”spacewalks” (10) and cumulative EVA time (67 hours, 40 minutes). He was inducted into the U.S. Astronaut Hall of Fame in 2021. Mike L-A is the former president of the Commercial Spaceflight Federation, where he was a spokesman, thought leader, and advocate with the U.S. Congress and pertinent Executive Agencies for favorable public policy on behalf of the commercial spaceflight industry. He has served on several advisory boards and committees of public and private organizations, including the Human Exploration and Operations Committee of the NASA Advisory Council and the Commercial Space Transportation Advisory Committee (COMSTAC) to the FAA, and is the former chairman of ASTM International’s Committee on Commercial Spaceflight as well as past President of the Association of Space Explorers. He earned a B.S. in systems engineering at the United States Naval Academy and an M.S. in aeronautical engineering from the Naval Postgraduate School. Michael López-Alegría Chief Astronaut Michael López-Alegría is a decorated astronaut who returned to low-Earth orbit for the sixth time in 2024 as commander of Axiom Mission 3. He also commanded Axiom Space’s first private astronaut mission to the International Space Station (ISS) in 2022, known as Axiom Mission 1. “Mike L-A” (as he’s known to the space community) is involved in both operational and business development efforts within Axiom Space. He has more than 40 years of aviation and space experience with the U.S. Navy and NASA in a variety of roles including Naval Aviator, engineering test pilot and program manager, NASA astronaut, and International Space Station commander. He also holds NASA records for most extravehicular activities (EVAs) or ”spacewalks” (10) and cumulative EVA time (67 hours, 40 minutes). He was inducted into the U.S. Astronaut Hall of Fame in 2021. Mike L-A is the former president of the Commercial Spaceflight Federation, where he was a spokesman, thought leader, and advocate with the U.S. Congress and pertinent Executive Agencies for favorable public policy on behalf of the commercial spaceflight industry. He has served on several advisory boards and committees of public and private organizations, including the Human Exploration and Operations Committee of the NASA Advisory Council and the Commercial Space Transportation Advisory Committee (COMSTAC) to the FAA, and is the former chairman of ASTM International’s Committee on Commercial Spaceflight as well as past President of the Association of Space Explorers. He earned a B.S. in systems engineering at the United States Naval Academy and an M.S. in aeronautical engineering from the Naval Postgraduate School."
  }
]