[
  {
    "candidate": "Louis, Farah",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/farah-louis/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 45 Farah N. Louis Flatbush, Midwood, East Flatbush, Flatlands, Marine Park, Canarsie Biography Council Member Farah N. Louis represents the 45th Council District in Brooklyn, New York, encompassing the diverse neighborhoods of Flatbush, East Flatbush, Midwood, Flatlands, and parts of Kensington, Marine Park, and Canarsie. A first-generation Brooklynite raised in an immigrant and pro-union household, she brings a deep commitment to equity, advocacy, and opportunity for all New Yorkers. Since taking office in Spring 2019, Louis has been a steadfast advocate for a more livable New York – championing affordable housing, education reform, and equitable access to mental and reproductive health care. During her tenure on the City Council, Louis has led efforts to advance public safety initiatives and expand opportunities for first-time homeownership. She has also launched support services for minority-owned businesses, enhanced nonprofit contract access, and championed financial literacy and STEM education for public school students. As Chair of the Committee on Women and Gender Equity , Louis has dedicated herself to addressing the city’s most pressing challenges for women. She has tirelessly worked on issues such as maternal mortality and morbidity, pay equity, childcare disparities, and improving resources for survivors of domestic violence and human trafficking. Louis continues to champion policies that expand maternal and reproductive health care, enhance economic mobility, and increase leadership opportunities for women and girls. Louis has secured over $170 million in capital investments to advance equity and opportunity in the 45th Council District – including the first-ever women’s health center on Flatbush, the first recreation center with a pool in Central Brooklyn, major renovations to Rugby and Clarendon libraries, and improvements to neighborhood parks, aimed at preserving the rich history and cultural heritage of the district. A firm believer in grassroots organizing and civic participation, Louis works in close partnership with fellow social justice advocates to advance fair representation, racial and gender equity, and meaningful inclusion throughout New York City. Biography Council Member Farah N. Louis represents the 45th Council District in Brooklyn, New York, encompassing the diverse neighborhoods of Flatbush, East Flatbush, Midwood, Flatlands, and parts of Kensington, Marine Park, and Canarsie. A first-generation Brooklynite raised in an immigrant and pro-union household, she brings a deep commitment to equity, advocacy, and opportunity for all New Yorkers. Since taking office in Spring 2019, Louis has been a steadfast advocate for a more livable New York – championing affordable housing, education reform, and equitable access to mental and reproductive health care. During her tenure on the City Council, Louis has led efforts to advance public safety initiatives and expand opportunities for first-time homeownership. She has also launched support services for minority-owned businesses, enhanced nonprofit contract access, and championed financial literacy and STEM education for public school students. As Chair of the Committee on Women and Gender Equity , Louis has dedicated herself to addressing the city’s most pressing challenges for women. She has tirelessly worked on issues such as maternal mortality and morbidity, pay equity, childcare disparities, and improving resources for survivors of domestic violence and human trafficking. Louis continues to champion policies that expand maternal and reproductive health care, enhance economic mobility, and increase leadership opportunities for women and girls. Louis has secured over $170 million in capital investments to advance equity and opportunity in the 45th Council District – including the first-ever women’s health center on Flatbush, the first recreation center with a pool in Central Brooklyn, major renovations to Rugby and Clarendon libraries, and improvements to neighborhood parks, aimed at preserving the rich history and cultural heritage of the district. A firm believer in grassroots organizing and civic participation, Louis works in close partnership with fellow social justice advocates to advance fair representation, racial and gender equity, and meaningful inclusion throughout New York City. Biography Legislation Press Releases In The News Newsletters Events Staff Directory Important Phone Numbers Volunteer in the District Utica Avenue Business Improvement District (BID) Fiscal Year 2026 Funding Requests District Office 1434 Flatbush Avenue Brooklyn, NY 11210 Phone: 718-629-2900 Monday - Thursday 9:00 A.M. - 5:00 P.M. Friday | By Appointment Only Legislative Office 250 Broadway, Suite 1810 New York, NY 10007 Phone: 212-788-6859 Monday - Friday | By Appointment Only Follow Us On... Facebook Twitter Instagram For general inquiries , please email: District45@council.nyc.gov . Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway"
  },
  {
    "candidate": "Louis, Farah",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/farah-louis/",
    "text": ", as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]