[
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Lawman_Lynch",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Lawman Lynch Lawman Lynch Lawman Lynch Do you have a photo that could go here? Click here to submit it for this profile! Democratic Party Candidate, New York City Council District 41 June 24, 2025 Education CELA International University, 2016 St. Thomas University, 2022 Campaign website Campaign Facebook Campaign Instagram Campaign TikTok Personal Instagram Personal LinkedIn Lawman Lynch ( Democratic Party ) is running for election to the New York City Council to represent District 41 . He is on the ballot in the Democratic primary on June 24, 2025 . Lynch completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Lawman Lynch earned a bachelor's degree from CELA International University in 2016 and a graduate degree from St. Thomas University in 2022. His career experience includes working as a program manager, as president of the Lawman Lynch Foundation, and as the co-founder of Cariglo. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 41 The following candidates are running in the Democratic primary for New York City Council District 41 on June 24, 2025. Candidate Darlene Mealy Submit photo Dante Arnwine Submit photo Elijah Brown Submit photo Bianca Cunningham Submit photo Jamell Henderson Submit photo Clifton Hinton Submit photo Lawman Lynch Submit photo Jammel Thompson Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Lawman Lynch completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Lynch's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. I am a Jamaican-born educator, youth advocate, and community leader who has proudly called Brooklyn home since 2010. My lived experience as an immigrant, my work in education, and my deep ties to the neighborhoods of District 41 have shaped my understanding of what our communities need—not just to survive, but to thrive. For over a decade, I’ve worked to support families, mentor young people, and organize with local leaders to bring meaningful resources and services directly to the people. As a program director in youth development, I’ve seen firsthand how critical it is to invest early in education, mental health, and family support. I’ve led afterschool programming, partnered with schools and nonprofits, and created safe spaces for youth to grow, learn, and lead. I’ve also organized community resource fairs, health fairs, housing workshops, and job readiness events—because I believe leadership is about meeting people where they are. I’m running for City Council because District 41 deserves bold, honest leadership that doesn’t just show up at election time. My campaign is rooted in the values of P.E.O.P.L.E.—Public Safety, Education, Optimization, Public Health, Love, and Entrepreneurship—and guided by a simple principle: when you put people at the center, policy becomes personal, and progress becomes possible. As a program director in youth development, I’ve seen firsthand how critical it is to invest early in education, mental health, and family support. I’ve led afterschool programming, partnered with schools and nonprofits, and"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Lawman_Lynch",
    "text": "created safe spaces for youth to grow, learn, and lead. I’ve also organized community resource fairs, health fairs, housing workshops, and job readiness events—because I believe leadership is about meeting people where they are. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? People at the Center – My campaign is rooted in putting people—not politics—at the center of every decision, through the P.E.O.P.L.E. platform: Public Safety, Education, Optimization, Public Health, Love, and Entrepreneurship. Real Experience, Real Connection – As an educator and longtime community advocate, I’ve worked directly with youth, families, and local institutions to deliver services and uplift lives—not just during campaigns, but every day. A New Kind of Leadership – I represent a new generation of leadership grounded in compassion, accountability, and bold ideas. I’m running to replace performative politics with authentic, community-driven representation. People at the Center – My campaign is rooted in putting people—not politics—at the center of every decision, through the P.E.O.P.L.E. platform: Public Safety, Education, Optimization, Public Health, Love, and Entrepreneurship. Real Experience, Real Connection – As an educator and longtime community advocate, I’ve worked directly with youth, families, and local institutions to deliver services and uplift lives—not just during campaigns, but every day. A New Kind of Leadership – I represent a new generation of leadership grounded in compassion, accountability, and bold ideas. I’m running to replace performative politics with authentic, community-driven representation. What areas of public policy are you personally passionate about? I’m passionate about public policy that centers equity, opportunity, and dignity—especially in education, housing, and public health. As an educator, I’ve seen the power of quality education and advocate for fully funded schools and wraparound support. I support policies that protect tenants, expand affordable housing, and prevent displacement. I’m also committed to improving access to mental health care and community-based health services. I believe policy should be rooted in justice, informed by community voices, and guided by love and inclusion. What qualities does this office possess that makes it a unique and important part of the state government and legal system? The City Council plays a unique role as the most direct connection between the people and the government. It’s where policy meets lived experience. Council Members have the power to pass local laws, shape the city budget, and hold agencies accountable—but just as importantly, they’re responsible for being visible, accessible advocates for their districts. What makes this office so vital is its proximity to the people. It’s one of the few roles in government where elected officials are expected to be present in neighborhoods, responsive to community needs, and active in solving everyday challenges. What characteristics or principles are most important for an elected official? The most important characteristics for an elected official are integrity, accountability, empathy, and consistency. Leaders should listen as much as they speak, stand firm in their values, and be present in the communities they serve—not just during election cycles. An elected official must be transparent in decision-making, grounded in the needs of the people, and willing to challenge systems that perpetuate inequality. Ultimately, leadership is about service—not ego—and building trust by showing up, following through, and doing the work with humility. What qualities do you possess that you believe would make you a successful officeholder? I lead with empathy, consistency, and a deep commitment to service. I’ve spent years working directly with youth, families, and community organizations, so I understand how to listen, collaborate, and act with purpose. I bring a calm, solution-oriented presence to the table—even when the issues are complex or tense. I’m not in this for status or spotlight; I’m in it to make systems work better for everyday people. My ability to connect with residents, build trust, and follow through on my commitments is what will make me an effective and accountable officeholder. What do you believe are the core responsibilities for someone elected to this office? The core responsibilities of a City Council Member are to legislate with integrity, advocate for the needs of their district, and ensure that public resources are equitably distributed. That means not only passing laws that improve people’s lives, but also being an accessible, responsive presence in the community. It’s about constituent services, budget oversight, and holding city agencies accountable—while making sure everyday New Yorkers have a voice in the decisions that affect them. Furthermore, an elected official should be a true reflection of the"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Lawman_Lynch",
    "text": "people—not someone placed on a pedestal, but someone held accountable and in constant service to the wants and needs of the community. Leadership is not about status—it’s about service. What legacy would you like to leave? I want my legacy to be one of service, integrity, and real impact. I want people to say I showed up—not just in words, but in action. That I listened, that I led with love, and that I made government feel closer and more human. I want to leave behind stronger schools, safer communities, more opportunity for young people, and a culture of civic pride and participation. Most of all, I want to be remembered as someone who put people at the center—who used the platform not for power, but to uplift and build alongside the community. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? One of the first major historical events I remember is the release of Nelson Mandela from prison in 1990. I was a child living in Jamaica at the time, but I still remember the impact it had on my family and community. It was more than just international news—it was a moment of hope, especially for people across the African diaspora. It showed me early on how powerful leadership, resilience, and justice can inspire change worldwide. That moment sparked my awareness of global struggles for freedom and human rights, and it continues to shape my values today. What was your very first job? How long did you have it? Program Regional Trainer at Citizenship Education for 3 years. Are there any little-known powers or responsibilities held by this office that you believe more people should be aware of? One lesser-known but incredibly impactful power of a City Council Member is their influence over land use and zoning decisions through a process called “member deference.” This gives Council Members significant sway over what gets built in their districts, from affordable housing to commercial developments. Council Members also allocate discretionary and capital funding to local organizations, schools, and parks—decisions that can directly shape the quality of life in a neighborhood. Beyond legislation, they serve as liaisons between city agencies and constituents, helping residents navigate housing, education, and public safety systems. These powers are often overlooked, but they carry real, tangible consequences for everyday people. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? While experience in government can be helpful, it’s not the only—or even the most important—qualification for public office. What truly matters is a demonstrated commitment to serving people, understanding community needs, and having the courage to lead with integrity. Too often, politics becomes a closed loop of insiders, disconnected from everyday realities. Leaders with real-world experience—whether in education, advocacy, or organizing—bring fresh perspectives and deep community ties. I believe elected officials should reflect the people they serve, and that lived experience can be just as valuable as political experience when it comes to governing with compassion and effectiveness. What kind of skills or expertise do you believe would be the most helpful for the holders of this office to possess? Empathy is one of the most important qualities a Council Member can have. To serve effectively, you must be able to listen deeply, understand people’s struggles, and respond with compassion and action. Alongside empathy, strong communication, organizational skills, and the ability to collaborate across diverse communities are essential. Council Members should also be strategic thinkers—capable of navigating budgets, legislation, and city agencies—while staying grounded in the lived experiences of those they represent. Ultimately, the best leaders lead with heart, humility, and a commitment to putting people first. What qualities does this office possess that makes it a unique and important part of the local government? The City Council is one of the most direct and responsive branches of local government. Council Members are uniquely positioned to influence legislation, approve the city budget, and shape land use decisions that directly affect neighborhoods. But what makes this office truly special is its closeness to the people—it’s a role that requires being on the ground, engaging with constituents, and advocating for community needs in real time. Council Members have the ability to turn everyday concerns into policy solutions, making this office both powerful and deeply personal in its impact. What are your views on financial transparency and government accountability? Financial transparency and government accountability are non-negotiable. Taxpayer dollars"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Lawman_Lynch",
    "text": "must be spent responsibly, and the public deserves to know where their money is going, how it’s being used, and who benefits. Too often, decisions are made behind closed doors, and communities are left in the dark. I believe in open budgeting, participatory processes, and regular public reporting to build trust. Elected officials should be held to the highest standard—because when the people are footing the bill, they deserve honesty, clarity, and real outcomes. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 41 Website Facebook Instagram TikTok Candidate New York City Council District 41 Website Facebook Instagram TikTok Personal Instagram LinkedIn Personal Instagram LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 1, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 1, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,596 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Lawman_Lynch",
    "text": "Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://jamaica-gleaner.com/article/news/20240524/jamaican-lawman-lynch-running-ny-city-council",
    "text": "Top Menu Mobile Apps eGleaner Login Subscribe Now Search Menu Main menu Home Lead Stories News Sports Entertainment Business Letters Commentary Health Lifestyle Secondary Menu World News In Focus Auto Food Shipping Art & Leisure Classifieds Elections Flair Vacations Jobs Podcast Puzzles Jamaican Lawman Lynch running for NY City Council Published: Friday | May 24, 2024 | 12:06 AM Friday | May 24, 2024 | 12:06 AM Photo Video Hoping to become the first Jamaica-born male to sit on the New York City Council, Lawman Lynch recently announced his candidacy for a Brooklyn city council seat. He is seeking to represent Council District 41 in Brooklyn. Should he win the seat in November 2025, Lynch would become the first Jamaica-born male to sit on the city council. Una Clarke was the first Jamaican to sit on the council when she ran successfully for Council District 40, also in Brooklyn. Division 41 takes in such areas as Brownsville, Bed Stuyvesant, Crown Heights, East Flatbush, East New York and Oceanville. It cuts across the Congressional districts currently represented by Jamaican Yvette Clarke and Hakeem Jeffries. Headlines Delivered to Your Inbox Lynch was born in Woodford Park, Kingston, and attended the Salvation Army Basic School, Alpha Infant School, Ripoll Primary School and later Wolmer’s Boys’ School. He also attended The University of the West Indies but did not complete his studies there, migrating to the United States in 2010. Political violence Political violence A member of the People’s National Party’s Youth Organisation and a political activist before migrating, Lynch left Jamaica shortly after he became a victim of what was seen as political violence when his motor vehicle was firebombed while parked in front of his home in Woodford Park. Lynch told The Gleaner at the time of the incident in 2010 that he heard an explosion and, on investigating, found that it was not his house but his car that was firebombed. On migrating to the US, Lynch settled in Brooklyn in the same area that he is now seeking to represent in the New York City Council. According to his bio, Lynch served as a regional trainer of Citizenship Education, as part of the Education Transformation Team at the Ministry of Education (Jamaica); and has worked for national and global nonprofits that focus on child, youth and community development, as well as education and social services. Lynch is an author, musician, and award-winning youth and community development activist. He is a recipient of the CSJP Community Development Award, The Prime Minister’s Youth in Excellence Award (category of Leadership), one of New York’s Caribbean Life newspaper’s 20 under 40 trailblazers, and the founder of the Lawman Lynch Foundation Inc (LLF), a New York-based nonprofit organisation that focuses on child, youth and community development, supporting programmes both in the US and Jamaica. Additionally, Lynch’s bio lists him as the CEO of CariGlo Diaspora LLC, a multifaceted human services and fintech company (owner of the MyPaadna platform and services). He also served as the Jamaica Diaspora New York State chair. He served two terms as chairman of the African, Caribbean and Pacific States (ACP) Civil Society Forum (Brussels), he is a former Safe Schools Ambassador (Jamaica), and previously served as a member of the education Sector of the Jamaica Diaspora North East USA Think Tank. Focus on education Focus on education Lynch said his campaign would focus on education, business development and ensuring that the district will receive the resources that it needs. “The district has some of the most underserved schools and we will concentrate on after-school programmes where we can strengthen after-school and day schools to create a better synergy,” he said. He also said homework help for students would be a priority for him, as well as STEM education. Noting that he has met with a number of community leaders, church leaders and business people in the district, Lynch pointed out that he was encouraged to contest the seat by former city councilwoman Una Clarke. “She provided the encouragement that I needed to toss my hat in the ring for the seat,” he told The Gleaner . Lynch considers himself a lifelong learner, whose purpose is to facilitate the upward mobility of those he comes in contact with. He holds a BA in Communications, Masters in Educational Leadership and is currently a PhD Candidate focusing on Ethical Leadership in Education, the Private and the Public Sectors. editorial@gleanerjm.com «Hellshire, Newlands get water supply, infrastructural improvements from NWC CIBC Caribbean reorganising call centres"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "bio",
    "score": null,
    "link": "https://jamaica-gleaner.com/article/news/20240524/jamaican-lawman-lynch-running-ny-city-council",
    "text": "across region, creating new ‘Digital Branch’ » View the discussion thread. More News Email this story Print this page E-mail the editor Email this story Print this page E-mail the editor More Stories Man killed in alleged police confrontation had been reported missing Man killed in alleged police confrontation had been reported missing Trial of Noel Maitland for Donna-Lee Donaldson's murder to begin tomorrow Trial of Noel Maitland for Donna-Lee Donaldson's murder to begin tomorrow Judiciary defends judge's actions in Rio Cobre pollution case Judiciary defends judge's actions in Rio Cobre pollution case Adolescent mothers encouraged to join the Women’s Centre of Jamaica Foundation Adolescent mothers encouraged to join the Women’s Centre of Jamaica Foundation Pastor to spend a year in prison for punching stepson repeatedly Pastor to spend a year in prison for punching stepson repeatedly Seven school buses to be assigned to St Elizabeth, Vaz says Seven school buses to be assigned to St Elizabeth, Vaz says British national charged for allegedly trying to smuggle millions of dollars into Jamaica in shampoo bottles British national charged for allegedly trying to smuggle millions of dollars into Jamaica in shampoo bottles 14 Hampton School students injured in bus crash 14 Hampton School students injured in bus crash Bail extended for TikToker 119 who is charged with malicious communication Bail extended for TikToker 119 who is charged with malicious communication US and China reach deal to roll back most tariffs for 90 days US and China reach deal to roll back most tariffs for 90 days Videos Just for you Table of Contents The Gleaner Archives Digital Archives: Online editions 2006-Now Library: Research and Assistance Print Archives: Editions 1834-Present The Gleaner Archives Digital Archives: Online editions 2006-Now Library: Research and Assistance Print Archives: Editions 1834-Present Gleaner Your Way Mobile: Get the Gleaner on your mobile Newsletter: Get headline news RSS Feeds Gallery Games Videos Gleaner Your Way Mobile: Get the Gleaner on your mobile Newsletter: Get headline news RSS Feeds Gallery Games Videos GCML Websites The Star Gleaner Classifieds Go Jamaica Gleaner - North America Youthlink Voice UK Flair GCML Websites The Star Gleaner Classifieds Go Jamaica Gleaner - North America Youthlink Voice UK Flair GCML Websites Restaurant Week Discover Jamaica Go Jamaica Hosting First Look Weather GCML Websites Restaurant Week Discover Jamaica Go Jamaica Hosting First Look Weather Gleaner Links Our Products Advertise with us About Us Contact Us Suggestion Subscription Terms and Conditions Submit a Letter Privacy Policy RJRGLEANER Merger Q&A Our Products Advertise with us About Us Contact Us Suggestion Subscription Terms and Conditions Submit a Letter Privacy Policy RJRGLEANER Merger Q&A"
  }
]