[
  {
    "candidate": "Maio, Danniel",
    "category": "bio",
    "score": null,
    "link": "https://senate.maio.net/about/",
    "text": "Mon. May 12th, 2025 Maio for New York State Senate, 15th District No to City of YES; repeal bail reform; Call for COVID Commission; Stop congestion price, stop marijuana legalization, stop gender/race/history rewriting! Maps Danniel Maio Issues Danniel Maio About me in: Ballotpedia , Vote411 (League of Women Voters), NYC Votes (Campaign Finance Board), PoliticsNY (Schneps Media) State Senator Addabbo’s Facebook In Queens, over 160,000 active voters are no longer registered in Queens between February 2021 and February 2022 according to New York State Board of Elections or 12% of Queens’ voting population. In Metro New York, about 36.6% or office workers were back to work as of June 1, 2022. Why are crime , City $102B budget and State $220B budget (your taxes), rental market , homeless , inflation at or near record high? Maio is committed to fix and report our growing problems; Addabbo, in office since 2002, does not share with you what’s happening in Albany nor his voting record . If you are satisfied the way things are today, not knowing how your tax dollars are being spent… vote Democrat. If you want a safe and clean community giving police and neighbors the authority and respect they deserve, vote Republican or Independence or Conservative or Medical Freedom. If elected , you will see the difference. Always, HUG your love ones; GREET your friends and neighbors; and SHARE stories so that others may be helped by your experience. To volunteer or comment… * * * * Zelle @dannielnyc@gmail.com Venmo @ Check, payable to \"Maio Unites\" * Recent Posts MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! Governor Hochul’s FY 2026 $252 Billion budget Marijuana and Crime Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! A culprit of housing crisis: rent control laws Recent Comments Queens Chronicle article on the State Senate race – Maio for New York State Senate, 15th District on General Election Ballot 2024 Queens Chronicle article on the State Senate race – Maio for New York State Senate, 15th District on General Election Ballot 2024 Richie G. on Residents of the 85-15 101 Ave Homeless Shelter Richie G. on Residents of the 85-15 101 Ave Homeless Shelter Richie G. Parking along 111 Street - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Parking along 111 Street - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Javier on Adult male homeless shelter opened February 2020 has been a hotspot for crime. Javier on Adult male homeless shelter opened February 2020 has been a hotspot for crime. Javier Trotting Course Lane: Cars parked for months - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Trotting Course Lane: Cars parked for months - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Archives January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 Categories Bail Reform Business Crime Election Fun Health Housing Inflation Parking Quality of Life Safety Sanitation Schools Taxes Transportation Tree and Sidewalk Uncategorized Wanted Waste You missed MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 Marijuana and Crime January 6, 2025 Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 Maio for New York State Senate, 15th District No to City of YES; repeal bail reform; Call for COVID Commission; Stop congestion price, stop marijuana legalization, stop gender/race/history rewriting! Proudly powered by WordPress | Theme: Newsup by Themeansar . | Home Danniel Maio Let’s Talk Maps Spread the mayo"
  },
  {
    "candidate": "Maio, Danniel",
    "category": "bio",
    "score": null,
    "link": "https://senate.maio.net/",
    "text": "Mon. May 12th, 2025 Maio for New York State Senate, 15th District No to City of YES; repeal bail reform; Call for COVID Commission; Stop congestion price, stop marijuana legalization, stop gender/race/history rewriting! Maps Danniel Maio Issues NYC DOT Albany Good People Election Integrity MTA COVID Latest Post MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! Governor Hochul’s FY 2026 $252 Billion budget Marijuana and Crime Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! A culprit of housing crisis: rent control laws MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! Governor Hochul’s FY 2026 $252 Billion budget Marijuana and Crime Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! Crime Inflation Taxes MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 Danniel MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 Taxes Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 Danniel Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 Crime Safety Marijuana and Crime January 6, 2025 Danniel Marijuana and Crime January 6, 2025 Inflation Taxes Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 Danniel Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 Housing Inflation A culprit of housing crisis: rent control laws December 29, 2024 Danniel A culprit of housing crisis: rent control laws December 29, 2024 Crime Inflation Taxes MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 Danniel When MTA went cashless in 2018, the number of delinquent “placements” increased. $1.4 billion in 2024 alone and $3.7 billion combined from 2021 through 2023, according to a financial chart… MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 When MTA went cashless in 2018, the number of delinquent “placements” increased. $1.4 billion in 2024 alone and $3.7 billion combined from 2021 through 2023, according to a financial chart… Taxes Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 Danniel The New York State budget has a 27-month cycle. Before Governor’s announcement in January, the process starts when the previous budget passed the Albany legislature supposedly by March 31. The… Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 The New York State budget has a 27-month cycle. Before Governor’s announcement in January, the process starts when the previous budget passed the Albany legislature supposedly by March 31. The… Crime Safety Marijuana and Crime January 6, 2025 Danniel How many criminals had marijuana in their system when they committed their act? The City does not track it since there is no accepted instrument such as a breathalyzer to… Marijuana and Crime January 6, 2025 How many criminals had marijuana in their system when they committed their act? The City does not track it since there is no accepted instrument such as a breathalyzer to… Inflation Taxes Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 Danniel MTA has been blind to the needs of its riders. If the Chair and CEO, who makes over $400,000 per year, were elected, will you vote for him? There has… Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 MTA has been blind to the needs of its riders. If the Chair and CEO, who makes over $400,000 per year, were elected, will you vote for him? There has… Housing Inflation A culprit of housing crisis: rent control laws December 29, 2024 Danniel To resolve high rent and low vacancy in the city that has decreasing population, one must examine why there is a supply problem through the housing pipeline from construction, marketing,… A culprit of housing crisis: rent control laws December 29, 2024 To resolve high rent and low vacancy in the city that has decreasing population, one must examine why there is a supply problem through the housing pipeline from construction, marketing,… Inflation Taxes Waste Lavender scent machines in subway?!! December 21, 2024 Danniel Are you kidding me? Congestion Pricing is about to start on January 5 and subway fare is planned to increase to $3… Instead of helping the"
  },
  {
    "candidate": "Maio, Danniel",
    "category": "bio",
    "score": null,
    "link": "https://senate.maio.net/",
    "text": "straphangers, MTA knows how… Lavender scent machines in subway?!! December 21, 2024 Are you kidding me? Congestion Pricing is about to start on January 5 and subway fare is planned to increase to $3… Instead of helping the straphangers, MTA knows how… Crime Inflation Taxes The Big Apple is a $89 Billion judicial hellhole! December 12, 2024 Danniel According to American Tort Reform Reform Association, which is dedicated to fighting frivolous lawsuits in America, ranks New York City as the worst in America second only to Philadelphia. The Big Apple is a $89 Billion judicial hellhole! December 12, 2024 According to American Tort Reform Reform Association, which is dedicated to fighting frivolous lawsuits in America, ranks New York City as the worst in America second only to Philadelphia. Election Post-Election Political Shenanigans November 16, 2024 Danniel Delayed approval by Panel for Education Policy’s $17 million contract for NCS Pearson’s SHSAT high school test. Adultery is no longer a crime. Neither is jaywalking in NYC. Congestion Pricing… Post-Election Political Shenanigans November 16, 2024 Delayed approval by Panel for Education Policy’s $17 million contract for NCS Pearson’s SHSAT high school test. Adultery is no longer a crime. Neither is jaywalking in NYC. Congestion Pricing… Inflation Quality of Life Taxes Transportation Congestion Pricing: She said, he said. November 15, 2024 Danniel Election has consequence. On Congestion Pricing, Governor Hochul wants to restart it on January 5, 2025. President-Elect Donald Trump said he will kill it after taking office on January 20,… Congestion Pricing: She said, he said. November 15, 2024 Election has consequence. On Congestion Pricing, Governor Hochul wants to restart it on January 5, 2025. President-Elect Donald Trump said he will kill it after taking office on January 20,… Election Elections for judgeship are non-competitive November 14, 2024 Danniel London House and Collado Consultants & Co. is the go to firm in Bronx. What about other boroughs? Elections for judgeship are non-competitive November 14, 2024 London House and Collado Consultants & Co. is the go to firm in Bronx. What about other boroughs? Posts pagination 1 … Recent Posts MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! Governor Hochul’s FY 2026 $252 Billion budget Marijuana and Crime Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! A culprit of housing crisis: rent control laws Recent Comments Queens Chronicle article on the State Senate race – Maio for New York State Senate, 15th District on General Election Ballot 2024 Queens Chronicle article on the State Senate race – Maio for New York State Senate, 15th District on General Election Ballot 2024 Richie G. on Residents of the 85-15 101 Ave Homeless Shelter Richie G. on Residents of the 85-15 101 Ave Homeless Shelter Richie G. Parking along 111 Street - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Parking along 111 Street - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Javier on Adult male homeless shelter opened February 2020 has been a hotspot for crime. Javier on Adult male homeless shelter opened February 2020 has been a hotspot for crime. Javier Trotting Course Lane: Cars parked for months - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Trotting Course Lane: Cars parked for months - Maio for New York State Senate, 15th District on Proposal 1: For car owners! Archives January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 Categories Bail Reform Business Crime Election Fun Health Housing Inflation Parking Quality of Life Safety Sanitation Schools Taxes Transportation Tree and Sidewalk Uncategorized Wanted Waste You missed MTA lost nearly $1 billion to fare evaders, but $5 billion to bridge and tunnels! January 26, 2025 Governor Hochul’s FY 2026 $252 Billion budget January 21, 2025 Marijuana and Crime January 6, 2025 Congestion Pricing started 12:01 am Jan 5th: Janno (John Nathan) Lieber has to go! January 5, 2025 Maio for New York State Senate, 15th District No to City of YES; repeal bail reform; Call for COVID Commission; Stop congestion price, stop marijuana legalization, stop gender/race/history"
  },
  {
    "candidate": "Maio, Danniel",
    "category": "bio",
    "score": null,
    "link": "https://senate.maio.net/",
    "text": "rewriting! Proudly powered by WordPress | Theme: Newsup by Themeansar . | Home Danniel Maio Let’s Talk Maps Spread the mayo"
  }
]