[
  {
    "candidate": "Malave, Ismael",
    "category": "bio",
    "score": null,
    "link": "https://malavefornyc.com/",
    "text": "About Team Program Events Gallery Contact About Team Program Events Gallery Contact Contribute WELCOME TO MALAVEFORNYC: INTEGRITY, STRENGTH, & HOPE \"ISH\" ismael malave perez FOR COMPTROLLER! Affectionately known as “ISH.” Born in Santurce, Puerto Rico, USA, and raised in the Bronx, Mr. Malave has dedicated his life to serving his community. Growing up in challenging circumstances, he learned the values of resilience, hard work, and compassion from his mother, who raised him and his siblings single-handedly. Mr. Malave graduated from Lehman College, CUNY, with a BA in Economics and later earned an MBA from Baruch College, CUNY. With over two decades of experience in public service and a deep understanding of fiscal policy, Mr. Malave is ready to bring positive change to New York City as its next Comptroller. Donate at ActBlue Where equality reins. Vision, Values, and Key Priorities: At MalaveForNYC, our vision is to build a city that works for everyone. Mr. Malave believes in the core values of Integrity, Strength, and Hope, and is committed to: Fiscal Responsibility: Mr. Malave will prioritize responsible budgeting practices and work to eliminate waste and inefficiency in city government. Equity and Opportunity: Mr. Malave is dedicated to creating a fair and inclusive city where every resident has access to economic opportunity and essential services. Transparency and Accountability: Mr. Malave will establish transparent protocols for government audits to identify cost savings, eliminate fraud, and ensure taxpayer dollars are spent wisely. Contribute 2025 New York City Fighting for Voter Access: Strengthening Our Democracy Ismael “ISH” Malave-Perez, Jr., MBA, is dedicated to enhancing voter rights and access to the ballot box for all New Yorkers, addressing the declining voter turnout in New York City. He plans to collaborate with labor unions, community leaders, and advocacy groups to implement solutions that eliminate voting barriers and increase civic engagement. Leveraging his experience in government, including with five comptrollers, the Public Advocate, and the Board of Education’s Chancellor, Ismael aims to reform the electoral system. He supports reforms like same-day registration, early voting, and streamlining election administration, believing these will increase voter participation, save taxpayer money, and strengthen democracy. Electing Ismael as the next NYC Comptroller is a vote for expanding voter access and strengthening democracy, aiming to create a more inclusive and representative electoral system. Days Hours Minutes Seconds Donate at ActBlue Leadership - MalaveForNYC stands for ... Upholding the Prevailing Wage: ISH is a strong advocate for fair wages and will work to ensure that all workers in NYC receive the wages they deserve. Fixing Tier 6: ISH is committed to addressing issues with the city's pension system and will advocate for reforms to ensure the long-term sustainability of retirement benefits for city workers. Diverse Money Management: ISH will promote diversity in the city's business network by including more minority money managers and vendors who are issued government contracts and manage our investments. Donate at ActBlue Experience Matters: A Track Record of Leadership and Achievement Ismael Malave-Perez, Jr., MBA, has a distinguished career with over 23 years of experience in government and finance, serving in various capacities including Senior Investment Analyst, advocating for corporate responsibility, leading change management and business transformation, and contributing to strategic planning and IT implementation. He has worked with statewide Comptrollers and citywide elected officials, including the Public Advocate and the Board of Education's Chancellor. His educational background includes an MBA in Marketing and Government Policy from Baruch’s Zicklin School of Business and a degree in Economics from Lehman College. Ismael is now seeking to apply his expertise and leadership skills to serve as a leader for the Comptroller’s Office, bringing a unique blend of financial acumen, strategic vision, and commitment to public service. Contribute Fortitude and Dedication: A Real New Yorker's Commitment Ismael Malave-Perez, Jr., MBA, is celebrated for his fortitude and dedication to his community, embodying the spirit of resilience and perseverance. Born and raised in New York City, he understands the challenges faced by many New Yorkers, including personal struggles and the importance of community. Ismael's journey from the Bronx to becoming a successful professional, dedicated father, and esteemed civil servant showcases his commitment to overcoming obstacles and achieving success. He believes in unity and collaboration to address community issues, using his deep connections and empathy to foster change. As a professional, father, and civil servant, Ismael is committed to serving with humility and integrity, leading by example and working tirelessly for a brighter future for all New Yorkers. Electing him as the next NYC Comptroller is a"
  },
  {
    "candidate": "Malave, Ismael",
    "category": "bio",
    "score": null,
    "link": "https://malavefornyc.com/",
    "text": "vote for fortitude, dedication, and a better future for the city. Join our Campaign Name Email Mobile Phone Send By providing your phone number you are agreeing to receive campaign updates and news at a maximum of 10 times a month from MalaveForNYC. Message and data rates may apply. Text HELP for more information. Text STOP to stop receiving messages. A City We Can All Be Proud Of Imagine waking up every day in a New York City that you can be proud of – a city where your tax dollars are used efficiently, where financial decisions are made with transparency, and where the Comptroller’s office is a beacon of integrity. That’s the city I want to build with you. Contribute Join our Cause Join our team of like-minded everyday people who simply want to elect a moderate democrat with Ismael, a real New Yorker who will make NYC a better place to live in, a place where every voice is heard, every hand is held, and every soul is equal. You’re invited to join our cause. Donate Volunteer Today We’re always looking for the community’s support to help push our campaign further than we could ever imagine. Does that sound like you? Volunteer today and be a part of change. News/Updates: Stay up to date with the latest news and updates from MalaveForNYC. Check back regularly for campaign announcements, events, and more. Multimedia Content: Explore photos and videos from ISH's campaign events and community outreach efforts. Get to know the candidate and learn more about his vision for NYC. Honesty & Transparency Mr. Malave will establish transparent protocols for government audits to identify cost savings, eliminate fraud, and ensure taxpayer dollars are spent wisely. Can we count on you? Connect with Us: Follow MalaveForNYC on Facebook, Instagram, and Twitter for the latest updates and behind-the-scenes content. Join the conversation and help us spread the word about ISH’s campaign for NYC Comptroller. NEW YORK CITY Pension systems Ish for Comptroller New York City Economic Issues Ish for Comptroller New York City Labor Work Force Ish for Comptroller New York City PRE Election Campaign policy statements Ish for Comptroller New York City ai + Cybersecurity + emerging technology Ish for Comptroller New York City Embracing Future Transitions Ish for Comptroller New York City Reinvesting in NY's Minority-Owned Business Enterprises (MWBEs) Ish for Comptroller New York City fiscal responsibility and inclusion Ish for Comptroller New York City commitment to transparency Ish for Comptroller Become Volunteer and Donate Show Your Support & Donate Connect with Us: Follow MalaveForNYC on Facebook, Instagram, and Twitter for the latest updates and behind-the-scenes content. Join the conversation and help us spread the word about ISH’s campaign for NYC Comptroller. Contribution Card DONATE Latest news & Article Pension Systems April 5, 2024 No Comments Blog Post Title February 25, 2024 No Comments INTEGRITY, STRENGTH, & HOPE Issues Educations Economic Public Health Social Law & Civil Rights About Ismael Malave, Jr. About Us Volunteer Programs Team Headquarters New York City [email protected] +1 917 468 2589 Copyright © 2024 Malave For NYC, All rights reserved. Facebook-f Instagram Twitter Youtube Linkedin About Team Program Events Gallery Contact About Team Program Events Gallery Contact Contribute Contribute WELCOME TO MALAVEFORNYC: INTEGRITY, STRENGTH, & HOPE \"ISH\" ismael malave perez FOR COMPTROLLER! Affectionately known as “ISH.” Born in Santurce, Puerto Rico, USA, and raised in the Bronx, Mr. Malave has dedicated his life to serving his community. Growing up in challenging circumstances, he learned the values of resilience, hard work, and compassion from his mother, who raised him and his siblings single-handedly. Mr. Malave graduated from Lehman College, CUNY, with a BA in Economics and later earned an MBA from Baruch College, CUNY. With over two decades of experience in public service and a deep understanding of fiscal policy, Mr. Malave is ready to bring positive change to New York City as its next Comptroller. Donate at ActBlue Donate at ActBlue Where equality reins. Vision, Values, and Key Priorities: At MalaveForNYC, our vision is to build a city that works for everyone. Mr. Malave believes in the core values of Integrity, Strength, and Hope, and is committed to: Fiscal Responsibility: Mr. Malave will prioritize responsible budgeting practices and work to eliminate waste and inefficiency in city government. Equity and Opportunity: Mr. Malave is dedicated to creating a fair and inclusive city where every resident has access to economic opportunity and essential services. Transparency and Accountability: Mr. Malave will establish transparent protocols for government audits"
  },
  {
    "candidate": "Malave, Ismael",
    "category": "bio",
    "score": null,
    "link": "https://malavefornyc.com/",
    "text": "to identify cost savings, eliminate fraud, and ensure taxpayer dollars are spent wisely. Contribute Contribute 2025 2025 New York City New York City Fighting for Voter Access: Strengthening Our Democracy Ismael “ISH” Malave-Perez, Jr., MBA, is dedicated to enhancing voter rights and access to the ballot box for all New Yorkers, addressing the declining voter turnout in New York City. He plans to collaborate with labor unions, community leaders, and advocacy groups to implement solutions that eliminate voting barriers and increase civic engagement. Leveraging his experience in government, including with five comptrollers, the Public Advocate, and the Board of Education’s Chancellor, Ismael aims to reform the electoral system. He supports reforms like same-day registration, early voting, and streamlining election administration, believing these will increase voter participation, save taxpayer money, and strengthen democracy. Electing Ismael as the next NYC Comptroller is a vote for expanding voter access and strengthening democracy, aiming to create a more inclusive and representative electoral system. Days Hours Minutes Seconds Donate at ActBlue Donate at ActBlue Leadership - MalaveForNYC stands for ... Leadership - MalaveForNYC stands for ... Upholding the Prevailing Wage: ISH is a strong advocate for fair wages and will work to ensure that all workers in NYC receive the wages they deserve. Fixing Tier 6: ISH is committed to addressing issues with the city's pension system and will advocate for reforms to ensure the long-term sustainability of retirement benefits for city workers. Diverse Money Management: ISH will promote diversity in the city's business network by including more minority money managers and vendors who are issued government contracts and manage our investments. Donate at ActBlue Donate at ActBlue Experience Matters: A Track Record of Leadership and Achievement Experience Matters: A Track Record of Leadership and Achievement Ismael Malave-Perez, Jr., MBA, has a distinguished career with over 23 years of experience in government and finance, serving in various capacities including Senior Investment Analyst, advocating for corporate responsibility, leading change management and business transformation, and contributing to strategic planning and IT implementation. He has worked with statewide Comptrollers and citywide elected officials, including the Public Advocate and the Board of Education's Chancellor. His educational background includes an MBA in Marketing and Government Policy from Baruch’s Zicklin School of Business and a degree in Economics from Lehman College. Ismael is now seeking to apply his expertise and leadership skills to serve as a leader for the Comptroller’s Office, bringing a unique blend of financial acumen, strategic vision, and commitment to public service. Contribute Contribute Fortitude and Dedication: A Real New Yorker's Commitment Fortitude and Dedication: A Real New Yorker's Commitment Ismael Malave-Perez, Jr., MBA, is celebrated for his fortitude and dedication to his community, embodying the spirit of resilience and perseverance. Born and raised in New York City, he understands the challenges faced by many New Yorkers, including personal struggles and the importance of community. Ismael's journey from the Bronx to becoming a successful professional, dedicated father, and esteemed civil servant showcases his commitment to overcoming obstacles and achieving success. He believes in unity and collaboration to address community issues, using his deep connections and empathy to foster change. As a professional, father, and civil servant, Ismael is committed to serving with humility and integrity, leading by example and working tirelessly for a brighter future for all New Yorkers. Electing him as the next NYC Comptroller is a vote for fortitude, dedication, and a better future for the city. Join our Campaign Send Send By providing your phone number you are agreeing to receive campaign updates and news at a maximum of 10 times a month from MalaveForNYC. Message and data rates may apply. Text HELP for more information. Text STOP to stop receiving messages. A City We Can All Be Proud Of Imagine waking up every day in a New York City that you can be proud of – a city where your tax dollars are used efficiently, where financial decisions are made with transparency, and where the Comptroller’s office is a beacon of integrity. That’s the city I want to build with you. Contribute Contribute Join our Cause Join our team of like-minded everyday people who simply want to elect a moderate democrat with Ismael, a real New Yorker who will make NYC a better place to live in, a place where every voice is heard, every hand is held, and every soul is equal. You’re invited to join our cause. Donate Donate Volunteer Today We’re always looking for the community’s support to help push our"
  },
  {
    "candidate": "Malave, Ismael",
    "category": "bio",
    "score": null,
    "link": "https://malavefornyc.com/",
    "text": "campaign further than we could ever imagine. Does that sound like you? Volunteer today and be a part of change. News/Updates: News/Updates: Stay up to date with the latest news and updates from MalaveForNYC. Check back regularly for campaign announcements, events, and more. Multimedia Content: Multimedia Content: Explore photos and videos from ISH's campaign events and community outreach efforts. Get to know the candidate and learn more about his vision for NYC. Honesty & Transparency Honesty & Transparency Mr. Malave will establish transparent protocols for government audits to identify cost savings, eliminate fraud, and ensure taxpayer dollars are spent wisely. Can we count on you? Connect with Us: Follow MalaveForNYC on Facebook, Instagram, and Twitter for the latest updates and behind-the-scenes content. Join the conversation and help us spread the word about ISH’s campaign for NYC Comptroller. Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Ish for Comptroller Become Volunteer and Donate Show Your Support & Donate Connect with Us: Follow MalaveForNYC on Facebook, Instagram, and Twitter for the latest updates and behind-the-scenes content. Join the conversation and help us spread the word about ISH’s campaign for NYC Comptroller. Contribution Card Contribution Card DONATE DONATE Latest news & Article Pension Systems April 5, 2024 No Comments April 5, 2024 No Comments Blog Post Title February 25, 2024 No Comments February 25, 2024 No Comments INTEGRITY, STRENGTH, & HOPE Issues Educations Educations Economic Economic Public Health Public Health Social Social Law & Civil Rights Law & Civil Rights About Ismael Malave, Jr. About Us About Us Volunteer Volunteer Programs Programs Team Team Headquarters New York City New York City [email protected] [email protected] [email protected] +1 917 468 2589 +1 917 468 2589 Facebook-f Facebook-f Instagram Instagram Twitter Twitter Youtube Youtube Linkedin Linkedin"
  }
]