[
  {
    "candidate": "Maloney, Virginia",
    "category": "bio",
    "score": null,
    "link": "https://www.virginiamaloney.com/about",
    "text": "About Issues Events Volunteer Endorsements News District 4 Meet Virginia Meet Virginia Virginia grew up on New York's east side. Virginia grew up on New York's east side. My name is Virginia Maloney , and I am running for New York City Council District 4 , encompassing parts of the Upper East Side, Sutton Place, Midtown East, Kips Bay, Murray Hill, and Stuyvesant Town-Peter Cooper Village. I’m a New Yorker— born and raised on the East Side of Manhattan . My community has shaped who I am and inspired my lifelong commitment to public service. I’m running to make New York a more Accountable , Affordable , and Accessible place. My Work My Work I dedicated my career to improving people's lives through the advancement of technology. Whether that was installing solar-powered ovens in rural homes in Bolivia or leading Mayor Bloomberg's initiative to expand free public Wi-Fi to New Yorkers—I know how to build consensus and get things done. Virginia works in the private sector to make tech more accessible. Virginia works in the private sector to make tech more accessible. At the NYC Economic Development Corporation , I worked with local businesses to create jobs and expand opportunities for marginalized communities. I expanded internet access throughout the City, and built programs to attract top talent. I consulted for federal agencies to improve high-speed rail to the Northeast Corridor, improve healthcare services, and save taxpayer dollars. As a leader in the tech sector, I know how technology can positively impact people’s lives. I created online tools to support mom-and-pop businesses and communities, help people give blood, and connect blind and vision-impaired people with volunteers to help them navigate daily life. My Family My Family Virginia with her mother on the east side. Virginia with her mother on the east side. My mother loves to tell the story that she was debating legislation on the floor of the City Council when she went into labor with me. My mother—a teacher, City Councilwoman and a Member of Congress —taught me to believe in myself as a woman and that when I do, I can get great things done. Virginia with her sister, Christina, and nephew. Virginia with her sister, Christina, and nephew. My late father—a U.S. Navy veteran and NYC Marathon runner who served on the board of Civitas and the New York Foundation for Senior Citizens —taught me the importance of hard work and that even the smallest of gestures can have a huge impact on people's lives. I’ve seen that real change is possible through their example, and that of my relative, Alice Paul, a pioneering suffragist who fought for women’s right to vote and authored the national Equal Rights Amendment. I know the importance of standing up for what is right, working hard, and never backing down. My Education and Community Involvement My Education and Community Involvement Virginia speaking in support of Pursuit Fellows (Photo Credit: Andrew Kelly). Virginia speaking in support of Pursuit Fellows (Photo Credit: Andrew Kelly). My education, like my career, has woven together both public service and technology. After growing up in New York City, I graduated from Princeton University , where I majored in public policy and minored in Environmental Studies. I went on to earn a Master’s degree in Public Administration from Harvard University's Kennedy School and an MBA from M.I.T. I started a company focused on affordable housing and senior care that won the NYC Big Apps award. I served on Teach for America ’s Young Professionals Committee in New York and am a member of the Young Fellows for the Frick Collection . I have been involved in Democratic politics my entire life, including on a host of local elections and Hillary Clinton ’s presidential campaigns. I currently serve on the Executive Committee of the Lexington Democratic Club, where we worked to pass Prop 1 and elect East Side Democrats . I’m a proven problem solver with the grit and determination to stand up for what’s right and get things done. Our country is in crisis, and strong local leadership is crucial to pushing back against the second Trump administration. New York’s East Side is my lifelong home, and I’ll be a strong voice for our entire City. I hope to earn your vote. contact@virginiamaloney.com contact@virginiamaloney.com Paid for by Virginia Maloney for City Council"
  }
]