[
  {
    "candidate": "Marte, Christopher",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/christopher-marte/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 1 Christopher Marte Financial District-Battery Park City, Tribeca-Civic Center, The Battery-Governors Island-Ellis Island-Liberty Island, SoHo-Little Italy-Hudson Square, Chinatown-Two Bridges, Lower East Side Biography Christopher Marte was born and raised on the Lower East Side, where his father owned a bodega and his mother worked in a garment factory before becoming a home attendant. When he wasn’t stacking cans, he attended local public schools and after-school programs. Eventually, his father’s store had to close down because of rent hikes, and Christopher started to see the community he loved get torn apart by luxury development and corrupt politicians. Christopher co-founded two community gardens in NYCHA and volunteered at the Bowery Mission in order to give back to the community that raised him. Professionally, Christopher started his career managing IBM’s retirement funds while paying off his student loans. As he continued to work in finance, he served on the Young Professionals Board of Defy Ventures — where he guided formerly incarcerated people through the process of starting their own small businesses. Afterwards, Christopher worked as a legal researcher at an immigration law firm, before deciding to run for City Council in 2017. Although Christopher fell short by 200 votes, he was able to unite people all across District 1; neighbors, who lived only a quarter mile away from each other but never had a reason to work together before, became closer connected. After the election, he served as the New York State Director at Arena, using his experience running for office to train a new generation of candidates and campaign staffers. In 2021, Christopher won the City Council election and now serves as District 1’s City Council Member. Biography Christopher Marte was born and raised on the Lower East Side, where his father owned a bodega and his mother worked in a garment factory before becoming a home attendant. When he wasn’t stacking cans, he attended local public schools and after-school programs. Eventually, his father’s store had to close down because of rent hikes, and Christopher started to see the community he loved get torn apart by luxury development and corrupt politicians. Christopher co-founded two community gardens in NYCHA and volunteered at the Bowery Mission in order to give back to the community that raised him. Professionally, Christopher started his career managing IBM’s retirement funds while paying off his student loans. As he continued to work in finance, he served on the Young Professionals Board of Defy Ventures — where he guided formerly incarcerated people through the process of starting their own small businesses. Afterwards, Christopher worked as a legal researcher at an immigration law firm, before deciding to run for City Council in 2017. Although Christopher fell short by 200 votes, he was able to unite people all across District 1; neighbors, who lived only a quarter mile away from each other but never had a reason to work together before, became closer connected. After the election, he served as the New York State Director at Arena, using his experience running for office to train a new generation of candidates and campaign staffers. In 2021, Christopher won the City Council election and now serves as District 1’s City Council Member. Biography Staff Directory Letters from the Council Member FY2026 Budget Subscribe to our newsletter Media Inquiries Adopt a Tree in District 1! District Office 65 East Broadway New York, NY 10002 Phone: 212-587-3159 Fax: 212-587-3138 Office Hours: 10:00 a.m. to 6:00 p.m. Legislative Office 250 Broadway, Suite 1815 New York, NY 10007 Phone: 212-587-3159 Fax: 212-442-1563 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement"
  },
  {
    "candidate": "Marte, Christopher",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/christopher-marte/",
    "text": "General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Marte, Christopher",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/christopher-marte/staff/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 1 Christopher Marte Financial District-Battery Park City, Tribeca-Civic Center, The Battery-Governors Island-Ellis Island-Liberty Island, SoHo-Little Italy-Hudson Square, Chinatown-Two Bridges, Lower East Side Staff Directory Caitlin Kelmar , Chief of Staff ckelmar@council.nyc.gov Conor Allerton , Director of Land Use and Housing callerton@council.nyc.gov Max Deutsch , Legislative Director mdeutsch@council.nyc.gov Simon Kostelanetz , Director of Public Affairs skostelanetz@council.nyc.gov Andy Li , Budget Director anli@council.nyc.gov Jessica Lin , Community Liaison jlin@council.nyc.gov Louis Olivares , Community Liaison lolivares@council.nyc.gov Meng Qin Zou , Community Liaison nzou@council.nyc.gov For media inquiries, please contact ckelmar@council.nyc.gov. Staff Directory Caitlin Kelmar , Chief of Staff ckelmar@council.nyc.gov Conor Allerton , Director of Land Use and Housing callerton@council.nyc.gov Max Deutsch , Legislative Director mdeutsch@council.nyc.gov Simon Kostelanetz , Director of Public Affairs skostelanetz@council.nyc.gov Andy Li , Budget Director anli@council.nyc.gov Jessica Lin , Community Liaison jlin@council.nyc.gov Louis Olivares , Community Liaison lolivares@council.nyc.gov Meng Qin Zou , Community Liaison nzou@council.nyc.gov For media inquiries, please contact ckelmar@council.nyc.gov. Biography Staff Directory Letters from the Council Member FY2026 Budget Subscribe to our newsletter Media Inquiries Adopt a Tree in District 1! District Office 65 East Broadway New York, NY 10002 Phone: 212-587-3159 Fax: 212-587-3138 Office Hours: 10:00 a.m. to 6:00 p.m. Legislative Office 250 Broadway, Suite 1815 New York, NY 10007 Phone: 212-587-3159 Fax: 212-442-1563 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]