[
  {
    "candidate": "Martinez, Jean P",
    "category": "bio",
    "score": null,
    "link": "https://jeanpierremartinez.net/en/accueil-english/",
    "text": "Jean-Pierre Martinez Jean-Pierre Martinez Dramaturge, Playwright, Dramaturgo Dramaturge, Playwright, Dramaturgo Home Plays Distribution Theatrical Genre Themes Translations Productions Biography Copyright Contact Jean-Pierre Martinez Jean-Pierre Martinez Dramaturge, Playwright, Dramaturgo Dramaturge, Playwright, Dramaturgo Main Menu Home Plays Distribution Theatrical Genre Themes Translations Productions Biography Copyright Contact Born in France with Spanish roots, Jean-Pierre Martinez is a playwright with an unconventional trajectory. His journey began on stage at the age of twenty, not as a writer but as a drummer in rock bands. He later transitioned into advertising semiology before embarking on a career as a television scriptwriter. Ultimately, he returned to the stage as a playwright. By making all his works freely accessible to theater companies via his own website—and translating them into over twenty languages—he quickly gained international recognition. His greatest pride lies in seeing his plays performed in nearly a hundred countries, including by emerging theater groups and in places where theater serves as a tool for emancipation or even resistance. His plays are also studied and performed in schools, colleges, and universities worldwide. Shades of humor Absurd Black comedy Burlesque Chamber play Comedy of character Comedy of intrigue Comedy of manners Crime comedy Dramatic comedy Dystopian drama Meta-theatre Parody Political comedy Romantic comedy Situation comedy Sketchs Specific Forms Monologues One-Act Comedies Sketchs Last-Cast Plays On stage Born in France with Spanish roots, Jean-Pierre Martinez is a playwright with an unconventional trajectory. His journey began on stage at the age of twenty, not as a writer but as a drummer in rock bands. He later transitioned into advertising semiology before embarking on a career as a television scriptwriter. Ultimately, he returned to the stage as a playwright. By making all his works freely accessible to theater companies via his own website—and translating them into over twenty languages—he quickly gained international recognition. His greatest pride lies in seeing his plays performed in nearly a hundred countries, including by emerging theater groups and in places where theater serves as a tool for emancipation or even resistance. His plays are also studied and performed in schools, colleges, and universities worldwide. Shades of humor Absurd Black comedy Burlesque Chamber play Comedy of character Comedy of intrigue Comedy of manners Crime comedy Dramatic comedy Dystopian drama Meta-theatre Parody Political comedy Romantic comedy Situation comedy Sketchs Specific Forms Monologues One-Act Comedies Sketchs Last-Cast Plays On stage Plays Created with GIMP Cast Two Characters Three Characters Four Characters Five Characters Six Characters Seven or More Characters Sketchs Monologues Theatrical genre Absurd Black comedy Burlesque Chamber play Comedy of character Comedy of intrigue Comedy of manners Crime comedy Dramatic comedy Dystopian theatre Meta-theatre Parody Political comedy Romantic comedy Situation comedy Languages Albanian Arabic Bulgarian Chinese Czech Danish Dutch Finnish French German Greek Hungarian Italian Japanese Korean Lithuanian Polish Portuguese Romanian Serbian Spanish Swedish Turkish Ukrainian Home Plays Distribution Theatrical Genre Themes Translations Productions Biography Copyright Contact Copyright © 2025 Jean-Pierre Martinez playwright | Powered by Astra WordPress Theme Astra WordPress Theme Politique de cookies (UE) Fonctionnel Fonctionnel Always active Fonctionnel Fonctionnel Always active Fonctionnel Fonctionnel Le stockage ou l’accès technique est strictement nécessaire dans la finalité d’intérêt légitime de permettre l’utilisation d’un service spécifique explicitement demandé par l’abonné ou l’utilisateur, ou dans le seul but d’effectuer la transmission d’une communication sur un réseau de communications électroniques. Préférences Préférences Préférences Préférences Préférences Le stockage ou l’accès technique est nécessaire dans la finalité d’intérêt légitime de stocker des préférences qui ne sont pas demandées par l’abonné ou l’utilisateur. Statistiques Statistiques Statistiques Statistiques Statistiques Le stockage ou l’accès technique qui est utilisé exclusivement à des fins statistiques. Le stockage ou l’accès technique qui est utilisé exclusivement dans des finalités statistiques anonymes. En l’absence d’une assignation à comparaître, d’une conformité volontaire de la part de votre fournisseur d’accès à internet ou d’enregistrements supplémentaires provenant d’une tierce partie, les informations stockées ou extraites à cette seule fin ne peuvent généralement pas être utilisées pour vous identifier. Marketing Marketing Marketing Marketing Marketing Le stockage ou l’accès technique est nécessaire pour créer des profils d’utilisateurs afin d’envoyer des publicités, ou pour suivre l’utilisateur sur un site web ou sur plusieurs sites web ayant des finalités marketing similaires. Scroll to Top"
  }
]