[
  {
    "candidate": "McPhatter, Shanduke L",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shanduke_McPhatter",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Shanduke McPhatter Shanduke McPhatter Shanduke McPhatter This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Voices for Change Party November 2, 2021 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Personal Facebook Personal Twitter Personal Instagram Personal LinkedIn Shanduke McPhatter (Voices for Change Party) ran for election for Brooklyn Borough President in New York. He lost in the general election on November 2, 2021 . McPhatter completed Ballotpedia's Candidate Connection survey in 2021. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2021 2 Elections 2.1 2021 2.1 2021 3 Campaign themes 3.1 2021 3 Campaign themes 3.1 2021 3.1 2021 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Shanduke McPhatter was born in Brooklyn, New York. He founded the organization G-MACC, or Gangstas Making Astronomical Community Changes, which describes its mission as “making positive change by reaching out to residents of all ages in communities ravaged by gun violence and gang activity.” [1] [2] Elections Elections 2021 2021 See also: Municipal elections in Kings County, New York (2021) General election General election for Brooklyn Borough President Antonio Reynoso defeated Menachem Raitport , Anthony Jones , and Shanduke McPhatter in the general election for Brooklyn Borough President on November 2, 2021. Candidate % Votes ✔ Antonio Reynoso (D) 72.8 235,118 Menachem Raitport (R / Conservative Party) 22.9 74,068 Anthony Jones (Rent Is 2 Damn High Party) 2.7 8,567 Shanduke McPhatter (Voices for Change Party) 1.4 4,415 Other/Write-in votes 0.2 635 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 322,803 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic Primary for Brooklyn Borough President Select round: Round 11 Round 10 Round 9 Round 8 Round 7 Round 6 Round 5 Round 4 Round 3 Round 2 Round 1 The following candidates advanced in the ranked-choice voting election: Antonio Reynoso in round 11 . The results of Round are displayed below. To see the results of other rounds, use the dropdown menu above to select a round and the table will update. Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 54.9 107,963 11,519 Advanced (11) Jo Anne Simon 45.1 88,794 17,005 11 Robert Cornegy 0.0 0 -70,173 11 Submit photo Khari Edwards 0.0 0 0 10 Mathieu Eugene 0.0 0 0 10 Kimberly Council 0.0 0 0 9 Submit photo Robert Ramos Jr. 0.0 0 0 8 Anthony Jones 0.0 0 0 7 Submit photo Trisha Ocona 0.0 0 0 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 40.5 96,444 6,979 Advanced (11) Jo Anne Simon 30.1 71,789 9,679 11 Robert Cornegy 29.4 70,173 8,293 11 Mathieu Eugene 0.0 0 -27,175 10 Submit photo Khari Edwards 0.0 0 -25,211 10 Kimberly Council 0.0 0 0 9 Submit photo Robert Ramos Jr. 0.0 0 0 8 Anthony Jones 0.0 0 0 7 Submit photo Trisha Ocona 0.0 0 0 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 33.7 89,465 2,981 Advanced (11) Jo Anne Simon 23.4 62,110 4,284 11 Robert Cornegy 23.3 61,880 2,908 11 Mathieu Eugene 10.2 27,175 1,317 10 Submit photo Khari Edwards 9.5 25,211 2,804 10 Kimberly Council 0.0 0 -20,959 9 Submit photo Robert Ramos Jr. 0.0 0 0 8 Anthony Jones 0.0 0 0 7 Submit photo Trisha Ocona 0.0 0 0 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total"
  },
  {
    "candidate": "McPhatter, Shanduke L",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shanduke_McPhatter",
    "text": "Votes Transfer Round eliminated Antonio Reynoso 31.7 86,484 2,916 Advanced (11) Robert Cornegy 21.6 58,972 1,136 11 Jo Anne Simon 21.2 57,826 1,256 11 Mathieu Eugene 9.5 25,858 892 10 Submit photo Khari Edwards 8.2 22,407 874 10 Kimberly Council 7.7 20,959 909 9 Submit photo Robert Ramos Jr. 0.0 0 -12,128 8 Anthony Jones 0.0 0 0 7 Submit photo Trisha Ocona 0.0 0 0 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 30.2 83,568 807 Advanced (11) Robert Cornegy 20.9 57,836 974 11 Jo Anne Simon 20.4 56,570 1,128 11 Mathieu Eugene 9.0 24,966 641 10 Submit photo Khari Edwards 7.8 21,533 1,216 10 Kimberly Council 7.2 20,050 857 9 Submit photo Robert Ramos Jr. 4.4 12,128 918 8 Anthony Jones 0.0 0 -10,393 7 Submit photo Trisha Ocona 0.0 0 0 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 29.5 82,761 570 Advanced (11) Robert Cornegy 20.3 56,862 368 11 Jo Anne Simon 19.8 55,442 1,824 11 Mathieu Eugene 8.7 24,325 452 10 Submit photo Khari Edwards 7.2 20,317 969 10 Kimberly Council 6.8 19,193 1,290 9 Submit photo Robert Ramos Jr. 4.0 11,210 571 8 Anthony Jones 3.7 10,393 568 7 Submit photo Trisha Ocona 0.0 0 -9,570 6 Robert Elstein 0.0 0 0 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 29.0 82,191 628 Advanced (11) Robert Cornegy 19.9 56,494 578 11 Jo Anne Simon 18.9 53,618 1,064 11 Mathieu Eugene 8.4 23,873 302 10 Submit photo Khari Edwards 6.8 19,348 346 10 Kimberly Council 6.3 17,903 512 9 Submit photo Robert Ramos Jr. 3.8 10,639 274 8 Anthony Jones 3.5 9,825 405 7 Submit photo Trisha Ocona 3.4 9,570 215 6 Robert Elstein 0.0 0 -7,151 5 Pearlene Fields 0.0 0 0 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 28.5 81,563 403 Advanced (11) Robert Cornegy 19.5 55,916 277 11 Jo Anne Simon 18.4 52,554 548 11 Mathieu Eugene 8.2 23,571 207 10 Submit photo Khari Edwards 6.6 19,002 430 10 Kimberly Council 6.1 17,391 980 9 Submit photo Robert Ramos Jr. 3.6 10,365 144 8 Anthony Jones 3.3 9,420 366 7 Submit photo Trisha Ocona 3.3 9,355 441 6 Robert Elstein 2.5 7,151 191 5 Pearlene Fields 0.0 0 -5,222 4 Submit photo Lamor Miller-Whitehead 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 28.2 81,160 270 Advanced (11) Robert Cornegy 19.4 55,639 327 11 Jo Anne Simon 18.1 52,006 250 11 Mathieu Eugene 8.1 23,364 199 10 Submit photo Khari Edwards 6.5 18,572 410 10 Kimberly Council 5.7 16,411 264 9 Submit photo Robert Ramos Jr. 3.6 10,221 165 8 Anthony Jones 3.1 9,054 288 7 Submit photo Trisha Ocona 3.1 8,914 202 6 Robert Elstein 2.4 6,960 115 5 Pearlene Fields 1.8 5,222 166 4 Submit photo Lamor Miller-Whitehead 0.0 0 -4,084 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 28.0 80,890 23 Advanced (11) Robert Cornegy 19.1 55,312 27 11 Jo Anne Simon 17.9 51,756 24 11 Mathieu Eugene 8.0 23,165 12 10 Submit photo Khari Edwards 6.3 18,162 12 10 Kimberly Council 5.6 16,147 18 9 Submit photo Robert Ramos Jr. 3.5 10,056 3 8 Anthony Jones 3.0 8,766 8 7 Submit photo Trisha Ocona 3.0 8,712 8 6 Robert Elstein 2.4 6,845 11 5 Pearlene Fields 1.7 5,056 24 4 Submit photo Lamor Miller-Whitehead 1.4 4,084 10 3 Candidate % Total Votes Transfer Round eliminated Antonio Reynoso 27.9 80,867 0 Advanced (11) Robert Cornegy 19.1 55,285 0 11 Jo Anne Simon 17.9 51,732 0 11 Mathieu Eugene 8.0 23,153 0 10 Submit photo Khari Edwards 6.3 18,150 0 10 Kimberly Council 5.6 16,129 0 9 Submit photo Robert Ramos Jr. 3.5 10,053 0 8 Anthony Jones 3.0 8,758 0 7 Submit photo Trisha Ocona 3.0 8,704 0 6 Robert Elstein 2.4 6,834 0 5 Pearlene Fields 1.7 5,032 0 4 Submit photo Lamor Miller-Whitehead 1.4 4,074 0 3 Undeclared Write-ins Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However,"
  },
  {
    "candidate": "McPhatter, Shanduke L",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shanduke_McPhatter",
    "text": "if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. 0.2 706 0 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 289,477 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Republican primary election The Republican primary election was canceled. Menachem Raitport advanced from the Republican primary for Brooklyn Borough President. Conservative Party primary election The Conservative Party primary election was canceled. Menachem Raitport advanced from the Conservative Party primary for Brooklyn Borough President. Campaign themes Campaign themes 2021 2021 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Shanduke McPhatter completed Ballotpedia's Candidate Connection survey in 2021. The survey questions appear in bold and are followed by McPhatter's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Hello, I am Shanduke McPhatter and I am running to be your Brooklyn Borough President. I am a proud lifelong resident of Brooklyn. In 2012 I committed myself to decreasing acts of gun violence, assisting individuals in actualizing personal change, and changing community norms. Gangstas Making Astronomical Community Changes Inc. (G-MACC Inc.), the nonprofit I started has allowed me to serve Brooklyn as an advocate for personal and community change. From 2012-2015, the 67 Precinct in East Flatbush was one of the top three precincts in NYC for murders. In 2017 when G-MACC Inc. began providing programs and services in the precinct the rate of murders decreased by 65 percent. As your Brooklyn Borough President I will work to make Brooklyn safer and will be attentive to the needs of community members. Hello, I am Shanduke McPhatter and I am running to be your Brooklyn Borough President. I am a proud lifelong resident of Brooklyn. In 2012 I committed myself to decreasing acts of gun violence, assisting individuals in actualizing personal change, and changing community norms. Gangstas Making Astronomical Community Changes Inc. (G-MACC Inc.), the nonprofit I started has allowed me to serve Brooklyn as an advocate for personal and community change. From 2012-2015, the 67 Precinct in East Flatbush was one of the top three precincts in NYC for murders. In 2017 when G-MACC Inc. began providing programs and services in the precinct the rate of murders decreased by 65 percent. As your Brooklyn Borough President I will work to make Brooklyn safer and will be attentive to the needs of community members. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? I have a passion and the experience to help build Enhanced public safety I believe Youth engagement is key to a better and safer community I believe in Diversity and Unity. I have a passion and the experience to help build Enhanced public safety I believe Youth engagement is key to a better and safer community I believe in Diversity and Unity. What areas of public policy are you personally passionate about? Gun Violence Prevention Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? https://www.amazon.com/Two-Way-Mirror-Shanduke-McPhatter/dp/1735552615/ref=sr_1_3?crid=OAMHEN487BR3&dchild=1&keywords=shanduke+mcphatter&qid=1632063557&sprefix=shanduke+mcphatter%2Caps%2C165&sr=8-3 Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2021 Elections Government Newsletters External links External links Search Google News for this topic Candidate Brooklyn Borough President Website Facebook Twitter Instagram Candidate Brooklyn Borough President Website"
  },
  {
    "candidate": "McPhatter, Shanduke L",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shanduke_McPhatter",
    "text": "Facebook Twitter Instagram Personal Facebook Twitter Instagram LinkedIn Personal Facebook Twitter Instagram LinkedIn Footnotes Footnotes ↑ G-MACC, “Home,” accessed September 27, 2021 ↑ G-MACC, “Home,” accessed September 27, 2021 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on September 19, 2021 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on September 19, 2021 v • e 2021 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2021 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2021 challenger 2021 general election (defeated) Brooklyn Borough President candidate, 2021 Municipal candidate, 2021 Municipal candidates New York Voices for Change Party Ballotpedia features 604,597 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th"
  },
  {
    "candidate": "McPhatter, Shanduke L",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Shanduke_McPhatter",
    "text": "and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]