[
  {
    "candidate": "Medina, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://law.rutgers.edu/sarah-medina-camiscoli",
    "text": "Enter a Search Term Visit Rutgers.edu | Giving News Events Camden Newark New Brunswick Rutgers Health Strategic Plan Commencement Academics Academic Calendar Continuing Legal Education Dual-Degree Programs J.D. Program 3+3 Program Certificate Programs Curriculum Winter Session Library Non-J.D. Programs Certificate in Cannabis Law and Business Corporate Training Spanish for Legal Professionals Part-Time J.D. Program Undergraduate Legal Studies Academic Calendar Continuing Legal Education Dual-Degree Programs J.D. Program 3+3 Program Certificate Programs Curriculum Winter Session 3+3 Program Certificate Programs Curriculum Winter Session Library Non-J.D. Programs Certificate in Cannabis Law and Business Corporate Training Spanish for Legal Professionals Certificate in Cannabis Law and Business Corporate Training Spanish for Legal Professionals Part-Time J.D. Program Undergraduate Legal Studies Admissions How To Apply J.D. Applicants Summer Jump Start Foreign-Trained Lawyer Applicants Transfer Student Applicants Visiting Student Applicants Quick Facts Tuition & Financial Aid Tuition and Fees Financial Aid Steps Scholarships Social Justice Scholars Solomon Scholars Veteran Support Loan Repayment Assistance Program Visiting & Virtual Events Student Ambassadors How To Apply J.D. Applicants Summer Jump Start Foreign-Trained Lawyer Applicants Transfer Student Applicants Visiting Student Applicants J.D. Applicants Summer Jump Start Foreign-Trained Lawyer Applicants Transfer Student Applicants Visiting Student Applicants Quick Facts Tuition & Financial Aid Tuition and Fees Financial Aid Steps Scholarships Social Justice Scholars Solomon Scholars Veteran Support Loan Repayment Assistance Program Tuition and Fees Financial Aid Steps Scholarships Social Justice Scholars Solomon Scholars Veteran Support Loan Repayment Assistance Program Visiting & Virtual Events Student Ambassadors Student Ambassadors Professional Skills Advocacy at Rutgers Law Advocacy at Camden Advocacy at Newark Clinics Child Advocacy Clinic Child and Family Advocacy Clinic Community and Transactional Lawyering Clinic Constitutional Rights Clinic Criminal & Youth Justice Clinic Domestic Violence Clinic Economic Justice and Public Benefits Clinic Education & Health Law Clinic Entrepreneurship Clinic Housing Advocacy Immigrant Justice Clinic Immigrant Rights Clinic Intellectual Property Clinic International Human Rights Clinic Legislative & Policy Advocacy Clinic Medical-Legal Partnership Clinic Field Placements & Externships International Programs Law Journals Legal Writing Pro Bono & Public Interest Pro Bono Public Interest Fellowships and Funding Opportunities Public Interest Traditions Rutgers Law Associates Fellowship Program Advocacy at Rutgers Law Advocacy at Camden Advocacy at Newark Advocacy at Camden Advocacy at Newark Clinics Child Advocacy Clinic Child and Family Advocacy Clinic Community and Transactional Lawyering Clinic Constitutional Rights Clinic Criminal & Youth Justice Clinic Domestic Violence Clinic Economic Justice and Public Benefits Clinic Education & Health Law Clinic Entrepreneurship Clinic Housing Advocacy Immigrant Justice Clinic Immigrant Rights Clinic Intellectual Property Clinic International Human Rights Clinic Legislative & Policy Advocacy Clinic Medical-Legal Partnership Clinic Child Advocacy Clinic Child and Family Advocacy Clinic Community and Transactional Lawyering Clinic Constitutional Rights Clinic Criminal & Youth Justice Clinic Domestic Violence Clinic Economic Justice and Public Benefits Clinic Education & Health Law Clinic Entrepreneurship Clinic Housing Advocacy Immigrant Justice Clinic Immigrant Rights Clinic Intellectual Property Clinic International Human Rights Clinic Legislative & Policy Advocacy Clinic Medical-Legal Partnership Clinic Field Placements & Externships International Programs Law Journals Legal Writing Pro Bono & Public Interest Pro Bono Public Interest Fellowships and Funding Opportunities Public Interest Traditions Pro Bono Public Interest Fellowships and Funding Opportunities Public Interest Traditions Rutgers Law Associates Fellowship Program Student Life Academic Support & Resources Accessibility at Rutgers Law Career Development Career Pathways Commencement Get Involved Health & Wellness Minority Student Program MSP In the News Minority Student Program Summer Internship Program Minority Student Program Today Minority Student Program: In Their Own Words Academic Support & Resources Accessibility at Rutgers Law Career Development Career Pathways Career Pathways Commencement Get Involved Health & Wellness Minority Student Program MSP In the News Minority Student Program Summer Internship Program Minority Student Program Today Minority Student Program: In Their Own Words MSP In the News Minority Student Program Summer Internship Program Minority Student Program Today Minority Student Program: In Their Own Words Faculty Academic Centers Center for Corporate Law and Governance Center for Gender Justice and Law Center for Immigrant Justice Center for Risk and Responsibility Center for Security, Race and Rights Center for State Constitutional Studies Center for Transnational Law Center on Law, Inequality and Metropolitan Equity Institute for Information Policy and Law Institute for Law and Philosophy Faculty Publications Faculty and Staff Directory Academic Centers Center for Corporate Law and Governance Center for Gender Justice and Law Center for Immigrant Justice Center for Risk and Responsibility Center for Security, Race and Rights Center for State Constitutional Studies Center for Transnational Law Center on Law, Inequality and Metropolitan Equity Institute for Information Policy and Law Institute for"
  },
  {
    "candidate": "Medina, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://law.rutgers.edu/sarah-medina-camiscoli",
    "text": "Law and Philosophy Center for Corporate Law and Governance Center for Gender Justice and Law Center for Immigrant Justice Center for Risk and Responsibility Center for Security, Race and Rights Center for State Constitutional Studies Center for Transnational Law Center on Law, Inequality and Metropolitan Equity Institute for Information Policy and Law Institute for Law and Philosophy Faculty Publications Faculty and Staff Directory About Us Consumer Information (ABA Required Disclosures) Diversity & Inclusion Anti-Racism Resources Anti-Racist Principles & Action Non-Discrimination Policy Leadership News Legal Issues to Watch in 2025 Our Locations About Rutgers-Camden About Rutgers–Newark Why Rutgers Law Consumer Information (ABA Required Disclosures) Diversity & Inclusion Anti-Racism Resources Anti-Racist Principles & Action Non-Discrimination Policy Anti-Racism Resources Anti-Racist Principles & Action Non-Discrimination Policy Leadership News Legal Issues to Watch in 2025 Legal Issues to Watch in 2025 Our Locations About Rutgers-Camden About Rutgers–Newark About Rutgers-Camden About Rutgers–Newark Why Rutgers Law News Information For Admitted Students Reserve Your Seat Incoming Student Checklist Admitted Student Days Orientation Alumni Alumni Resources Career Services Get Involved Heckel Inn of Court RU Law Camden Alumni Association RU Law Newark Alumni Association Alumni Updates Current Students Law Student Resources Report Harassment or Bias Student Feedback Form Employers Employer Resources & Guidelines On-Campus Recruiting Post a Job Faculty & Staff Camden Faculty & Staff Newark Faculty & Staff Get Legal Help Expungement Law Project Housing Justice Project New Jersey Innocence Project Rutgers Immigrant Community Assistance Project (RICAP) Rutgers Law Associates Rutgers Law Name Change Project Information For Admitted Students Reserve Your Seat Incoming Student Checklist Admitted Student Days Orientation Reserve Your Seat Incoming Student Checklist Admitted Student Days Orientation Alumni Alumni Resources Career Services Get Involved Heckel Inn of Court RU Law Camden Alumni Association RU Law Newark Alumni Association Alumni Updates Alumni Resources Career Services Get Involved Heckel Inn of Court RU Law Camden Alumni Association RU Law Newark Alumni Association Alumni Updates Current Students Law Student Resources Report Harassment or Bias Student Feedback Form Law Student Resources Report Harassment or Bias Student Feedback Form Employers Employer Resources & Guidelines On-Campus Recruiting Post a Job Employer Resources & Guidelines On-Campus Recruiting Post a Job Faculty & Staff Camden Faculty & Staff Newark Faculty & Staff Camden Faculty & Staff Newark Faculty & Staff Get Legal Help Expungement Law Project Housing Justice Project New Jersey Innocence Project Rutgers Immigrant Community Assistance Project (RICAP) Rutgers Law Associates Rutgers Law Name Change Project Expungement Law Project Housing Justice Project New Jersey Innocence Project Rutgers Immigrant Community Assistance Project (RICAP) Rutgers Law Associates Rutgers Law Name Change Project Strategic Plan Commencement Academics Academic Calendar Continuing Legal Education Dual-Degree Programs J.D. Program 3+3 Program Certificate Programs Curriculum Winter Session Library Non-J.D. Programs Part-Time J.D. Program Undergraduate Legal Studies Academic Calendar Continuing Legal Education Dual-Degree Programs J.D. Program 3+3 Program Certificate Programs Curriculum Winter Session 3+3 Program Certificate Programs Curriculum Winter Session Library Non-J.D. Programs Part-Time J.D. Program Undergraduate Legal Studies Admissions How To Apply Quick Facts Tuition & Financial Aid Visiting & Virtual Events Student Ambassadors How To Apply Quick Facts Tuition & Financial Aid Visiting & Virtual Events Student Ambassadors Student Ambassadors Professional Skills Advocacy at Rutgers Law Clinics Field Placements & Externships International Programs Law Journals Legal Writing Pro Bono & Public Interest Rutgers Law Associates Fellowship Program Advocacy at Rutgers Law Clinics Field Placements & Externships International Programs Law Journals Legal Writing Pro Bono & Public Interest Rutgers Law Associates Fellowship Program Student Life Academic Support & Resources Accessibility at Rutgers Law Career Development Commencement Get Involved Health & Wellness Minority Student Program Academic Support & Resources Accessibility at Rutgers Law Career Development Commencement Get Involved Health & Wellness Minority Student Program Faculty Academic Centers Faculty Publications Faculty and Staff Directory Academic Centers Faculty Publications Faculty and Staff Directory About Us Consumer Information (ABA Required Disclosures) Diversity & Inclusion Leadership News Our Locations Why Rutgers Law Consumer Information (ABA Required Disclosures) Diversity & Inclusion Leadership News Our Locations Why Rutgers Law News Information For Admitted Students Alumni Current Students Employers Faculty & Staff Get Legal Help Information For Admitted Students Alumni Current Students Employers Faculty & Staff Get Legal Help Visit Rutgers.edu | Giving News Events Camden Newark New Brunswick Rutgers Health Sarah Medina Camiscoli Assistant Professor of Law Location Rutgers Law School 123 Washington Street Newark, NJ 07102 Rutgers Law School 123 Washington Street Newark, NJ 07102 https://calendly.com/smedinacamiscoli sc2594@law.rutgers.edu Role Faculty Areas of Expertise Legal Education , Education Law , Constitutional Law , Civil Rights & Civil Liberties"
  },
  {
    "candidate": "Medina, Sarah",
    "category": "bio",
    "score": null,
    "link": "https://law.rutgers.edu/sarah-medina-camiscoli",
    "text": ", Child Advocacy Biography Professor Medina Camiscoli writes at the intersection of constitutional law, education law, and youth social movements. She employs participatory law scholarship and movement law to include, elevate, and credit mobilized youth who reimagine law and prefigure radical democracies. Through this work, she intends to extend the legacy of Rutgers Law School— known as the \"People’s Electric Law School\" — to marginalized and mobilized youth. Previously, Professor Medina Camiscoli taught as an Education Studies Fellow at the Yale Center or the Study of Race, Indigeneity, and Transnational Migration and practiced law as a Justice Catalyst Legal Fellow at Public Counsel. Before law school, she worked as a public school teacher and youth organizer in the South Bronx where she founded IntegrateNYC — a youth-led organization that develops young leaders who repair the harms of segregation and build authentic integration and equity. Upon graduating from law school, she co-founded the Peer Defense Project —an intergenerational movement lawyering project that develops legal education, networks and technology to empower youth to fight injustice and transform the law. She identifies as a proud first generation, LGBTQAI+ legal scholar–practitioner of the Puerto Rican diaspora, born and raised in New Jersey. Professor Medina Camiscoli holds a B.A. from Columbia University, a J.D. from Yale Law School, and an M.A. from Hunter School of Education. Publications Facebook Twitter LinkedIn Reddit Whatsapp Email Print Publications Sarah Medina Camiscoli, Youth Movement Law : Seeding Constitutional Revolutions with Marginalized and Mobilized Youth, University of Pennsylvania Journal of Constitutional Law ( Forthcoming, Summer 2024 ) Sarah Medina Camiscoli and Sa’Real McRae, Youth Participatory Law Scholarship , University of Virgina Law Review, ( Forthcoming, Summer 2024 ) Sarah Medina Camiscoli, Defending Schoolhouse Property : Reimagining Procedural Protections to Block Bans and Power Student Movements, Georgetown Journal of Modern Critical Race Theory ( Forthcoming, Summer 2024 ) Sarah Medina Camiscoli et al., Youth Dignity Takings : Understanding and Restoring the Involuntary Loss of Book Bans and Trans Bans , Loyola Interdisciplinary Journal of Public Interest Law ( Forthcoming, January 2024 ) Sarah Medina Camiscoli and Kia Turner, Critical Youth Theory , (Work in Progress) Christina John, Russel Pearce, Aundray Archer, Sarah Medina Camiscoli, Aaron Pines, Maryam Salmanova, and Vira Tarnavaska, Subversive Legal Education : Reformist Steps Toward Abolitionist Visions , 90 Fordham L. Rev. 2089 (2022). Site Footer Academics Academic Calendars Course Catalogs Law Library Schedule of Classes University Libraries Campus Visits and Tours Campus Safety Calendar of Events Connect Apply Work at Rutgers Giving News Veteran & Military Resources Notices Consumer Information (ABA Required Disclosures) Accessibility Commencement University Operating Status Privacy Follow Us Rutgers is an equal access/equal opportunity institution. Individuals with disabilities are encouraged to direct suggestions, comments, or complaints concerning any accessibility issues with Rutgers websites to accessibility@rutgers.edu or complete the Report Accessibility Barrier / Provide Feedback form. Copyright ©[year] , Rutgers, The State University of New Jersey. All rights reserved. Contact webmaster | Sitemap"
  }
]