[
  {
    "candidate": "Monserrate, Hiram",
    "category": "bio",
    "score": null,
    "link": "https://www.nysenate.gov/senators/hiram-monserrate/about",
    "text": "former New York State Senator Hiram Monserrate Served from January 1, 2009 – February 9, 2010 About Our District Newsroom Legislation Events Contact Search Search icon Search login Search Search icon Search About Hiram Monserrate Democrat, Working Families Democrat, Working Families Senator Hiram Monserrate made history in 2001 when he became the first Latino elected to public office in Queens, winning a seat representing the 21st Council District of Corona, East Elmhurst, Elmhurst and Jackson Heights. Since then, he has brought his unique experience as a Marine, NYPD police officer, and civil rights advocate to the City Council, working to empower and protect all New Yorkers. Senator Monserrate began his life-long career in public service by enlisting in the United States Marine Corps Reserves, where he received the National Defense Ribbon and the Good Conduct Medal. In 1988, Hiram Monserrate joined the NYPD, where he served for 12 years protecting the safety and quality of life of Queens' residents. He was a founding member of the Latino Officers Association and served as the first police officer elected to the Board of Directors of the New York Civil Liberties Union. In the New York City Council, Senator Monserrate served as the Chair of the Veterans Committee. During his tenure, he spearheaded a million-dollar initiative to open veterans' resource centers in all five boroughs. From 2002 to 2005, Senator Monserrate served as the Co-Chair of the Black, Latino and Asian Caucus. In this leadership position, he led his colleagues to ensure passage of living wage legislation for hard-working residents and families and successfully fought back attempts to cut funding for programs working to combat infant mortality and HIV/AIDS. As a consumer advocate, Senator Monserrate introduced and worked to pass a law requiring truth-in-pricing in retail stores and battled the Mayor to successfully rollback Sunday parking meter regulations, ensuring that parking meters everywhere in New York City are free on Sundays. In addition, Senator Monserrate passed legislation suspending alternate side parking during and after snowfall in New York City. As a former union member - SEIU Local 32BJ and the PBA – Senator Monserrate has fought for fair contracts for workers city-wide. And as a civil rights advocate, he led the successful fight to secure immigrants' rights and protect residents' confidentiality by working with the Mayor to create a \"don't ask, don't tell\" policy, Executive Order 41, regarding sensitive information in city agencies. This historic policy ensures the city's safety by allowing all residents access to necessary city services, including emergency health care and fire prevention. Education has been at the forefront of Senator Monserrate’s agenda since his inauguration. In the past years, he has allocated funding for two schools, a new elementary and high school to alleviate the overcrowding that has plagued the Corona public school system. Considering the overwhelming number of immigrant parents, Senator Monserrate has also made sure translation services are provided at each and every school in New York City, enabling every parent to become fully involved in their children's education. Raised and educated in Queens and a product of the City University of New York, Senator Monserrate has provided millions of dollars in necessary funding to ensure the quality of life in the borough, helping to expand libraries, provide quality playgrounds and green space and support language and job training programs. On November 4, 2008, Senator Monserrate was elected to represent the 13th District in the New York State Senate. He was appointed Chairman of the Consumer Protection Committee. In addition, Senator Monserrate serves as a member of the Cities, Civil Service, Energy and Telecommunications, Insurance, Rules, and Mental Health Committees. About Hiram Monserrate Democrat, Working Families Democrat, Working Families Democrat, Working Families Democrat, Working Families Senator Hiram Monserrate made history in 2001 when he became the first Latino elected to public office in Queens, winning a seat representing the 21st Council District of Corona, East Elmhurst, Elmhurst and Jackson Heights. Since then, he has brought his unique experience as a Marine, NYPD police officer, and civil rights advocate to the City Council, working to empower and protect all New Yorkers. Senator Monserrate began his life-long career in public service by enlisting in the United States Marine Corps Reserves, where he received the National Defense Ribbon and the Good Conduct Medal. In 1988, Hiram Monserrate joined the NYPD, where he served for 12 years protecting the safety and quality of life of Queens' residents. He was a founding member of the Latino Officers Association and served as the"
  },
  {
    "candidate": "Monserrate, Hiram",
    "category": "bio",
    "score": null,
    "link": "https://www.nysenate.gov/senators/hiram-monserrate/about",
    "text": "first police officer elected to the Board of Directors of the New York Civil Liberties Union. In the New York City Council, Senator Monserrate served as the Chair of the Veterans Committee. During his tenure, he spearheaded a million-dollar initiative to open veterans' resource centers in all five boroughs. From 2002 to 2005, Senator Monserrate served as the Co-Chair of the Black, Latino and Asian Caucus. In this leadership position, he led his colleagues to ensure passage of living wage legislation for hard-working residents and families and successfully fought back attempts to cut funding for programs working to combat infant mortality and HIV/AIDS. As a consumer advocate, Senator Monserrate introduced and worked to pass a law requiring truth-in-pricing in retail stores and battled the Mayor to successfully rollback Sunday parking meter regulations, ensuring that parking meters everywhere in New York City are free on Sundays. In addition, Senator Monserrate passed legislation suspending alternate side parking during and after snowfall in New York City. As a former union member - SEIU Local 32BJ and the PBA – Senator Monserrate has fought for fair contracts for workers city-wide. And as a civil rights advocate, he led the successful fight to secure immigrants' rights and protect residents' confidentiality by working with the Mayor to create a \"don't ask, don't tell\" policy, Executive Order 41, regarding sensitive information in city agencies. This historic policy ensures the city's safety by allowing all residents access to necessary city services, including emergency health care and fire prevention. Education has been at the forefront of Senator Monserrate’s agenda since his inauguration. In the past years, he has allocated funding for two schools, a new elementary and high school to alleviate the overcrowding that has plagued the Corona public school system. Considering the overwhelming number of immigrant parents, Senator Monserrate has also made sure translation services are provided at each and every school in New York City, enabling every parent to become fully involved in their children's education. Raised and educated in Queens and a product of the City University of New York, Senator Monserrate has provided millions of dollars in necessary funding to ensure the quality of life in the borough, helping to expand libraries, provide quality playgrounds and green space and support language and job training programs. On November 4, 2008, Senator Monserrate was elected to represent the 13th District in the New York State Senate. He was appointed Chairman of the Consumer Protection Committee. In addition, Senator Monserrate serves as a member of the Cities, Civil Service, Energy and Telecommunications, Insurance, Rules, and Mental Health Committees. NYSenate.gov Socials Follow the New York State Senate News & Issues Senators & Committees Bills & Laws Budget Events About the Senate Footer Right Contact the Senate Report a Website Issue Home Rule Form Site Policies About this Website GET INVOLVED"
  }
]