[
  {
    "candidate": "Montoya, Erycka",
    "category": "bio",
    "score": null,
    "link": "https://www.eryckamontoya.com/about",
    "text": "0 0 English Open Menu Close Menu Open Menu Close Menu English English Back Meet Erycka Erycka is fighting to ensure that all New York families can live, work, and thrive in our beautiful city. Erycka is an Afro-Latina mother of two. She is a renter, a public transit rider, and an experienced government worker with over 20 years of experience. She is running to represent our neighbors in New York City Council District 21- which includes Corona, East Elmhurst, LeFrak City, and parts of Jackson Heights and Elmhurst. Erycka was born and raised in Corona by a determined single mother who immigrated from Colombia. Her mother worked hard as a union factory worker, a union health aide, and many other jobs to raise Erycka and her sister. Despite language barriers, her mother made countless sacrifices to provide Erycka and her sister with a better future. Now, Erycka is doing the same—proudly raising two children in Corona, the neighborhood she has always called home. Erycka Understands The Struggles Families Face And Is Prepared To Fight For Them Thanks to her mother’s sacrifices, Eycka was able to attend college and establish an impressive career spanning over two decades as a dedicated government and nonprofit professional. Erycka currently works as a Deputy Director of Intergovernmental Affairs at the New York City Council, where she works to connect community members facing complex issues, like housing, immigration, workers' rights, with much-needed city resources. Her expertise is to bridge the gap between city agencies, lawmakers, and bureaucratic hurdles to find solutions for the needs of all New Yorkers. Erycka fights to ensure that our city does its part in meeting the needs of all New Yorkers. When Her Neighbors Needed Help, Erycka Stepped Up In 2020, during the peak of the COVID-19 pandemic, Erycka and her neighbors organized grocery deliveries for those in need. They established a multi-network mutual aid system that facilitated grocery deliveries for neighbors unable to leave their homes, ensuring access to healthy, culturally, and relevant food. Their efforts supported hundreds of New Yorkers facing food insecurity during unprecedented times. Erycka Knows What Makes Communities Strong Erycka has always been dedicated to strengthening communities. For six years, Erycka has been an active parent in her children’s schools. She was the president of the Parent-Teacher Association and has held roles on the School Leadership Team. In these positions, she helped ensure that school families always had up-to-date information and resources, especially during the pandemic. Erycka has always gone above and beyond organizing youth and their families to ensure their voices are heard. When she served as the Community Engagement Manager at Friends of the High Line (an organization dedicated to re-imagining public spaces) she helped launch a six-month job program for teens. She also led efforts to engage diverse youth in designing their own programs. She believes in offering youth empowering opportunities that foster growth and inspire them to dream. Read More About Erycka's Plans Why I’m Running for City Council \"I’m running for City Council because our communities urgently need new, trusted, and fierce leadership in these uncertain times. Families in Corona, East Elmhurst, and LeFrak City have long been ignored, stolen from, and underrepresented. We are in the fight of our lives, and we need leaders who know what it’s like to struggle to pay rent, raise good kids, and look after our neighbors and family members who may not speak English. We should all be able to live and work with dignity. In the greatest and wealthiest city in the world, our city government must constantly be working to improve the lives of families within the five boroughs. I am running to ensure our city government delivers for everyone and that we create an affordable, safe, and equitable city for all New Yorkers.\" Meet Erycka Meet Erycka Erycka is fighting to ensure that all New York families can live, work, and thrive in our beautiful city. Erycka is an Afro-Latina mother of two. She is a renter, a public transit rider, and an experienced government worker with over 20 years of experience. She is running to represent our neighbors in New York City Council District 21- which includes Corona, East Elmhurst, LeFrak City, and parts of Jackson Heights and Elmhurst. Erycka was born and raised in Corona by a determined single mother who immigrated from Colombia. Her mother worked hard as a union factory worker, a union health aide, and many other jobs to raise Erycka and her sister. Despite"
  },
  {
    "candidate": "Montoya, Erycka",
    "category": "bio",
    "score": null,
    "link": "https://www.eryckamontoya.com/about",
    "text": "language barriers, her mother made countless sacrifices to provide Erycka and her sister with a better future. Now, Erycka is doing the same—proudly raising two children in Corona, the neighborhood she has always called home. Erycka Understands The Struggles Families Face And Is Prepared To Fight For Them Thanks to her mother’s sacrifices, Eycka was able to attend college and establish an impressive career spanning over two decades as a dedicated government and nonprofit professional. Erycka currently works as a Deputy Director of Intergovernmental Affairs at the New York City Council, where she works to connect community members facing complex issues, like housing, immigration, workers' rights, with much-needed city resources. Her expertise is to bridge the gap between city agencies, lawmakers, and bureaucratic hurdles to find solutions for the needs of all New Yorkers. Erycka fights to ensure that our city does its part in meeting the needs of all New Yorkers. When Her Neighbors Needed Help, Erycka Stepped Up In 2020, during the peak of the COVID-19 pandemic, Erycka and her neighbors organized grocery deliveries for those in need. They established a multi-network mutual aid system that facilitated grocery deliveries for neighbors unable to leave their homes, ensuring access to healthy, culturally, and relevant food. Their efforts supported hundreds of New Yorkers facing food insecurity during unprecedented times. Erycka Knows What Makes Communities Strong Erycka has always been dedicated to strengthening communities. For six years, Erycka has been an active parent in her children’s schools. She was the president of the Parent-Teacher Association and has held roles on the School Leadership Team. In these positions, she helped ensure that school families always had up-to-date information and resources, especially during the pandemic. Erycka has always gone above and beyond organizing youth and their families to ensure their voices are heard. When she served as the Community Engagement Manager at Friends of the High Line (an organization dedicated to re-imagining public spaces) she helped launch a six-month job program for teens. She also led efforts to engage diverse youth in designing their own programs. She believes in offering youth empowering opportunities that foster growth and inspire them to dream. Why I’m Running for City Council \"I’m running for City Council because our communities urgently need new, trusted, and fierce leadership in these uncertain times. Families in Corona, East Elmhurst, and LeFrak City have long been ignored, stolen from, and underrepresented. We are in the fight of our lives, and we need leaders who know what it’s like to struggle to pay rent, raise good kids, and look after our neighbors and family members who may not speak English. We should all be able to live and work with dignity. In the greatest and wealthiest city in the world, our city government must constantly be working to improve the lives of families within the five boroughs. I am running to ensure our city government delivers for everyone and that we create an affordable, safe, and equitable city for all New Yorkers.\" Paid for by People for Erycka Home Meet Erycka Platform Volunteer Terms of Service"
  }
]