[
  {
    "candidate": "Morales, Salvador",
    "category": "bio",
    "score": null,
    "link": "https://www.cancer.gov/nano/about/contact/morales-carolina",
    "text": "Search Cancer & Nanotech Cancer & Nanotech Research Research Grants & Training Grants & Training Events Events About NSDB About NSDB Nanodelivery Systems and Devices Branch Nanodelivery Systems and Devices Branch About NSDB About NSDB Contact & Staff Contact & Staff Carolina Salvador Morales, Ph.D. Carolina Salvador Morales, Ph.D. Print Email About NSDB Related NCI Initiatives Publications Contact & Staff Related NCI Initiatives Publications Contact & Staff Carolina Salvador Morales, Ph.D. Program Director Nanodelivery Systems and Devices Branch carolina.salvadormorales@nih.gov Dr. Carolina Salvador Morales is a Program Director for the NCI Division of Cancer Treatment and Diagnosis’ Nanodelivery Systems and Devices Branch. She manages nanotechnology-focused grants and co-develops new initiatives with other NCI divisions and centers. Dr. Salvador Morales received her Ph.D. in Chemistry from Oxford University. She has a Master’s degree in Biochemistry from Trinity College, Dublin, and a Bachelor’s degree in Physics from the National Autonomous University of Mexico. She conducted her postdoctoral training at MIT and Brigham and Women’s Hospital-Harvard Medical School. For nearly a decade, she worked as an Assistant Professor on Tenure-Track and later earned tenured as an Associate Professor. Her research program included cancer nanotechnology, molecular imaging, and agricultural chemistry projects. She was the recipient of several grants funded by the National Institutes of Health, National Science Foundation, Center for Innovative Technology, and Jeffress Trust Fund. She has published multiple peer-reviewed articles in leading journals in Colloidal Chemistry and Nanoscience. She is the author of book chapters as well. Furthermore, she was a visiting scholar at Memorial Sloan Kettering Cancer Center, New York. Apart from having a multidisciplinary and interdisciplinary academic background, Dr. Salvador Morales has received training and experience in entrepreneurship. She was a Kaufman Fellow in 2010 and taught courses on entrepreneurship in bioengineering for over 8 years. Her passion for medical translation led her to perform an extensive customer discovery process within the NSF I-Corp program and co-establish Nano-Guided Technologies, LLC. Carolina Salvador Morales, Ph.D. Dr. Carolina Salvador Morales is a Program Director for the NCI Division of Cancer Treatment and Diagnosis’ Nanodelivery Systems and Devices Branch. She manages nanotechnology-focused grants and co-develops new initiatives with other NCI divisions and centers. Dr. Salvador Morales received her Ph.D. in Chemistry from Oxford University. She has a Master’s degree in Biochemistry from Trinity College, Dublin, and a Bachelor’s degree in Physics from the National Autonomous University of Mexico. She conducted her postdoctoral training at MIT and Brigham and Women’s Hospital-Harvard Medical School. For nearly a decade, she worked as an Assistant Professor on Tenure-Track and later earned tenured as an Associate Professor. Her research program included cancer nanotechnology, molecular imaging, and agricultural chemistry projects. She was the recipient of several grants funded by the National Institutes of Health, National Science Foundation, Center for Innovative Technology, and Jeffress Trust Fund. She has published multiple peer-reviewed articles in leading journals in Colloidal Chemistry and Nanoscience. She is the author of book chapters as well. Furthermore, she was a visiting scholar at Memorial Sloan Kettering Cancer Center, New York. Apart from having a multidisciplinary and interdisciplinary academic background, Dr. Salvador Morales has received training and experience in entrepreneurship. She was a Kaufman Fellow in 2010 and taught courses on entrepreneurship in bioengineering for over 8 years. Her passion for medical translation led her to perform an extensive customer discovery process within the NSF I-Corp program and co-establish Nano-Guided Technologies, LLC. Print Email Back To Top Contact NSDB Visit Division of Cancer Treatment and Diagnosis (DCTD) Digital Standards for NCI Websites Site Map Accessibility FOIA Privacy & Security Disclaimers Vulnerability Disclosure Division of Cancer Treatment and Diagnosis at the National Cancer Institute Division of Cancer Treatment and Diagnosis at the National Cancer Institute"
  }
]