[
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Montell_Moseley",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Montell Moseley Montell Moseley Montell Moseley Do you have a photo that could go here? Click here to submit it for this profile! Republican Party Candidate, Mayor of New York June 24, 2025 Education Empire State College, 2019 New York Institute of Technology, 2019 Campaign website Campaign Facebook Personal Twitter Personal Instagram Personal LinkedIn Montell Moseley ( Republican Party ) is running for election for Mayor of New York . She declared candidacy for the Republican primary scheduled on June 24, 2025 . [source] Moseley completed Ballotpedia's Candidate Connection survey in 2024. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Montell Moseley was born in New York, New York . Moseley's career experience includes working as a CEO. She earned a bachelor's degree from Empire State College in 2019 and a graduate degree from the New York Institute of Technology in 2019. [1] Elections Elections 2025 2025 See also: Mayoral election in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. Additional general election candidates will be added here following the primary. General election for Mayor of New York Incumbent Eric Adams , Jean Anglade , Kyle Gutierrez , Abbey Laurel-Smith , and James Walden are running in the general election for Mayor of New York on November 4, 2025. Candidate Eric Adams (Independent) Jean Anglade (Independent) Submit photo Kyle Gutierrez (Independent) Abbey Laurel-Smith (Independent) Submit photo James Walden (Independent) Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for Mayor of New York The following candidates are running in the Democratic primary for Mayor of New York on June 24, 2025. Candidate Adrienne Adams Submit photo Selma Bartholomew Michael Blake Andrew Cuomo Corinne Fisher Brad Lander Deirdre Levy Zohran Kwame Mamdani Zellnor Myrie Paperboy Prince Jessica Ramos Scott Stringer Whitney Tilson There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Cleopatra Fitzgerald (D) Republican primary election Republican primary for Mayor of New York The following candidates are running in the Republican primary for Mayor of New York on June 24, 2025. Candidate Joe Alny Darren Dione Aquino Submit photo Naomi Coley Gonzalo Duran John Harris Submit photo Kris Lord Submit photo James Manning Submit photo Montell Moseley Submit photo Ronen Nahom Fátimazöhra Nouinou Submit photo David Rem Curtis Sliwa There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Montell Moseley completed Ballotpedia's Candidate"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Montell_Moseley",
    "text": "Connection survey in 2024. The survey questions appear in bold and are followed by Moseley's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. I am writing to bring to your attention my candidacy for mayor of New York City. I am Ms. Montell C. Moseley, a Republican, and working families, but most importantly, I am a daughter, mother, and dedicated servant of a diverse community. I have spent my life, in service to others from assisting Holocaust survivors to advocating for our vulnerable population through my nonprofit (RAPCCCINC.COM). My path has not been one of privilege or ease, but perseverance, hard work won lessons, and an unwavering belief in the power of compassion and action. I am not a career politician, but a fighter for working families, a champion of our diverse communities, and a passionate advocate for those who often go unheard. Although my first run for public office as a write-in candidate for the 24th District City Council seat in Queens was unsuccessful, I gained valuable experience. I had the opportunity to address the Electrical Union, connect to young people at local youth basketball games, and sponsor. And cosponsored and organized marches with police detectives for gun violence awareness in the Queens community. As Your Mayor, I will not forget the lessons of my faith or the struggles of our people. I will be a leader who has a commonsense mindset and understands the needs of American families come first. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Safety: keep our communities safe. Rising tide of crime in communities and especially subway crime must be met head on with common sense approach and determination. securing more funding put more cops on the street and form repo ire with community on a daily basis creating trust between law enforcement and community. Hopefully, decrease crime in those neighborhoods. As A Mayor, I'll be champion for seniors care who built this city and deserve respect and gratitude and 55 community affordable housing and protect social security , increase the cost of living , choose Medicare doesn't have costly copayment out service specialist , and fight to expand veterans services, with more , doctors , nurses and mental specialist as well CASAC consultants and 1:1 peer support, so we can give back to those who gave so much. Also, increase snap benefit for food is very expensive. Sanctuary city laws please understand I am treating everyone person with dignity and respect, no matter their immigration status. I am also for common sense and it's not right dangerous criminal broke the law to avoid deportation. We need the law to work with NYPD to turn over violent criminal and gangs to ice and reopen Rikers Island Ice office. Illegal migrant needs understand the laws of government and proper way enter our country. Safety: keep our communities safe. Rising tide of crime in communities and especially subway crime must be met head on with common sense approach and determination. securing more funding put more cops on the street and form repo ire with community on a daily basis creating trust between law enforcement and community. Hopefully, decrease crime in those neighborhoods. As A Mayor, I'll be champion for seniors care who built this city and deserve respect and gratitude and 55 community affordable housing and protect social security , increase the cost of living , choose Medicare doesn't have costly copayment out service specialist , and fight to expand veterans services, with more , doctors , nurses and mental specialist as well CASAC consultants and 1:1 peer support, so we can give back to those who gave so much. Also, increase snap benefit for food is very expensive. Sanctuary city laws please understand I am treating everyone person with dignity and respect, no matter their immigration status. I am also for common sense and it's not right dangerous criminal broke the law to avoid deportation. We need the law to work with NYPD to turn over violent criminal and gangs to ice and reopen Rikers Island Ice office. Illegal migrant needs understand the laws of government and proper way enter our country. What areas of public policy are you personally passionate about? Our schools must be sanctuaries of"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Montell_Moseley",
    "text": "learning, where every child can feel safe and succeed. That means securing the funds to upgrade the security system, with a camera and buzz-in entry, so we know who's coming into our schools. It's all about giving our teachers, paraprofessionals, Physical and occupational, speech therapists, and principals the resources they need to create a safe, nurturing environment, where every student can thrive. Support our unions. I have designed a specialized program for the parents' teacher association and increased funds. What qualities do you possess that you believe would make you a successful officeholder? You can trust me What legacy would you like to leave? my compassion and love for all races. What was your very first job? How long did you have it? I worked for a Police Athletic League summer youth reading and math tutor. I won the Best Counselor award in Queens and was given a $500 Scholarship because my parents were so proud of me. What is your favorite book? Why? Shirley Chisolm's Netflix movie motivated me. What was the last song that got stuck in your head? Aint no mountain high enough by the Supreme and Diana Ross What is something that has been a struggle in your life? being a teenage-age mother with postpartum depression. all woman goes through this it doesn't show on our faces. My son got sick has a baby and I had another baby. A mayor is a leader in his or her city. What does that mean to you? Has Mayor of New York City, it my sworn duty serve the public and protect and keep our community safe. I have a selflessly dedicated myself to addressing the pressing issues facing New Yorkers. My platform focuses on improving public safety, New York City Housing ensuring all city codes are inspected properly, and numerous other relevant concerns will be discussed during my campaign. But I have faith we can overcome this challenge and build brighter future for ourselves and children and generation to come. Friends of Ms Montell C Moseley Tell us your favorite joke. I am having difficulty uploading my picture of me can I send it another way What organizations or individuals have endorsed your campaign? The poor and hard-working families. This is the most important part of my campaign we the people. Friends of Ms Montell C Moseley Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate Mayor of New York Website Facebook Candidate Mayor of New York Website Facebook Personal Twitter Instagram LinkedIn Personal Twitter Instagram LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on December 7, 2024 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on December 7, 2024 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Montell_Moseley",
    "text": "| Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Mayor of New York candidate, 2025 Municipal candidate, 2025 Municipal candidates New York Republican Party Ballotpedia features 604,597 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Montell_Moseley",
    "text": "Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://www.voicevisionfuture.com/about-5",
    "text": "top of page MY VOICE , YOUR VISION AND YOUR FUTURE MY VOICE , YOUR VISION AND YOUR FUTURE Home Home About About New Page New Page Welcome Welcome Mission Mission News News Get Involved Get Involved More More About me About me About me My name is Montell Moseley, and I'm writing to announce my candidacy for Mayor of New York City. Born and raised in Queens, I've spent my entire life devoted to serving this great city and its people. My 34-year career with the Department of Education, including 25 years as a UFT paraprofessional and supervisor, has given me a deep understanding of the needs of our communities. I've never been content to simply do my job – I've always sought out ways to give back more. I've volunteered on political campaigns across the aisle, from Mayor Michael Bloomberg to President Barack Obama, because I believe that good ideas can come from anywhere. I've worked hand-in-hand with our Borough Presidents and local elected officials to make a real difference in people's lives. I've organized fundraisers, walked door-to-door, and run my own block association to make our neighborhoods better. My commitment to our community has earned me recognition, from being named the \"Star of the Week\" by the Courier to winning scholarships for my work with young people. But more importantly, it's given me a unique perspective on the challenges we face, from homelessness and domestic violence to the need for better resources for our seniors. As a CEO and advocate for a non-profit organization, I've helped connect people with the services they need to thrive. In my work with organizations serving children and adults with disabilities, I've seen firsthand the power of compassion and inclusion. As a first responder and direct care worker, I've helped people heal and build peaceful lives. Now, I'm running for Mayor because I believe our city needs a leader who will bring us together, not drive us apart. We need someone with the experience to get things done, but also the heart to truly listen and understand our struggles. I've lived through tough times myself, and I know that our government can and must do better. The migrant crisis has shown us the cost of ineffective leadership and broken trust. As your Mayor, I'll be present in every corner of our city, helping people access the resources they need and deserve. From Meals on Wheels to transportation access, I'll fight to make our city work for everyone. I'm not a career politician – I'm a dedicated public servant who has always put the people first. I ask for your support because I know that together, we can rebuild trust, bring unity, and ma My name is Montell Moseley, and I'm writing to announce my candidacy for Mayor of New York City. Born and raised in Queens, I've spent my entire life devoted to serving this great city and its people. My 34-year career with the Department of Education, including 25 years as a UFT paraprofessional and supervisor, has given me a deep understanding of the needs of our communities. I've never been content to simply do my job – I've always sought out ways to give back more. I've volunteered on political campaigns across the aisle, from Mayor Michael Bloomberg to President Barack Obama, because I believe that good ideas can come from anywhere. I've worked hand-in-hand with our Borough Presidents and local elected officials to make a real difference in people's lives. I've organized fundraisers, walked door-to-door, and run my own block association to make our neighborhoods better. My commitment to our community has earned me recognition, from being named the \"Star of the Week\" by the Courier to winning scholarships for my work with young people. But more importantly, it's given me a unique perspective on the challenges we face, from homelessness and domestic violence to the need for better resources for our seniors. As a CEO and advocate for a non-profit organization, I've helped connect people with the services they need to thrive. In my work with organizations serving children and adults with disabilities, I've seen firsthand the power of compassion and inclusion. As a first responder and direct care worker, I've helped people heal and build peaceful lives. Now, I'm running for Mayor because I believe our city needs a leader who will bring us together, not drive us apart. We need someone with the experience to get things done, but also the heart to truly listen and"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://www.voicevisionfuture.com/about-5",
    "text": "understand our struggles. I've lived through tough times myself, and I know that our government can and must do better. The migrant crisis has shown us the cost of ineffective leadership and broken trust. As your Mayor, I'll be present in every corner of our city, helping people access the resources they need and deserve. From Meals on Wheels to transportation access, I'll fight to make our city work for everyone. I'm not a career politician – I'm a dedicated public servant who has always put the people first. I ask for your support because I know that together, we can rebuild trust, bring unity, and ma My name is Montell Moseley, and I'm writing to announce my candidacy for Mayor of New York City. Born and raised in Queens, I've spent my entire life devoted to serving this great city and its people. My 34-year career with the Department of Education, including 25 years as a UFT paraprofessional and supervisor, has given me a deep understanding of the needs of our communities. I've never been content to simply do my job – I've always sought out ways to give back more. I've volunteered on political campaigns across the aisle, from Mayor Michael Bloomberg to President Barack Obama, because I believe that good ideas can come from anywhere. I've worked hand-in-hand with our Borough Presidents and local elected officials to make a real difference in people's lives. I've organized fundraisers, walked door-to-door, and run my own block association to make our neighborhoods better. My commitment to our community has earned me recognition, from being named the \"Star of the Week\" by the Courier to winning scholarships for my work with young people. But more importantly, it's given me a unique perspective on the challenges we face, from homelessness and domestic violence to the need for better resources for our seniors. As a CEO and advocate for a non-profit organization, I've helped connect people with the services they need to thrive. In my work with organizations serving children and adults with disabilities, I've seen firsthand the power of compassion and inclusion. As a first responder and direct care worker, I've helped people heal and build peaceful lives. Now, I'm running for Mayor because I believe our city needs a leader who will bring us together, not drive us apart. We need someone with the experience to get things done, but also the heart to truly listen and understand our struggles. I've lived through tough times myself, and I know that our government can and must do better. The migrant crisis has shown us the cost of ineffective leadership and broken trust. As your Mayor, I'll be present in every corner of our city, helping people access the resources they need and deserve. From Meals on Wheels to transportation access, I'll fight to make our city work for everyone. I'm not a career politician – I'm a dedicated public servant who has always put the people first. I ask for your support because I know that together, we can rebuild trust, bring unity, and ma My Story My Story My Story My fellow New Yorkers,, My fellow New Yorkers,, My fellow New Yorkers,, I'm Montell Moseley, and I'm running to be your next Mayor because I believe in a New York City that works for everyone. As a Republican woman candidate, I bring a fresh perspective and unwavering determination to City Hall. Every New Yorker deserves a voice. Whether you're working multiple jobs to make ends meet, building a small business, or raising a family in our incredible city, your dreams and challenges matter. For too long, we've been told that working people should lower their expectations – I'm Montell Moseley, and I'm running to be your next Mayor because I believe in a New York City that works for everyone. As a Republican woman candidate, I bring a fresh perspective and unwavering determination to City Hall. Every New Yorker deserves a voice. Whether you're working multiple jobs to make ends meet, building a small business, or raising a family in our incredible city, your dreams and challenges matter. For too long, we've been told that working people should lower their expectations – I'm Montell Moseley, and I'm running to be your next Mayor because I believe in a New York City that works for everyone. As a Republican woman candidate, I bring a fresh perspective and unwavering determination to City Hall. Every New Yorker deserves a voice. Whether you're working multiple"
  },
  {
    "candidate": "Moseley, Montell C",
    "category": "bio",
    "score": null,
    "link": "https://www.voicevisionfuture.com/about-5",
    "text": "jobs to make ends meet, building a small business, or raising a family in our incredible city, your dreams and challenges matter. For too long, we've been told that working people should lower their expectations – I say that's absolutely wrong. Real leadership means fighting for every New Yorker's right to be heard. That's why I'm committed to: I say that's absolutely wrong. Real leadership means fighting for every New Yorker's right to be heard. That's why I'm committed to: I say that's absolutely wrong. Real leadership means fighting for every New Yorker's right to be heard. That's why I'm committed to: • Ensuring fair ballot access for all candidates • Ensuring fair ballot access for all candidates • Ensuring fair ballot access for all candidates • Giving voters more choices in primary elections • Giving voters more choices in primary elections • Giving voters more choices in primary elections • Creating genuine opportunities for every hardworking New Yorker • Creating genuine opportunities for every hardworking New Yorker • Creating genuine opportunities for every hardworking New Yorker • Bringing fresh solutions to our city's challenges With an experienced campaign team and strong legal support behind me, we're ready to bring real change to New York City. But this isn't just my campaign – it's our campaign. It's about building a city where your standards, your dreams, and your voice shape our future. The time for transformation is now. Together, we can create a New York City that truly represents all of us – not just a select few. I'm Montell Moseley, and I'm asking for your support to make this vision a reality. Join our movement. Let's build a stronger, more inclusive New York City – one where every voice matters and every dream has a chance. Vote Montell Moseley for NYC Mayor. Because New York deserves a leader you can build trust . • Bringing fresh solutions to our city's challenges With an experienced campaign team and strong legal support behind me, we're ready to bring real change to New York City. But this isn't just my campaign – it's our campaign. It's about building a city where your standards, your dreams, and your voice shape our future. The time for transformation is now. Together, we can create a New York City that truly represents all of us – not just a select few. I'm Montell Moseley, and I'm asking for your support to make this vision a reality. Join our movement. Let's build a stronger, more inclusive New York City – one where every voice matters and every dream has a chance. Vote Montell Moseley for NYC Mayor. Because New York deserves a leader you can build trust . • Bringing fresh solutions to our city's challenges With an experienced campaign team and strong legal support behind me, we're ready to bring real change to New York City. But this isn't just my campaign – it's our campaign. It's about building a city where your standards, your dreams, and your voice shape our future. The time for transformation is now. Together, we can create a New York City that truly represents all of us – not just a select few. I'm Montell Moseley, and I'm asking for your support to make this vision a reality. Join our movement. Let's build a stronger, more inclusive New York City – one where every voice matters and every dream has a chance. Vote Montell Moseley for NYC Mayor. Because New York deserves a leader you can build trust . Contact Contact Contact I'm always looking for new and exciting opportunities. Let's connect. I'm always looking for new and exciting opportunities. Let's connect. I'm always looking for new and exciting opportunities. Let's connect. info@mysite.com info@mysite.com info@mysite.com info@mysite.com 123-456-7890 123-456-7890 123-456-7890 MY VOICE , YOUR VISION AND YOUR FUTURE MY VOICE , YOUR VISION AND YOUR FUTURE MY VOICE , YOUR VISION AND YOUR FUTURE Email: MoseleyMontell1@gmail.com Email: MoseleyMontell1@gmail.com website: website: www.rapcccinc.com www.rapcccinc.com www.repmyblock.org www.repmyblock.org Social media: Social media: Instagram Instagram facebook facebook ​ ​ ​ ​ ​ ​ ​ ​ ​ bottom of page"
  }
]