[
  {
    "candidate": "Murillo, Jason C",
    "category": "bio",
    "score": null,
    "link": "https://djloudmouthfornyc.com/",
    "text": "Home About My Policies Endorsements In the Media Donate Volunteer In the Newspapers Community First Conservative Party of NYS Midtown Republican Club Devil Dog Usa Inc. More Home About My Policies Endorsements In the Media Donate Volunteer In the Newspapers Community First Conservative Party of NYS Midtown Republican Club Devil Dog Usa Inc. More Home About My Policies Endorsements In the Media Donate Volunteer In the Newspapers Community First Conservative Party of NYS Midtown Republican Club Devil Dog Usa Inc. Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Sign In Create Account My Account Signed in as: Signed in as: filler@godaddy.com filler@godaddy.com My Account Sign out Sign out Signed in as: filler@godaddy.com Home Home About About My Policies My Policies Endorsements Endorsements In the Media In the Media Donate Donate Volunteer Volunteer In the Newspapers In the Newspapers Community First Community First Conservative Party of NYS Conservative Party of NYS Midtown Republican Club Midtown Republican Club Devil Dog Usa Inc. Devil Dog Usa Inc. Account My Account Sign out Sign out Sign In My Account MEET JASON MURILLO I am a lifelong resident, advocate, and community leader of the East Village, L.E.S, where I've lived for over 35 years. I know firsthand the daily struggles our community faces which is why I'm running for City Council in District 2. My campaign is driven by one mission: to put our families and community first! I am a lifelong resident, advocate, and community leader of the East Village, L.E.S, where I've lived for over 35 years. I know firsthand the daily struggles our community faces which is why I'm running for City Council in District 2. My campaign is driven by one mission: to put our families and community first! JASON MURILLO: A VOICE FOR THE PEOPLE JASON MURILLO: A VOICE FOR THE PEOPLE JASON MURILLO: DEFENDING NYCHA RESIDENTS AT CITY HALL JASON MURILLO: DEFENDING NYCHA RESIDENTS AT CITY HALL About Jason & his vision for a better district 2 About Jason & his vision for a better district 2 Jason Murillo, known as \"DJ Loudmouth,\" is a lifelong resident of Manhattan's Lower East Side and East Village, with over 35 years in the community. A product of NYCHA public housing, he understands the challenges faced by residents and is running for New York City Council in District 2 to address them. As a small business owner, entrepreneur, community organizer, and award-winning television, radio, and music producer, Murillo has a strong background in advocacy and activism, focusing on unity and support for marginalized groups, including public housing residents, those on public assistance, and the homeless.His campaign prioritizes a conservative agenda, including: Jason Murillo, known as \"DJ Loudmouth,\" is a lifelong resident of Manhattan's Lower East Side and East Village, with over 35 years in the community. A product of NYCHA public housing, he understands the challenges faced by residents and is running for New York City Council in District 2 to address them. As a small business owner, entrepreneur, community organizer, and award-winning television, radio, and music producer, Murillo has a strong background in advocacy and activism, focusing on unity and support for marginalized groups, including public housing residents, those on public assistance, and the homeless.His campaign prioritizes a conservative agenda, including: Repealing sanctuary city status and implementing law and order reforms, such as ending cashless bail and supporting Priscilla's Law to regulate e-bikes. Re-funding the NYPD to increase police presence for public safety. Safeguarding NYCHA housing and addressing homelessness with housing solutions. Protecting small businesses and low-income families through targeted initiatives. Repealing congestion pricing and promoting fiscal responsibility by reducing wasteful spending, particularly on the migrant crisis. Restoring public trust through transparency and accountability. Repealing sanctuary city status and implementing law and order reforms, such as ending cashless bail and supporting Priscilla's Law to regulate e-bikes. Re-funding the NYPD to increase police presence for public safety. Safeguarding NYCHA housing and addressing homelessness with housing solutions. Protecting small businesses and low-income families through targeted initiatives. Repealing congestion pricing and promoting fiscal responsibility by reducing wasteful spending, particularly on the migrant crisis. Restoring public trust through transparency and accountability. Murillo has collaborated with organizations like Manhattan Neighborhood Network, Bric TV, BronxNet, and the Nuyorican Poets Cafe, and currently works with Devil Dog USA Inc. & Vero G. Productions to support families, youth, and veterans. He has also organized rallies to keep Mount Sinai Beth Israel Hospital open, highlighting his commitment to accessible healthcare & Housing Justice. Murillo"
  },
  {
    "candidate": "Murillo, Jason C",
    "category": "bio",
    "score": null,
    "link": "https://djloudmouthfornyc.com/",
    "text": "has collaborated with organizations like Manhattan Neighborhood Network, Bric TV, BronxNet, and the Nuyorican Poets Cafe, and currently works with Devil Dog USA Inc. & Vero G. Productions to support families, youth, and veterans. He has also organized rallies to keep Mount Sinai Beth Israel Hospital open, highlighting his commitment to accessible healthcare & Housing Justice. United By A Common Goal Jason Murillo, a lifelong resident of Manhattan’s Lower East Side and East Village, is running for New York City Council in District 2 to stay deeply connected to his community and give back to the neighborhood he loves. As a product of NYCHA public housing, he is driven by a personal understanding of local challenges and a commitment to ensuring every resident—especially minorities, families, small business owners, veterans, public housing residents, youth, and seniors—has a voice and equal representation. Jason Murillo, a lifelong resident of Manhattan’s Lower East Side and East Village, is running for New York City Council in District 2 to stay deeply connected to his community and give back to the neighborhood he loves. As a product of NYCHA public housing, he is driven by a personal understanding of local challenges and a commitment to ensuring every resident—especially minorities, families, small business owners, veterans, public housing residents, youth, and seniors—has a voice and equal representation. Positioning himself as a Conservative Republican, Murillo advocates for: Positioning himself as a Conservative Republican, Murillo advocates for: Fiscal Responsibility : Promoting common-sense conservative policies to curb wasteful spending, particularly on issues like the migrant crisis, and ensuring taxpayer money is used effectively. Public Safety : Pushing for law and order reforms, including re-funding the NYPD to increase police presence, ending cashless bail, and supporting measures like Priscilla’s Law to regulate dangerous e-bikes. Community Empowerment : Protecting NYCHA housing, supporting small businesses, addressing homelessness with housing solutions, and advocating for low-income families to foster a stronger, more inclusive District 2. Fiscal Responsibility : Promoting common-sense conservative policies to curb wasteful spending, particularly on issues like the migrant crisis, and ensuring taxpayer money is used effectively. Public Safety : Pushing for law and order reforms, including re-funding the NYPD to increase police presence, ending cashless bail, and supporting measures like Priscilla’s Law to regulate dangerous e-bikes. Community Empowerment : Protecting NYCHA housing, supporting small businesses, addressing homelessness with housing solutions, and advocating for low-income families to foster a stronger, more inclusive District 2. His campaign reflects a blend of grassroots activism and conservative values, rooted in his extensive community involvement with organizations like Devil Dog USA Inc., Vero G. Productions, and efforts to keep Mount Sinai Beth Israel Hospital open. His campaign reflects a blend of grassroots activism and conservative values, rooted in his extensive community involvement with organizations like Devil Dog USA Inc., Vero G. Productions, and efforts to keep Mount Sinai Beth Israel Hospital open. We're in it to Win it. Jason Murillo, running for New York City Council in District 2, emphasizes a people-first campaign, calling for community support to achieve his vision for the East Village and Lower East Side. He underscores that his campaign relies on grassroots efforts—flyering, spreading the word, volunteering, or donating—to succeed. As a Conservative Republican and lifelong resident of NYCHA public housing, Murillo positions himself as a candidate who will serve the community, not special interests, million-dollar developers, or lobbyists.His pledges include: Jason Murillo, running for New York City Council in District 2, emphasizes a people-first campaign, calling for community support to achieve his vision for the East Village and Lower East Side. He underscores that his campaign relies on grassroots efforts—flyering, spreading the word, volunteering, or donating—to succeed. As a Conservative Republican and lifelong resident of NYCHA public housing, Murillo positions himself as a candidate who will serve the community, not special interests, million-dollar developers, or lobbyists.His pledges include: Fighting for Residents : Advocating for minorities, families, small business owners, veterans, public housing residents, youth, and seniors, ensuring their voices are heard. Economic and Housing Solutions : Bringing back jobs for the unemployed, securing housing for homeless families, and safeguarding NYCHA public housing to prevent displacement. Addressing the Migrant Crisis : Ending the chaos and reckless spending of taxpayer dollars on the migrant crisis, prioritizing fiscal responsibility. Community Reinvestment : Reallocating resources to strengthen local communities and support their needs. Fighting for Residents : Advocating for minorities, families, small business owners, veterans, public housing residents, youth, and seniors, ensuring their voices are heard. Economic and Housing Solutions : Bringing back jobs for"
  },
  {
    "candidate": "Murillo, Jason C",
    "category": "bio",
    "score": null,
    "link": "https://djloudmouthfornyc.com/",
    "text": "the unemployed, securing housing for homeless families, and safeguarding NYCHA public housing to prevent displacement. Addressing the Migrant Crisis : Ending the chaos and reckless spending of taxpayer dollars on the migrant crisis, prioritizing fiscal responsibility. Community Reinvestment : Reallocating resources to strengthen local communities and support their needs. Murillo’s message of unity and strong leadership highlights his commitment to serving District 2’s residents above all. Murillo’s message of unity and strong leadership highlights his commitment to serving District 2’s residents above all. HELP US WIN HELP US WIN COMMUNITY UNITY & OUTREACH COMMUNITY UNITY & OUTREACH JOIN OUR COMMUNITY-BASED CAMPAIGN Be a community leader today! Be a community leader today! VOLUNTEER - CONTACT US VOLUNTEER - CONTACT US Be a Leader Today! Attach Files Attachments (0) Sign up for our email list for updates, promotions, and more. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. There are many ways to get involved in our work to serve you! We have opportunities for everyone. Regardless of political experience, age, gender, or ability, you can make a difference & impact in your community today! Regardless of political experience, age, gender, or ability, you can make a difference & impact in your community today! East Village, New York, New York, United States EMAIL: jasonmurillofornyc@gmail.com ENDORSEMENTS ENDORSEMENTS Gerard Kassar - Chairman Conservative Party of New York State AJ Catsimatidis - Chairwoman Manhattan Republican Party Manhattan Republican Party Conservative Party of New York State Maud Maron - Manhattan DA Candidate North Manhattan Republican Party Curtis Sliwa - NYC Mayoral Candidate Brooklyn Conservative Party Lillian Ward Houses Tenants ENDORSEMENTS & SUPPORTERS ENDORSEMENTS & SUPPORTERS ENDORSEMENTS ENDORSEMENTS Patrick McManus - Chairman The Bronx County Conservative Party The Hon. Sgt Gonzalo Duran - Frm US Marine Current (C) District Leader 79th AD (The Bronx) Jacob Riis Houses Tenants Lazaris - Hiphop Music Superstar DJ Drewski - Hot97 Manhattan Conservative Party Midtown Republican Club The Bronx County Conservative Party Veronica Gonzalez - US Presidental Lifetime Service Award Recipient & Community Activist IN THE MEDIA/NEWS IN THE MEDIA/NEWS JASON MURILLO: THE VOICE OF REASON JASON MURILLO: THE VOICE OF REASON GIVING BACK TO OUR COMMUNITY GIVING BACK TO OUR COMMUNITY BACK TO SCHOOL COMMUNITY EVENT - SPECTRUM NY1 NEWS BACK TO SCHOOL COMMUNITY EVENT - SPECTRUM NY1 NEWS IN THE PAPERS IN THE PAPERS Jason Murillo Lifelong Community Advocate Running for City Council Republican candidate Jason Murillo officially enters City Council District 2 race. Jason Murillo Lifelong Community Advocate Running for City Council Jason Murillo's Incredible Journey & Rise to City Council Run Republican candidate Jason Murillo officially enters City Council District 2 race. Jason Murillo Lifelong Community Advocate Running for City Council Republican candidate Jason Murillo officially enters City Council District 2 race. Republican candidate Jason Murillo officially enters City Council District 2 race. Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Anthony Weiner Eyes NYC Council Comeback After Scandal. Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Bronx hosts event of Conservative Party candidates for 2025 citywide elections. Bronx hosts event of Conservative Party candidates for 2025 citywide elections. Disgraced ex-lawmaker Anthony Weiner officially files to run for NY City Council years after sexting Bronx hosts event of Conservative Party candidates for 2025 citywide elections. The Bronx Set to Host NYC’s Largest Conservative Event of the Year. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side. Conservative Movement Unites at 2024 Viable Candidate Summit in the Bronx. Conservative Movement Unites at 2024 Viable Candidate Summit in the Bronx. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side. Conservative Movement Unites at 2024 Viable Candidate Summit in the Bronx. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side. Mount Sinai Beth Israel Hospital Stays Open: Jason Murillo Celebrates Victory. Mount Sinai Beth Israel Hospital Stays Open: Jason Murillo Celebrates Victory. Vero G., Jason Murillo Hosts 5th Annual Back-to-School Giveaway in Lower East Side."
  },
  {
    "candidate": "Murillo, Jason C",
    "category": "bio",
    "score": null,
    "link": "https://djloudmouthfornyc.com/",
    "text": "Conservative Party Members Recognized for Voter Registration Achievements. Mount Sinai Beth Israel Hospital Stays Open: Jason Murillo Celebrates Victory. Conservative Party Members Recognized for Voter Registration Achievements. Artist Showcase: Promoting Community Unity And Combating Gun Violence. Mount Sinai Beth Israel Hospital Stays Open: Jason Murillo Celebrates Victory. Conservative Party Members Recognized for Voter Registration Achievements. Get involved! Join our Campaign Sign up to receive updates from the candidate on the trail! Email* Sign up Sign up to receive updates from the candidate on the trail! IN THE MEDIA/NEWS IN THE MEDIA/NEWS WE RECEIVE SPECIAL HONOR FROM US PRESIDENT JOE BIDEN FOR OUR COMMUNITY SERVICE WE RECEIVE SPECIAL HONOR FROM US PRESIDENT JOE BIDEN FOR OUR COMMUNITY SERVICE MY MANDATE TO VOTERS IS TO BRING LAW & ORDER BACK TO NYC MY MANDATE TO VOTERS IS TO BRING LAW & ORDER BACK TO NYC A COMMUNITY UNITED A COMMUNITY UNITED JASON MURILLO / DJ LOUDMOUTH OFFICIAL 2025 NYC CITY COUNCIL DISTRICT 2 RUN ANNOUNCEMENT @ RALLY TO SAVE MOUNT SINAI BETH ISRAEL HOSPITAL #NYCVOTES JASON MURILLO / DJ LOUDMOUTH OFFICIAL 2025 NYC CITY COUNCIL DISTRICT 2 RUN ANNOUNCEMENT @ RALLY TO SAVE MOUNT SINAI BETH ISRAEL HOSPITAL #NYCVOTES Copyright © 2025 Jason Murillo Republican for NYC City Council District 2: Leading Our Future - All Rights Reserved. Copyright © 2025 Jason Murillo Republican for NYC City Council District 2: Leading Our Future - All Rights Reserved. Powered by Powered by Donate Community First Conservative Party of NYS Midtown Republican Club Devil Dog Usa Inc. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
  }
]