[
  {
    "candidate": "Myrie, Zellnor",
    "category": "bio",
    "score": null,
    "link": "https://www.nysenate.gov/senators/zellnor-myrie",
    "text": "New York State Senator Zellnor Myrie Chairman of Codes Committee ( D ) 20th Senate District ( D ) About Our District Newsroom Legislation Events Contact Search Search icon Search login Search Search icon Search New York State Senate Educator Recognition Program Read More Graduate Certificate Program Read More Download Senator Myrie's Reproductive Healthcare Resource Guide Read More Legislative Record - John R. Lewis Voting Rights Act of New York (NYVRA) Read More 2024 New York State Senate Veterans' Hall of Fame Honoree Read More Download Senator Myrie's Senior Resource Guide! Read More Featured Story May 14, 2024 Redetha Abrahams-Nichols Women of Distinction Newsroom Go to Newsroom In the News March 28, 2025 Op-Ed: Commentary: End sales of handguns that convert easily to 'DIY machine guns' Press release March 21, 2025 News: Myrie, Colleagues And Advocates: \"New York Needs A Gun Violence Prevention Office Now!\" Article February 26, 2025 Senator Myrie's Reproductive Healthcare Resource Guide Access to Healthcare In the News January 7, 2025 Op-Ed: Speed Case Discovery with NYPD Databases Sign up for Senator Myrie’s Community Updates Read More Request a Proclamation or Award from Senator Myrie! Take the Questionnaire Need to request meetings or constituent services? Click here! Read More New York State Senate Educator Recognition Program Read More New York State Senate Educator Recognition Program New York State Senate Educator Recognition Program Graduate Certificate Program Read More Graduate Certificate Program Graduate Certificate Program Download Senator Myrie's Reproductive Healthcare Resource Guide Read More Download Senator Myrie's Reproductive Healthcare Resource Guide Download Senator Myrie's Reproductive Healthcare Resource Guide Legislative Record - John R. Lewis Voting Rights Act of New York (NYVRA) Read More Legislative Record - John R. Lewis Voting Rights Act of New York (NYVRA) Legislative Record - John R. Lewis Voting Rights Act of New York (NYVRA) 2024 New York State Senate Veterans' Hall of Fame Honoree Read More 2024 New York State Senate Veterans' Hall of Fame Honoree 2024 New York State Senate Veterans' Hall of Fame Honoree Download Senator Myrie's Senior Resource Guide! Read More Download Senator Myrie's Senior Resource Guide! Download Senator Myrie's Senior Resource Guide! Featured Story May 14, 2024 Redetha Abrahams-Nichols Women of Distinction Featured Story Redetha Abrahams-Nichols Redetha Abrahams-Nichols Newsroom In the News March 28, 2025 Op-Ed: Commentary: End sales of handguns that convert easily to 'DIY machine guns' Op-Ed: Commentary: End sales of handguns that convert easily to 'DIY machine guns' Press release March 21, 2025 News: Myrie, Colleagues And Advocates: \"New York Needs A Gun Violence Prevention Office Now!\" News: Myrie, Colleagues And Advocates: \"New York Needs A Gun Violence Prevention Office Now!\" Article February 26, 2025 Senator Myrie's Reproductive Healthcare Resource Guide Access to Healthcare Senator Myrie's Reproductive Healthcare Resource Guide In the News January 7, 2025 Op-Ed: Speed Case Discovery with NYPD Databases Op-Ed: Speed Case Discovery with NYPD Databases Sign up for Senator Myrie’s Community Updates Read More Sign up for Senator Myrie’s Community Updates Sign up for Senator Myrie’s Community Updates Request a Proclamation or Award from Senator Myrie! Take the Questionnaire Request a Proclamation or Award from Senator Myrie! Take the Questionnaire Request a Proclamation or Award from Senator Myrie! Request a Proclamation or Award from Senator Myrie! Need to request meetings or constituent services? Click here! Read More Need to request meetings or constituent services? Click here! Read More Need to request meetings or constituent services? Click here! Need to request meetings or constituent services? Click here! NYSenate.gov Socials Follow the New York State Senate News & Issues Senators & Committees Bills & Laws Budget Events About the Senate Footer Right Contact the Senate Report a Website Issue Home Rule Form Site Policies About this Website GET INVOLVED"
  }
]