[
  {
    "candidate": "Nahom, Ronen",
    "category": "bio",
    "score": null,
    "link": "https://www.ronenformayor.com/",
    "text": "top of page Menu Menu Close Close About About Contact Contact Ronen Nahom For Mayor About About Contact Contact Take Our City Back! Ronen Nahom For Mayor Donate My Issues My Issues Fare Evasion Crackdown Fare Evasion Crackdown Crime Prevention & Public Safety Crime Prevention & Public Safety Strong Police Presence Strong Police Presence Repeal of the Congestion Toll Repeal of the Congestion Toll Strengthening Our Workforce and Protecting Public Servants Strengthening Our Workforce and Protecting Public Servants Strong Action Against Illegal Protests and Public Disruption Strong Action Against Illegal Protests and Public Disruption Strong Action Against Antisemitism Strong Action Against Antisemitism Eliminate DEI on Day One Eliminate DEI on Day One Fare Evasion Crackdown Heavy Fines for Subway & Bus Fare Evaders – Implement strict penalties with increasing fines for repeat offenders. Heavy Fines for Subway & Bus Fare Evaders – Implement strict penalties with increasing fines for repeat offenders. ​ ​ ​ Zero-Tolerance Enforcement – Transit officers and police ensure all riders pay their fare, with immediate penalties for those caught evading. Zero-Tolerance Enforcement – Transit officers and police ensure all riders pay their fare, with immediate penalties for those caught evading. Crime Prevention & Public Safety Maximum Sentences for Repeat Offenders – Those who continuously commit crimes, including theft, assault, or vandalism, face the highest legal penalties. Maximum Sentences for Repeat Offenders – Those who continuously commit crimes, including theft, assault, or vandalism, face the highest legal penalties. ​ ​ ​ Jail Time for Criminal Activities – Anyone engaging in illegal acts on public transit is swiftly arrested and prosecuted. Jail Time for Criminal Activities – Anyone engaging in illegal acts on public transit is swiftly arrested and prosecuted. Strong Police Presence Uniformed Police Patrols – Officers stationed on buses, trains, and platforms to deter crime and enforce rules. Uniformed Police Patrols – Officers stationed on buses, trains, and platforms to deter crime and enforce rules. Immediate Repeal of the Congestion Toll I demand the immediate removal of the congestion toll, which has placed an undue burden on our citizens and public service workers. This toll is an unnecessary obstacle to the daily activities of our residents, businesses, and first responders, and it must be eliminated without delay. ​ ​ On day one, all FDNY and NYPD personnel will be exempt from paying this toll until it is fully repealed. Our first responders should never have to bear additional financial burdens while performing their critical duties to serve and protect our communities. ​ ​ I urge swift action to abolish the congestion toll entirely, ensuring that our hardworking public servants and the people of this city are supported—not penalized. Strengthening Our Police Officers On day one, I will act to raise the minimum annual salary for all new recruits, ensuring that we attract and retain top talent in our workforce. Competitive pay is essential to maintaining excellence and dedication in public service. ​ ​ Additionally, I will restore the qualified immunity rule immediately. Law enforcement officers and public officials must have the legal protections necessary to perform their duties effectively without fear of unjust retaliation. We must empower those who serve and protect our communities while maintaining accountability and integrity. qualified immunity ​ ​ These actions will promote fair wages, strong protections, and a more effective public service system. Strong Action Against Illegal Protests and Public Disruption The time has come to put an end to illegal protests that disrupt daily life, block major streets, and create chaos in our communities. These unlawful actions are unacceptable and will no longer be tolerated. ​ ​ We will deploy specialized riot police to swiftly arrest and detain individuals participating in illegal demonstrations. Those who engage in violence, vandalism, or disorderly conduct will face heavy fines and immediate legal consequences. ​ ​ Peaceful assembly is a right, but lawlessness and public disruption will be met with strict enforcement and zero tolerance. Our streets must remain open, safe, and functional for all law-abiding citizens. Strong Action Against Antisemitism I am unwavering in my commitment to eradicating antisemitism from our communities. There will be zero tolerance for any form of antisemitic behavior, threats, or rhetoric. Offenders will face the maximum punishment allowable under the law—no exceptions. ​ ​ We will not allow schools, organizations, or individuals to ignore this issue. Any institution that fails to actively address and prevent antisemitism will be held accountable. ​ ​ Furthermore, no Jewish individual—child or adult—should ever have to hide their identity or live in fear."
  },
  {
    "candidate": "Nahom, Ronen",
    "category": "bio",
    "score": null,
    "link": "https://www.ronenformayor.com/",
    "text": "We must ensure that every synagogue, school, and community space is protected and that hate has no place in our society. Action begins now. The time for strong, decisive leadership on this issue is long overdue. Eliminate DEI on Day One On day one, the Diversity, Equity, and Inclusion (DEI) program will be completely eliminated from schools and all government agencies. This program has no place in our institutions and will be dismantled without exception. ​ ​ Our focus must be on merit, equal opportunity, and excellence—not divisive policies. Every individual should be treated fairly and based on their qualifications, without forced ideological agendas. It’s time to restore accountability, fairness, and common sense in education and government. DEI is gone. Subscribe to our newsletter • Don’t miss out! Subscribe to our newsletter • Don’t miss out! Subscribe to our newsletter • Don’t miss out! * Submit ©2025 Ronen For Mayor. Powered By Gozoek.Com Gozoek.Com About About Contact Contact bottom of page"
  }
]