[
  {
    "candidate": "Narcisse, Mercedes",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/mercedes-narcisse/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 46 Mercedes Narcisse Bergen Beach, Canarsie, Flatlands, Georgetown, Gerritsen Beach, Marine Park, Mill Basin, Mill Island, and Sheepshead Bay Biography Council Member Mercedes Narcisse is a registered nurse who represents the 46th Council District in Brooklyn, covering the neighborhoods of Bergen Beach, Canarsie, Flatlands, Georgetown, Gerritsen Beach, Marine Park, Mill Basin, Mill Island, Sheepshead Bay. Council Member Narcisse is Chair of the New York City Council’s Committee on Hospitals and serves on the Committees on Health, Education, Parks and Recreation, Transportation and Infrastructure, Criminal Justice and the Subcommittee on COVID Recovery and Resiliency. Mercedes was born in Saint Marc, Haiti and migrated to the United States as a teenager, settling in Brooklyn. She attended public high school in Brooklyn, and is a proud CUNY graduate. Prior to her election to the City Council in November, 2021, she worked as a registered nurse and was a small business owner. In her first term as a Member of the New York City Council, Mercedes built a reputation as a fierce advocate for her community with a tireless work ethic. Her community office has notably become one of the highest in serving constituents in NYC, demonstrating her effectiveness and dedication. As a member of the Council’s Budget and Negotiation Team, Mercedes has delivered unprecedented victories for District 46. She secured millions of dollars in city funding to upgrade and renovate parks, libraries and schools across the district. Mercedes also secured the funding needed to operate after-school programs, senior centers, and other community initiatives, greatly benefiting local residents. In 2023, she championed strong legislation, notably a bill to enhance health outcomes for those with sickle cell disease and another to train NYPD officers in identifying and interacting with New Yorkers with autism. These initiatives reflect her commitment to addressing both health and social challenges, further cementing her reputation as a relentless advocate for her constituents. Mercedes is a loving mother of four and a proud resident of the 46th district in Brooklyn. In November, 2023 she was re-elected to serve another two-year term beginning January 1, 2024. Biography Council Member Mercedes Narcisse is a registered nurse who represents the 46th Council District in Brooklyn, covering the neighborhoods of Bergen Beach, Canarsie, Flatlands, Georgetown, Gerritsen Beach, Marine Park, Mill Basin, Mill Island, Sheepshead Bay. Council Member Narcisse is Chair of the New York City Council’s Committee on Hospitals and serves on the Committees on Health, Education, Parks and Recreation, Transportation and Infrastructure, Criminal Justice and the Subcommittee on COVID Recovery and Resiliency. Mercedes was born in Saint Marc, Haiti and migrated to the United States as a teenager, settling in Brooklyn. She attended public high school in Brooklyn, and is a proud CUNY graduate. Prior to her election to the City Council in November, 2021, she worked as a registered nurse and was a small business owner. In her first term as a Member of the New York City Council, Mercedes built a reputation as a fierce advocate for her community with a tireless work ethic. Her community office has notably become one of the highest in serving constituents in NYC, demonstrating her effectiveness and dedication. As a member of the Council’s Budget and Negotiation Team, Mercedes has delivered unprecedented victories for District 46. She secured millions of dollars in city funding to upgrade and renovate parks, libraries and schools across the district. Mercedes also secured the funding needed to operate after-school programs, senior centers, and other community initiatives, greatly benefiting local residents. In 2023, she championed strong legislation, notably a bill to enhance health outcomes for those with sickle cell disease and another to train NYPD officers in identifying and interacting with New Yorkers with autism. These initiatives reflect her commitment to addressing both health and social challenges, further cementing her reputation as a relentless advocate for her constituents. Mercedes is a loving mother of four and a proud resident of the 46th district in Brooklyn. In November, 2023 she was re-elected to serve another two-year term beginning January 1, 2024. Biography Staff Directory Legislative Work District Office 5827 Flatlands Avenue Brooklyn, NY 11234 Phone: 718-241-9330 Twitter @CMMercedesCD46 Legislative Office 250 Broadway, Suite 1792 New York, NY 10007 Phone: 212-788-7286 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to"
  },
  {
    "candidate": "Narcisse, Mercedes",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/mercedes-narcisse/",
    "text": "hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]