[
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Fátimazöhra Nouinou Fátimazöhra Nouinou Fátimazöhra Nouinou Republican Party Candidate, Mayor of New York June 24, 2025 Education Lycée Abdelkhalek Torres Ashworth College, 2007 Detective Training Institute, 2015 Campaign Facebook Campaign Twitter Personal Twitter Personal Instagram Personal LinkedIn Fátimazöhra Nouinou ( Republican Party ) is running for election for Mayor of New York . She declared candidacy for the Republican primary scheduled on June 24, 2025 . Nouinou completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Fátimazöhra Nouinou earned a high school diploma from the Lycée Abdelkhalek Torres. She earned an associate degree from Ashworth College in 2007, graduated from the Inter Air Institute in 2000, and graduated from the Detective Training Institute in 2015. Her career experience includes working as a nonprofit founder, air safety and operations officer, investigator, security professional, risk manager, human factors specialist, quality assurance expert, and program manager. Nouinou has been affiliated with the United Nations, the United Nations Development Programme, the World Health Organization, and UNHURTDIGNITY. [1] Elections Elections 2025 2025 See also: Mayoral election in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. Additional general election candidates will be added here following the primary. General election for Mayor of New York Incumbent Eric Adams , Jean Anglade , Kyle Gutierrez , Abbey Laurel-Smith , and James Walden are running in the general election for Mayor of New York on November 4, 2025. Candidate Eric Adams (Independent) Jean Anglade (Independent) Submit photo Kyle Gutierrez (Independent) Abbey Laurel-Smith (Independent) Submit photo James Walden (Independent) Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for Mayor of New York The following candidates are running in the Democratic primary for Mayor of New York on June 24, 2025. Candidate Adrienne Adams Submit photo Selma Bartholomew Michael Blake Andrew Cuomo Corinne Fisher Brad Lander Deirdre Levy Zohran Kwame Mamdani Zellnor Myrie Paperboy Prince Jessica Ramos Scott Stringer Whitney Tilson There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Cleopatra Fitzgerald (D) Republican primary election Republican primary for Mayor of New York The following candidates are running in the Republican primary for Mayor of New York on June 24, 2025. Candidate Joe Alny Darren Dione Aquino Submit photo Naomi Coley Gonzalo Duran John Harris Submit photo Kris Lord Submit photo James Manning Submit photo Montell Moseley Submit photo Ronen Nahom Fátimazöhra Nouinou Submit photo David Rem Curtis Sliwa There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Fátimazöhra Nouinou completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Nouinou's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Fátimazöhra is an Andalusian American with a distinguished career spanning over two decades with the United Nations. Her diverse experience encompasses roles in Communication, Aviation, Inspection, Evaluation, Investigation, Administration of Justice, and Counter-Terrorism. Professionally, Fátimazöhra is a versatile expert, skilled in Linguistics, Risk Management, Safety and Security, Human Factors, and Quality Assurance. Additionally, she has worked in New York City Real Estate and collaborated with the New York City Board of Elections. Prior to joining the UN in New York City, Fátimazöhra trained as a Flight Attendant in Jeddah and later worked in tourism and international events in Istanbul and Buenos Aires, where she also served at a consulate and an embassy. As a world traveler, UN Peacekeeper, and humanitarian, her areas of focus include human rights, women’s empowerment, child protection, justice, peace, racial equality, social equity, civilization, and innovation. Professionally, Fátimazöhra is a versatile expert, skilled in Linguistics, Risk Management, Safety and Security, Human Factors, and Quality Assurance. Additionally, she has worked in New York City Real Estate and collaborated with the New York City Board of Elections. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Make New York City Clean, Safe and Modern Again! My campaign encompasses the following: 1- Cleanliness A clean city is essential for public health, tourism, economic growth, and the overall quality of life. My administration will take bold action to ensure New York City remains a world-class metropolis by implementing the following initiatives: - Strengthening Sanitation Services - Cracking Down on Illegal Dumping and Littering - Tackling Rodent and Pest Infestations - Expanding Green Public Spaces - Cleaning Parks - Modernizing Waste & Recycling Infrastructure By prioritizing cleanliness, we can improve public health, attract businesses and tourism, and foster a sense of civic pride among all New Yorkers. 2- Homelessness My Strategies to Address Homelessness are: - Increase Affordable Housing - Enhance Shelter Systems - Strengthen Prevention Programs - Address Systemic Barriers - Foster Community Partnerships - Utilize Data-Driven Approaches By adopting these strategies, we can work towards a future where homelessness is rare, brief, and nonrecurring, ensuring that all New Yorkers have access to safe and stable housing. 3- Establishing judicial reform Establishing judicial reform in New York City is essential to ensure a fair, efficient, and transparent justice system that serves all residents equitably. My Key Strategies for Judicial Reform are: - Discovery Law Reforms - Bail System Evaluation - Sentencing Reform - Court Simplification - Community-Based Justice Initiatives - Addressing Jail Conditions By implementing these strategies, we can work towards a judicial system in New York City that upholds justice, maintains public safety, and ensures equitable treatment for all residents. Make New York City Clean, Safe and Modern Again! My campaign encompasses the following: 1- Cleanliness A clean city is essential for public health, tourism, economic growth, and the overall quality of life. My administration will take bold action to ensure New York City remains a world-class metropolis by implementing the following initiatives: - Strengthening Sanitation Services - Cracking Down on Illegal Dumping and Littering - Tackling Rodent and Pest Infestations - Expanding Green Public Spaces - Cleaning Parks - Modernizing Waste & Recycling Infrastructure By prioritizing cleanliness, we can improve public health, attract businesses and tourism, and foster a sense of civic pride among all New Yorkers. My campaign encompasses the following: 1- Cleanliness A clean city is essential for public health, tourism, economic growth, and the overall quality of life. My administration will take bold action to ensure New York City remains a world-class metropolis by implementing the following initiatives: - Strengthening Sanitation Services - Cracking Down on Illegal Dumping and Littering - Tackling Rodent and Pest Infestations - Expanding Green Public Spaces - Cleaning Parks - Modernizing Waste & Recycling Infrastructure 2- Homelessness My Strategies to Address Homelessness are: - Increase Affordable Housing - Enhance Shelter Systems - Strengthen Prevention Programs - Address Systemic Barriers - Foster Community Partnerships - Utilize Data-Driven"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "Approaches By adopting these strategies, we can work towards a future where homelessness is rare, brief, and nonrecurring, ensuring that all New Yorkers have access to safe and stable housing. 3- Establishing judicial reform Establishing judicial reform in New York City is essential to ensure a fair, efficient, and transparent justice system that serves all residents equitably. My Key Strategies for Judicial Reform are: - Discovery Law Reforms - Bail System Evaluation - Sentencing Reform - Court Simplification - Community-Based Justice Initiatives - Addressing Jail Conditions By implementing these strategies, we can work towards a judicial system in New York City that upholds justice, maintains public safety, and ensures equitable treatment for all residents. What areas of public policy are you personally passionate about? As a dedicated Candidate for NYC Mayor, I am personally passionate about several key public policy areas that directly impact the well-being and prosperity of their city. According to the National League of Cities ’s 2024 State of the Cities report, I nationwide prioritize: - Economic Development - Infrastructure - Housing - Public Health - Public Safety Additionally, I focus on: - Education - Environmental Sustainability - Social Equity By passionately engaging in these areas, I can lead my city toward a more prosperous, equitable, and sustainable future. According to the National League of Cities ’s 2024 State of the Cities report, I nationwide prioritize: - Economic Development - Infrastructure - Housing - Public Health - Public Safety Additionally, I focus on: - Education - Environmental Sustainability - Social Equity Who do you look up to? Whose example would you like to follow, and why? Fátima Al-Fihri built the First University in the World; Queen Isabella I supported the exploration of Columbus; Kemal Atatürk founded the Republic of Turkey; Dag Hammarskjöld was a True World Leader and UNSG; John F. Kennedy was a Strong Ambitious U.S. President. Queen Isabella I supported the exploration of Columbus; Kemal Atatürk founded the Republic of Turkey; Dag Hammarskjöld was a True World Leader and UNSG; Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? To deepen my understanding of ethical, moral, constitutional, professional, and political philosophy, I would consider and recommend the following: - Buying a Book \"Justice: What's the Right Thing to Do?\" by Michael Sandel: This thought-provoking book explores fundamental questions of justice, morality, and politics. - Reading an Essay \"The Social Contract\" by Jean-Jacques Rousseau {excerpts}: This influential essay lays the groundwork for modern political philosophy, discussing the nature of society, governance, and individual rights. - Watching a Film \"The Post\" [2017]: Directed by Steven Spielberg, this film tells the story of the Pentagon Papers and the Washington Post's decision to publish them, raising essential questions about government accountability, freedom of the press, and individual conscience. Additionally, I would have the following recommendations: - Book: \"The Republic\" by Plato - Essay: \"The Declaration of Independence\" [1776] - Film: \"Lincoln\" {2012} These resources will provide a solid foundation for exploring the complexities of ethical, moral, constitutional, professional, and political philosophy. - Buying a Book \"Justice: What's the Right Thing to Do?\" by Michael Sandel: This thought-provoking book explores fundamental questions of justice, morality, and politics. - Reading an Essay \"The Social Contract\" by Jean-Jacques Rousseau {excerpts}: This influential essay lays the groundwork for modern political philosophy, discussing the nature of society, governance, and individual rights. - Watching a Film \"The Post\" [2017]: Directed by Steven Spielberg, this film tells the story of the Pentagon Papers and the Washington Post's decision to publish them, raising essential questions about government accountability, freedom of the press, and individual conscience. Additionally, I would have the following recommendations: - Book: \"The Republic\" by Plato - Essay: \"The Declaration of Independence\" [1776] - Film: \"Lincoln\" {2012} What characteristics or principles are most important for an elected official? When it comes to an elected official, there are several key characteristics and principles that are essential for effective leadership. Here are some of the most important ones: 1- Core Qualities - Honesty: Being truthful and transparent in her/his words and actions, even when it's difficult. - Integrity: Adhering to moral and ethical principles, and maintaining a strong moral compass. - Compassion: Understanding and empathizing with the needs and struggles of her/his constituents. - Confidence: Having faith in her/his abilities and decisions, while also being open to feedback and criticism. - Flexibility: Being able to adapt to changing circumstances and find common ground with others."
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "2- Leadership Skills - Relationship-building: Fostering strong relationships with constituents, staff, and other officials. - Teamwork: Collaborating effectively with others to achieve common goals. - Emotional maturity: Managing her/his emotions and reactions to challenging situations. - Critical thinking: Making informed, well-reasoned decisions that consider multiple perspectives. - Communication: Listening actively and communicating clearly and respectfully with constituents and staff. 3- Accountability and Transparency - Transparency: Providing clear and timely information about her/his actions and decisions. - Accountability: Taking responsibility for her/his mistakes and being answerable to her/his constituents. - Respect for staff and constituents: Valuing and respecting the time, expertise, and contributions of others. By embodying these characteristics and principles, an elected official can build trust, foster collaboration, and make informed decisions that benefit her/his constituents and communities. 1- Core Qualities - Honesty: Being truthful and transparent in her/his words and actions, even when it's difficult. - Integrity: Adhering to moral and ethical principles, and maintaining a strong moral compass. - Compassion: Understanding and empathizing with the needs and struggles of her/his constituents. - Confidence: Having faith in her/his abilities and decisions, while also being open to feedback and criticism. - Flexibility: Being able to adapt to changing circumstances and find common ground with others. 2- Leadership Skills - Relationship-building: Fostering strong relationships with constituents, staff, and other officials. - Teamwork: Collaborating effectively with others to achieve common goals. - Emotional maturity: Managing her/his emotions and reactions to challenging situations. - Critical thinking: Making informed, well-reasoned decisions that consider multiple perspectives. - Communication: Listening actively and communicating clearly and respectfully with constituents and staff. 3- Accountability and Transparency - Transparency: Providing clear and timely information about her/his actions and decisions. - Accountability: Taking responsibility for her/his mistakes and being answerable to her/his constituents. - Respect for staff and constituents: Valuing and respecting the time, expertise, and contributions of others. What qualities do you possess that you believe would make you a successful officeholder? Honesty, Loyalty, Integrity, Professionalism, Dedication, Commitment, Patience, Perseverance and Persistence. What do you believe are the core responsibilities for someone elected to this office? As a chief executive of a metropolitan city, a mayor's core responsibilities typically include: 1- Economic Development Job creation and business growth Economic diversification Infrastructure development 2- Fiscal Management Budgeting and financial planning Revenue generation Debt management 3- Public Safety and Health Law enforcement and emergency services Public health initiatives Disaster preparedness and response 4- Education and Community Development Education partnerships Community engagement and outreach Neighborhood revitalization 5- Environmental Sustainability and Infrastructure Environmental protection Transportation and mobility Urban planning and development 6- International Relations and Tourism Diplomatic relations Tourism development Global competitiveness 7- Accountability and Transparency Open government initiatives Ethics and integrity Performance metrics and evaluation By focusing on these core responsibilities, a mayor can effectively lead a metropolitan city, driving economic growth, improving quality of life, and ensuring a sustainable future for its citizens. 1- Economic Development Job creation and business growth Economic diversification Infrastructure development 2- Fiscal Management Budgeting and financial planning Revenue generation Debt management 3- Public Safety and Health Law enforcement and emergency services Public health initiatives Disaster preparedness and response 4- Education and Community Development Education partnerships Community engagement and outreach Neighborhood revitalization 5- Environmental Sustainability and Infrastructure Environmental protection Transportation and mobility Urban planning and development 6- International Relations and Tourism Diplomatic relations Tourism development Global competitiveness 7- Accountability and Transparency Open government initiatives Ethics and integrity Performance metrics and evaluation What legacy would you like to leave? Be who you are, you get what you want! What is the first historical event that happened in your lifetime that you remember? How old were you at the time? The Independence of Timor-Leste, when I was assigned from UNHQ in New York to go on a UN Peacekeeping Mission. I was in charge of the UN VIP Flight Safety of the UN Secretary-General Kofi Annan. I was 30 years old. What was your very first job? How long did you have it? Flight Attendant: On-Job Training for few months. What is your favorite book? Why? My favorite book is “On Becoming a Leader” by Warren Bennis, because it explores the qualities that define an effective leader and offers insights into self-awareness, vision and integrity. If you could be any fictional character, who would you want to be? Eagle. What was the last song that got stuck in your head? “Kendim düştüm kalkabilirim” by Sibel Can. What is something that has been a struggle in your life? Combating Gender"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "Inequality. A mayor is a leader in his or her city. What does that mean to you? A mayor is the highest-ranking official in a municipal government, responsible for overseeing the day-to-day administration of the city. This leader is essentially the chief executive officer, ensuring the smooth operation of city services, infrastructure, and policies. The mayor's duties can vary depending on the city charter, local laws, and customs. However, common responsibilities include: - Appointing and overseeing municipal managers and employees: The mayor selects key personnel to manage various city departments. - Providing basic governmental services: This includes ensuring public safety, maintaining infrastructure, and providing essential services like water and sanitation. - Executing laws and ordinances: The mayor enforces local laws and regulations, working closely with the city council and other stakeholders. - Representing the city: As the official representative, the mayor promotes the city's interests, fosters partnerships, and engages with citizens. In terms of governance structure, mayors can be either directly elected by citizens or selected by the city council. The mayor's term length also varies, typically ranging from two to six years. Overall, a mayor plays a vital role in shaping the city's vision, policies, and services, working collaboratively with the city council, citizens, and other stakeholders to build a thriving community. The mayor's duties can vary depending on the city charter, local laws, and customs. However, common responsibilities include: - Appointing and overseeing municipal managers and employees: The mayor selects key personnel to manage various city departments. - Providing basic governmental services: This includes ensuring public safety, maintaining infrastructure, and providing essential services like water and sanitation. - Executing laws and ordinances: The mayor enforces local laws and regulations, working closely with the city council and other stakeholders. - Representing the city: As the official representative, the mayor promotes the city's interests, fosters partnerships, and engages with citizens. In terms of governance structure, mayors can be either directly elected by citizens or selected by the city council. The mayor's term length also varies, typically ranging from two to six years. If the mayor in your city is a member of the city council and there's a city manager appointed to handle the day-to-day administration of the city government, what do you believe should be the mayor's top priority in office? If the mayor is a member of the city council and there is a city manager appointed to handle the day-to-day administration of the city government, the mayor's top priority in office would likely be: 1- Legislative Leadership - Policy development: Focus on developing and implementing policies that align with the city's strategic goals and priorities. - Council leadership: Provide leadership and guidance to the city council, facilitating collaboration and consensus-building among council members. - Community engagement: Engage with citizens, businesses, and community organizations to understand their needs, concerns, and priorities. 2- Strategic Visioning - Long-term planning: Work with the city council, city manager, and stakeholders to develop and implement a long-term vision for the city. - Goal setting: Establish clear goals and objectives for the city, aligning with the strategic plan. - Performance monitoring: Oversee the city's progress toward its goals, making adjustments as needed. 3- Representation and Advocacy - Representing the city: Serve as the official representative of the city, promoting its interests and image. - Advocating for the city: Advocate for the city's needs and interests at the regional, state, and national levels. - Building partnerships: Foster partnerships with other governments, businesses, and organizations to support the city's goals and priorities. By focusing on legislative leadership, strategic visioning, and representation and advocacy, the mayor can provide effective leadership and guidance to the city council and city manager, ensuring the city achieves its goals and priorities. 1- Legislative Leadership - Policy development: Focus on developing and implementing policies that align with the city's strategic goals and priorities. - Council leadership: Provide leadership and guidance to the city council, facilitating collaboration and consensus-building among council members. - Community engagement: Engage with citizens, businesses, and community organizations to understand their needs, concerns, and priorities. 2- Strategic Visioning - Long-term planning: Work with the city council, city manager, and stakeholders to develop and implement a long-term vision for the city. - Goal setting: Establish clear goals and objectives for the city, aligning with the strategic plan. - Performance monitoring: Oversee the city's progress toward its goals, making adjustments as needed. 3- Representation and Advocacy - Representing the city: Serve as the official representative of the city, promoting its interests"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "and image. - Advocating for the city: Advocate for the city's needs and interests at the regional, state, and national levels. - Building partnerships: Foster partnerships with other governments, businesses, and organizations to support the city's goals and priorities. If the mayor in your city is not a member of the city council and oversees the day-to-day administration of the city government, what do you believe is the ideal relationship between the mayor and city council? If the mayor is not a member of the city council and oversees the day-to-day administration of the city government, the ideal relationship between the mayor and the city council would be: 1- Separation of Powers with Collaboration - Clear distinction of roles: The mayor focuses on executive responsibilities, while the city council exercises legislative authority. - Respectful communication: Regular, open dialogue to ensure mutual understanding of goals, challenges, and priorities. - Collaborative problem-solving: Working together to address complex city challenges, such as budgeting, public safety, and infrastructure development. 2- Checks and Balances - Council oversight: The city council provides oversight of the mayor's administration, ensuring accountability and transparency. - Mayoral veto power: The mayor has the authority to veto council decisions, with the council having the option to override the veto. - Balanced decision-making: Both the mayor and city council contribute to decision-making processes, preventing any one entity from dominating. 3- Supportive but Independent - Independent decision-making: The city council maintains its independence to make decisions, ask questions, and provide oversight. - Mayoral support: The mayor provides guidance, resources, and expertise to support the council's decision-making process. - Citizen engagement: Both the mayor and city council collaborate to promote citizen participation, engagement, and feedback. By maintaining a balance of power, respecting each other's roles, and collaborating on key issues, the mayor and city council can work together effectively to serve the city's best interests. 1- Separation of Powers with Collaboration - Clear distinction of roles: The mayor focuses on executive responsibilities, while the city council exercises legislative authority. - Respectful communication: Regular, open dialogue to ensure mutual understanding of goals, challenges, and priorities. - Collaborative problem-solving: Working together to address complex city challenges, such as budgeting, public safety, and infrastructure development. 2- Checks and Balances - Council oversight: The city council provides oversight of the mayor's administration, ensuring accountability and transparency. - Mayoral veto power: The mayor has the authority to veto council decisions, with the council having the option to override the veto. - Balanced decision-making: Both the mayor and city council contribute to decision-making processes, preventing any one entity from dominating. 3- Supportive but Independent - Independent decision-making: The city council maintains its independence to make decisions, ask questions, and provide oversight. - Mayoral support: The mayor provides guidance, resources, and expertise to support the council's decision-making process. - Citizen engagement: Both the mayor and city council collaborate to promote citizen participation, engagement, and feedback. What do you love most about your city? New York City, one of the world's most iconic and beloved cities, has countless attributes that captivate people's hearts. Here are some of the top things people love about New York City: 1- Diversity and Inclusivity - Cultural melting pot: NYC is home to people from diverse backgrounds, cultures, and ethnicities, making it a vibrant and inclusive city. - Global cuisine: The city offers an unparalleled culinary experience, with a wide range of international cuisines and dining options. 2- Iconic Landmarks and Attractions - Statue of Liberty and Ellis Island: These iconic symbols of freedom and opportunity are a must-visit for many. - Central Park: This 843-acre green oasis in the heart of Manhattan provides a peaceful escape from the hustle and bustle. - Times Square: The bright lights, giant billboards, and lively atmosphere make it a thrilling destination. - Museums and galleries: NYC is home to some of the world's most renowned museums, such as the Met, MoMA, and the Guggenheim. 3- Entertainment and Performing Arts - Broadway shows: NYC's theater scene is unmatched, with dozens of world-class productions to choose from. - Music venues: From iconic spots like Madison Square Garden and Carnegie Hall to smaller clubs and bars, NYC has a thriving music scene. - Comedy clubs: The city is famous for its comedy clubs, where many famous comedians got their start. 4- Energy and Opportunity - Fast-paced and dynamic: NYC's energy is infectious, with endless opportunities to explore, learn, and grow. - Career opportunities: The city is a hub for various industries, including finance,"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "media, art, and technology. - Networking: NYC's diverse population and numerous events provide ample opportunities to connect with people from all walks of life. 5- Neighborhoods and Architecture - Unique neighborhoods: From trendy areas like Williamsburg and Greenwich Village to historic districts like Harlem 1- Diversity and Inclusivity - Cultural melting pot: NYC is home to people from diverse backgrounds, cultures, and ethnicities, making it a vibrant and inclusive city. - Global cuisine: The city offers an unparalleled culinary experience, with a wide range of international cuisines and dining options. 2- Iconic Landmarks and Attractions - Statue of Liberty and Ellis Island: These iconic symbols of freedom and opportunity are a must-visit for many. - Central Park: This 843-acre green oasis in the heart of Manhattan provides a peaceful escape from the hustle and bustle. - Times Square: The bright lights, giant billboards, and lively atmosphere make it a thrilling destination. - Museums and galleries: NYC is home to some of the world's most renowned museums, such as the Met, MoMA, and the Guggenheim. 3- Entertainment and Performing Arts - Broadway shows: NYC's theater scene is unmatched, with dozens of world-class productions to choose from. - Music venues: From iconic spots like Madison Square Garden and Carnegie Hall to smaller clubs and bars, NYC has a thriving music scene. - Comedy clubs: The city is famous for its comedy clubs, where many famous comedians got their start. 4- Energy and Opportunity - Fast-paced and dynamic: NYC's energy is infectious, with endless opportunities to explore, learn, and grow. - Career opportunities: The city is a hub for various industries, including finance, media, art, and technology. - Networking: NYC's diverse population and numerous events provide ample opportunities to connect with people from all walks of life. 5- Neighborhoods and Architecture What do you perceive to be your city's greatest challenges over the next decade? These are contributing factors that lead to envisioning NYC’s greatest challenges over the next decade: 1- Demographic Challenges - Population growth or decline: Managing infrastructure, services, and resources to accommodate changing population dynamics. - Aging population: Addressing the needs of older adults, such as healthcare, transportation, and social services. - Diversity and inclusion: Fostering a welcoming environment for diverse populations, including racial, ethnic, and LGBTQ+ communities. 2- Economic Challenges - Job creation and employment: Attracting businesses, creating jobs, and ensuring a skilled workforce. - Affordable housing: Providing affordable housing options for low- and moderate-income residents. - Economic inequality: Addressing income disparities and ensuring equal access to opportunities. 3- Environmental Challenges - Climate change: Mitigating the effects of climate change, such as sea-level rise, extreme weather events, and heat islands. - Sustainability: Implementing environmentally friendly practices, reducing waste, and promoting green infrastructure. - Water management: Ensuring access to clean water, managing wastewater, and addressing flood risks. 4- Infrastructure Challenges - Transportation: Developing efficient, safe, and accessible transportation systems, including public transit, pedestrian, and cycling infrastructure. - Public facilities: Maintaining and upgrading public facilities, such as schools, hospitals, and community centers. - Digital infrastructure: Ensuring reliable, high-speed internet access and modern digital infrastructure. 5- Social Challenges - Public health: Addressing health disparities, improving access to healthcare, and promoting healthy lifestyles. - Education: Providing high-quality education, addressing achievement gaps, cultural diversity and social equity. 1- Demographic Challenges - Population growth or decline: Managing infrastructure, services, and resources to accommodate changing population dynamics. - Aging population: Addressing the needs of older adults, such as healthcare, transportation, and social services. - Diversity and inclusion: Fostering a welcoming environment for diverse populations, including racial, ethnic, and LGBTQ+ communities. 2- Economic Challenges - Job creation and employment: Attracting businesses, creating jobs, and ensuring a skilled workforce. - Affordable housing: Providing affordable housing options for low- and moderate-income residents. - Economic inequality: Addressing income disparities and ensuring equal access to opportunities. 3- Environmental Challenges - Climate change: Mitigating the effects of climate change, such as sea-level rise, extreme weather events, and heat islands. - Sustainability: Implementing environmentally friendly practices, reducing waste, and promoting green infrastructure. - Water management: Ensuring access to clean water, managing wastewater, and addressing flood risks. 4- Infrastructure Challenges - Transportation: Developing efficient, safe, and accessible transportation systems, including public transit, pedestrian, and cycling infrastructure. - Public facilities: Maintaining and upgrading public facilities, such as schools, hospitals, and community centers. - Digital infrastructure: Ensuring reliable, high-speed internet access and modern digital infrastructure. 5- Social Challenges - Public health: Addressing health disparities, improving access to healthcare, and promoting healthy lifestyles. What do you believe"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "is the ideal relationship between your city and the state government? Cooperation and Collaboration -Clear communication: Open dialogue to ensure mutual understanding of needs, goals and challenges. -Partnership: Collaborative approach to address shared priorities: economic development, transportation and public safety. -Respect for roles: Recognition of each level of government's responsibilities and expertise, avoiding duplication of efforts. Support and Resources -State funding: Timely and sufficient allocation of funds for authorized programs and projects. -Technical assistance: Provision of expertise, guidance and training to support city initiatives. -Access to state programs: Cities should have access to state programs, services and resources that support local priorities. -Regional Coordination: Collaboration on transportation, economic development and environmental protection. Flexibility and Autonomy -Local control: Cities should have flexibility to make decisions and implement solutions tailored to their unique needs. -Minimal regulatory burden: State regulations should be streamlined, and cities should be given latitude to innovate and experiment. -Adaptability: State policies and programs should be adaptable to changing local circumstances. -Data sharing: Best practices to inform policy decisions and improve service delivery. Accountability and Transparency -Clear expectations: State government should clearly communicate expectations, requirements, and timelines. -Performance metrics: Establishing measurable goals and outcomes to evaluate program effectiveness. -Regular evaluation: Periodic assessment of state programs and policies to ensure they remain relevant and effective. Dispute Resolution -Open communication: Establishing channels for resolving conflicts and addressing concerns. -Mediation: Using neutral third-party mediators to resolve disputes. -Flexibility: Willingness to negotiate and find mutually beneficial solutions. -Emergency preparedness: Coordination on disaster relief. -Clear communication: Open dialogue to ensure mutual understanding of needs, goals and challenges. -Partnership: Collaborative approach to address shared priorities: economic development, transportation and public safety. -Respect for roles: Recognition of each level of government's responsibilities and expertise, avoiding duplication of efforts. Support and Resources -State funding: Timely and sufficient allocation of funds for authorized programs and projects. -Technical assistance: Provision of expertise, guidance and training to support city initiatives. -Access to state programs: Cities should have access to state programs, services and resources that support local priorities. -Regional Coordination: Collaboration on transportation, economic development and environmental protection. Flexibility and Autonomy -Local control: Cities should have flexibility to make decisions and implement solutions tailored to their unique needs. -Minimal regulatory burden: State regulations should be streamlined, and cities should be given latitude to innovate and experiment. -Adaptability: State policies and programs should be adaptable to changing local circumstances. -Data sharing: Best practices to inform policy decisions and improve service delivery. Accountability and Transparency -Clear expectations: State government should clearly communicate expectations, requirements, and timelines. -Performance metrics: Establishing measurable goals and outcomes to evaluate program effectiveness. -Regular evaluation: Periodic assessment of state programs and policies to ensure they remain relevant and effective. Dispute Resolution -Open communication: Establishing channels for resolving conflicts and addressing concerns. -Mediation: Using neutral third-party mediators to resolve disputes. -Flexibility: Willingness to negotiate and find mutually beneficial solutions. What do you believe is the ideal relationship between your city and the federal government? Cooperation and Collaboration: - Clear communication: Honest and open dialogue to ensure mutual understanding of needs, goals and challenges. - Partnership: Collaborative approach to address shared priorities such as infrastructure development, public safety and economic growth. - Respect for roles: Recognition of each level of government's responsibilities and expertise, avoiding duplication of efforts. Support and Resources: - Federal funding: Timely and sufficient allocation of funds for authorized programs and projects. - Technical assistance: Provision of expertise, guidance, and training to support city initiatives. - Access to federal programs: Cities should have access to federal programs, services and resources that support local priorities. Flexibility and Autonomy: - Local control: Cities should have the flexibility to make decisions and implement solutions tailored to their unique needs. - Minimal regulatory burden: Federal regulations should be streamlined, and cities should be given latitude to innovate and experiment. - Adaptability: Federal policies and programs should be adaptable to changing local circumstances. Accountability and Transparency: - Clear expectations: Federal government should clearly communicate expectations, requirements and timelines. - Performance metrics: Establishing measurable goals and outcomes to evaluate program effectiveness. - Regular evaluation: Periodic assessment of federal programs and policies to ensure they remain relevant and effective. Dispute Resolution: - Open communication: Establishing channels for resolving conflicts and addressing concerns. - Mediation: Using neutral third-party mediators to resolve disputes. - Flexibility: Willingness to negotiate and find mutually beneficial solutions. - Clear communication: Honest and open dialogue to ensure mutual understanding of needs, goals and challenges. - Partnership: Collaborative approach to address shared"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "priorities such as infrastructure development, public safety and economic growth. - Respect for roles: Recognition of each level of government's responsibilities and expertise, avoiding duplication of efforts. Support and Resources: - Federal funding: Timely and sufficient allocation of funds for authorized programs and projects. - Technical assistance: Provision of expertise, guidance, and training to support city initiatives. - Access to federal programs: Cities should have access to federal programs, services and resources that support local priorities. Flexibility and Autonomy: - Local control: Cities should have the flexibility to make decisions and implement solutions tailored to their unique needs. - Minimal regulatory burden: Federal regulations should be streamlined, and cities should be given latitude to innovate and experiment. - Adaptability: Federal policies and programs should be adaptable to changing local circumstances. Accountability and Transparency: - Clear expectations: Federal government should clearly communicate expectations, requirements and timelines. - Performance metrics: Establishing measurable goals and outcomes to evaluate program effectiveness. - Regular evaluation: Periodic assessment of federal programs and policies to ensure they remain relevant and effective. Dispute Resolution: - Open communication: Establishing channels for resolving conflicts and addressing concerns. - Mediation: Using neutral third-party mediators to resolve disputes. Tell us your favorite joke. What is the best thing about Switzerland? Its flag is a big plus! What do you believe is the ideal relationship between the mayor's office and law enforcement? This relationship fosters a collaborative environment promoting public safety, justice and community well-being; it is based on: Mutual Respect and Trust: - Clear communication: Open and transparent communication to ensure both parties are informed. - Respect for roles: Avoiding interference or micromanaging, and respecting each other's responsibilities. - Collaborative problem-solving: Working together to address public safety concerns. Community-Focused Policing: - Community engagement: Engaging with the community to understand concerns, build trust and promote safety. - Data-driven decision-making: Using data and research to inform policing strategies. - Accountability and transparency: Ensuring law enforcement accountability and transparency in policies and practices. Support and Resources: - Adequate funding: Ensuring sufficient funding for law enforcement operations, training, and equipment. - Training and development: Providing regular training and professional development opportunities. - Mental health support: Recognizing emotional demands and providing access to mental health resources. Oversight and Accountability: - Independent review: Establishing an independent review process for complaints against law enforcement. - Policy oversight*: Providing oversight of law enforcement policies, ensuring alignment with community values. - Transparency in discipline: Ensuring fair, transparent and communicated disciplinary actions. Mutual Respect and Trust: - Clear communication: Open and transparent communication to ensure both parties are informed. - Respect for roles: Avoiding interference or micromanaging, and respecting each other's responsibilities. - Collaborative problem-solving: Working together to address public safety concerns. Community-Focused Policing: - Community engagement: Engaging with the community to understand concerns, build trust and promote safety. - Data-driven decision-making: Using data and research to inform policing strategies. - Accountability and transparency: Ensuring law enforcement accountability and transparency in policies and practices. Support and Resources: - Adequate funding: Ensuring sufficient funding for law enforcement operations, training, and equipment. - Training and development: Providing regular training and professional development opportunities. - Mental health support: Recognizing emotional demands and providing access to mental health resources. Oversight and Accountability: - Independent review: Establishing an independent review process for complaints against law enforcement. - Policy oversight*: Providing oversight of law enforcement policies, ensuring alignment with community values. What organizations or individuals have endorsed your campaign? None. What are your views on financial transparency and government accountability? These are my views of financial transparency and government accountability and which I prioritize: - Complete transparency: All financial information, including budgets, expenditures, and contracts, should be easily accessible, clear, and understandable to the public. - Real-time disclosure: Financial information should be disclosed in real-time, allowing citizens to stay informed and hold officials accountable. - Independent oversight: Independent bodies, such as auditors or watchdog agencies, should be established to monitor government finances and ensure accountability. - Citizen participation: Citizens should be encouraged to participate in the budgeting process, provide input on financial decisions, and engage in oversight. - Accountability mechanisms: Strong accountability mechanisms, such as penalties for non-compliance or mismanagement, should be in place to ensure officials are held responsible. - Protection for whistleblowers: Whistleblowers who report financial irregularities or misconduct should be protected from retaliation. - Regular audits and evaluations: Regular audits and evaluations should be conducted to ensure financial management is effective, efficient, and transparent. - Open data initiatives: Governments should adopt open data initiatives, making"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "financial data available in machine-readable formats to facilitate analysis and scrutiny. - Clear and concise communication: Financial information should be communicated clearly and concisely, avoiding technical jargon and ensuring accessibility for all citizens. - Continuous improvement: Governments should commit to continuous improvement, regularly assessing and refining their financial transparency and accountability practices. By embracing these principles, governments can demonstrate their commitment to transparency, accountability, and ethical governance, ultimately strengthening trust and promoting a more informed and engaged citizenry. - Complete transparency: All financial information, including budgets, expenditures, and contracts, should be easily accessible, clear, and understandable to the public. - Real-time disclosure: Financial information should be disclosed in real-time, allowing citizens to stay informed and hold officials accountable. - Independent oversight: Independent bodies, such as auditors or watchdog agencies, should be established to monitor government finances and ensure accountability. - Citizen participation: Citizens should be encouraged to participate in the budgeting process, provide input on financial decisions, and engage in oversight. - Accountability mechanisms: Strong accountability mechanisms, such as penalties for non-compliance or mismanagement, should be in place to ensure officials are held responsible. - Protection for whistleblowers: Whistleblowers who report financial irregularities or misconduct should be protected from retaliation. - Regular audits and evaluations: Regular audits and evaluations should be conducted to ensure financial management is effective, efficient, and transparent. - Open data initiatives: Governments should adopt open data initiatives, making financial data available in machine-readable formats to facilitate analysis and scrutiny. - Clear and concise communication: Financial information should be communicated clearly and concisely, avoiding technical jargon and ensuring accessibility for all citizens. - Continuous improvement: Governments should commit to continuous improvement, regularly assessing and refining their financial transparency and accountability practices. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate Mayor of New York Facebook Twitter Candidate Mayor of New York Facebook Twitter Personal Twitter Instagram LinkedIn Personal Twitter Instagram LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 7, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 7, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Mayor of New York candidate, 2025 Municipal candidate, 2025 Municipal candidates New York Republican Party Ballotpedia features 604,608 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About"
  },
  {
    "candidate": "Nouinou, Fatimazohra",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/F%C3%A1timaz%C3%B6hra_Nouinou",
    "text": "Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]