[
  {
    "candidate": "Nurse, Sandy",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/sandy-nurse/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 37 Sandy Nurse Bushwick (West), Bushwick (East), The Evergreens Cemetery, Cypress Hills, East New York (North), East New York-City Line, Highland Park-Cypress Hills Cemeteries (South), Ocean Hill, Brownsville Biography Sandy Nurse represents the 37th Council District, which includes neighborhoods of Bushwick, Brownsville, Cypress Hills, Cityline and East New York. She currently serves as the Chair of the Committee on Criminal Justice and was formerly Chair of the Committee on Sanitation and Solid Waste Management. Born in Panama, Sandy’s parents were active service members in the U.S. Military and subsequently she was raised all over the world living on or near U.S. Military bases. Sandy’s global upbringing exposed her stark poverty and inequality, particularly for women and girls. Those experiences inspired her to join movements for social and racial justice and dedicate her life to humanitarian work. Prior to being elected to the City Council, Sandy worked for the Department of Defense and the United Nations World Food Programme. She later founded BK ROT, an environmental justice youth jobs program, and co-founded Mayday Space, a grassroots organizing center in her district. Sandy also worked as a carpenter and carpentry instructor for many years, hosting workshops for women, youth and LGTBQ folks interested in power tools. She built large scale farms at Howard Houses, Wagner Houses and Bayview Houses in NYCHA developments with Green City Force. She also served on Brooklyn Community Board 4. Sandy’s priorities are improving the health and well-being of the communities she represents. She’s focused on housing for all, high quality public education, increasing public safety and fighting for a livable, sustainable and resilient New York City. Read Sandy’s 2024-2025 District Agenda here . Biography Sandy Nurse represents the 37th Council District, which includes neighborhoods of Bushwick, Brownsville, Cypress Hills, Cityline and East New York. She currently serves as the Chair of the Committee on Criminal Justice and was formerly Chair of the Committee on Sanitation and Solid Waste Management. Sandy Nurse represents the 37th Council District, which includes neighborhoods of Bushwick, Brownsville, Cypress Hills, Cityline and East New York. She currently serves as the Chair of the Committee on Criminal Justice and was formerly Chair of the Committee on Sanitation and Solid Waste Management. Born in Panama, Sandy’s parents were active service members in the U.S. Military and subsequently she was raised all over the world living on or near U.S. Military bases. Sandy’s global upbringing exposed her stark poverty and inequality, particularly for women and girls. Those experiences inspired her to join movements for social and racial justice and dedicate her life to humanitarian work. Born in Panama, Sandy’s parents were active service members in the U.S. Military and subsequently she was raised all over the world living on or near U.S. Military bases. Sandy’s global upbringing exposed her stark poverty and inequality, particularly for women and girls. Those experiences inspired her to join movements for social and racial justice and dedicate her life to humanitarian work. Prior to being elected to the City Council, Sandy worked for the Department of Defense and the United Nations World Food Programme. She later founded BK ROT, an environmental justice youth jobs program, and co-founded Mayday Space, a grassroots organizing center in her district. Sandy also worked as a carpenter and carpentry instructor for many years, hosting workshops for women, youth and LGTBQ folks interested in power tools. She built large scale farms at Howard Houses, Wagner Houses and Bayview Houses in NYCHA developments with Green City Force. She also served on Brooklyn Community Board 4. Prior to being elected to the City Council, Sandy worked for the Department of Defense and the United Nations World Food Programme. She later founded BK ROT, an environmental justice youth jobs program, and co-founded Mayday Space, a grassroots organizing center in her district. Sandy also worked as a carpenter and carpentry instructor for many years, hosting workshops for women, youth and LGTBQ folks interested in power tools. She built large scale farms at Howard Houses, Wagner Houses and Bayview Houses in NYCHA developments with Green City Force. She also served on Brooklyn Community Board 4. Sandy’s priorities are improving the health and well-being of the communities she represents. She’s focused on housing for all, high quality public education, increasing public safety and fighting for a livable, sustainable and resilient New York City. Sandy’s priorities are improving the health and well-being"
  },
  {
    "candidate": "Nurse, Sandy",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/sandy-nurse/",
    "text": "of the communities she represents. She’s focused on housing for all, high quality public education, increasing public safety and fighting for a livable, sustainable and resilient New York City. Read Sandy’s 2024-2025 District Agenda here . Read Sandy’s 2024-2025 District Agenda here . Biography Staff Directory Press Releases Newsletter Signup and Volunteer Form 2024-2025 Agenda District Office 56 Pennsylvania Ave Brooklyn, NY 11207 Phone: 718-642-8664 Legislative Office 250 Broadway, Suite 1823 New York, NY 10007 Phone: 212-788-7284 Fax: 212-227-5636 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Nurse, Sandy",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/sandy-nurse/pb/12/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 37 Sandy Nurse Bushwick (West), Bushwick (East), The Evergreens Cemetery, Cypress Hills, East New York (North), East New York-City Line, Highland Park-Cypress Hills Cemeteries (South), Ocean Hill, Brownsville Participatory Budgeting Cycle 12 Learn more about PBNYC How would you spend $1M? What changes would you like to see? Anyone is welcome to propose ideas for any participating district. Submit your ideas online, through the idea collection map before October 17th. View the ideas map Want to volunteer? Delegates, Facilitators, and Poll Workers make the real work of democracy possible. Learn more about how you can participate . Or sign up to volunteer . Biography Staff Directory Press Releases Newsletter Signup and Volunteer Form 2024-2025 Agenda District Office 56 Pennsylvania Ave Brooklyn, NY 11207 Phone: 718-642-8664 Legislative Office 250 Broadway, Suite 1823 New York, NY 10007 Phone: 212-788-7284 Fax: 212-227-5636 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]