[
  {
    "candidate": "Okporo, Edafe",
    "category": "Veterans & Military",
    "score": 4,
    "link": "https://jimowles.org/news/candidate-answers-to-joldc-edafe-okporo-for-city-council-district-7-2025",
    "text": "dedicated their life to serving immigrant communities, I bring a unique perspective to City Hall. Our campaign is committed to: Fully funding legal services for asylum seekers to ensure they have the representation and support they need to navigate our immigration system. Protecting New York City’s status as a sanctuary city, standing firm against Mayor Adams' policies that put migrant communities at risk, especially in light of the incoming Trump administration’s potential hostility toward immigrants. Investing in education programs that help migrant children integrate, giving them the tools to thrive and succeed in their new home. New York City has long been a beacon of hope for immigrants. I will fight to ensure it remains a place where everyone is treated with dignity and respect. 6. Will you seek or accept endorsements of individuals who oppose LGBTQ+ and reproductive rights, such as Ruben Diaz Sr., Fernando Cabrera or Erick Salgado? Will you pledge to denounce their homophobia and anti-choice positions in the event you receive an endorsement from such individuals? I will not seek or accept endorsements from anyone who opposes LGBTQ+ and reproductive rights, and I will denounce any such individuals and organizations. 7. In light of the upcoming Trump Administration’s war on women, the LGBTQ+ community, racial minorities and immigrants, what are your plans to organize and combat the Trump agenda? See my response to question 5. 8. Do you support the unrestricted right to reproductive care and abortion? Yes. 9. Have you hosted, funded or otherwise supported Drag Story Hours in your community? While I have not hosted a Drag Story Hour, I am proud to have the support of drag artist and LGBTQ+ activist Marti Allen-Cummings. 10. What proposals will do you support to increase the protection of immigrants and cement New York City’s status as a Sanctuary City? When I first moved to New York, I was homeless for three months–and I saw how new arrivals can slip through the cracks. First, based on my experience with Refuge America and Operation Allies Welcome, I propose creating a Welcome, Reception, and Integration Program that would help immigrants access services and integrate into our community. New York should also fund legal representation for immigrants to fight against mass deportations. We need to pass the New York for All Act at the state level, and we need to pass Intro 0214 to provide civil recourse to enforce New York City’s sanctuary city laws. There are other things we can do to help ensure that immigrants are not pushed into the prison system and put at risk of deportation. Outdated caps on street vendor permits dating back to the 1980s have led to a backlog of 10,000 applicants, leading to many vendors operating illegally. We must process this backlog to ensure that street vendors can operate their businesses. We must also ensure that our city’s deliveristas are not criminalized, instead focusing efforts at e-bike regulation on tech companies and businesses selling shoddy equipment. 11. How will you represent the most vulnerable, including individuals experiencing homelessness and asylum seekers? Have you ever opposed any shelter in your district? I have been concerned about the increase in support within the Democratic Party of the criminalization of homelessness. When I was released from the immigration detention center, I slept in Newark’s Penn Station; when I moved to New York, I was homeless for three months. I have seen how a lack of support can quickly result in someone becoming unhoused. We know that supportive housing is the most effective way to end homelessness. A housing first pilot in New York targeting veterans has almost completely eliminated veteran homelessness. And it is more cost-effective: supportive housing costs half as much as a shelter; it is just 5% of the cost of incarcerating someone on Rikers Island, and it is less than 2% of the cost of hospitalizing someone. As a councilmember, I would support legislation that would incentivize developers to create more supportive housing units. I also support increasing funding and resources for Intensive Mobile Treatment teams, which has the opportunity to build long-term relationships with the unhoused and those suffering from acute mental health crises. As someone who has run a shelter, I hope to use the oversight powers of the city council to also ensure that organizations that the city partners with are effectively helping those facing street homelessness. 12. If incumbent, are you a co-sponsor of Resolution 2970, introduced by Council Member Shahana Hanif? If not yet elected, will you"
  },
  {
    "candidate": "Okporo, Edafe",
    "category": "Veterans & Military",
    "score": 3,
    "link": "https://jimowles.org/news/candidate-answers-to-joldc-edafe-okporo-for-city-council-district-7-2025",
    "text": "also being compassionate towards those in need. We need to invest in community-oriented solutions that have been proven to make us all safer. I believe that we should drastically increase funding for the city’s mental health court program, which has been shown to reduce recidivism by as much as 50%. I also believe that the city’s Intensive Mobile Treatment teams show promise for reducing violent crime–but they have been plagued by a lack of oversight during the Adams administration. Providing people in need with permanent, supportive housing and mental health interventions isn’t just the right thing to do–it is also a fraction of the cost of incarcerating someone on Riker’s Island or sending someone to the emergency room. Immigration: As a former asylum seeker and someone who has dedicated their life to serving immigrant communities, I bring a unique perspective to City Hall. Our campaign is committed to: Fully funding legal services for asylum seekers to ensure they have the representation and support they need to navigate our immigration system. Fully funding legal services for asylum seekers to ensure they have the representation and support they need to navigate our immigration system. Protecting New York City’s status as a sanctuary city, standing firm against Mayor Adams' policies that put migrant communities at risk, especially in light of the incoming Trump administration’s potential hostility toward immigrants. Protecting New York City’s status as a sanctuary city, standing firm against Mayor Adams' policies that put migrant communities at risk, especially in light of the incoming Trump administration’s potential hostility toward immigrants. Investing in education programs that help migrant children integrate, giving them the tools to thrive and succeed in their new home. Investing in education programs that help migrant children integrate, giving them the tools to thrive and succeed in their new home. New York City has long been a beacon of hope for immigrants. I will fight to ensure it remains a place where everyone is treated with dignity and respect. 6. Will you seek or accept endorsements of individuals who oppose LGBTQ+ and reproductive rights, such as Ruben Diaz Sr., Fernando Cabrera or Erick Salgado? Will you pledge to denounce their homophobia and anti-choice positions in the event you receive an endorsement from such individuals? I will not seek or accept endorsements from anyone who opposes LGBTQ+ and reproductive rights, and I will denounce any such individuals and organizations. 7. In light of the upcoming Trump Administration’s war on women, the LGBTQ+ community, racial minorities and immigrants, what are your plans to organize and combat the Trump agenda? See my response to question 5. 8. Do you support the unrestricted right to reproductive care and abortion? Yes. 9. Have you hosted, funded or otherwise supported Drag Story Hours in your community? While I have not hosted a Drag Story Hour, I am proud to have the support of drag artist and LGBTQ+ activist Marti Allen-Cummings. 10. What proposals will do you support to increase the protection of immigrants and cement New York City’s status as a Sanctuary City? When I first moved to New York, I was homeless for three months–and I saw how new arrivals can slip through the cracks. First, based on my experience with Refuge America and Operation Allies Welcome, I propose creating a Welcome, Reception, and Integration Program that would help immigrants access services and integrate into our community. New York should also fund legal representation for immigrants to fight against mass deportations. We need to pass the New York for All Act at the state level, and we need to pass Intro 0214 to provide civil recourse to enforce New York City’s sanctuary city laws. There are other things we can do to help ensure that immigrants are not pushed into the prison system and put at risk of deportation. Outdated caps on street vendor permits dating back to the 1980s have led to a backlog of 10,000 applicants, leading to many vendors operating illegally. We must process this backlog to ensure that street vendors can operate their businesses. We must also ensure that our city’s deliveristas are not criminalized, instead focusing efforts at e-bike regulation on tech companies and businesses selling shoddy equipment. 11. How will you represent the most vulnerable, including individuals experiencing homelessness and asylum seekers? Have you ever opposed any shelter in your district? I have been concerned about the increase in support within the Democratic Party of the criminalization of homelessness. When I was released from the immigration detention center, I"
  },
  {
    "candidate": "Okporo, Edafe",
    "category": "Veterans & Military",
    "score": 2,
    "link": "https://jimowles.org/news/candidate-answers-to-joldc-edafe-okporo-for-city-council-district-7-2025",
    "text": "slept in Newark’s Penn Station; when I moved to New York, I was homeless for three months. I have seen how a lack of support can quickly result in someone becoming unhoused. We know that supportive housing is the most effective way to end homelessness. A housing first pilot in New York targeting veterans has almost completely eliminated veteran homelessness. And it is more cost-effective: supportive housing costs half as much as a shelter; it is just 5% of the cost of incarcerating someone on Rikers Island, and it is less than 2% of the cost of hospitalizing someone. As a councilmember, I would support legislation that would incentivize developers to create more supportive housing units. I also support increasing funding and resources for Intensive Mobile Treatment teams, which has the opportunity to build long-term relationships with the unhoused and those suffering from acute mental health crises. As someone who has run a shelter, I hope to use the oversight powers of the city council to also ensure that organizations that the city partners with are effectively helping those facing street homelessness. 12. If incumbent, are you a co-sponsor of Resolution 2970, introduced by Council Member Shahana Hanif? If not yet elected, will you promise to co-sponsor the resolution? The text urges the NYS Legislature to pass the New York for All Act, which would ensure state and local resources are not used to facilitate federal immigration enforcement. If not, please explain. I support this resolution (and the reintroduced Res 0714) and would co-sponsor it if elected. 13. If incumbent, are you a co-sponsor of Resolution 2917, introduced by Council Member Crystal Hudson? If not yet elected, will you promise to co-sponsor the resolution? The text endorses the Access to Representation Act, which would establish a “universal right to counsel” for indigent New Yorkers who are subject to removal proceedings under federal immigration law. If not, please explain. I support this resolution and would co-sponsor it if elected. 14. Will you join our efforts to pass legislation mandating the review of sentences of incarcerated individuals over the age of 55 who have served in excess of 15 years to determine if they warrant release? The legislation is commonly known as the New York Elder Parole Bill. Yes. 15. Do you oppose the death penalty? Yes. 16. Do you support outlawing solitary confinement? Yes. 17. Do you commit to visit constituents who are incarcerated? Will you work to secure the release of individuals who have demonstrated sincere remorse, worked toward rehabilitation and are not deemed a threat to society? Yes to both questions. One of my first connections to my district was while I was detained for 6 months at an immigration facility in New Jersey when I first immigrated to the US. Volunteers from Riverside Church would visit and write letters to detained asylum seekers, and it was one of the things that helped me to stay hopeful. 18. Do you commit to working to change our penal system toward a restorative rather than a retributive model of justice? Yes. 19. Do you commit to make applications for clemencies available to your constituency including a link to an application in a constituent newsletter? Will you submit it to our club? Yes. 20. Who did you support for mayor in the 2021 Democratic primary election? Maya Wiley 21. Which 2025 Democratic candidates have you removed from your consideration? Have you endorsed anyone? If so, who? I will not rank Eric Adams. I have not yet endorsed any mayoral candidate. 22. Do you support the renaming of the Ed Koch bridge and will you work towards the renaming including sponsoring such legislation? Yes. 23. What are your plans to address rent affordability in NYC? Did you vote for “City of Yes”? If not, please explain. While the City of Yes was a good start for creating more housing across New York City, we cannot build our way out of the affordability crisis. District 7 is already one of the densest parts of the city, and in 2023, District 7 only created 87 new units of affordable housing. More luxury developments with limited public housing in our neighborhood–like a recently approved building at 135th street–will not fix our housing crisis. I believe that we need to massively invest in existing social housing programs like Open Doors and Neighborhood Pillars to create more limited equity cooperatives like HDFCs and Mitchell-Lamas and to preserve existing affordable units - thousands of which in our district will"
  }
]