[
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Antirson_Ortiz",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Antirson Ortiz Antirson Ortiz Antirson Ortiz Democratic Party Candidate, New York City Council District 17 June 24, 2025 Education Samuel Gompers Vocational High School New York Institute of Technology, 2010 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Campaign YouTube Personal LinkedIn Antirson Ortiz ( Democratic Party ) is running for election to the New York City Council to represent District 17 . He is on the ballot in the Democratic primary on June 24, 2025 . Ortiz completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Antirson Ortiz was born in Santo Domingo, Dominican Republic. He earned a high school diploma from Samuel Gompers Vocational High School and a bachelor's degree from the New York Institute of Technology in 2010. His career experience includes working in government affairs. Ortiz has been affiliated with Phi Iota Alpha Fraternity, Inc. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 17 Antirson Ortiz , Freddy Perez Jr. , Justin Sanchez , and Elvis Santana are running in the Democratic primary for New York City Council District 17 on June 24, 2025. Candidate Antirson Ortiz Submit photo Freddy Perez Jr. Submit photo Justin Sanchez Elvis Santana There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Jasmine Uribe (D) Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Antirson Ortiz completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Ortiz's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Antirson Ortiz is an Afro-Dominican, born in the Dominican Republic and raised in the South Bronx. As a proud product of the public education system and a member of a family of educators, Ortiz has devoted his life to grassroots organizing and community service. He began his career as a Youth Counselor in the South Bronx and West Harlem, spearheading school-based initiatives designed to empower youth and connect families to essential community resources. Ortiz’s career in public service has been consistently driven by a commitment to uplifting others and strengthening his community. In addition to serving as the State Committeeman for the 85th NYS Assembly District, his extensive professional experience includes roles such as Office Manager for Assemblyman Marcos A. Crespo, Bronx Borough Liaison for former NYC Comptroller Scott M. Stringer, NYPD Auxiliary Police Officer, and his current position as Director of Constituent Services for NYC Comptroller Brad Lander. In each of these roles, Ortiz has played a pivotal role in resolving thousands of quality-of-life concerns, demonstrating his dedication to the people of the Bronx and the broader New York City community. With a deep-rooted passion for service, Antirson Ortiz remains committed to championing the values of empowerment, equality, and opportunity for all. As a proud product of the public education system and a member of a family of educators, Ortiz has devoted his life to grassroots organizing and community service. He began his career as a Youth Counselor in the South"
  },
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Antirson_Ortiz",
    "text": "Bronx and West Harlem, spearheading school-based initiatives designed to empower youth and connect families to essential community resources. Ortiz’s career in public service has been consistently driven by a commitment to uplifting others and strengthening his community. In addition to serving as the State Committeeman for the 85th NYS Assembly District, his extensive professional experience includes roles such as Office Manager for Assemblyman Marcos A. Crespo, Bronx Borough Liaison for former NYC Comptroller Scott M. Stringer, NYPD Auxiliary Police Officer, and his current position as Director of Constituent Services for NYC Comptroller Brad Lander. In each of these roles, Ortiz has played a pivotal role in resolving thousands of quality-of-life concerns, demonstrating his dedication to the people of the Bronx and the broader New York City community. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Building a Safer Community. As a South Bronx resident since 1997 and an NYPD Auxiliary Police Officer for nearly a decade, Antirson Ortiz recognizes the urgency of addressing rising crime. He is committed to investing in violence intervention and prevention programs while fostering stronger relationships between the community and law enforcement. Affordable Housing and Homeownership for all. Having grown up in an impoverished area of Santo Domingo, Dominican Republic, Antirson Ortiz deeply understands the fundamental importance of housing as a human right. Over his career, he has assisted thousands of constituents in seeking, maintaining, and navigating housing challenges. Aware of the rising cost of living and rent, Ortiz is committed to collaborating with developers, housing organizations, and policy experts to ensure meaningful investments are made, allowing Bronx residents to continue calling their borough home. Empowering our Youth and fighting for a better Educational System. For far too long, the Bronx has had a stigma of being last in education. As the son of two teachers, former youth counselor and founder of his own youth scholarship, Ortiz believes in investing and working with educators in the usage of more multi-systemic and evidence based approaches to target our educational crisis. Building a Safer Community. As a South Bronx resident since 1997 and an NYPD Auxiliary Police Officer for nearly a decade, Antirson Ortiz recognizes the urgency of addressing rising crime. He is committed to investing in violence intervention and prevention programs while fostering stronger relationships between the community and law enforcement. Affordable Housing and Homeownership for all. Having grown up in an impoverished area of Santo Domingo, Dominican Republic, Antirson Ortiz deeply understands the fundamental importance of housing as a human right. Over his career, he has assisted thousands of constituents in seeking, maintaining, and navigating housing challenges. Aware of the rising cost of living and rent, Ortiz is committed to collaborating with developers, housing organizations, and policy experts to ensure meaningful investments are made, allowing Bronx residents to continue calling their borough home. Empowering our Youth and fighting for a better Educational System. For far too long, the Bronx has had a stigma of being last in education. As the son of two teachers, former youth counselor and founder of his own youth scholarship, Ortiz believes in investing and working with educators in the usage of more multi-systemic and evidence based approaches to target our educational crisis. What areas of public policy are you personally passionate about? - Investing in violence intervention and prevention programs and addressing rising crime with proactive safety measures. - Affordable Housing and Homeownership for All. - Empowering Our Youth & Improving Education by investing in evidence-based educational reforms. - Caring for Our Seniors & Promoting Healthier Lifestyles. - Tackling food deserts and systemic health disparities. - Affordable Housing and Homeownership for All. - Empowering Our Youth & Improving Education by investing in evidence-based educational reforms. - Caring for Our Seniors & Promoting Healthier Lifestyles. What qualities does this office possess that makes it a unique and important part of the state government and legal system? The New York City Council is a unique legislative body that plays an essential role in state government while also shaping the nation’s progressive policies. Through oversight and accountability, it provides a vital system of checks and balances, ensuring fair representation for a broad and diverse population. Who do you look up to? Whose example would you like to follow, and why? I look up to my parents. After establishing their professional careers and lives, they made the difficult decision to sacrifice everything and leave their lives"
  },
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Antirson_Ortiz",
    "text": "behind in The Dominican Republic, all to bring my siblings and me to the United States in search of the American Dream. What characteristics or principles are most important for an elected official? Elected officials should demonstrate a unique level of integrity and honesty, which should be reflected in their leadership and vision for the future. They must communicate clearly while actively listening to and engaging with constituents, ensuring that their priorities are met with empathy and understanding. Leading with courage and decisiveness, they must remain dedicated to their commitment to public service, always acting in the best interest of those they represent. What qualities do you possess that you believe would make you a successful officeholder? As a proud product of the public school system, I have dedicated my life as a public servant to the purpose of helping residents of The Bronx and NYC. In addition to serving as the State Committeeman for the 85th NYS Assembly District, my extensive professional experience includes roles such as Office Manager for Assemblyman Marcos A. Crespo, Bronx Borough Liaison for former NYC Comptroller Scott M. Stringer, NYPD Auxiliary Police Officer, and serving as Director of Constituent Services for NYC Comptroller Brad Lander. In each of these roles, I have played a pivotal role in resolving thousands of quality-of-life concerns, demonstrating my dedication to the people of the Bronx and the broader New York City community. In addition to serving as the State Committeeman for the 85th NYS Assembly District, my extensive professional experience includes roles such as Office Manager for Assemblyman Marcos A. Crespo, Bronx Borough Liaison for former NYC Comptroller Scott M. Stringer, NYPD Auxiliary Police Officer, and serving as Director of Constituent Services for NYC Comptroller Brad Lander. What do you believe are the core responsibilities for someone elected to this office? The core responsibilities of elected officials should be to represent their constituents by creating legislation and policies that address community needs. They must collaborate with other officials and agencies to ensure the long-term growth and development of the city and state, creating sustainable progress for all. What legacy would you like to leave? A legacy of caring and helping others, rooted in the understanding that life can become more beautiful when you help those in need make their lives beautiful, too. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? The first historical event in my lifetime was when my parents had me sign papers to travel from The Dominican Republic to the USA. What was your very first job? How long did you have it? My first job in this country was through SYEP by The Department of Youth and Community Development. In this summer job, I was responsible for helping clean Bill Rainey Park in my community. What was the last song that got stuck in your head? A Change Is Gonna Come by Sam Cooke Are there any little-known powers or responsibilities held by this office that you believe more people should be aware of? Participatory Budgeting (PB) in the NYC Council is a democratic process, which members of the community should become more familiar with. It allows residents to directly decide how to spend part of the city's budget in their communities. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? It's imperative that holders of this office have a well-rounded experience, as it can greatly enhance their commitment to the community and lead to the creation of effective, well-informed policies and legislation What organizations or individuals have endorsed your campaign? Former NYC Comptroller Scott M. Stringer What are your views on financial transparency and government accountability? Financial transparency and government accountability are the foundation of a strong government. A transparent government ensures that the people, who have entrusted their leaders with power, can access clear, accurate, and timely information about how decisions are made and how money is being spend. This transparency builds trust and serves as a tool for accountability, which empowers citizens to hold their leaders responsible for their actions. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign"
  },
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Antirson_Ortiz",
    "text": "requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 17 Website Facebook Twitter Instagram YouTube Candidate New York City Council District 17 Website Facebook Twitter Instagram YouTube Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 3, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on February 3, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents"
  },
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Antirson_Ortiz",
    "text": "defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Ortiz, Antirson R",
    "category": "bio",
    "score": null,
    "link": "https://ortizforthebronx.com/",
    "text": "Home Our Story News Platform Gallery Volunteer Contact Home Our Story News Platform Gallery Volunteer Contact Donate Donate Ortiz for City Council “Renewing Hope, Building a Safer Bronx, and Empowering Opportunities for All” Click for Antirson's video Click for Antirson's video district 17 community issues Building a Safer Community Affordable and Low Income Housing for all Affordable Housing Empowering our Youth and a better Educational System Caring for Our Seniors and promoting a healthier lifestyle Supporting Jobs, Career Development, and Entrepreneurship Who is Antirson Ortiz? Antirson Ortiz serves as the State Committeeman for the 85th NYS Assembly District and NYC Director of Constituent Services at the Office of the Comptroller. As Director of Constituent Services, he oversees the public interface operations across all five boroughs, assisting thousands of families each year with quality-of-life concerns and navigating government processes. Ortiz is a proven leader ready to tackle our current challenges and invested in restoring hope to our community. Born in the Dominican Republic, Ortiz immigrated with his family to the South Bronx in the late 1990s. As a proud product of the public school system, he has dedicated his life as a public servant to the purpose of helping residents of The Bronx and NYC. Endorsed By Ortiz News Features Ortiz News Features News Features Healthy Lifestyle Gratitude Breakfast Read More Read More Schneps Media’s Bronx A List event celebrates borough’s leading men Read More Read More Five Boroughs Leadership Ceremony Read More Read More Latin American community leaders celebrated at fun-filled Latin Impact Awards Read More Read More donate donate Become a Volunteer antirson ortiz news make your plan to vote on June 24, 2025 Days Hours Minutes Seconds Follow Us Facebook-f Facebook-f Instagram Instagram Linkedin Linkedin 646-294-3300 ■ [email protected] [email protected] Paid for by Ortiz for The Bronx Designed by pantone graphic studio"
  }
]