[
  {
    "candidate": "Pacheco, Ricardo J",
    "category": "bio",
    "score": null,
    "link": "https://www.votepacheco.com/about-me",
    "text": "0 0 Open Menu Close Menu Open Menu Close Menu A Journey of Determination: Born in Nicaragua in 1965, Ricardo's mother sought a better life in New York, leaving Ricardo and his sister in the care of friends until their joyful reunion in 1978. Growing up in humble beginnings, Ricardo learned the value of hard work from a young age. While attending Hillcrest High School, he juggled academics with odd jobs to support his family. Recognizing the financial barriers to higher education, Ricardo enlisted in the United States Marine Corps after graduation. Serving his country proudly, he married his high school sweetheart and welcomed a daughter. Despite the challenges of military life, Ricardo treasures the lessons learned and the lifelong friendships forged. Service to Community: Upon returning to New York, Ricardo embarked on a journey of education and service. From his tenure as a security guard at Merrill Lynch to his role at The College Board, Ricardo's commitment to learning and growth never wavered. Inspired by his experiences, he pursued degrees in journalism and forensic psychology while awaiting his call to serve with the New York City Police Department. In 1993, Ricardo's dream was realized when he joined the NYPD. Assigned to the 73rd Precinct, he navigated the demands of law enforcement while balancing the responsibilities of single parenthood. Ricardo's dedication to his daughter mirrored the sacrifices made by his own mother, instilling in him a deep sense of empathy and compassion. A Champion for Change: Retiring from the NYPD in 2016, Ricardo remained active in his community, serving as President of his co-op board and advocating for cooperative initiatives. From organizing neighborhood events to leading discussions on community development, Ricardo's commitment to unity and inclusivity shone through. As President of the Jackson Heights Coops Alliance, Ricardo prioritized collaboration and transparency, empowering residents to have their voices heard. His dedication to amplifying community concerns extends to his involvement with the PTA and the SELFHELP/NORC Advisory Board, where he advocates for educational equity and senior support services. One of Us, For All of Us: Ricardo's journey from immigrant to public servant is a testament to his unwavering determination and steadfast commitment to community. With Ricardo Pacheco as our representative, we can trust that our voices will be heard, our concerns addressed, and our community strengthened! A Journey of Determination: Born in Nicaragua in 1965, Ricardo's mother sought a better life in New York, leaving Ricardo and his sister in the care of friends until their joyful reunion in 1978. Growing up in humble beginnings, Ricardo learned the value of hard work from a young age. While attending Hillcrest High School, he juggled academics with odd jobs to support his family. A Journey of Determination: Recognizing the financial barriers to higher education, Ricardo enlisted in the United States Marine Corps after graduation. Serving his country proudly, he married his high school sweetheart and welcomed a daughter. Despite the challenges of military life, Ricardo treasures the lessons learned and the lifelong friendships forged. Service to Community: Upon returning to New York, Ricardo embarked on a journey of education and service. From his tenure as a security guard at Merrill Lynch to his role at The College Board, Ricardo's commitment to learning and growth never wavered. Inspired by his experiences, he pursued degrees in journalism and forensic psychology while awaiting his call to serve with the New York City Police Department. In 1993, Ricardo's dream was realized when he joined the NYPD. Assigned to the 73rd Precinct, he navigated the demands of law enforcement while balancing the responsibilities of single parenthood. Ricardo's dedication to his daughter mirrored the sacrifices made by his own mother, instilling in him a deep sense of empathy and compassion. Service to Community: A Champion for Change: Retiring from the NYPD in 2016, Ricardo remained active in his community, serving as President of his co-op board and advocating for cooperative initiatives. From organizing neighborhood events to leading discussions on community development, Ricardo's commitment to unity and inclusivity shone through. As President of the Jackson Heights Coops Alliance, Ricardo prioritized collaboration and transparency, empowering residents to have their voices heard. His dedication to amplifying community concerns extends to his involvement with the PTA and the SELFHELP/NORC Advisory Board, where he advocates for educational equity and senior support services. A Champion for Change: One of Us, For All of Us: Ricardo's journey from immigrant to public servant is a testament to his unwavering determination and steadfast commitment to community. With Ricardo Pacheco"
  },
  {
    "candidate": "Pacheco, Ricardo J",
    "category": "bio",
    "score": null,
    "link": "https://www.votepacheco.com/about-me",
    "text": "as our representative, we can trust that our voices will be heard, our concerns addressed, and our community strengthened! One of Us, For All of Us: Unity. Integrity. Humanity."
  }
]