[
  {
    "candidate": "Perez Jr., Freddy",
    "category": "bio",
    "score": null,
    "link": "https://www.freddyperez2025.com/",
    "text": "0 0 English Open Menu Close Menu English Open Menu Close Menu English Back FREDDY PEREZ, JR. Learn More Democrat for New York City Council | Bronx District 17 Shared Values. Delivering for Us. Freddy Perez Jr. is a husband, father, veteran, small business owner, and longtime community advocate who knows firsthand what the South Bronx needs to thrive. From championing public safety to ensuring affordable housing and quality education, Freddy is committed to creating real opportunities and a brighter future for our neighborhoods. Meet the Candidate Affordable Housing | Safe Communities | Education Access | Good Jobs | Affordable Housing | Safe Communities | Education Access | Good Jobs | Affordable Housing | Safe Communities | Education Access | Good Jobs | ✓ Affordable Housing – Expanding options for seniors, veterans, and families. ✓ Safe Communities – Strengthening partnerships with law enforcement to create safer neighborhoods. ✓ Education Access – Increasing free afterschool and early childhood programs. ✓ Good Jobs – Combating the affordability crisis by driving local job creation. Visit the Gallery Learn More SUPPORT OUR CAMPAIGN DONATE TODAY FREDDY PEREZ, JR. FREDDY PEREZ, JR. Democrat for New York City Council | Bronx District 17 Democrat for New York City Council | Bronx District 17 Shared Values. Delivering for Us. Shared Values. Delivering for Us. Freddy Perez Jr. is a husband, father, veteran, small business owner, and longtime community advocate who knows firsthand what the South Bronx needs to thrive. From championing public safety to ensuring affordable housing and quality education, Freddy is committed to creating real opportunities and a brighter future for our neighborhoods. Affordable Housing | Safe Communities | Education Access | Good Jobs | Affordable Housing | Safe Communities | Education Access | Good Jobs | Affordable Housing | Safe Communities | Education Access | Good Jobs | Affordable Housing | Safe Communities | Education Access | Good Jobs | ✓ Affordable Housing – Expanding options for seniors, veterans, and families. ✓ Safe Communities – Strengthening partnerships with law enforcement to create safer neighborhoods. ✓ Education Access – Increasing free afterschool and early childhood programs. ✓ Good Jobs – Combating the affordability crisis by driving local job creation. SUPPORT OUR CAMPAIGN Subscribe Sign up with your email address to receive news and updates. Sign Up We respect your privacy."
  }
]