[
  {
    "candidate": "Pieters, Austin",
    "category": "bio",
    "score": null,
    "link": "https://ualbanysports.com/sports/mens-track-and-field/roster/austin-pieters/7261",
    "text": "University of Albany The official site of the ualbany great danes The official site of the ualbany Main Navigation Menu Sport Navigation Menu 2017-18 Track & Field - M Roster Choose a Player: Ball, James Banfield, Myles Baptiste, Kyle Boyd-Postell, Malik Briggs, Walter Buczynski, Alex Bush, Adam Butlak, Calvin Campbell, Matthew Carlson, David Carter, Jeremy Cotto, Victor Coveney, Jake Cruz III, Harmodio DeGraw, Evan Echeandia, Andres Everett, Elliott Gay, Jonathan Gibbons, Sidney Gooden, Brandon Gronostaj, Kyle Gueye, Lamine Helms, Nate JeanPierre, Matthew Johnson, Jake Lawrence, Jordan LeLiever, Matthew Machabee, Keith Mattera, Jesse Mitchell, Adrian Murray, T.J. Napier, Garfield Nicholson, Bryan Nicholson, Osiris Ogbonna, Kingsley Ortiz Rivera, Victor Perillo, Christopher Pieters, Austin Ragone, Charlie Ranke, Tyler Reid, Dom Sémôn, Mandé Somerville, Joey Sperl, Austin Sturdivant, Omahri Taylor, Najee Udvadia, Ryan Williams, Dawshawn Willis, Devon Go Austin Pieters Position Sprints Class Sophomore Hometown Queens Village, N.Y. Bio Related Biography Pieters’ TFRRS Profile 2017-18 Outdoor Personal Bests Track & Field Event Indoor Outdoor 60m 7.02 X 100m X 11.13 200m 22.44 X Did not compete Indoor America East Indoor Championships (February 23-24) 60m: 7.10 - 12th 200m: 22.54 - 13th Fastrack National Invitational (February 9) 60m: 7.02 - 23rd Bruce Lehane Scarlet & White Invitational (February 3) 60m: 7.13 - 16th 200m: 22.44 - 30th Middlebury Winterfell (January 20) 60m: 7.11 - 4th 4x400m: 3:29.13 - 2nd Great Dane Classic (January 13) 60m: 7.15 - 25th 200m: 23.33 - 49th 2016-17 Outdoor America East Outdoor Championships (May 6-7) 100m: 11.13 - 15th UAlbany Spring Classic (April 22) 100m: 10.87w - 6th 4x100m: 43.07 - 1st Indoor America East Indoor Track & Field Championships (February 24-25) 60m: 7.04 - 9th Fastrack National Invitational (February 10) 60m: 7.09 - 12th 200m: 23.17 - 27th Related Content There is no related content available. Related Headlines Related Press Clips Related Videos Related Photos 2017-18 Track & Field - M Roster Austin Pieters Austin Pieters Austin Pieters Position Sprints Position Sprints Class Sophomore Class Sophomore Hometown Queens Village, N.Y. Hometown Queens Village, N.Y. Bio Related Biography Personal Bests Track & Field Event Indoor Outdoor 60m 7.02 X 100m X 11.13 200m 22.44 X Related Content There is no related content available. Related Headlines Related Press Clips Related Videos Related Photos © 2025 University at Albany. All rights reserved. Footer Terms of Service , opens in new window , opens in new window Privacy Policy , opens in new window , opens in new window Accessibility Do Not Sell or Share My Personal Information Thanks for visiting ! The use of software that blocks ads hinders our ability to serve you the content you came here to enjoy. We ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here. Thank you for your support!"
  }
]