[
  {
    "candidate": "Pogozelski, Paul J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Paul_Pogozelski",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Paul Pogozelski Paul Pogozelski Paul Pogozelski Democratic Party Candidate, New York City Council District 30 June 24, 2025 Education Seaford High School Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Campaign YouTube Paul Pogozelski ( Democratic Party ) is running for election to the New York City Council to represent District 30 . He is on the ballot in the Democratic primary on June 24, 2025 . Pogozelski completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3.1.1 Video for Ballotpedia 3 Campaign themes 3.1 2025 3.1.1 Video for Ballotpedia 3.1 2025 3.1.1 Video for Ballotpedia 3.1.1 Video for Ballotpedia 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Paul Pogozelski was born in Islip, New York. He earned a high school diploma from Seaford High School. His career experience includes working as a consultant. He was the owner and president of Pogo Distribution Inc. from 1999 to 2023. [1] Pogozelski has been affiliated with the following organizations: [1] President of Middle Village Property Owners and Residents Association Chaplain of Veterans of Foreign Wars (VFW) Founder and President of the Middle Village Roller Hockey Association Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 30 Paul Pogozelski , Dermot Smyth , and Phil Wong are running in the Democratic primary for New York City Council District 30 on June 24, 2025. Candidate Paul Pogozelski Submit photo Dermot Smyth Submit photo Phil Wong There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 30 Jonathan Rinaldi and Alicia Vaichunas are running in the Republican primary for New York City Council District 30 on June 24, 2025. Candidate Jonathan Rinaldi Submit photo Alicia Vaichunas There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Video for Ballotpedia Video for Ballotpedia Video submitted to Ballotpedia Released April 11, 2025 Video submitted to Ballotpedia Released April 11, 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Paul Pogozelski completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Pogozelski's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. My name is Paul Pogozelski. I am 44 years old and a resident of Middle Village, Queens. I moved to the neighborhood over 8 years ago with my wife and three boys to be closer to my roots. I ran a small logistics business for over 20 years out of Middle Village, scheduling deliveries, managing a team of trucking specialists, and finding my true passion for the neighborhood. The experience I gained taught me how to build connections, become"
  },
  {
    "candidate": "Pogozelski, Paul J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Paul_Pogozelski",
    "text": "an expert at problem-solving, and turn plans into action. I made one of the best decisions of my life after many years of working when I decided to sell my successful small business. That decision allowed me to spend more time with my family and ultimately paved the way for my civic life to begin. I took it upon myself to revitalize a small youth sports organization that was nearly long forgotten in Middle Village and became President of the Middle Village Players Roller Hockey League. I had help from amazing neighbors I met along the way, and I’m happy to say it’s still running strong ever since. I’m running for New York City Council District 30 to continue to build a better neighborhood. I’ve seen first-hand that this district really needs someone who’s willing to be proactive about the neighborhood. I believe I am just like all of my neighbors who deserve to stake a claim in their local government. When it comes to democracy, we need to elect someone who is of the people, and I believe I am that candidate. I ran a small logistics business for over 20 years out of Middle Village, scheduling deliveries, managing a team of trucking specialists, and finding my true passion for the neighborhood. The experience I gained taught me how to build connections, become an expert at problem-solving, and turn plans into action. I made one of the best decisions of my life after many years of working when I decided to sell my successful small business. That decision allowed me to spend more time with my family and ultimately paved the way for my civic life to begin. I took it upon myself to revitalize a small youth sports organization that was nearly long forgotten in Middle Village and became President of the Middle Village Players Roller Hockey League. I had help from amazing neighbors I met along the way, and I’m happy to say it’s still running strong ever since. I’m running for New York City Council District 30 to continue to build a better neighborhood. I’ve seen first-hand that this district really needs someone who’s willing to be proactive about the neighborhood. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Public Safety is above all else in my candidacy for New York City Council District 30. Our neighborhoods need a criminal justice system that will keep repeat criminals in handcuffs and not let them go free in a matter of hours. The NYPD and our first responders need the proper resources from the city to do their jobs, and not having this sweeping support will continue to leave people questioning if they are truly safe on the street. Support for law enforcement means safer streets, and that only boosts the quality of life in our neighborhoods. I aim to bring a sense of stewardship back to our New York City Parks. These green spaces provide a space for hardworking families, older adults, and more residents to enjoy the outdoors. Not only does it boost physical health, but mental health as well. I’ve seen how constant littering, unpermitted parties, and vandalism have taken hold in our parks, and it must stop now. If people aren’t comfortable spending time in our parks, then community engagement falls, and that will not be acceptable in my candidacy. The cost of living in New York City has reached record highs in recent years, making it extremely difficult for any working-class family to live comfortably. Access to affordable produce, building materials, and amenities needs to return to normal. The key to balancing our costs is to support our small businesses. By promoting fixed long-term leases and working with city agencies to provide adequate support, we can help give the right businesses the financial means to help us afford our basic needs. This same issue falls in-line with making sure residents aren’t paying for projects not approved by our neighbors, such as congestion pricing and the City of Yes. Public Safety is above all else in my candidacy for New York City Council District 30. Our neighborhoods need a criminal justice system that will keep repeat criminals in handcuffs and not let them go free in a matter of hours. The NYPD and our first responders need the proper resources from the city to do their jobs, and not having this sweeping support will continue"
  },
  {
    "candidate": "Pogozelski, Paul J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Paul_Pogozelski",
    "text": "to leave people questioning if they are truly safe on the street. Support for law enforcement means safer streets, and that only boosts the quality of life in our neighborhoods. I aim to bring a sense of stewardship back to our New York City Parks. These green spaces provide a space for hardworking families, older adults, and more residents to enjoy the outdoors. Not only does it boost physical health, but mental health as well. I’ve seen how constant littering, unpermitted parties, and vandalism have taken hold in our parks, and it must stop now. If people aren’t comfortable spending time in our parks, then community engagement falls, and that will not be acceptable in my candidacy. The cost of living in New York City has reached record highs in recent years, making it extremely difficult for any working-class family to live comfortably. Access to affordable produce, building materials, and amenities needs to return to normal. The key to balancing our costs is to support our small businesses. By promoting fixed long-term leases and working with city agencies to provide adequate support, we can help give the right businesses the financial means to help us afford our basic needs. This same issue falls in-line with making sure residents aren’t paying for projects not approved by our neighbors, such as congestion pricing and the City of Yes. What areas of public policy are you personally passionate about? When I first began the Middle Village Platers Roller Hockey League, I couldn’t help but notice all of the problems facing Juniper Valley Park. The James Bohan Hockey Rink, located within Juniper Park, was full of random graffiti, garbage, and debris from around the park. It took months to get the rink back into shape for the kids, and seeing the once-neglected park space return to its former glory fueled my passion for our New York City Parks. I want to take what I did at Juniper Park and share it with the rest of the district. Our parks are our neighborhoods’ backyards. They act as a crucial space for families and children in our community, and we need someone who will be willing to fight to keep these spaces clean and safe. Who do you look up to? Whose example would you like to follow, and why? My idol has always been Benjamin Franklin for his ability to make contributions in a wide variety of ways and leading by example in doing so. As a publisher, scientist, inventor, diplomat, and Founding Father, he found a multitude of ways to contribute to his country and showed us how to live up to the ideal of what an American should be. Like Ben Franklin, I aim to find a myriad of ways to contribute to my community beyond my responsibilities in public service. What characteristics or principles are most important for an elected official? Our elected officials need to be accountable for their actions. When politicians allow out-of-district organizations and private entities to become key stakeholders in our democratic process, it always gets in the way of providing for our neighbors. I can promise that I will never become beholden to any outside forces that attempt to take advantage of the community, and I will remain committed to advocating for all our neighbors who live in the district. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 30 Website Facebook Twitter Instagram YouTube Candidate New York City Council District 30 Website Facebook Twitter Instagram YouTube Footnotes Footnotes ↑ 1.0 1.1 Information submitted to Ballotpedia through the Candidate Connection survey on April 11, 2025 ↑ 1.0 1.1 Information submitted to Ballotpedia through the Candidate Connection survey on April 11, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State"
  },
  {
    "candidate": "Pogozelski, Paul J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Paul_Pogozelski",
    "text": "Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential"
  },
  {
    "candidate": "Pogozelski, Paul J",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Paul_Pogozelski",
    "text": "election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]