[
  {
    "candidate": "Qiu, Helen J",
    "category": "bio",
    "score": null,
    "link": "https://www.westsiderepublicanclub.org/candidate/2023/helen-qui-candidate-for-nyc-council-district-1/",
    "text": "Toggle navigation Gertrude & Morrison Parker West Side Republican Club Membership Join Our Club! Lifetime Members Join Our Club! Lifetime Members Monthly Meetings About & Location Upcoming Events Past Events Club Speakers About & Location Upcoming Events Past Events Club Speakers Issues & Action Reclaim Our Country Campaign Support Our Candidates! Reclaim Our Country Campaign Support Our Candidates! Book Store Club Info Club History Assembly Districts Board of Directors Legal Bylaws Privacy Policy SMS Policy Club History Assembly Districts Board of Directors Legal Bylaws Privacy Policy SMS Policy Bylaws Privacy Policy SMS Policy Contact Info Contact Info Email Us Contact Info Email Us Helen Qiu – Candidate for NYC Council District 1 Helen Qiu is the Republican candidate running for NY City Council District 1 in Manhattan. Helen teaches as an adjunct professor at Manhattan College in the Bronx and is mom to her 12 year old son David. She came to New York in 2008 as a Masters and later a PhD student at Columbia University. Prior to coming to New York she had a successful career as an engineer and later engineering executive managing multimillion dollar projects in high-tech semiconductor companies in Silicon Valley. After graduating from Columbia she established the Mamre Christian Church, an online gathering congregation which helped many community organizations, families and youth during times of family or personal crisis, and in need of guidance. As Vice President of the Community Education Council (2021-2023), Helen was effective in curbing and eventually ending the wasteful spending of $200 million in the Department of Education’s now infamous “Mosaic Curriculum Project.” As a community advocate, she successfully reversed a Community Board preliminary decision to convert a NYCHA community garden into a parking lot. As the sole mediator, she settled a five-year lawsuit between two prominent community groups outside of the courtroom. Helen became involved politically in her district in January last year when Chinatown was set to build ten homeless shelters within a one mile radius. As a legal immigrant and naturalized citizen, Helen believes to end the migrant crisis we must close the southern border, end sanctuary city laws, and prioritize legal immigration applications. Helen supports law enforcement and when elected, will lobby to end cashless bail. She will be tough on crime, especially subway crimes and quality of life issues. Helen is against covid vaccine mandates, and as VP of Community Education Council, successfully lobbied the Department of Education and Mayor’s Office to allow 250,000 unvaccinated children and youth to attend their graduation celebration in 2022. For more information or to get in touch with Helen, go to www.HelenQiu.com . Helen Qiu – Candidate for NYC Council District 1 Helen Qiu is the Republican candidate running for NY City Council District 1 in Manhattan. Helen teaches as an adjunct professor at Manhattan College in the Bronx and is mom to her 12 year old son David. She came to New York in 2008 as a Masters and later a PhD student at Columbia University. Prior to coming to New York she had a successful career as an engineer and later engineering executive managing multimillion dollar projects in high-tech semiconductor companies in Silicon Valley. After graduating from Columbia she established the Mamre Christian Church, an online gathering congregation which helped many community organizations, families and youth during times of family or personal crisis, and in need of guidance. As Vice President of the Community Education Council (2021-2023), Helen was effective in curbing and eventually ending the wasteful spending of $200 million in the Department of Education’s now infamous “Mosaic Curriculum Project.” As a community advocate, she successfully reversed a Community Board preliminary decision to convert a NYCHA community garden into a parking lot. As the sole mediator, she settled a five-year lawsuit between two prominent community groups outside of the courtroom. Helen became involved politically in her district in January last year when Chinatown was set to build ten homeless shelters within a one mile radius. As a legal immigrant and naturalized citizen, Helen believes to end the migrant crisis we must close the southern border, end sanctuary city laws, and prioritize legal immigration applications. Helen supports law enforcement and when elected, will lobby to end cashless bail. She will be tough on crime, especially subway crimes and quality of life issues. Helen is against covid vaccine mandates, and as VP of Community Education Council, successfully lobbied the Department of Education and Mayor’s Office to allow 250,000 unvaccinated children and youth to attend their graduation celebration in"
  },
  {
    "candidate": "Qiu, Helen J",
    "category": "bio",
    "score": null,
    "link": "https://www.westsiderepublicanclub.org/candidate/2023/helen-qui-candidate-for-nyc-council-district-1/",
    "text": "2022. For more information or to get in touch with Helen, go to www.HelenQiu.com . Search for: Upcoming Club Events Bruce F. Bechtol-Rogue Allies June 10, 2025 Bruce F. Bechtol-Rogue Allies Club Events In Your Calendar Click the calendar icon below to have all our events in your phone or desktop's calendar. Updated Automatically! PAID FOR BY THE GERTRUDE & MORRISON PARKER WEST SIDE REPUBLICAN CLUB NOT AUTHORIZED BY ANY CANDIDATE OR CANDIDATE COMMITTEE 50 West 72nd Street Suite 504 New York, NY 10023 Secondary Menu Bylaws Bylaws Privacy Policy Privacy Policy SMS Policy SMS Policy"
  }
]