[
  {
    "candidate": "Rajkumar, Jenifer",
    "category": "bio",
    "score": null,
    "link": "https://nyassembly.gov/mem/Jenifer-Rajkumar",
    "text": "Assemblymember Jenifer Rajkumar Assembly District 38 Home About Biography District Map Biography District Map Newsroom Press Releases Publications News Articles Press Releases Publications News Articles Media Photos Video Photos Video Legislation Committee Membership Contact Assembly Home Contact Join email list Meet with me Map & Offices Biography Jenifer Rajkumar is a lawyer, professor, and government leader who made history as the first South Asian-American woman ever to be elected to a state office in New York. A graduate of Stanford Law School and the University of Pennsylvania, Jenifer has worked across the country to empower disenfranchised, vulnerable and excluded individuals, at both the national and local levels. Jenifer's parents immigrated to the United States with just $300 and a suitcase, settling in Queens where they got their start. Jenifer is proud to be born and raised in New York, the first generation of her family born in the United States. Jenifer’s legislative achievements are nationally recognized. She passed a milestone legislative package that gives domestic workers the full protections of New York State Human Rights Law. She passed a landmark bill establishing New York State’s first-ever Asian American & Pacific Island (AAPI) Commission. As a strong advocate for public safety, Jenifer passed a bill to expand compensation for victims of crime, which the Governor signed into law. Jenifer also has the distinction of serving as Senior Advisor to the Transition Team of New York City Mayor Eric Adams. Previous to her election to the State Legislature, she served as Director of Immigration Affairs for New York State. In this role, she built and led a first-in-the-nation $31 million project to assist immigrants in obtaining legal services. Jenifer also practiced as a civil rights lawyer at a national law firm, where she litigated class action cases on behalf of workers, tenants and women. She was part of the legal team of Velez v. Novartis , ranked by the United Nations as one of the top 10 cases in the world advancing women’s equality. She also collaborated with the U.S. Department of Justice on cases combating corporate fraud and excess. She worked in Washington DC as a fellow at the National Women's Law Center advancing policy at the federal level advancing women's equality. Locally, Jenifer has also served as a Professor at the City University of New York (CUNY)’s Lehman College, where she worked to uplift our city’s youth. Jenifer graduated from Stanford Law School with distinction for her pro bono legal work on behalf of vulnerable individuals. She graduated from the University of Pennsylvania magna cum laude, phi beta kappa where she received the Alice Paul Award for exemplary service to women and families and numerous other academic awards. In her career, she received the New York County Democratic Party’s Bella Abzug Award, the WIN Young Women of Achievement Award, and was named both a New York Metro Rising Star by Super Lawyers , as well as a “40 Under 40” Rising Star by City & State . However, her greatest award is the moments she has been able to help, serve and empower people, both in her community and around the country. Jenifer Rajkumar is a lawyer, professor, and government leader who made history as the first South Asian-American woman ever to be elected to a state office in New York. A graduate of Stanford Law School and the University of Pennsylvania, Jenifer has worked across the country to empower disenfranchised, vulnerable and excluded individuals, at both the national and local levels. Jenifer's parents immigrated to the United States with just $300 and a suitcase, settling in Queens where they got their start. Jenifer is proud to be born and raised in New York, the first generation of her family born in the United States. Jenifer’s legislative achievements are nationally recognized. She passed a milestone legislative package that gives domestic workers the full protections of New York State Human Rights Law. She passed a landmark bill establishing New York State’s first-ever Asian American & Pacific Island (AAPI) Commission. As a strong advocate for public safety, Jenifer passed a bill to expand compensation for victims of crime, which the Governor signed into law. Jenifer also has the distinction of serving as Senior Advisor to the Transition Team of New York City Mayor Eric Adams. Previous to her election to the State Legislature, she served as Director of Immigration Affairs for New York State. In this role, she built and led a first-in-the-nation $31 million project to assist immigrants in obtaining legal"
  },
  {
    "candidate": "Rajkumar, Jenifer",
    "category": "bio",
    "score": null,
    "link": "https://nyassembly.gov/mem/Jenifer-Rajkumar",
    "text": "services. Jenifer also practiced as a civil rights lawyer at a national law firm, where she litigated class action cases on behalf of workers, tenants and women. She was part of the legal team of Velez v. Novartis , ranked by the United Nations as one of the top 10 cases in the world advancing women’s equality. She also collaborated with the U.S. Department of Justice on cases combating corporate fraud and excess. She worked in Washington DC as a fellow at the National Women's Law Center advancing policy at the federal level advancing women's equality. Locally, Jenifer has also served as a Professor at the City University of New York (CUNY)’s Lehman College, where she worked to uplift our city’s youth. Jenifer graduated from Stanford Law School with distinction for her pro bono legal work on behalf of vulnerable individuals. She graduated from the University of Pennsylvania magna cum laude, phi beta kappa where she received the Alice Paul Award for exemplary service to women and families and numerous other academic awards. In her career, she received the New York County Democratic Party’s Bella Abzug Award, the WIN Young Women of Achievement Award, and was named both a New York Metro Rising Star by Super Lawyers , as well as a “40 Under 40” Rising Star by City & State . However, her greatest award is the moments she has been able to help, serve and empower people, both in her community and around the country. Jenifer Rajkumar is a lawyer, professor, and government leader who made history as the first South Asian-American woman ever to be elected to a state office in New York. A graduate of Stanford Law School and the University of Pennsylvania, Jenifer has worked across the country to empower disenfranchised, vulnerable and excluded individuals, at both the national and local levels. Jenifer's parents immigrated to the United States with just $300 and a suitcase, settling in Queens where they got their start. Jenifer is proud to be born and raised in New York, the first generation of her family born in the United States. Jenifer’s legislative achievements are nationally recognized. She passed a milestone legislative package that gives domestic workers the full protections of New York State Human Rights Law. She passed a landmark bill establishing New York State’s first-ever Asian American & Pacific Island (AAPI) Commission. As a strong advocate for public safety, Jenifer passed a bill to expand compensation for victims of crime, which the Governor signed into law. Jenifer also has the distinction of serving as Senior Advisor to the Transition Team of New York City Mayor Eric Adams. Previous to her election to the State Legislature, she served as Director of Immigration Affairs for New York State. In this role, she built and led a first-in-the-nation $31 million project to assist immigrants in obtaining legal services. Jenifer also practiced as a civil rights lawyer at a national law firm, where she litigated class action cases on behalf of workers, tenants and women. She was part of the legal team of Velez v. Novartis , ranked by the United Nations as one of the top 10 cases in the world advancing women’s equality. She also collaborated with the U.S. Department of Justice on cases combating corporate fraud and excess. She worked in Washington DC as a fellow at the National Women's Law Center advancing policy at the federal level advancing women's equality. Locally, Jenifer has also served as a Professor at the City University of New York (CUNY)’s Lehman College, where she worked to uplift our city’s youth. Jenifer graduated from Stanford Law School with distinction for her pro bono legal work on behalf of vulnerable individuals. She graduated from the University of Pennsylvania magna cum laude, phi beta kappa where she received the Alice Paul Award for exemplary service to women and families and numerous other academic awards. In her career, she received the New York County Democratic Party’s Bella Abzug Award, the WIN Young Women of Achievement Award, and was named both a New York Metro Rising Star by Super Lawyers , as well as a “40 Under 40” Rising Star by City & State . However, her greatest award is the moments she has been able to help, serve and empower people, both in her community and around the country. Recent Photos Recent Photos Recent Video Recent Video Recent News Recent News State Assemblywoman Jenifer Rajkumar Hosts “SMOKEOUT Act” Rally at City Hall Calling for Bill’s Passage in"
  },
  {
    "candidate": "Rajkumar, Jenifer",
    "category": "bio",
    "score": null,
    "link": "https://nyassembly.gov/mem/Jenifer-Rajkumar",
    "text": "State Budget Feb 26, 2024 South Queens, NY – On Friday, Assemblywoman Jenifer Rajkumar brought together a citywide coalition calling for passage of her SMOKEOUT Act (A8428A/S7998A), which she authored, and which grants municipalities across the State, including New York City,... State Assemblywoman Jenifer Rajkumar Hosts “SMOKEOUT Act” Rally at City Hall Calling for Bill’s Passage in State Budget Assemblywoman Jenifer Rajkumar Throws Largest Dominican Independence Celebration in the History of Her District Feb 26, 2024 South Queens, NY – Queens was abuzz on Friday night when Assemblywoman Jenifer Rajkumar threw the biggest Dominican Independence Day celebration in her district’s history. Over 200 people came to partake in the festivities, including many of the Assemblywoman’s... Assemblywoman Jenifer Rajkumar Throws Largest Dominican Independence Celebration in the History of Her District Assemblywoman Jenifer Rajkumar Brings Mayor Eric Adams and Community Together to Unveil New Gandhi Statue Jan 23, 2024 South Queens, NY – On Sunday, Assemblywoman Jenifer Rajkumar – the first Hindu-American elected official in New York State – brought Mayor Eric Adams and the community together to unveil the magnificent new Mahatma Gandhi statue at Shri Tulsi Mandir,... Assemblywoman Jenifer Rajkumar Brings Mayor Eric Adams and Community Together to Unveil New Gandhi Statue State Assemblywoman Jenifer Rajkumar Introduces “SMOKEOUT Act” to Shutter Illegal Smoke Shops Across New York State Jan 2, 2024 South Queens, NY – Assemblywoman Jenifer Rajkumar (D-AD 38) introduced the SMOKEOUT Act (A8428), one of her major priorities for passage this Albany session. The SMOKEOUT Act (Stop Marijuana Overproliferation and Keep Empty Operators of Unlicensed Transactions)... State Assemblywoman Jenifer Rajkumar Introduces “SMOKEOUT Act” to Shutter Illegal Smoke Shops Across New York State 2024 New York City Parking Calendar Dec 8, 2023 2024 New York City Parking Calendar State Assemblywoman Jenifer Rajkumar Distributes Over 400 Turkeys at Her Annual Thanksgiving Turkey Giveaway Nov 21, 2023 South Queens, NY – On Friday, Assemblywoman Jenifer Rajkumar (D-AD 38) hosted a turkey giveaway at her District Office in Woodhaven, where she distributed over 400 turkeys to the people of her district. Every year Assemblywoman Rajkumar secures hundreds... State Assemblywoman Jenifer Rajkumar Distributes Over 400 Turkeys at Her Annual Thanksgiving Turkey Giveaway Recent News"
  }
]