[
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Theona Reets-DuPont Theona Reets-DuPont Theona Reets-DuPont Democratic Party Candidate, New York City Council District 13 June 24, 2025 Education Notre Dame De Joie Clark University, 2016 CUNY Graduate Center, 2020 Campaign website Campaign Twitter Campaign Instagram Personal Facebook Theona Reets-DuPont ( Democratic Party ) is running for election to the New York City Council to represent District 13 . She is on the ballot in the Democratic primary on June 24, 2025 . [source] Reets-DuPont completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Theona Reets-DuPont earned a high school diploma from the Notre Dame De Joie. She earned a bachelor's degree from Clark University in 2016 and graduated from the CUNY Graduate Center in 2020. Her career experience includes working as a chief of staff, budget director, community engagement director, and director of communications for the New York City Council, as a congressional staffer, and as an ESOL and civics instructor. She has been affiliated with the Association of Legislative Employees (ALE) and the United Nations Association of the United States. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 13 Shirley Aldebol , David Diaz , John Perez , Theona Reets-DuPont , and Jacqueline Torres are running in the Democratic primary for New York City Council District 13 on June 24, 2025. Candidate Submit photo Shirley Aldebol Submit photo David Diaz Submit photo John Perez Theona Reets-DuPont Submit photo Jacqueline Torres There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 13 Incumbent Kristy Marmorato is running in the Republican primary for New York City Council District 13 on June 24, 2025. Candidate Kristy Marmorato Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Theona Reets-DuPont completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Reets-DuPont's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Theona Reets-DuPont is a proven leader dedicated to advocating for working people. With over 22 years of experience in community organizing, teaching, immigration law, and government, Theona is committed to creating positive change for our community. As a Public Health Advisor for New York City Health and Hospitals, she worked on the frontlines during the COVID-19 pandemic, educating and connecting individuals with critical resources. Theona played a key role in the Association of Legislative Employees (ALE), America’s largest union of legislative staffers, founded in the NYC Council. She created one of"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "the few fully unionized offices, ensuring every employee she hired was a member of ALE. As part of the union’s bargaining committee, Theona Reets-DuPont represented members during their first contract negotiation with the City Council. Theona’s leadership and commitment to fair wages, labor rights, and community service make her the candidate who will continue to fight for the people. Vote for Theona-because she’s dedicated to making a real difference. Theona played a key role in the Association of Legislative Employees (ALE), America’s largest union of legislative staffers, founded in the NYC Council. She created one of the few fully unionized offices, ensuring every employee she hired was a member of ALE. As part of the union’s bargaining committee, Theona Reets-DuPont represented members during their first contract negotiation with the City Council. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Theona has spent over two decades fighting for workers’ rights, fair wages, and better conditions. She helped create one of the first fully unionized offices in the City Council and played a lead role in negotiating a historic union contract for legislative staffers. During the COVID-19 pandemic, Theona served on the frontlines as a Public Health Advisor—connecting vulnerable communities with vital care and resources when they needed it most. With 22+ years of experience in organizing, education, immigration law, and public service, Theona has a track record of creating real change. She’s committed to building a more just, inclusive, and supportive community for all. Theona has spent over two decades fighting for workers’ rights, fair wages, and better conditions. She helped create one of the first fully unionized offices in the City Council and played a lead role in negotiating a historic union contract for legislative staffers. During the COVID-19 pandemic, Theona served on the frontlines as a Public Health Advisor—connecting vulnerable communities with vital care and resources when they needed it most. With 22+ years of experience in organizing, education, immigration law, and public service, Theona has a track record of creating real change. She’s committed to building a more just, inclusive, and supportive community for all. What areas of public policy are you personally passionate about? Quality of Life & Public Safety Everyone deserves to feel safe and supported in their neighborhood. Quality Education for All Education is the foundation of opportunity. I’m committed to fully funding our schools. Supporting Our Seniors Our seniors deserve to age with dignity, respect, and the support they’ve earned. 🇺🇸 Standing with Our Veterans Veterans have sacrificed for our country, and they should never be left behind. I’m committed to: Ensuring access to healthcare, mental health services, and housing support. Fighting for Working Families Working families are the backbone of our city. Small Business Support & Entrepreneurship Opportunities Small businesses are the heart of our neighborhoods and the engines of local jobs. Everyone deserves to feel safe and supported in their neighborhood. Quality Education for All Education is the foundation of opportunity. I’m committed to fully funding our schools. Supporting Our Seniors Our seniors deserve to age with dignity, respect, and the support they’ve earned. 🇺🇸 Standing with Our Veterans Veterans have sacrificed for our country, and they should never be left behind. I’m committed to: Ensuring access to healthcare, mental health services, and housing support. Fighting for Working Families Working families are the backbone of our city. Small Business Support & Entrepreneurship Opportunities What qualities does this office possess that makes it a unique and important part of the state government and legal system? Direct Representation of the People This office is deeply connected to the community, serving as the voice of constituents in the decision-making process. Unlike higher-level government positions, this office has a direct line to the people, ensuring their concerns, needs, and interests are heard and addressed at the local level. Advocacy for Justice and Equity A core responsibility of this office is to ensure that justice is accessible to all, regardless of socioeconomic status. It plays a key role in advocating for policies that protect marginalized communities, fighting for fairness and equality within the legal and governmental systems. Legislative Power at the Local Level This office carries significant legislative influence at the municipal level, helping to shape laws and policies that directly affect the everyday lives of residents. Whether it’s working on issues like housing, education, or public health, this office is at the forefront of passing laws that"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "have an immediate impact on the local community. Accountability and Oversight This office plays a vital role in ensuring that other parts of the city government remain accountable to the public. Through oversight and checks and balances, it ensures that city resources are used appropriately and that policies are being carried out effectively. It’s a safeguard against corruption and mismanagement within the local government. Bridging the Gap Between Law and People The office acts as a connector between the legal system and everyday citizens. Whether it’s ensuring that local laws are being followed or helping people navigate the legal system, this office plays an important role in making the law accessible and understandable for the people it serves. Policy Implementation and Community Development This office not only creates policy but also ensures that it is implemented effectively at the ground level. it plays an essential part in building stronger, more resilient neighborhoods. This office is deeply connected to the community, serving as the voice of constituents in the decision-making process. Unlike higher-level government positions, this office has a direct line to the people, ensuring their concerns, needs, and interests are heard and addressed at the local level. Advocacy for Justice and Equity A core responsibility of this office is to ensure that justice is accessible to all, regardless of socioeconomic status. It plays a key role in advocating for policies that protect marginalized communities, fighting for fairness and equality within the legal and governmental systems. Legislative Power at the Local Level This office carries significant legislative influence at the municipal level, helping to shape laws and policies that directly affect the everyday lives of residents. Whether it’s working on issues like housing, education, or public health, this office is at the forefront of passing laws that have an immediate impact on the local community. Accountability and Oversight This office plays a vital role in ensuring that other parts of the city government remain accountable to the public. Through oversight and checks and balances, it ensures that city resources are used appropriately and that policies are being carried out effectively. It’s a safeguard against corruption and mismanagement within the local government. Bridging the Gap Between Law and People The office acts as a connector between the legal system and everyday citizens. Whether it’s ensuring that local laws are being followed or helping people navigate the legal system, this office plays an important role in making the law accessible and understandable for the people it serves. Policy Implementation and Community Development This office not only creates policy but also ensures that it is implemented effectively at the ground level. Who do you look up to? Whose example would you like to follow, and why? I look up to my mother and father, who led with purpose, humility, and a deep commitment to serving others. Their example continues to inspire me. As a business leader and workers’ rights activist, they fought tirelessly for the rights of working families and small business owners. Like my parents, I believe in the power of public service, in giving a voice to the unheard, and in fighting for justice, fairness, and dignity in our communities. I also draw inspiration from the countless community members, educators, and frontline workers—people like myself—who may not be widely recognized, but who show up every day to make their neighborhoods stronger, safer, and more inclusive. Their resilience and quiet leadership are a constant reminder that real change begins at the ground level. I aim to follow the example of those who lead by listening, who stand up for working people, and who are unafraid to challenge the status quo to build something better. That’s the kind of leader I strive to be rooted in community, driven by equity, and committed to action. I also draw inspiration from the countless community members, educators, and frontline workers—people like myself—who may not be widely recognized, but who show up every day to make their neighborhoods stronger, safer, and more inclusive. Their resilience and quiet leadership are a constant reminder that real change begins at the ground level. What characteristics or principles are most important for an elected official? Integrity – Honest, transparent, and guided by strong moral values Accountability – Takes responsibility and stays answerable to the public Commitment to Service – Puts community needs first, not personal gain A Leader Who Will Listen - A true leader listens to the needs and concerns of their community. They don’t just speak—they hear, understand, and act"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "on what matters most to the people they serve. Empathy – Listens and understands the lived experiences of others Equity & Fairness – Advocates for justice and inclusive policies Vision – Has a clear plan for the future and bold ideas for progress Courage – Willing to speak up and stand firm for what’s right Collaboration – Works well with others to build consensus and deliver results Responsiveness – Stays in touch with the community and acts on concerns Dedication – Committed, hardworking, and persistent in getting results Accountability – Takes responsibility and stays answerable to the public Commitment to Service – Puts community needs first, not personal gain A Leader Who Will Listen - A true leader listens to the needs and concerns of their community. They don’t just speak—they hear, understand, and act on what matters most to the people they serve. Empathy – Listens and understands the lived experiences of others Equity & Fairness – Advocates for justice and inclusive policies Vision – Has a clear plan for the future and bold ideas for progress Courage – Willing to speak up and stand firm for what’s right Collaboration – Works well with others to build consensus and deliver results Responsiveness – Stays in touch with the community and acts on concerns What qualities do you possess that you believe would make you a successful officeholder? I bring a unique blend of experience, compassion, and commitment to public service that I believe will make me an effective and impactful City Council member. Proven Leadership: With over two decades of experience in community organizing, government, teaching, and immigration law, I know how to bring people together, build coalitions, and turn ideas into action. Deep Commitment to Equity and Justice: I’ve spent my career advocating for working families, immigrants, seniors, and small business owners—always with the goal of making sure no one is left behind. I understand the challenges our communities face because I’ve lived them and worked alongside those impacted the most. Strong Listener and Problem Solver: I believe that good leadership starts with listening. I take the time to hear from residents, understand their concerns, and work collaboratively to find solutions that are practical, equitable, and forward-thinking. Frontline Experience: As a Public Health Advisor during the COVID-19 pandemic, I was on the ground helping people navigate one of the hardest times in recent history. That experience strengthened my resolve to fight for better healthcare, housing, and public safety for all New Yorkers. Labor and Workers’ Rights Advocate: I’ve helped create one of the few fully unionized City Council offices and fought for fair wages and protections for staffers across city government. I’ll bring that same dedication to protecting the rights of all workers in our city. Above all, I am rooted in the community—I show up, I listen, and I lead with integrity. I’m not afraid to challenge the status quo if it means creating real change for the people I serve. Proven Leadership: With over two decades of experience in community organizing, government, teaching, and immigration law, I know how to bring people together, build coalitions, and turn ideas into action. Deep Commitment to Equity and Justice: I’ve spent my career advocating for working families, immigrants, seniors, and small business owners—always with the goal of making sure no one is left behind. I understand the challenges our communities face because I’ve lived them and worked alongside those impacted the most. Strong Listener and Problem Solver: I believe that good leadership starts with listening. I take the time to hear from residents, understand their concerns, and work collaboratively to find solutions that are practical, equitable, and forward-thinking. Frontline Experience: As a Public Health Advisor during the COVID-19 pandemic, I was on the ground helping people navigate one of the hardest times in recent history. That experience strengthened my resolve to fight for better healthcare, housing, and public safety for all New Yorkers. Labor and Workers’ Rights Advocate: I’ve helped create one of the few fully unionized City Council offices and fought for fair wages and protections for staffers across city government. I’ll bring that same dedication to protecting the rights of all workers in our city. What do you believe are the core responsibilities for someone elected to this office? Representing Constituents Listening to and acting in the best interest of the people who elect you—ensuring their voices are heard in all decisions. Creating and Enforcing Laws Proposing, debating, and passing laws that promote fairness, justice, and the"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "well-being of the community. Also, ensuring laws are applied equitably and effectively. Fiscal Responsibility Managing public funds responsibly—ensuring that taxpayer dollars are spent efficiently, with transparency and accountability. Advocating for Community Needs Fighting for policies and resources that address the most pressing issues in the community, such as healthcare, education, housing, and public safety. Building Partnerships Collaborating with other leaders, organizations, and the public to achieve long-term solutions to the community’s challenges. Transparency and Accountability Being open with constituents about decisions, policies, and actions. Ensuring a high level of accountability and being responsive to public concerns. Promoting Equity and Justice Championing policies that create fair opportunities for everyone, addressing systemic inequalities, and advocating for marginalized communities. Upholding Ethical Standards Maintaining integrity, honesty, and ethical behavior in every aspect of decision-making and leadership. Listening to and acting in the best interest of the people who elect you—ensuring their voices are heard in all decisions. Creating and Enforcing Laws Proposing, debating, and passing laws that promote fairness, justice, and the well-being of the community. Also, ensuring laws are applied equitably and effectively. Fiscal Responsibility Managing public funds responsibly—ensuring that taxpayer dollars are spent efficiently, with transparency and accountability. Advocating for Community Needs Fighting for policies and resources that address the most pressing issues in the community, such as healthcare, education, housing, and public safety. Building Partnerships Collaborating with other leaders, organizations, and the public to achieve long-term solutions to the community’s challenges. Transparency and Accountability Being open with constituents about decisions, policies, and actions. Ensuring a high level of accountability and being responsive to public concerns. Promoting Equity and Justice Championing policies that create fair opportunities for everyone, addressing systemic inequalities, and advocating for marginalized communities. Upholding Ethical Standards What legacy would you like to leave? I want to leave a legacy of service, equity, and empowerment. I hope to be remembered as someone who stood up for working people, listened deeply to the needs of the community, and took bold, meaningful action that led to real, lasting change. Whether it’s expanding affordable housing, protecting seniors and veterans, supporting small businesses, or creating career opportunities for young people, my mission is to uplift and strengthen families for generations to come. I want my legacy to reflect a leader who didn’t just hold office, but who used the platform to build power with the people—not just for them. I hope to inspire the next generation of leaders—especially young women, immigrants, and those from underserved communities to know their voices matter, and that they, too, belong in spaces of power. Ultimately, I want to leave behind a community that is stronger, safer, more just, and more united—because I was here, and because I never stopped fighting for it. I hope to be remembered as someone who stood up for working people, listened deeply to the needs of the community, and took bold, meaningful action that led to real, lasting change. Whether it’s expanding affordable housing, protecting seniors and veterans, supporting small businesses, or creating career opportunities for young people, my mission is to uplift and strengthen families for generations to come. I want my legacy to reflect a leader who didn’t just hold office, but who used the platform to build power with the people—not just for them. I hope to inspire the next generation of leaders—especially young women, immigrants, and those from underserved communities to know their voices matter, and that they, too, belong in spaces of power. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? wo major historical events that have left a lasting impact on me are 9/11 and the COVID-19 pandemic. I was 23 years old when 9/11 happened. I remember the shock, the fear, and the deep sense of grief that swept across the country—but also the incredible moments of unity and resilience that followed. It was a time that reshaped how we understood safety, global politics, and our shared humanity. That experience taught me about the fragility of life and the strength of communities when they come together in the face of tragedy. Years later, at 39, I lived through another transformative event: the COVID-19 pandemic. As someone who worked on the frontlines during that time, I witnessed not only the devastation it brought, but also the determination and compassion of everyday people. It highlighted the urgent need for strong public health systems, equitable access to resources, and leadership that puts people first. Both events"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "shaped my values and reinforced my belief in the importance of community, empathy, and action especially during times of crisis. They are part of what drives my commitment to public service and fighting for the well-being of working families, seniors, and small businesses today. I was 23 years old when 9/11 happened. I remember the shock, the fear, and the deep sense of grief that swept across the country—but also the incredible moments of unity and resilience that followed. It was a time that reshaped how we understood safety, global politics, and our shared humanity. That experience taught me about the fragility of life and the strength of communities when they come together in the face of tragedy. Years later, at 39, I lived through another transformative event: the COVID-19 pandemic. As someone who worked on the frontlines during that time, I witnessed not only the devastation it brought, but also the determination and compassion of everyday people. It highlighted the urgent need for strong public health systems, equitable access to resources, and leadership that puts people first. What was your very first job? How long did you have it? My first job as an English as a Second Language (ESL) teacher spanned seven incredible years, during which I had the opportunity to teach at a variety of settings, including community centers, colleges, and schools. This experience was not just a job but a journey that shaped my understanding of education, language, and the power of connection. Teaching in community centers was my introduction to ESL, and it was an eye-opening experience. Many of my students came from diverse backgrounds, with different educational histories and language skills. Some were immigrants seeking to improve their English for work or to integrate into their communities, while others were refugees rebuilding their lives. It was in this setting that I realized the importance of not just teaching language but also supporting my students in their emotional and social transitions. The community centers became more than just places to learn—they were spaces for cultural exchange, personal growth, and empowerment. From there, I had the privilege of teaching in colleges, where I worked with older students who were often focused on improving their English to pursue further academic studies or career goals. These students were motivated and hardworking, and I loved helping them build the skills needed for success in higher education. Teaching in this environment allowed me to focus on academic writing, critical thinking, and advanced conversational skills. It was rewarding to see students improve their fluency and confidence, enabling them to tackle complex topics in English and succeed in their academic pursuits. I also taught in schools, where I worked with younger students. This was an entirely different experience, as I had to adjust my teaching methods to engage a younger audience and keep them motivated. The challenge of working with children was incredibly rewarding, as it often required creativity in making lessons both fun and educational. Teaching in community centers was my introduction to ESL, and it was an eye-opening experience. Many of my students came from diverse backgrounds, with different educational histories and language skills. Some were immigrants seeking to improve their English for work or to integrate into their communities, while others were refugees rebuilding their lives. It was in this setting that I realized the importance of not just teaching language but also supporting my students in their emotional and social transitions. The community centers became more than just places to learn—they were spaces for cultural exchange, personal growth, and empowerment. From there, I had the privilege of teaching in colleges, where I worked with older students who were often focused on improving their English to pursue further academic studies or career goals. These students were motivated and hardworking, and I loved helping them build the skills needed for success in higher education. Teaching in this environment allowed me to focus on academic writing, critical thinking, and advanced conversational skills. It was rewarding to see students improve their fluency and confidence, enabling them to tackle complex topics in English and succeed in their academic pursuits. What is your favorite book? Why? \"The Alchemist\" by Paulo Coelho. It's one of those books that inspires people to follow their dreams and trust their own journey, no matter how difficult the path may seem. The way it mixes personal growth with a sense of adventure is really powerful. It shows human connection, resilience, and growth, which is such a powerful combination. If"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "you could be any fictional character, who would you want to be? Wonder Woman is an iconic character—strong, compassionate, and always fighting for justice. She’s a symbol of empowerment, resilience, and fairness, and she doesn’t hesitate to stand up for the vulnerable. Plus, her ability to balance strength with kindness is pretty inspiring. What was the last song that got stuck in your head? CeCe Winans - Goodness of God is such an uplifting and powerful song. It’s one of those songs that has a way of sticking with you, especially with its message of grace and goodness. What is something that has been a struggle in your life? One of the biggest struggles I’ve faced in my life has been navigating systems that weren’t built for people like me as a woman, as a person of color, and as someone deeply rooted in community work. Whether in education, the workforce, or public service, I’ve often had to fight to be heard, to be respected, and to earn a seat at the table. There were times when resources were limited, opportunities were scarce, and I felt the constant pressure to prove myself more than others. But those challenges didn’t hold me back they shaped my resilience, sharpened my voice, and deepened my commitment to lifting up my community and those who are often overlooked. That struggle taught me the importance of creating space for others, of leading with empathy and courage, and of fighting for equity, advocacy, and opportunity especially for the next generation of leaders in our community. There were times when resources were limited, opportunities were scarce, and I felt the constant pressure to prove myself more than others. But those challenges didn’t hold me back they shaped my resilience, sharpened my voice, and deepened my commitment to lifting up my community and those who are often overlooked. Are there any little-known powers or responsibilities held by this office that you believe more people should be aware of? Yes, there are several little-known powers and responsibilities that a City Council office holds, which many people might not be fully aware of. That have a direct impact on their lives and community, and it’s important to highlight them because they play a key role in shaping communities. Here are some of those hidden responsibilities: Zoning and Land Use Decisions - Determines how land can be developed (residential, commercial, industrial). Influences affordable housing, local businesses, and neighborhood development. Budget Approval and Allocation - Approves the city's budget, including funding for education, health services, public infrastructure, and community programs. Legislative Powers Beyond Passing Laws - Introduces and passes local ordinances on issues like noise, safety, business regulations, tenant protections, and minimum wage. Zoning and Land Use Decisions - Determines how land can be developed (residential, commercial, industrial). Influences affordable housing, local businesses, and neighborhood development. Budget Approval and Allocation - Approves the city's budget, including funding for education, health services, public infrastructure, and community programs. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? Yes, it can be beneficial for holders of city government office to have previous experience in government or politics. Here’s a breakdown of why experience can be valuable. Understanding of the System - Government and political structures are complex. Having prior experience helps elected officials navigate bureaucratic processes, understand the legislative framework, and be familiar with how policies are made and implemented. This knowledge can lead to more effective and efficient decision-making. Building Relationships and Networks Experience often means having established connections with other elected officials, community leaders, and organizations. These relationships can be valuable when it comes to advocating for the community and securing resources or support for key initiatives. Policy Expertise Prior experience in government or politics often provides a deeper understanding of specific policy areas, such as budgeting, public safety, education, or housing. This expertise allows officials to make well-informed decisions and contribute to more comprehensive policy development. Navigating Challenges and Crises Government roles often come with complex challenges and crises that require immediate and strategic responses. Experience can be valuable in understanding how to handle such issues, whether it’s budget deficits, public health emergencies, or large-scale disasters. Understanding of the System - Government and political structures are complex. Having prior experience helps elected officials navigate bureaucratic processes, understand the legislative framework, and be familiar with how policies are made and implemented. This knowledge can lead to more effective and efficient decision-making. Building Relationships"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "and Networks Experience often means having established connections with other elected officials, community leaders, and organizations. These relationships can be valuable when it comes to advocating for the community and securing resources or support for key initiatives. Policy Expertise Prior experience in government or politics often provides a deeper understanding of specific policy areas, such as budgeting, public safety, education, or housing. This expertise allows officials to make well-informed decisions and contribute to more comprehensive policy development. Navigating Challenges and Crises What kind of skills or expertise do you believe would be the most helpful for the holders of this office to possess? Leadership and Decision-Making Key Skill: The ability to lead with integrity and make difficult decisions, especially in times of crisis or conflict. Why It’s Important: Effective leaders need to make decisions that reflect the needs of the community while balancing competing interests. Strong leadership ensures that policies are implemented effectively and progress is made on key issues. Public Policy and Legislative Knowledge Key Skill: A deep understanding of local laws, policies, and the legislative process is critical. Why It’s Important: A solid grasp of how policies are created, debated, and passed helps elected officials advocate for and enact meaningful change. This expertise allows them to understand the implications of their decisions and ensure laws are enforceable. Effective Communication Key Skill: The ability to communicate clearly, both in writing and verbally, to a variety of audiences (constituents, colleagues, media, etc.). Why It’s Important: Elected officials must convey ideas clearly and persuasively, whether in meetings, speeches, or public forums. They also need to listen carefully to their constituents and relay important information effectively. Community Engagement and Advocacy Key Skill: The ability to connect with and represent the diverse voices within the community. Why It’s Important: City officials need to understand the needs and concerns of their constituents and engage with people from all backgrounds. Advocacy skills ensure that community members feel heard, and their concerns are taken seriously when decisions are made. Collaboration and Teamwork Key Skill: The ability to work effectively with other elected officials, city departments, and external stakeholders, including community organizations and advocacy groups. Why It’s Important: Much of the work in government involves collaboration—whether it’s securing funding, working on joint initiatives, or creating consensus around legislation. Successful teamwork. Key Skill: The ability to lead with integrity and make difficult decisions, especially in times of crisis or conflict. Why It’s Important: Effective leaders need to make decisions that reflect the needs of the community while balancing competing interests. Strong leadership ensures that policies are implemented effectively and progress is made on key issues. Public Policy and Legislative Knowledge Key Skill: A deep understanding of local laws, policies, and the legislative process is critical. Why It’s Important: A solid grasp of how policies are created, debated, and passed helps elected officials advocate for and enact meaningful change. This expertise allows them to understand the implications of their decisions and ensure laws are enforceable. Effective Communication Key Skill: The ability to communicate clearly, both in writing and verbally, to a variety of audiences (constituents, colleagues, media, etc.). Why It’s Important: Elected officials must convey ideas clearly and persuasively, whether in meetings, speeches, or public forums. They also need to listen carefully to their constituents and relay important information effectively. Community Engagement and Advocacy Key Skill: The ability to connect with and represent the diverse voices within the community. Why It’s Important: City officials need to understand the needs and concerns of their constituents and engage with people from all backgrounds. Advocacy skills ensure that community members feel heard, and their concerns are taken seriously when decisions are made. Collaboration and Teamwork Key Skill: The ability to work effectively with other elected officials, city departments, and external stakeholders, including community organizations and advocacy groups. What qualities does this office possess that makes it a unique and important part of the local government? The city government plays a pivotal role in shaping the lives of its residents and maintaining the well-being of the community. The unique qualities of a city government distinguish it from other levels of government and make it an essential part of the local governance system. Here are some key attributes that make city government a unique and important component of local governance: Close Proximity to the Community - City government is directly connected to residents, allowing for responsive decision-making. Localized Decision-Making and Flexibility City government can create policies tailored to the specific needs of the community"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "Zoning and Urban Planning Authority City governments shape the physical layout and growth of the city, including housing and business development. Close Proximity to the Community - City government is directly connected to residents, allowing for responsive decision-making. Localized Decision-Making and Flexibility City government can create policies tailored to the specific needs of the community Zoning and Urban Planning Authority Tell us your favorite joke. The pastor told the congregation, \"Anyone who donates $1,000 can choose the next three hymns.\" An elderly woman immediately raised her hand and said, \"I’ll donate $1,000!\" The pastor asked, \"What three hymns would you like?\" The lady replied, \"Him, him, and him!\" What organizations or individuals have endorsed your campaign? At this time, I haven’t received formal endorsements, but my campaign is powered by the people—neighbors, community leaders, working families, and everyday Bronxites who believe in a future built on unity, equity, and action. As the campaign moves forward, I look forward to building meaningful partnerships with organizations and individuals who share that vision and are ready to work toward lasting change. What are your views on financial transparency and government accountability? Financial Transparency I believe that when public funds are spent, the community has a right to know how every dollar is used. Taxpayer money should be allocated in ways that directly benefit the people, and the process must be clear, accessible, and open to scrutiny. As your elected official, I will ensure budget decisions, spending plans, and financial reports are transparent, allowing you to see exactly where your money is going. This transparency builds trust and ensures that every decision made is for the public good. Government Accountability Government must be accountable to the people it serves. This means being open about decisions, responding to community concerns, and being responsible for actions and outcomes. I will hold myself and my office to the highest standard of accountability, making sure that I answer to you. If I make a promise, I’ll keep it, and if things go wrong, I will take responsibility and work to correct them. A government that listens, acts with integrity, and remains answerable to its citizens is one that truly serves its community. I believe that when public funds are spent, the community has a right to know how every dollar is used. Taxpayer money should be allocated in ways that directly benefit the people, and the process must be clear, accessible, and open to scrutiny. As your elected official, I will ensure budget decisions, spending plans, and financial reports are transparent, allowing you to see exactly where your money is going. This transparency builds trust and ensures that every decision made is for the public good. Government Accountability Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 13 Website Twitter Instagram Candidate New York City Council District 13 Website Twitter Instagram Personal Facebook Personal Facebook Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 16, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 16, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "| School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Theona_Reets-DuPont",
    "text": "confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://sites.google.com/view/theona4citycouncil/meet-theona",
    "text": "Embedded Files Skip to main content Skip to navigation Theona Reets-DuPont Home Meet Theona Issues Gallery Get Involved Donate Theona Reets-DuPont Home Meet Theona Issues Gallery Get Involved Donate More Home Meet Theona Issues Gallery Get Involved Donate Home Meet Theona Issues Gallery Get Involved Donate Meet Theona Meet Theona Born in Guyana and raised in Belgium, Theona Reets-DuPont's thirst for knowledge and understanding of the world grew while in a diverse public school setting. Where she received a well-rounded public school education, one that Theona believes should be the standard for all children. After high school Theona migrated to the United States for college, she pursued a Certificate in Humanitarian Studies at Bard College. Theona further demonstrated her commitment to making a difference while at Clark University, where she graduated with a degree in Political Science and International Relations. As a participant of the United Nations’s Humpty Dumpty Institute program, she led the OurBus Project– a groundbreaking initiative that brought college-level courses to women in rural areas of Yemen through a mobile classroom. Theona Reets-DuPont also has a Certificate of Advanced Graduate Study in Immigration Law from the City University of New York Graduate Center. Theona is a Certified English as a Second Language Instructor and completed her teaching practicum at Fordham University. Theona has over a decade of experience in community organizing, teaching, immigration law, and government. Born in Guyana and raised in Belgium, Theona Reets-DuPont's thirst for knowledge and understanding of the world grew while in a diverse public school setting. Where she received a well-rounded public school education, one that Theona believes should be the standard for all children. After high school Theona migrated to the United States for college, she pursued a Certificate in Humanitarian Studies at Bard College. Theona further demonstrated her commitment to making a difference while at Clark University, where she graduated with a degree in Political Science and International Relations. As a participant of the United Nations’s Humpty Dumpty Institute program, she led the OurBus Project– a groundbreaking initiative that brought college-level courses to women in rural areas of Yemen through a mobile classroom. Theona Reets-DuPont also has a Certificate of Advanced Graduate Study in Immigration Law from the City University of New York Graduate Center. Theona is a Certified English as a Second Language Instructor and completed her teaching practicum at Fordham University. Theona has over a decade of experience in community organizing, teaching, immigration law, and government. Theona's public service career began with impactful work in various government and non-governmental organizations, such as Neighbor to Neighbor and Stand for Children. She volunteered as an organizer for former Governor Deval Patrick’s campaign in Boston. Theona then interned at Beacon Hill for former Massachusetts State Representative Kate D. Campanale, and went on to volunteer to teach English at Saint Rita’s Refugee Center in the Bronx. While interning with former Congress Member Eliot Engel, Theona's interest in public service was amplified through her casework. She then went on to an internship at Lacroix Ramos Immigration Law Firm, as an Immigration Legal Intern, where she was a point of contact for her legal team and clients. While Theona was with Congress Member Adriano Espaillat, she served as a Immigration Liaison, taking on various levels of complex cases and attending immigration meetings at Federal Plaza. Theona's public service career began with impactful work in various government and non-governmental organizations, such as Neighbor to Neighbor and Stand for Children. She volunteered as an organizer for former Governor Deval Patrick’s campaign in Boston. Theona then interned at Beacon Hill for former Massachusetts State Representative Kate D. Campanale, and went on to volunteer to teach English at Saint Rita’s Refugee Center in the Bronx. While interning with former Congress Member Eliot Engel, Theona's interest in public service was amplified through her casework. She then went on to an internship at Lacroix Ramos Immigration Law Firm, as an Immigration Legal Intern, where she was a point of contact for her legal team and clients. While Theona was with Congress Member Adriano Espaillat, she served as a Immigration Liaison, taking on various levels of complex cases and attending immigration meetings at Federal Plaza. Throughout her time serving many communities, Theona Reets-DuPont established herself as a steadfast leader and advocate. As Public Health Advisor and Community Engagement Specialist for New York City Health and Hospitals, Theona was at the forefront of the community working in COVID-19 tested centers and educating individuals who tested positive for COVID-19 and connecting them with"
  },
  {
    "candidate": "Reets-DuPont, Theona S",
    "category": "bio",
    "score": null,
    "link": "https://sites.google.com/view/theona4citycouncil/meet-theona",
    "text": "numerous resources. Throughout her time serving many communities, Theona Reets-DuPont established herself as a steadfast leader and advocate. As Public Health Advisor and Community Engagement Specialist for New York City Health and Hospitals, Theona was at the forefront of the community working in COVID-19 tested centers and educating individuals who tested positive for COVID-19 and connecting them with numerous resources. Theona then transitioned back to her governmental roots, serving as Campaign Manager and Chief of Staff to New York City Council Member Oswald Feliz. As Chief of Staff, Theona oversaw a team of Councilmanic Aides, legislative fellows, and interns. During this time Theona played an instrumental role in the Association of Legislative Employees (ALE), which is currently America's largest union of legislative staffers, formed in the New York City Council. Theona’s dedication to labor rights, living wages, and worker protection led her to having one of the few fully unionized offices, where every employee she hired was also a member of ALE . Theona served on the union’s bargaining committee, where she represented union members during their first contract negotiation between the union and the City Council. Theona then transitioned back to her governmental roots, serving as Campaign Manager and Chief of Staff to New York City Council Member Oswald Feliz. As Chief of Staff, Theona oversaw a team of Councilmanic Aides, legislative fellows, and interns. During this time Theona played an instrumental role in the Association of Legislative Employees (ALE), which is currently America's largest union of legislative staffers, formed in the New York City Council. Theona’s dedication to labor rights, living wages, and worker protection led her to having one of the few fully unionized offices, where every employee she hired was also a member of ALE . Theona served on the union’s bargaining committee, where she represented union members during their first contract negotiation between the union and the City Council. Contact The Team Paid for by Theona for City Council Google Sites Report abuse Page details Page updated"
  }
]