[
  {
    "candidate": "Rem, David",
    "category": "bio",
    "score": null,
    "link": "https://www.davidremnyc.com/",
    "text": "0 0 Open Menu Close Menu Open Menu Close Menu David Rem David is a true advocate for New York City, consistently championing the issues that matter most to its residents. He has protested against rising crime rates, opposed the housing of undocumented immigrants in hotels, and stood up for municipal workers both during and after the COVID-19 pandemic. David has become a voice for the voiceless, addressing common-sense matters like school choice, supporting charter schools, and holding the public school system accountable for not preparing students for higher education. Transparency is a core principle for David. He promises to bring transparency to the forefront of his administration every single day, ensuring that NYC residents are always informed and represented. David is deeply passionate about inner-city children. He understands the detrimental effects of a lack of direction and vision on young lives and believes that his experiences and lessons learned from his own mistakes have prepared him to pave the way for a brighter future for NYC's children. He is the only candidate committed to introducing vocational studies in the public school system, expanding post-high school trade schools, and enhancing community outreach through police department programs to strengthen relationships and mutual respect between the community and law enforcement. David recognizes that our police force has been hindered by liberal agendas that ultimately compromise community safety. He firmly believes in the government's primary duty to protect life and is determined to eliminate sanctuary city laws, which he views as a source of neglect for the city's residents. While seniors and veterans have faced homelessness and financial struggles due to the city's fiscal mismanagement, undocumented immigrants have been housed in luxury hotels and given substantial monthly stipends. David Rem pledges that, under his leadership, NYC's legal residents and citizens will always come first. DONATE NOW WELCOME TO DAVID REM David Rem, a childhood friend of Donald Trump, was a featured speaker at Trump’s October 27, 2024, Madison Square Garden rally. A proud NYC activist, patriot, and former U.S. Congressional candidate who boldly challenged Alexandria Ocasio-Cortez, David has been a steadfast advocate for conservative values, common sense solutions, and securing America’s future—including taking a strong stand on closing the southern border. Now running for Mayor of New York City in 2025, David is dedicated to restoring safety, accountability, and opportunity in the city he loves. His activism began with the fight for merit-based education, championing fairness and hard work. As Mayor, David Rem will fight for the values that matter most to New Yorkers and deliver real solutions for a brighter future. DONATE NOW Please Volunteer! Name * First Name Last Name Email * Phone (###) ### #### What services are you interested in? Option 1 - DOOR KNOCKING Option 2 - PHONE BANKING Option 3 - OFFICE SUPPORT Preferred Date MM DD YYYY WHAT BOROUGH CAN YOU VOLUNTEER IN? How did you hear about us? Option 1 Option 2 Message * Thank you! DONATE NOW David Rem David is a true advocate for New York City, consistently championing the issues that matter most to its residents. He has protested against rising crime rates, opposed the housing of undocumented immigrants in hotels, and stood up for municipal workers both during and after the COVID-19 pandemic. David has become a voice for the voiceless, addressing common-sense matters like school choice, supporting charter schools, and holding the public school system accountable for not preparing students for higher education. Transparency is a core principle for David. He promises to bring transparency to the forefront of his administration every single day, ensuring that NYC residents are always informed and represented. David is deeply passionate about inner-city children. He understands the detrimental effects of a lack of direction and vision on young lives and believes that his experiences and lessons learned from his own mistakes have prepared him to pave the way for a brighter future for NYC's children. He is the only candidate committed to introducing vocational studies in the public school system, expanding post-high school trade schools, and enhancing community outreach through police department programs to strengthen relationships and mutual respect between the community and law enforcement. David recognizes that our police force has been hindered by liberal agendas that ultimately compromise community safety. He firmly believes in the government's primary duty to protect life and is determined to eliminate sanctuary city laws, which he views as a source of neglect for the city's residents. While seniors and veterans have faced homelessness and financial struggles due"
  },
  {
    "candidate": "Rem, David",
    "category": "bio",
    "score": null,
    "link": "https://www.davidremnyc.com/",
    "text": "to the city's fiscal mismanagement, undocumented immigrants have been housed in luxury hotels and given substantial monthly stipends. David Rem pledges that, under his leadership, NYC's legal residents and citizens will always come first. WELCOME TO DAVID REM WELCOME TO DAVID REM David Rem, a childhood friend of Donald Trump, was a featured speaker at Trump’s October 27, 2024, Madison Square Garden rally. A proud NYC activist, patriot, and former U.S. Congressional candidate who boldly challenged Alexandria Ocasio-Cortez, David has been a steadfast advocate for conservative values, common sense solutions, and securing America’s future—including taking a strong stand on closing the southern border. Now running for Mayor of New York City in 2025, David is dedicated to restoring safety, accountability, and opportunity in the city he loves. His activism began with the fight for merit-based education, championing fairness and hard work. As Mayor, David Rem will fight for the values that matter most to New Yorkers and deliver real solutions for a brighter future. Please Volunteer! * First Name Last Name * (###) ### #### MM DD YYYY * PAID FOR BY DAVID REM NYC DavidRemNYC@yahoo.com"
  }
]