[
  {
    "candidate": "Restler, Lincoln",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/lincoln-restler/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 33 Lincoln Restler Greenpoint, Northside Williamsburg, South Williamsburg, Brooklyn Heights, Downtown Brooklyn, DUMBO, Boerum Hill, Vinegar Hill, Bedford-Stuyvesant, Brooklyn Navy Yard Biography Born and raised in the 33rd Council District, Lincoln has spent his whole life living and working in the communities that make up the district – from Brooklyn Heights to Greenpoint and from Williamsburg to Boerum Hill. Lincoln shows up for our community as a 24/7 problem solver – hosting town halls, resolving thousands of constituent issues, and mobilizing neighbors to better our neighborhoods through volunteer opportunities. He has prioritized the urgent issues facing our City like securing affordable housing and protecting tenants, mitigating local climate change impacts, improving public transportation and safer streets, investing in our public schools, and holding the Mayor accountable. Lincoln has helped improve safety on major corridors including Atlantic Ave and McGuinness Boulevard, led oversight of the Adams administration as Chair of the Committee on Governmental Operations, and introduced and passed critical legislation to make our communities cleaner, safer, and greener. Before being elected to the Council, Lincoln spent most of his career as a public servant in New York City government in the Bloomberg and de Blasio administrations, including serving as Deputy Chief of Staff to Mayor de Blasio. He designed and implemented programs like IDNYC – providing all New Yorkers with access to a U.S. government issued photo identification. Lincoln formerly served as Executive Director of the New York City Employment and Training Coalition. Lincoln has been committed to reforming local politics for many years. Over a decade ago, Lincoln helped form the New Kings Democrats, an organization dedicated to bringing transparency, accountability, and integrity to Brooklyn politics. Lincoln was born and raised in Brooklyn Heights, lived in Greenpoint for over a decade, and now resides in Boerum Hill with his wife and son. He graduated from Brown University. Biography Born and raised in the 33rd Council District, Lincoln has spent his whole life living and working in the communities that make up the district – from Brooklyn Heights to Greenpoint and from Williamsburg to Boerum Hill. Lincoln shows up for our community as a 24/7 problem solver – hosting town halls, resolving thousands of constituent issues, and mobilizing neighbors to better our neighborhoods through volunteer opportunities. Born and raised in the 33rd Council District, Lincoln has spent his whole life living and working in the communities that make up the district – from Brooklyn Heights to Greenpoint and from Williamsburg to Boerum Hill. Lincoln shows up for our community as a 24/7 problem solver – hosting town halls, resolving thousands of constituent issues, and mobilizing neighbors to better our neighborhoods through volunteer opportunities. He has prioritized the urgent issues facing our City like securing affordable housing and protecting tenants, mitigating local climate change impacts, improving public transportation and safer streets, investing in our public schools, and holding the Mayor accountable. Lincoln has helped improve safety on major corridors including Atlantic Ave and McGuinness Boulevard, led oversight of the Adams administration as Chair of the Committee on Governmental Operations, and introduced and passed critical legislation to make our communities cleaner, safer, and greener. He has prioritized the urgent issues facing our City like securing affordable housing and protecting tenants, mitigating local climate change impacts, improving public transportation and safer streets, investing in our public schools, and holding the Mayor accountable. Lincoln has helped improve safety on major corridors including Atlantic Ave and McGuinness Boulevard, led oversight of the Adams administration as Chair of the Committee on Governmental Operations, and introduced and passed critical legislation to make our communities cleaner, safer, and greener. Before being elected to the Council, Lincoln spent most of his career as a public servant in New York City government in the Bloomberg and de Blasio administrations, including serving as Deputy Chief of Staff to Mayor de Blasio. He designed and implemented programs like IDNYC – providing all New Yorkers with access to a U.S. government issued photo identification. Lincoln formerly served as Executive Director of the New York City Employment and Training Coalition. Before being elected to the Council, Lincoln spent most of his career as a public servant in New York City government in the Bloomberg and de Blasio administrations, including serving as Deputy Chief of Staff to Mayor de Blasio. He designed and implemented programs like IDNYC – providing all New Yorkers with"
  },
  {
    "candidate": "Restler, Lincoln",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/lincoln-restler/",
    "text": "access to a U.S. government issued photo identification. Lincoln formerly served as Executive Director of the New York City Employment and Training Coalition. Lincoln has been committed to reforming local politics for many years. Over a decade ago, Lincoln helped form the New Kings Democrats, an organization dedicated to bringing transparency, accountability, and integrity to Brooklyn politics. Lincoln has been committed to reforming local politics for many years. Over a decade ago, Lincoln helped form the New Kings Democrats, an organization dedicated to bringing transparency, accountability, and integrity to Brooklyn politics. Lincoln was born and raised in Brooklyn Heights, lived in Greenpoint for over a decade, and now resides in Boerum Hill with his wife and son. He graduated from Brown University. Lincoln was born and raised in Brooklyn Heights, lived in Greenpoint for over a decade, and now resides in Boerum Hill with his wife and son. He graduated from Brown University. Biography News Newsletter Signup District Office 410 Atlantic Avenue Brooklyn, NY 11217 Phone: 718-875-5200 Fax: 718-643-6620 Legislative Office 250 Broadway, 1883 New York, NY 10007 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]