[
  {
    "candidate": "Richards, Donovan",
    "category": "bio",
    "score": null,
    "link": "https://www.richardsforqueens.com/meet-donovan",
    "text": "Donovan Richards serves the over 2.2 million residents of Queens as their Borough President. He was overwhelmingly elected with over 65% of the vote in 2020. Donovan made history as the first Black man to serve in this elected position. As Queens Borough President, Donovan is leading the efforts to revitalize our great borough and make it one which works for all of its residents and workers. Although in office for only a few months, his impact has been immediate. Some of Donovan’s major accomplishments include: Rapidly expanding access to the COVID-19 vaccine, including opening Citi Field as a distribution site. Rapidly expanding access to the COVID-19 vaccine, including opening Citi Field as a distribution site. Securing $17.5 million to help struggling small businesses. Securing $17.5 million to help struggling small businesses. Hosting food distribution events around the borough to help those experiencing food insecurity. Hosting food distribution events around the borough to help those experiencing food insecurity. Modernizing the Community Board process with online applications, resulting in a record 56% increase in responses. Modernizing the Community Board process with online applications, resulting in a record 56% increase in responses. Continuing to make Queens an affordable place to live by breaking ground on hundreds of new units of real affordable housing. Continuing to make Queens an affordable place to live by breaking ground on hundreds of new units of real affordable housing. To help fight climate change, and prepare Queens for a safe, clean, and sustainable future, he has empowered the Queens Solid Waste Advisory Board to work on environmental justice initiatives. To help fight climate change, and prepare Queens for a safe, clean, and sustainable future, he has empowered the Queens Solid Waste Advisory Board to work on environmental justice initiatives. It was tragedy that inspired Donovan to get involved in the fight to end gun violence and advocate for public safety changes in his community. He has been a community activist since the murder of a close childhood friend propelled him into action. Donovan’s pursuit of justice brought him into close contact with elected officials, government agencies, and other leaders. He quickly recognized that as an elected official he could affect change at a greater level by helping to turn progressive policy solutions into reality. Donovan was elected to the New York City Council in 2013. As a champion for affordable housing, he served as the Chair of the Subcommittee on Zoning and Franchises during his first City Council term. Donovan used this position to rezone the Rockaways to increase residential availability, as well as, commercial and community space, including a new world-class library. He also served as Chair of the Committee on Environmental Protection following SuperStorm Sandy which devastated many areas of Queens. Through his position he was able to help secure funding for flood protection to protect vulnerable coastal communities. Donovan is a steadfast advocate for criminal justice reform, most recently serving as Chair of the Committee on Public Safety. In that position, he stood up to the NYPD. He has held numerous hearings on police brutality, treatment of protestors, and negotiation a public disciplinary system for bad cops. He has been tireless advocate for the Special Victims Division. In the City Council, he has been a proponent of closing Rikers Island and legalizing the recreational use of cannabis. Donovan Richards is a lifelong Queens resident who has represented Southeast Queens in the City Council since 2013. Growing up he lived in Jamaica, St. Albans, Hollis, and Rosedale, with frequent visits to grandparents who lived in the Rockaways. He attended Jamaica High School and Redemption Christian Academy before studying communications, radio, and TV at Nyack College. He later received a degree in Aviation Management from Vaughn College. He lives in the Rockaways with his wife and son. DONOVAN IN THE COMMUNITY stay in touch RichardsForQueens@gmail.com Paid for by Friends Of Donovan Richards Info Meet Donovan Issues Video Action Volunteer Contact Donate Action Kit"
  }
]