[
  {
    "candidate": "Rinaldi, Jonathan D",
    "category": "bio",
    "score": null,
    "link": "https://www.jdrfornyc.com/about",
    "text": "0 0 Open Menu Close Menu Open Menu Close Menu ABOUT JONATHAN RESPONSIBLE RINALDI Proud Queens native, 'Responsible Rinaldi,' is running for NYC Council District 29 in Queens. He tackles community concerns like safety, healthcare, education, and parental rights. He advocates for fiscal responsibility, policy, and affordable housing, driven by a passion for community well-being. Jonathan D. Rinaldi was born and raised in Queens, NY. He also grew up in COOP City in the Bronx, with Jewish roots. Fluent in Spanish, Jonathan's parents are from Argentina, and he co-parents three black children with his Haitian ex-wife. He holds a Bachelor of Science in Architecture from City College NY in Harlem and became the first architecture student to be the president of the student government. Additionally, he showcased his expertise for seven years on a reality show called \"Million Dollar Contractor.\" In 2023, Jonathan ran for City Council District 24 in Queens, earning endorsements from the Queens GOP and the Queens Conservative Party. His campaign focused on transparency and accountability, emphasizing fiscally sound economic policies, parental rights, confronting overtaxation, ensuring secure elections, preserving life, public safety, education improvement, small business support, ending mandates, advocating for animal welfare, enhancing eldercare, and tackling homelessness. Additionally, he addressed concerns related to the City's migrant crisis, public housing, Local Law 97, and NYC congestion pricing. As an advocate for transparency and accountability, Jonathan served as a First Amendment auditor, filing FOIL requests for public records. His activism included organizing rallies like the Kew Motor Inn Protest, Pomonok Houses Rally, Roosevelt Hotel Exposure, and more, addressing housing issues. He was the first on-site at Creedmoor, exposing incoming migrants, and highlighted voter fraud concerns at the Board of Elections Rally. Additionally, he engaged with religious communities, recognizing conservative values, and actively participated in community service. Jonathan gained substantial media attention, securing coverage on the covers of major publications such as The New York Times, NY Post, NY Daily News, AM New York, and the UK Daily Mail. Additionally, he was featured on Spanish speaking media outlets such as El Diario NY, Telemundo, and Univision, expanding his visibility across diverse audiences. Furthermore, Jonathan appeared on Stew Peters show, Salty Cracker, and became a recurring guest on Culture Club USA. This extensive media coverage played a crucial role in increasing his reach and communicating uncensored messages to a wide audience, irrespective of political affiliations. He is honored to announce his candidacy for Assembly District 28. As a lifelong resident of Queens, he is deeply committed to addressing the pressing issues that affect us all. From crime to healthcare, he believes that together, we can create a brighter and more prosperous future for our families, businesses, and neighborhoods. ABOUT JONATHAN RESPONSIBLE RINALDI Proud Queens native, 'Responsible Rinaldi,' is running for NYC Council District 29 in Queens. He tackles community concerns like safety, healthcare, education, and parental rights. He advocates for fiscal responsibility, policy, and affordable housing, driven by a passion for community well-being. Jonathan D. Rinaldi was born and raised in Queens, NY. He also grew up in COOP City in the Bronx, with Jewish roots. Fluent in Spanish, Jonathan's parents are from Argentina, and he co-parents three black children with his Haitian ex-wife. He holds a Bachelor of Science in Architecture from City College NY in Harlem and became the first architecture student to be the president of the student government. Additionally, he showcased his expertise for seven years on a reality show called \"Million Dollar Contractor.\" In 2023, Jonathan ran for City Council District 24 in Queens, earning endorsements from the Queens GOP and the Queens Conservative Party. His campaign focused on transparency and accountability, emphasizing fiscally sound economic policies, parental rights, confronting overtaxation, ensuring secure elections, preserving life, public safety, education improvement, small business support, ending mandates, advocating for animal welfare, enhancing eldercare, and tackling homelessness. Additionally, he addressed concerns related to the City's migrant crisis, public housing, Local Law 97, and NYC congestion pricing. As an advocate for transparency and accountability, Jonathan served as a First Amendment auditor, filing FOIL requests for public records. His activism included organizing rallies like the Kew Motor Inn Protest, Pomonok Houses Rally, Roosevelt Hotel Exposure, and more, addressing housing issues. He was the first on-site at Creedmoor, exposing incoming migrants, and highlighted voter fraud concerns at the Board of Elections Rally. Additionally, he engaged with religious communities, recognizing conservative values, and actively participated in community service. Jonathan gained substantial media attention, securing coverage on the covers of major publications such"
  },
  {
    "candidate": "Rinaldi, Jonathan D",
    "category": "bio",
    "score": null,
    "link": "https://www.jdrfornyc.com/about",
    "text": "as The New York Times, NY Post, NY Daily News, AM New York, and the UK Daily Mail. Additionally, he was featured on Spanish speaking media outlets such as El Diario NY, Telemundo, and Univision, expanding his visibility across diverse audiences. Furthermore, Jonathan appeared on Stew Peters show, Salty Cracker, and became a recurring guest on Culture Club USA. This extensive media coverage played a crucial role in increasing his reach and communicating uncensored messages to a wide audience, irrespective of political affiliations. He is honored to announce his candidacy for Assembly District 28. As a lifelong resident of Queens, he is deeply committed to addressing the pressing issues that affect us all. From crime to healthcare, he believes that together, we can create a brighter and more prosperous future for our families, businesses, and neighborhoods. JONATHAN D. RINALDI FOR CITY COUNCIL DISTRICT 29 Home About Issues Get Involved votejdr@gmail.com"
  }
]