[
  {
    "candidate": "Robertson, Hector",
    "category": "bio",
    "score": null,
    "link": "https://www.hectorforcitycouncil.com/about",
    "text": "0 0 Open Menu Close Menu Open Menu Close Menu About Courage. Character. Community We need your support, empower our movement. Donate today Meet Hector Robertson Hector Robertson is running for the office of City Council for New York City’s District 35 in Brooklyn, representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. A longtime resident of Crown Heights Brooklyn and son of Jamaican and Panamanian immigrants, is seeking to become a public servant committed to making government more accessible for everyone in the district and across the city of New York. Hector’s commitment to public and community service is personal and had its beginning when he saw neighbors struggling to keep their housing while being abused and harassed by building owners. To centralized his efforts in helping the community, Hector founded the Washington Avenue Botanic Block Association (WABBA) and also the Crown Heights Community Council (CHCC) to provide information and resources for those affected tenants and anyone else who may need help. OVER THE YEARS, Hector has become a fierce advocate for older adults not understanding NYC red tapes regarding city services and for families impacted by the lack of low-income housing. Hector has an unwavering pledge to serving families who are in desperate need to keep a roof over their heads and keep their families safe. Hector has spent more than two decades working in the healthcare industry in the clinical trials space – first with reputable company such as Pfizer, Roche, Novartis and Siemens and later for various other Pharmaceutical, Biotech, Medical Device and Diagnosis companies and at the same time, involved in community service. Hector is a graduate and holds a degree from the University of Panama. He lives with his wife in the district he wishes to represent, Crown Heights. “ Putting Working Class First ” About Courage. Character. Community We need your support, empower our movement. We need your support, empower our movement. Meet Hector Robertson Hector Robertson Hector Robertson is running for the office of City Council for New York City’s District 35 in Brooklyn, representing the neighborhoods of Crown Heights, Prospect Heights, Clinton Hill, and Fort Greene. A longtime resident of Crown Heights Brooklyn and son of Jamaican and Panamanian immigrants, is seeking to become a public servant committed to making government more accessible for everyone in the district and across the city of New York. Hector’s commitment to public and community service is personal and had its beginning when he saw neighbors struggling to keep their housing while being abused and harassed by building owners. To centralized his efforts in helping the community, Hector founded the Washington Avenue Botanic Block Association (WABBA) and also the Crown Heights Community Council (CHCC) to provide information and resources for those affected tenants and anyone else who may need help. OVER THE YEARS, OVER THE YEARS, Hector has become a fierce advocate for older adults not understanding NYC red tapes regarding city services and for families impacted by the lack of low-income housing. Hector has an unwavering pledge to serving families who are in desperate need to keep a roof over their heads and keep their families safe. Hector has spent more than two decades working in the healthcare industry in the clinical trials space – first with reputable company such as Pfizer, Roche, Novartis and Siemens and later for various other Pharmaceutical, Biotech, Medical Device and Diagnosis companies and at the same time, involved in community service. Hector is a graduate and holds a degree from the University of Panama. He lives with his wife in the district he wishes to represent, Crown Heights. “ Putting Working Class First ” “ Putting Working Class First ” “ Putting Working Class First ”"
  }
]