[
  {
    "candidate": "Ryan, Allie L",
    "category": "bio",
    "score": null,
    "link": "https://www.redfin.com/real-estate-agents/ryan-allie",
    "text": "Sign in SEARCH For Sale For Rent Find an Agent Feed Favorites Redfin Premier Sell My Home List My Home for Rent Mobile App Homepage Saved Searches Why Sell with Redfin? Owner Dashboard Renter Dashboard Open House Schedule Appointments Mortgage Be a Redfin Agent Notification Settings Homes for sale Condos for sale Land for sale Open houses Buy with Redfin Redfin Premier Affordability calculator Home buying guide Find lenders & inspectors Free home buying classes US housing market Renter dashboard Rental market tracker How much rent can I afford? Should I rent or buy? Renter guide List my home for rent Rental Tools dashboard US rental market trends Should I sell or rent my home? What's my home worth? My home dashboard Why sell with Redfin? Redfin Premier Redfin Full Service Find an agent Home selling guide Will selling pay off? Find handypeople and stagers Home improvement trends Get pre-approved Today's mortgage rates Today's refinance rates Home equity lenders Become a lender partner Payment calculator How much can I afford? Rent vs. buy How to get pre-approved Find an Agent Join as a Redfin Agent Join our referral network Agent Resource Center Join / Sign in Back to Bonney Lake Agents Ryan Allie 205 HOMES CLOSED IN: Bonney Lake · Enumclaw · Maple Valley · Puyallup · Lake Tapps · Auburn · Des Moines · Tacoma · Federal Way · Milton and other neighborhoods … Bonney Lake · Enumclaw · Maple Valley · Puyallup · Lake Tapps · Auburn · Des Moines · Tacoma · Federal Way · Milton and other neighborhoods … View More Get in Touch English Currently taking calls Currently taking calls Ryan has 20 sales in your neighborhood. Ryan Allie Get in Touch About Ryan Ryan's Listings & Sales $825,000 20411 90th Pl S Kent, WA 98031 $825,000 9806 30th Ave SW Seattle, WA 98126 — — — $575,000 8023 A St Tacoma, WA 98408 $535,000 9519 133rd St E Puyallup, WA 98373 $499,950 6589 James Ave SE Unit 12D Auburn, WA 98092 $265,000 2511 S 248th St Unit B22 Kent, WA 98032 We had something come up last minute and Ryan communicated with lender, title agency, and 1031 exchange company immediately and was able to save the sale. Rick L Closed Dec '20 for $339,900 We had something come up last minute and Ryan communicated with lender, title agency, and 1031 exchange company immediately and was able to save the sale. See all agent reviews Tour insights 3 beds 2.5 baths 1,556 sq ft 10705 185th Ave E, Bonney Lake, WA 98391 \"Well-maintained home adjacent to a greenbelt, situated in a quiet cul-de-sac. Ideal layout for a starter home, turnkey and ready for move-in.\" Show more Saw this home 1 Week Ago 3 beds 2.5 baths 1,556 sq ft 1,556 sq ft \"Well-maintained home adjacent to a greenbelt, situated in a quiet cul-de-sac. Ideal layout for a starter home, turnkey and ready for move-in.\" Saw this home 1 Week Ago 3 beds 2.5 baths 1,850 sq ft 324 Valley Ave E, Sumner, WA 98390 \"Charming midcentury home with a spacious lot, requiring some renovation. Ideal for commuters with easy freeway access. A true diamond in the rough.\" Show more Saw this home 3 Weeks Ago 3 beds 2.5 baths 1,850 sq ft 1,850 sq ft \"Charming midcentury home with a spacious lot, requiring some renovation. Ideal for commuters with easy freeway access. A true diamond in the rough.\" Saw this home 3 Weeks Ago 4 beds 2.5 baths 2,516 sq ft 18410 Village Pkwy E, Bonney Lake, WA 98391 \"This charming corner lot home boasts an abundance of natural light and a spacious layout, especially on the lower level. It features tasteful color schemes, a cozy den, and double...\" Show more doors leading to the primary bedroom, complemented by a subtle mountain view. Short walk to large park.\" Saw this home 3 Weeks Ago 4 beds 2.5 baths 2,516 sq ft 2,516 sq ft \"This charming corner lot home boasts an abundance of natural light and a spacious layout, especially on the lower level. It features tasteful color schemes, a cozy den, and double...\" doors leading to the primary bedroom, complemented by a subtle mountain view. Short walk to large park.\" Saw this home 3 Weeks Ago The highest level of service from Redfin’s best agents Redfin Premier agents are local luxury experts with years of experience buying and selling high-end homes. Only our best agents qualify to become Redfin Premier agents. When you're ready"
  },
  {
    "candidate": "Ryan, Allie L",
    "category": "bio",
    "score": null,
    "link": "https://www.redfin.com/real-estate-agents/ryan-allie",
    "text": "to buy, your agent will know what it takes to write a winning offer for the most highly sought-after homes. And when it's time to sell, they will know how to price, prepare, and market your home, so it attracts qualified buyers and sells for more. Plus, keep more of the proceeds from your home sale by paying a 1% listing fee when you buy and sell with us, less than half of what brokerages commonly charge. Plus, keep more of the proceeds from your home sale by paying a 1% listing fee when you buy and sell with us, less than half of what brokerages commonly charge. Learn more Meet Ryan's Team See all , , Redfin Redfin Real Estate Agents Bonney Lake Brokers Ryan Allie Ryan Allie Popular searches Seattle Real Estate Agents Bellevue Real Estate Agents Tacoma Real Estate Agents Kirkland Real Estate Agents Bothell Real Estate Agents Redmond Real Estate Agents Vancouver Real Estate Agents Puyallup Real Estate Agents Renton Real Estate Agents Issaquah Real Estate Agents Lynnwood Real Estate Agents Sammamish Real Estate Agents Everett Real Estate Agents Olympia Real Estate Agents Gig Harbor Real Estate Agents Show more Popular cities Seattle Homes for Sale Bellevue Homes for Sale Tacoma Homes for Sale Kirkland Homes for Sale Bothell Homes for Sale Redmond Homes for Sale Vancouver Homes for Sale Puyallup Homes for Sale Renton Homes for Sale Issaquah Homes for Sale Lynnwood Homes for Sale Sammamish Homes for Sale Everett Homes for Sale Olympia Homes for Sale Gig Harbor Homes for Sale Show more Near me searches Condos for sale near me Houses for sale near me Land for sale near me Open houses near me Join us Find homes faster About us Find us Advertise Subsidiaries Countries United States United States Canada Copyright: © 2025 Redfin. All rights reserved. Updated January 2023: By searching, you agree to the Terms of Use , and Privacy Policy . Do not sell or share my personal information . REDFIN and all REDFIN variants, TITLE FORWARD, WALK SCORE, and the R logos, are trademarks of Redfin Corporation, registered or pending in the USPTO. California DRE #01521930 Redfin is licensed to do business in New York as Redfin Real Estate. NY Standard Operating Procedures New Mexico Real Estate Licenses TREC: Info About Brokerage Services , Consumer Protection Notice If you are using a screen reader, or having trouble reading this website, please call Redfin Customer Support for help at 1-844-759-7732 . REDFIN IS COMMITTED TO AND ABIDES BY THE FAIR HOUSING ACT AND EQUAL OPPORTUNITY ACT. READ REDFIN'S FAIR HOUSING POLICY AND THE NEW YORK STATE FAIR HOUSING NOTICE . REDFIN IS COMMITTED TO AND ABIDES BY THE FAIR HOUSING ACT AND EQUAL OPPORTUNITY ACT. READ REDFIN'S FAIR HOUSING POLICY AND THE NEW YORK STATE FAIR HOUSING NOTICE ."
  }
]