[
  {
    "candidate": "Sanchez, Justin E",
    "category": "bio",
    "score": null,
    "link": "https://victoryfund.org/candidate/justin-sanchez/",
    "text": "Visit Victory Institute Visit Victory Institute About Expand Navigation Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Expand Navigation Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting About Expand Navigation Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Expand Navigation Black Leaders Caucus Our Future Caucus Expand Navigation Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting Our Candidates Our Candidates Run For Office Run For Office Support Us Support Us Donate Donate Events Events News News Blog Blog Research Research Contact Contact About Expand Navigation Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Expand Navigation Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting About Expand Navigation Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Expand Navigation Black Leaders Caucus Our Future Caucus Expand Navigation Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting Our Candidates Our Candidates Run For Office Run For Office Support Us Support Us Donate Donate Go to LGBTQ+ Victory Fund Home Donate Visit Victory Institute Visit Victory Institute Events Events News News Blog Blog Research Research Media Media Contact Contact Bluesky Channel Bluesky Channel Facebook Profile Facebook Profile YouTube Channel YouTube Channel Instagram Profile Instagram Profile Linkedin Profile Linkedin Profile Flickr Profile Flickr Profile Go to LGBTQ+ Victory Fund Home About Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting About Our Mission Endorsements Our History Victory Fund Board LGBTQ+ Victory Action Board Victory Campaign Board LGBTQ+ Victory Action Black Leaders Caucus Our Future Caucus Black Leaders Caucus Our Future Caucus Past Results Career Opportunities Annual Reporting Our Candidates Our Candidates Run For Office Run For Office Support Us Support Us Donate Donate LGBTQ+ Victory Fund LGBTQ+ Victory Fund Our Candidates Our Candidates Sanchez, Justin Sanchez, Justin Justin Sanchez New York City Council, District 17 Back to Candidates Donate to Justin Position Sought New York City Council, District 17 Current Position New York City Council Party Affiliation Democrat Location New York, New York Date of Primary Election June 24, 2025 Primary Election Donation Limit $1,050 Date of General Election November 4, 2025 General Election Donation Limit $1,050 Race/Ethnicity Latinx/Hispanic Gender Identity Cisgender Man Sexual Orientation Gay Connect with Justin Sanchez Justin will continue to bring important representation to the New York City Council! Biography Justin Sanchez is a born and raised Bronxite of Dominican, Puerto Rican, Mexican, and Honduran descent. He has had the honor of learning from and working with some of the best leaders that the State of New York has to offer, most recently serving as Chief of Staff to NYS Senator Nathalia Fernandez. Justin graduated as Valedictorian from the CUNY School of Labor and Urban Studies and obtained his MPA from the NYU Robert F. Wagner Graduate School of Public Service. He served as the Chair of the Hispanic & Latinx Caucus for the Young Democrats of America and President of the Stonewall Democrats – the largest LGBTQ+ political club in New York. Donate to Justin Position Sought New York City Council, District 17 Current Position New York City Council Party Affiliation Democrat Location New York, New York Date of Primary Election June 24, 2025 Primary Election Donation Limit $1,050 Date of General Election November 4, 2025 General Election Donation Limit $1,050 Race/Ethnicity Latinx/Hispanic Gender Identity Cisgender Man Sexual Orientation Gay Connect with Justin Sanchez Justin will continue to bring important representation to the New York City Council! Biography Justin Sanchez is a born and raised Bronxite of Dominican, Puerto Rican, Mexican, and Honduran descent. He has had the honor of learning from and working with some of the best leaders that the State of New York has to offer, most recently serving as Chief of Staff to NYS Senator Nathalia Fernandez. Justin graduated as Valedictorian from the CUNY School of Labor and Urban Studies and obtained his MPA from the NYU Robert F. Wagner Graduate School of Public Service. He served as the Chair of the Hispanic & Latinx Caucus for the Young Democrats of America and President of the Stonewall Democrats – the largest LGBTQ+ political club in New York. 1225 I (Eye) Street"
  },
  {
    "candidate": "Sanchez, Justin E",
    "category": "bio",
    "score": null,
    "link": "https://victoryfund.org/candidate/justin-sanchez/",
    "text": "NW, Suite 525 Washington, DC 20005 Voice: 202.VICTORY Fax: 202.289.3863 Electing LGBTQ+ leaders. Home Home Contact Contact Privacy Policy Privacy Policy Terms of Use Terms of Use © 2006 - 2025 LGBTQ+ Victory Fund. All Rights Reserved | Built by Social Driver All content on this page is paid for by LGBTQ+ Victory Fund. Close Modal Close Modal"
  }
]