[
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.dreshare.com/raymond-santana-jr/",
    "text": "Home Privacy Policy Disclaimer Dreshare Team Contact Us About Us Home Privacy Policy Disclaimer Dreshare Team Contact Us About Us Home » Celeb Biography » Raymond Santana Jr. Wiki, Age, Wife, Biography, Family, Kids & Facts Deepika Verma April 28, 2023 26 Raymond Santana Jr. Wiki, Age, Wife, Biography, Family, Kids & Facts Raymond Santana Jr. (born April 26, 1975) is an American Producer, Activist, Fashion Designer, Businessman, Controversial Personality, and Instagram Star from Atlanta, Georgia. He has produced various films and TV shows like Bloodsworth: An Innocent Man (2015), The Central Park Five (2012), and American Justice (1992). He has also founded Park Madison NYC, his own Fashion Clothing Company. Central Park Jogger Case, Trisha Meili & Matias Reyes At the age of 14, Raymond was arrested along with his 4 friends ( Yusef Salaam , Korey Wise , Antron McCray , and Kevin Richardson ) in his involvement in the rape and assault of Trisha Meili (White Descent Jogger) in Central Park, New York City. On May 1, 1989, Real Estate Business Tycoon Donald Trump had spent $85K US Dollars to put full page ads on 4 New York City’s Newspaper demanding “ Death Penalty ” for accused criminals. In December 1990, the 44-year-old Santana Junior had received in between 5 to 15 years of imprisonment in the second trial of New York Court. But after the confession of Matias Reyes , he has released in 2002. Trivia & Quick Info Wiki/Bio Full Birth Name Raymond Santana Jr. Nick name Raymond. Profession Producer. Famous For Producing films like American Justice (1992), The Central Park Five (2012), and Bloodsworth: An Innocent Man (2015). Age (As of 2019) 44 years old Date of Birth (DOB), Birthday 26 April 1975. Birthplace/Hometown New York, United States. Nationality American. Gender Male. Sexuality (Gay or Lesbian) Straight. Debut Film : American Justice (1992, as Producer). TV-Show : NA. Social Media Stats Instagram : @santanaraymond (24.6k+ followers). Twitter : NA. Facebook : -- Awards Will Update. Star Sign (Zodiac Sign) Taurus. Ethnicity Afro-American Descent. Religion Christianity. Current Residence Atlanta, Georgia, USA. Physical Statistics Height (Tall) Feet & Inches: 5' 10\" . Centimeters: 178 cm . Meters: 1.78 m . Weight Kilograms: 81 Kg . Pounds: 178 lbs . Biceps Size 15 inches. Body Measurements (chest-waist-hips) 44-36-35. Shoe Size (US) 10. Eye Color Black. Hair Color Bald (Black). Tattoos details? Will Update. Family Parents Father : Not Known. Mother : NA. Siblings Brother: Will Update. Sister: Name not found. Relatives Grandparents: -- Uncle: -- Aunt: -- Personal Life Relationship Marital Status Married. Wedding Date 2013. Dating History? In a relationship with his partner Nekesta. Girlfriend Nekesta Samone Shelton Wife/Spouse Name Nekesta Samone Shelton. Children Son: NA. Daughter: Melia Symone. Education Highest Qualification Graduate. School Bronx Preparatory High School. Alma Mater Will Update. Hobbies & Favorite Things Favorite Celeb Actor: Morgan Freeman. Actress: Halle Berry. Dream Holiday Destination Miami. Favorite Color Black. Love to do Playing golf, Sunbath & Swimming. Favorite Dishes Non-Vegetarian Food. Wealth Net worth (Approx.) $3.1 Million US Dollars (As of 2019). Salary, Earnings & Monthly Income Under review. Contact Details Home Details House in Atlanta, Georgia, USA. Email Address Will Update. Office Address None. Mobile or Phone Number NA. Official Website None. Some Lesser Known Facts about Raymond Santana Jr. Wikipedia : Producer, Raymond Santana Jr. was born on the 26th of April 1975 to Afro-American parents from New York, USA. At present, his age is around 44 years old and birth Zodiac Sign is Taurus. In 2002, Serial Rapist Matias Reyes has confessed his crime for attempted murder and rape of Trisha Meili (a white Caucasian female jogger) in Central Park, New York City. In the same year, Santana found innocent in this case and released from jail. After a year, he has filed a lawsuit against New York City for racial discrimination, malicious prosecution, and emotionally torturing him. Antron McCray and Kevin Richardson have also sued the City for $250 million US Dollars. https://www.instagram.com/p/ByHo1VJFME3/ In November 2013, New York Mayor, Bill de Blasio has agreed for the settlement of this lawsuit. In the year 2014, all the Central Park Five’s Korey Wise, Yusef Salaam, Antron McCray, Raymond, and Kevin Richardson received $41 million settlement as compensation from New York Court. Explore More : The Biography of Lawrence Leathers , Lifestyle, Story & Affairs Richardson, Santana, Salaam, and McCray have received at around $7.1 million US Dollars and Korey Wise get $12.2 million USD. On 26 June 2017, he has completed his"
  },
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.dreshare.com/raymond-santana-jr/",
    "text": "graduation from Bronx Preparatory High School. He has received his degree along with his two friends Kevin Richardson, and Yusef Salaam (the Central Park Five’s 2 members). Photo of his Spouse Nekesta Samone Shelton. Wedding & Love Affairs : Raymond married his longtime girlfriend Nekesta Samone Shelton after release from the jail. His Wife “Nekesta Shelton” has supported him during his depression days. with his child Melia Symone. In addition, they also blessed with a daughter named “ Melia Symone “. Presently, he is living with his family from Atlanta, Georgia. He has a decent height at around 5 feet 10 inches or 178 cm tall In addition, his body weight is around 81 Kg (178 pounds) approx. Money Factor : His estimated Net worth is valued at $3.1 Million US Dollars. Netflix has also made “ When They See Us ” biographical Television Show inspired by the story of these 5 black men and Central Park Jogger Rape Case. This series is directed by Ava DuVernay and released on May 31, 2019. When They See Us Netflix Series. When They See Us’ Star Cast : In this Biopic, Actor Marquis Rodriguez is playing Santana Jr., Jharrel Jerome is featuring as Korey Wise, Ethan Herisse as Yusef Salaam, Caleel Harris as Antron McCray, and Asante Blackk as Kevin Richardson. Home » Celeb Biography » Raymond Santana Jr. Wiki, Age, Wife, Biography, Family, Kids & Facts » » Raymond Santana Jr. Wiki, Age, Wife, Biography, Family, Kids & Facts Deepika Verma Deepika Verma April 28, 2023 April 28, 2023 26 Raymond Santana Jr. Wiki, Age, Wife, Biography, Family, Kids & Facts Raymond Santana Jr. (born April 26, 1975) is an American Producer, Activist, Fashion Designer, Businessman, Controversial Personality, and Instagram Star from Atlanta, Georgia. He has produced various films and TV shows like Bloodsworth: An Innocent Man (2015), The Central Park Five (2012), and American Justice (1992). He has also founded Park Madison NYC, his own Fashion Clothing Company. Central Park Jogger Case, Trisha Meili & Matias Reyes At the age of 14, Raymond was arrested along with his 4 friends ( Yusef Salaam , Korey Wise , Antron McCray , and Kevin Richardson ) in his involvement in the rape and assault of Trisha Meili (White Descent Jogger) in Central Park, New York City. On May 1, 1989, Real Estate Business Tycoon Donald Trump had spent $85K US Dollars to put full page ads on 4 New York City’s Newspaper demanding “ Death Penalty ” for accused criminals. In December 1990, the 44-year-old Santana Junior had received in between 5 to 15 years of imprisonment in the second trial of New York Court. But after the confession of Matias Reyes , he has released in 2002. Trivia & Quick Info Wiki/Bio Full Birth Name Raymond Santana Jr. Nick name Raymond. Profession Producer. Famous For Producing films like American Justice (1992), The Central Park Five (2012), and Bloodsworth: An Innocent Man (2015). Age (As of 2019) 44 years old Date of Birth (DOB), Birthday 26 April 1975. Birthplace/Hometown New York, United States. Nationality American. Gender Male. Sexuality (Gay or Lesbian) Straight. Debut Film : American Justice (1992, as Producer). TV-Show : NA. Social Media Stats Instagram : @santanaraymond (24.6k+ followers). Twitter : NA. Facebook : -- Awards Will Update. Star Sign (Zodiac Sign) Taurus. Ethnicity Afro-American Descent. Religion Christianity. Current Residence Atlanta, Georgia, USA. Physical Statistics Physical Statistics Height (Tall) Feet & Inches: 5' 10\" . Centimeters: 178 cm . Meters: 1.78 m . Weight Kilograms: 81 Kg . Pounds: 178 lbs . Biceps Size 15 inches. Body Measurements (chest-waist-hips) 44-36-35. Shoe Size (US) 10. Eye Color Black. Hair Color Bald (Black). Tattoos details? Will Update. Family Family Parents Father : Not Known. Mother : NA. Siblings Brother: Will Update. Sister: Name not found. Relatives Grandparents: -- Uncle: -- Aunt: -- Personal Life Relationship Personal Life Relationship Marital Status Married. Wedding Date 2013. Dating History? In a relationship with his partner Nekesta. Girlfriend Nekesta Samone Shelton Wife/Spouse Name Nekesta Samone Shelton. Children Son: NA. Daughter: Melia Symone. Education Education Highest Qualification Graduate. School Bronx Preparatory High School. Alma Mater Will Update. Hobbies & Favorite Things Hobbies & Favorite Things Favorite Celeb Actor: Morgan Freeman. Actress: Halle Berry. Dream Holiday Destination Miami. Favorite Color Black. Love to do Playing golf, Sunbath & Swimming. Favorite Dishes Non-Vegetarian Food. Wealth Wealth Net worth (Approx.) $3.1 Million US Dollars (As of 2019). Salary, Earnings & Monthly Income Under review. Contact Details Contact Details Home Details"
  },
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.dreshare.com/raymond-santana-jr/",
    "text": "House in Atlanta, Georgia, USA. Email Address Will Update. Office Address None. Mobile or Phone Number NA. Official Website None. Some Lesser Known Facts about Raymond Santana Jr. Wikipedia : Producer, Raymond Santana Jr. was born on the 26th of April 1975 to Afro-American parents from New York, USA. At present, his age is around 44 years old and birth Zodiac Sign is Taurus. In 2002, Serial Rapist Matias Reyes has confessed his crime for attempted murder and rape of Trisha Meili (a white Caucasian female jogger) in Central Park, New York City. In the same year, Santana found innocent in this case and released from jail. After a year, he has filed a lawsuit against New York City for racial discrimination, malicious prosecution, and emotionally torturing him. Antron McCray and Kevin Richardson have also sued the City for $250 million US Dollars. https://www.instagram.com/p/ByHo1VJFME3/ In November 2013, New York Mayor, Bill de Blasio has agreed for the settlement of this lawsuit. In the year 2014, all the Central Park Five’s Korey Wise, Yusef Salaam, Antron McCray, Raymond, and Kevin Richardson received $41 million settlement as compensation from New York Court. Explore More : The Biography of Lawrence Leathers , Lifestyle, Story & Affairs Richardson, Santana, Salaam, and McCray have received at around $7.1 million US Dollars and Korey Wise get $12.2 million USD. On 26 June 2017, he has completed his graduation from Bronx Preparatory High School. He has received his degree along with his two friends Kevin Richardson, and Yusef Salaam (the Central Park Five’s 2 members). Photo of his Spouse Nekesta Samone Shelton. Wedding & Love Affairs : Raymond married his longtime girlfriend Nekesta Samone Shelton after release from the jail. His Wife “Nekesta Shelton” has supported him during his depression days. with his child Melia Symone. In addition, they also blessed with a daughter named “ Melia Symone “. Presently, he is living with his family from Atlanta, Georgia. He has a decent height at around 5 feet 10 inches or 178 cm tall In addition, his body weight is around 81 Kg (178 pounds) approx. Money Factor : His estimated Net worth is valued at $3.1 Million US Dollars. Netflix has also made “ When They See Us ” biographical Television Show inspired by the story of these 5 black men and Central Park Jogger Rape Case. This series is directed by Ava DuVernay and released on May 31, 2019. When They See Us Netflix Series. When They See Us’ Star Cast : In this Biopic, Actor Marquis Rodriguez is playing Santana Jr., Jharrel Jerome is featuring as Korey Wise, Ethan Herisse as Yusef Salaam, Caleel Harris as Antron McCray, and Asante Blackk as Kevin Richardson. FOLLOW US ON SOCIAL MEDIA Recent Posts Shannon St. Clair Wiki, Height, Age, Boyfriend, Family, Biography & More YBN Nahmir Height, Age, Girlfriend, Net worth, Biography, Family Facts Andre Marhold Wiki, Age, Wife, Girlfriend, Height, Weight, Biography & More Rosa Walton Age, Height, Wiki, Biography, Boyfriend, Family, Net Worth & More Related Posts Asher Lara Age, Height, Parents, Girlfriend, Ethnicity, Biography & Wiki Asher Lara Age, Height, Parents, Girlfriend, Ethnicity, Biography & Wiki Dinesh Kallahalli (Activist) Wiki, Age, Wife, Caste, Family, Biography & More Dinesh Kallahalli (Activist) Wiki, Age, Wife, Caste, Family, Biography & More Show Comments No Responses Yet Leave a Reply Cancel reply Leave a Reply Leave a Reply Welcome to Dreshare.com ! For Advertisements on our Site or to report a problem, kindly contact our team via email address. Contact Us: [email protected] [email protected] Dreshare Copyright © 2024 Stay Connected Important Pages About Us Meet the Team Contact Us Privacy Policy Disclaimer Advertisement & PR Dreshare Copyright © 2025."
  },
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.newsweek.com/who-raymond-santana-how-central-park-five-victim-inspired-ava-duvernay-make-when-they-1442509",
    "text": "U.S. World Science Health Life Rankings Opinion Entertainment Fact Check My Turn Education Events Sports Podcasts Better Planet Better Workplaces Vault Mightier Autos Newsletters Unconventional Vantage Experts Voices Go Ad-Free Go Ad-Free Login Login Go Ad-Free Login U.S. World Science Health Life Rankings Opinion Entertainment Fact Check My Turn Education Events Sports Podcasts Better Planet Better Workplaces Vault Mightier Autos Newsletters Unconventional Vantage Experts Voices Share U.S. Central park five Netflix Ava duvernay Who Is Raymond Santana? How Central Park Five Victim Inspired Ava DuVernay to Make 'When They See Us' Published Jun 06, 2019 at 8:06 AM EDT Who Is Raymond Santana? How Central Park Five Victim Inspired Ava DuVernay to Make 'When They See Us' By Alfred Joyner Senior News Editor Newsweek Is A Trust Project Member FOLLOW news article Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. Share Copy Link ✓ Link copied to clipboard! Listen Translate English (Original) Español 中国人 Français Deutsch Portuguese हिन्दी Newsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content. Read original Speed: 0.5x Speed: 1x Speed: 1.5x Speed: 2x 🎙️ Voice is AI-generated. Inconsistencies may occur. ✖ New Netflix drama When They See Us has received critical acclaim since first airing on the streaming service on May 31. Written and directed by Ava DuVernay, the four-part miniseries chronicles the real life wrongful conviction and imprisonment of five black teenagers for the rape and assault of 28-year-old investment banker Trisha Meili in New York's Central Park in 1989. Dubbed \"the Central Park Five,\" Antron McCray, Kevin Richardson, Yusef Salaam, Raymond Santana and Korey Wise were coerced into giving false confessions by prosecutors, before spending a number of years behind bars. Now, millions of people are hearing their harrowing story for the first time. And it's all thanks to one of the five—Raymond Santana. Raymond Santana spent five years behind bars for a crime he did not commit. Raymond Santana spent five years behind bars for a crime he did not commit. Getty Images/Paras Griffin After watching Selma , Ava DuVernay's 2014 biopic of Martin Luther King, Santana reached out to the filmmaker on Twitter asking if her next film could be about the Central Park Five. \"What's your next film gonna be on?? #thecentralparkfive #CP5 #centralpark5 maybe???? #wishfulthinking #fingerscrossed,\" he posted on April 21, 2015. It all started on @Twitter four years ago when Raymond Santana hit me with this question. The rest is their history. Finally told. Thank you, Raymond, Korey, Kevin, Yusef and Antron for trusting me. My brothers. #WhenTheySeeUs pic.twitter.com/t4mcWUITdr — Ava DuVernay (@ava) March 1, 2019 His wishful thinking came true. In 2017 Netflix greenlit a series based on the Central Park Five from Ava DuVernay, and two years later when the show aired the public finally got to see the true story of Santana and the other four wrongfully imprisoned men. Growing up in Harlem with a passion for drawing, Santana was just 14 years old when he was arrested in 1989 for the attack on Trisha Meili. Despite a lack of evidence, the prosecution—spearheaded by Assistant District Attorney Linda Fairstein —went ahead and pursued his conviction of rape and assault, along with that of McCray, Richardson, Salaam and Wise. Santana was tried as a juvenile and sentenced to five to 10 years in prison. He ended up spending five years there. A photo Santana posted to Instagram shows him in 1991 at Goshen Secure Center, a juvenile detention facility in Orange County, New York. View this post on Instagram It's not #tbt but I had to post #youngking...#goshen early 90s.. #wedothisforjustice #4justice #thisiswhywefight #dreamsdocometrue #ParkMadisonNyc #pmnyc #harlem #Drip #sauce #sauceboys #whentheyseeus A post shared by Raymond Santana (@santanaraymond) on Apr 5, 2019 at 8:26am PDT Despite being released from prison in 1995, Santana and the other four were not exonerated until 2002, when serial rapist and murderer Matias Reyes confessed from prison that he was the one who attacked Meili back in 1989. The following year they sued New York City for malicious prosecution, racial discrimination and emotional distress, with the case being settled for $41 million in 2014. Santana now lives in Georgia with his daughter and used the settlement money to launch his own fashion line, Park Madison NYC. Described on the brand website as \"constructing lifestyle collections for the rebellious and chic outcast,\" one of the items you can purchase is \"the Brotherhood tee\" with the names of the"
  },
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.newsweek.com/who-raymond-santana-how-central-park-five-victim-inspired-ava-duvernay-make-when-they-1442509",
    "text": "Central Park Five on it. A portion of the proceeds goes towards the Innocence Project, which helps others who have been wrongfully convicted. View this post on Instagram @parkmadisonnyc presents THE BROTHERHOOD TEE.. PRERORDER NOW at www.parkmadisonnyc.com @dr.yusefsalaam @kevrichardson77 #AntronMcCray @koreykingwise @santanaraymond #cp5 #salute #warriors #fighters #ParkMadisonNyc #whentheyseeus A post shared by PARK MADISON NYC x R.SANTANA (@parkmadisonnyc) on Apr 23, 2019 at 8:17pm PDT Speaking about When They See Us on Instagram, Santana said: \" #TheCentralPark5 ...when #TRUTH is your power. No matter how many times, they try to put out your light, as long as you stand on your square, and stay true to yourself. You will prevail, never give up, never settle. In 1989,we left in handcuffs and came back with a camera crew. We became fighters and now what you see here, is what you created. What you thought you destroyed. Stands proud and tall ,looks you in the eyes and is no longer afraid. You did this, and now you have to deal with your consequences. We will never let you forget.\" Request Reprint & Licensing Submit Correction View Editorial & AI Guidelines Alfred Joyner Newsweek Is A Trust Project Member news article Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. Share Translate English (Original) Español 中国人 Français Deutsch Portuguese हिन्दी Newsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content. 🎙️ Voice is AI-generated. Inconsistencies may occur. New Netflix drama When They See Us has received critical acclaim since first airing on the streaming service on May 31. Written and directed by Ava DuVernay, the four-part miniseries chronicles the real life wrongful conviction and imprisonment of five black teenagers for the rape and assault of 28-year-old investment banker Trisha Meili in New York's Central Park in 1989. Dubbed \"the Central Park Five,\" Antron McCray, Kevin Richardson, Yusef Salaam, Raymond Santana and Korey Wise were coerced into giving false confessions by prosecutors, before spending a number of years behind bars. Now, millions of people are hearing their harrowing story for the first time. And it's all thanks to one of the five—Raymond Santana. Raymond Santana spent five years behind bars for a crime he did not commit. Raymond Santana spent five years behind bars for a crime he did not commit. Getty Images/Paras Griffin After watching Selma , Ava DuVernay's 2014 biopic of Martin Luther King, Santana reached out to the filmmaker on Twitter asking if her next film could be about the Central Park Five. \"What's your next film gonna be on?? #thecentralparkfive #CP5 #centralpark5 maybe???? #wishfulthinking #fingerscrossed,\" he posted on April 21, 2015. It all started on @Twitter four years ago when Raymond Santana hit me with this question. The rest is their history. Finally told. Thank you, Raymond, Korey, Kevin, Yusef and Antron for trusting me. My brothers. #WhenTheySeeUs pic.twitter.com/t4mcWUITdr His wishful thinking came true. In 2017 Netflix greenlit a series based on the Central Park Five from Ava DuVernay, and two years later when the show aired the public finally got to see the true story of Santana and the other four wrongfully imprisoned men. Growing up in Harlem with a passion for drawing, Santana was just 14 years old when he was arrested in 1989 for the attack on Trisha Meili. Despite a lack of evidence, the prosecution—spearheaded by Assistant District Attorney Linda Fairstein —went ahead and pursued his conviction of rape and assault, along with that of McCray, Richardson, Salaam and Wise. Santana was tried as a juvenile and sentenced to five to 10 years in prison. He ended up spending five years there. A photo Santana posted to Instagram shows him in 1991 at Goshen Secure Center, a juvenile detention facility in Orange County, New York. It's not #tbt but I had to post #youngking...#goshen early 90s.. #wedothisforjustice #4justice #thisiswhywefight #dreamsdocometrue #ParkMadisonNyc #pmnyc #harlem #Drip #sauce #sauceboys #whentheyseeus A post shared by Raymond Santana (@santanaraymond) on Apr 5, 2019 at 8:26am PDT Despite being released from prison in 1995, Santana and the other four were not exonerated until 2002, when serial rapist and murderer Matias Reyes confessed from prison that he was the one who attacked Meili back in 1989. The following year they sued New York City for malicious prosecution, racial discrimination and emotional distress, with the case being settled for $41 million in 2014. Santana now lives in Georgia with his daughter and used the settlement money to launch his own fashion"
  },
  {
    "candidate": "Santana, Raymond",
    "category": "bio",
    "score": null,
    "link": "https://www.newsweek.com/who-raymond-santana-how-central-park-five-victim-inspired-ava-duvernay-make-when-they-1442509",
    "text": "line, Park Madison NYC. Described on the brand website as \"constructing lifestyle collections for the rebellious and chic outcast,\" one of the items you can purchase is \"the Brotherhood tee\" with the names of the Central Park Five on it. A portion of the proceeds goes towards the Innocence Project, which helps others who have been wrongfully convicted. @parkmadisonnyc presents THE BROTHERHOOD TEE.. PRERORDER NOW at www.parkmadisonnyc.com @dr.yusefsalaam @kevrichardson77 #AntronMcCray @koreykingwise @santanaraymond #cp5 #salute #warriors #fighters #ParkMadisonNyc #whentheyseeus A post shared by PARK MADISON NYC x R.SANTANA (@parkmadisonnyc) on Apr 23, 2019 at 8:17pm PDT Speaking about When They See Us on Instagram, Santana said: \" #TheCentralPark5 ...when #TRUTH is your power. No matter how many times, they try to put out your light, as long as you stand on your square, and stay true to yourself. You will prevail, never give up, never settle. In 1989,we left in handcuffs and came back with a camera crew. We became fighters and now what you see here, is what you created. What you thought you destroyed. Stands proud and tall ,looks you in the eyes and is no longer afraid. You did this, and now you have to deal with your consequences. We will never let you forget.\" Submit Correction Top stories Joe Biden Diagnosed With 'Aggressive' Form of Prostate Cancer Joe Biden Diagnosed With 'Aggressive' Form of Prostate Cancer Authorities Identify Suspect in Bombing Incident Near Fertility Clinic Authorities Identify Suspect in Bombing Incident Near Fertility Clinic Exclusive: Al Green on Trump Impeachment Push — 'Don't Wait' for 'Tanks' Exclusive: Al Green on Trump Impeachment Push — 'Don't Wait' for 'Tanks' Is a Billionaire Hotel Heir the Answer to Democrats' Working-Class Problem? Is a Billionaire Hotel Heir the Answer to Democrats' Working-Class Problem? About the writer Alfred Joyner Share on Twitter The Debate Trump Trade Deals Offer Lifeline to Farmers and Ranchers Like Me | Opinion By Todd Armstrong VS Tariffs, Trade, and the High Cost of Chaos in the White House | Opinion By Aron Solomon The Debate Trump Trade Deals Offer Lifeline to Farmers and Ranchers Like Me | Opinion Tariffs, Trade, and the High Cost of Chaos in the White House | Opinion U.S. World Science Health Rankings Opinion Entertainment Fact Check My Turn Education Events Sports Podcasts Better Planet Better Workplaces Vault Mightier Autos Newsletters Unconventional Vantage Experts Voices Trending Subscriptions $4.99 $49.00 $9.99 $99 Newsletters in your inbox See all The Bulletin (Daily) See Sample The Gist of It (Daily) Geoscape (Twice a Week) The 1600 (Daily) Inside Trump Policy (Weekly) Sports Daily (Daily) The Josh Hammer Report (Weekly) See Sample For The Culture (Three Times a Week) See Sample Discoveries (3 Times a Week) Like & Subscribe (Daily) Breaking News (As it Breaks) The Debate (Twice a Week) Pawsitively (Daily) Better Planet (Weekly) The Good Life (Weekly) Newsweek Pulse (2x3 Times a Month) In The Magazine May 23 2025 Issue Company About Us Masthead Diversity Announcements Archive Policies and Standards Mission Statement Leadership Newsletters Press Center Company Editions: U.S. Edition 日本 Polska România Editions: Contact Advertise Careers Contact Us Corrections Contact Terms of Use Cookie Policy Copyright Privacy Policy Terms & Conditions Terms of Sale Privacy Settings Terms of Use © 2025 NEWSWEEK DIGITAL LLC"
  }
]