[
  {
    "candidate": "Santosuosso, Kayla",
    "category": "bio",
    "score": null,
    "link": "https://womensmediacenter.com/shesource/expert/kayla-santosuosso",
    "text": "Sign Up About Press Donate Menu Search Search Search Reports About The Women’s Media Center’s research and reports shed a light on the underrepresentation and misrepresentation of women in the media. More » Status of Women in the U.S. Media Reports and Research Infographics Categories Arts and culture Health Media Politics Back Status of Women in the U.S. Media Reports and Research Infographics About The Women’s Media Center’s research and reports shed a light on the underrepresentation and misrepresentation of women in the media. More » About The Women’s Media Center’s research and reports shed a light on the underrepresentation and misrepresentation of women in the media. More » Status of Women in the U.S. Media Reports and Research Infographics Categories Arts and culture Health Media Politics Categories Arts and culture Health Media Politics Back Status of Women in the U.S. Media Reports and Research Infographics Articles About WMC publishes original reporting and commentary on headline stories and underreported topics. More » Articles Categories Feminism International Media Politics Back Articles About WMC publishes original reporting and commentary on headline stories and underreported topics. More » About WMC publishes original reporting and commentary on headline stories and underreported topics. More » Articles Categories Feminism International Media Politics Categories Feminism International Media Politics Back Articles Podcast About WMC Live with Robin Morgan is a weekly radio show and podcast in 110 countries around the globe. More » WMC Live WMC Live on iTunes Categories Feminism Misogyny Politics Robin Morgan Back WMC Live WMC Live on iTunes About WMC Live with Robin Morgan is a weekly radio show and podcast in 110 countries around the globe. More » About WMC Live with Robin Morgan is a weekly radio show and podcast in 110 countries around the globe. More » WMC Live WMC Live on iTunes Categories Feminism Misogyny Politics Robin Morgan Categories Feminism Misogyny Politics Robin Morgan Back WMC Live WMC Live on iTunes Experts About WMC SheSource is an online database of media-experienced women experts who we connect to journalists, bookers and producers. More » Find an Expert Apply to WMC SheSource Journalist Sign Up Areas of Expertise Business and the Economy Media and Entertainment Politics Social justice Back Find an Expert Apply to WMC SheSource Journalist Sign Up About WMC SheSource is an online database of media-experienced women experts who we connect to journalists, bookers and producers. More » About WMC SheSource is an online database of media-experienced women experts who we connect to journalists, bookers and producers. More » Find an Expert Apply to WMC SheSource Journalist Sign Up Areas of Expertise Business and the Economy Media and Entertainment Politics Social justice Areas of Expertise Business and the Economy Media and Entertainment Politics Social justice Back Find an Expert Apply to WMC SheSource Journalist Sign Up Training About The Women’s Media Center (WMC) media training and leadership programs seek to elevate women’s voices through media training. More » Progressive Women's Voices PWV Alumnae Other Training Back Progressive Women's Voices PWV Alumnae Other Training About The Women’s Media Center (WMC) media training and leadership programs seek to elevate women’s voices through media training. More » About The Women’s Media Center (WMC) media training and leadership programs seek to elevate women’s voices through media training. More » Progressive Women's Voices PWV Alumnae Other Training Back Progressive Women's Voices PWV Alumnae Other Training Speech About WMC Speech Project is dedicated to raising public and media awareness about online harassment. More » Articles Online Abuse 101 Resources Categories Education Feminism Misogyny Online harassment Back Articles Online Abuse 101 Resources About WMC Speech Project is dedicated to raising public and media awareness about online harassment. More » About WMC Speech Project is dedicated to raising public and media awareness about online harassment. More » Articles Online Abuse 101 Resources Categories Education Feminism Misogyny Online harassment Categories Education Feminism Misogyny Online harassment Back Articles Online Abuse 101 Resources More Links Back Sign Up About Press Donate Connect Events Privacy Policy Back Sign Up About Press Donate Connect Events Privacy Policy About Apply for WMC SheSource Articles Pitch our editor Pitch our editor Board Climate Contact Donate Editorial Events Experts for Media Facebook FBomb Pitch our editor Pitch our editor Features Pitch our editor Pitch our editor Gloria Steinem Home Page I/DARE Pitch our editor Pitch our editor Infographics International Jane Fonda Journalist Sign up Name it Change it Pitch us Podcast Press Room Press releases Press contact Press kit Press releases Press contact Press kit Privacy"
  },
  {
    "candidate": "Santosuosso, Kayla",
    "category": "bio",
    "score": null,
    "link": "https://womensmediacenter.com/shesource/expert/kayla-santosuosso",
    "text": "policy Progressive Women's Voices Publications Radio show Research Reports Robin Morgan SheSource Apply to WMC SheSource Sign up for journalist newsletter Apply to WMC SheSource Sign up for journalist newsletter Sources for journalists Speech Project Pitch our editor Pitch our editor Statistics Status of women in media reports Subscribe WMC News WMC Live WMC SheSource Journalist email WMC News WMC Live WMC SheSource Journalist email Training Twitter Unspinning the Spin WMC Live Women Under Siege Pitch our editor Pitch our editor Women's Media Awards Write for us WMC LOREEN ARBUS JOURNALISM PROGRAM Kayla Santosuosso Media Experience Available for Interviews In Search For Another Expert Kayla Santosuosso is a Brooklyn-based community organizer, activist, and nonprofit professional. She has been the Deputy Director of the Arab American Association of New York since 2013, leading development efforts to support programming in the largest Arab community in NYC. Kayla organizes around racial justice, environmental justice, and alternative economies. She is one of the founding members of the NYC chapter of Showing Up for Racial Justice - a group dedicated to organizing white people for anti-racism. Prior to her time at AAANY, Kayla led communications efforts for the Office of Sustainability at New York University, moving thousands of university students, faculty, and administration toward positive environmental behavioral change. She also worked with the Palestine Wildlife Society in Beit Sahour, Palestine, to establish an environmental education center for youth. Kayla has co-founded numerous non-profit initiatives and a for-profit company, and served on the national board of the Cooperative Food Empowerment Directive (CoFED). Kayla is an Arabic speaker and holds a Bachelor of Arts in Middle Eastern and Islamic Studies from New York University, where she was named one of the university's ten most influential students. She has presented throughout New York City on her organizing and activist work, and considers herself a perpetual student of social justice movements. Hailing originally from small-town Ohio, she is now a proud resident of Bay Ridge, Brooklyn. [SHARE] Expert DirectLink Expert DirectLink Climate change Environment Race and ethnicity Women Protesters Outside of Trump Tower Shred Trump's Bigotry Occupy Democrats [December 15, 2015] NASH Matters NASH [May 17, 2015] You Want to Defund the Arab American Association? Really? Hey Ridge [October 28, 2015] Hey Ridge: Bay Ridge is only out of the way if you don't live here Brick Underground [June 30, 2015] Connect Events Privacy Policy Sign Up • powered by feminism"
  }
]