[
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://en.wikipedia.org/wiki/Elvis_Santana",
    "text": "Main menu Main page Main page Contents Contents Current events Current events Random article Random article About Wikipedia About Wikipedia Contact us Contact us Help Help Learn to edit Learn to edit Community portal Community portal Recent changes Recent changes Upload file Upload file Special pages Special pages Search Appearance Donate Donate Create account Create account Log in Log in Personal tools Donate Donate Create account Create account Log in Log in learn more Contributions Contributions Talk Talk Contents (Top) 1 References 1 References 2 External links 2 External links Toggle the table of contents Elvis Santana Elvis Santana 3 languages العربية العربية مصرى مصرى Тоҷикӣ Тоҷикӣ Edit links Article Article Talk Talk English Read Read Edit Edit View history View history Tools Read Read Edit Edit View history View history What links here What links here Related changes Related changes Upload file Upload file Permanent link Permanent link Page information Page information Cite this page Cite this page Get shortened URL Get shortened URL Download QR code Download QR code Download as PDF Download as PDF Printable version Printable version Wikidata item Wikidata item Elvis da Silva Santana ( 1983-07-11 ) 11 July 1983 (age 41) ( 1983-07-11 ) 1983-07-11 (age 41) Brazil 1.77 m (5 ft 10 in) Midfielder CFA Amazonia Team Apps ( Gls ) 2000–2002 CFA Amazonia 2002 Östersunds FK 5 (0) 2003–2004 Hammarby IF 2 (0) 2004 → Hammarby TFF 12 (3) 2005 Paulista 2006 Vilhena 2006–2007 Vila Aurora 2006 → FC Ascona (loan) 2007 Bodens BK 3 (1) 2008 Akropolis IF 8 (1) 2009–2010 Väsby United 51 (7) 2011–2013 Assyriska FF 22 (2) *Club domestic league appearances and goals, correct as of 9 July 2012 Elvis da Silva Santana (born 11 July 1983) is a Brazilian footballer who plays as a midfielder . [ 1 ] [ ] References [ edit ] [ edit ] ^ \"Elvis Santana\" . Svenskfotboll . Retrieved 9 July 2012 . ^ \"Elvis Santana\" . Svenskfotboll . Retrieved 9 July 2012 . . Retrieved 9 July 2012 9 July External links [ edit ] [ edit ] Elvis Santana at the Swedish Football Association (in Swedish) (archived) (in Swedish) Fotbolltransfers profile This biographical article related to a Brazilian association football midfielder born in the 1980s is a stub . You can help Wikipedia by expanding it . This biographical article related to a Brazilian association football midfielder born in the 1980s is a stub . You can help Wikipedia by expanding it . v t e 1983 births Living people Men's association football midfielders Brazilian men's footballers Allsvenskan players Superettan players Assyriska FF players AFC Eskilstuna players Hammarby Talang FF players Hammarby Fotboll players Akropolis IF players Östersunds FK players Bodens BK players 21st-century Brazilian sportsmen Brazilian expatriate men's footballers Brazilian football midfielder, 1980s birth stubs Articles with short description Short description is different from Wikidata Use dmy dates from August 2024 Articles with Swedish-language sources (sv) SvFF player template using pid parameter All stub articles This page was last edited on 6 January 2025, at 21:47 (UTC) . (UTC) Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Toggle the table of contents Elvis Santana 3 languages Add topic"
  },
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Elvis_Santana",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Elvis Santana Elvis Santana Elvis Santana Democratic Party Candidate, New York City Council District 17 June 24, 2025 Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Personal LinkedIn Elvis Santana ( Democratic Party ) is running for election to the New York City Council to represent District 17 . He is on the ballot in the Democratic primary on June 24, 2025 . [source] Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2.2 2020 2.2.1 Endorsements 2.3 2017 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 2.2 2020 2.2.1 Endorsements 2.2 2020 2.2.1 Endorsements 2.2.1 Endorsements 2.3 2017 2.3 2017 3 Campaign themes 3.1 2025 3.2 2020 3.3 2017 3 Campaign themes 3.1 2025 3.1 2025 3.2 2020 3.2 2020 3.3 2017 3.3 2017 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Elvis Santana was born in the Bronx, New York. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 17 Antirson Ortiz , Freddy Perez Jr. , Justin Sanchez , and Elvis Santana are running in the Democratic primary for New York City Council District 17 on June 24, 2025. Candidate Antirson Ortiz Submit photo Freddy Perez Jr. Submit photo Justin Sanchez Elvis Santana There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Jasmine Uribe (D) Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . 2020 2020 See also: New York State Assembly elections, 2020 General election General election for New York State Assembly District 79 Chantel Jackson defeated Donald Skinner and Dion Powell in the general election for New York State Assembly District 79 on November 3, 2020. Candidate % Votes ✔ Chantel Jackson (D) 89.8 33,008 Submit photo Donald Skinner (R) 8.2 3,014 Dion Powell (Conservative Party) 1.9 682 Other/Write-in votes 0.2 57 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 36,761 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic primary for New York State Assembly District 79 The following candidates ran in the Democratic primary for New York State Assembly District 79 on June 23, 2020. Candidate % Votes ✔ Chantel Jackson 25.9 2,944 Submit photo Cynthia Cox 22.9 2,599 George Alvarez 21.6 2,456 Elvis Santana 13.5 1,536 Eric Stevenson 12.2 1,383 Dion Powell 3.6 410 Other/Write-in votes 0.2 25 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 11,353 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Withdrawn or disqualified candidates Isabel Sonia Fernandez (D) Republican primary election The Republican primary election was"
  },
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Elvis_Santana",
    "text": "canceled. Donald Skinner advanced from the Republican primary for New York State Assembly District 79. Conservative Party primary election The Conservative Party primary election was canceled. Dion Powell advanced from the Conservative Party primary for New York State Assembly District 79. Libertarian primary election Withdrawn or disqualified candidates Dion Powell (L) Serve America Movement Party primary election Withdrawn or disqualified candidates Dion Powell (Serve America Movement Party) Endorsements Endorsements To view Santana's endorsements in the 2020 election, please click here . 2017 2017 New York City held elections for mayor, public advocate, comptroller, and all 51 seats on the city council in 2017. New Yorkers also voted for offices in their boroughs: The Bronx , Brooklyn , Manhattan , Queens , and Staten Island . Primary elections were scheduled for September 12, 2017, and the general election was on November 7, 2017. Under New York law, candidates who run unopposed in a primary or general election win the nomination or election automatically, and their names do not appear on the ballot. [2] Incumbent Rafael Salamanca (D) defeated Patrick Delices (R), Oswald Denis (Conservative), and Elvis Santana (Empower Society) in the general election for the District 17 seat on the New York City Council. Party Candidate Vote % Votes Democratic Rafael Salamanca Incumbent 92.26% 11,512 Republican Patrick Delices 3.47% 433 Conservative Oswald Denis 2.26% 282 Empower Society Elvis Santana 1.81% 226 Write-in votes 0.2% 25 Total Votes 12,478 Source: New York City Board of Elections , \"2017 General Certified Election Results,\" November 28, 2017 Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Elvis Santana has not yet completed Ballotpedia's 2025 Candidate Connection survey. Send a message to Elvis Santana asking him to fill out the survey . If you are Elvis Santana, click here to fill out Ballotpedia's 2025 Candidate Connection survey . Who fills out Ballotpedia's Candidate Connection survey? Any candidate running for elected office, at any level, can complete Ballotpedia's Candidate Survey. Completing the survey will update the candidate's Ballotpedia profile, letting voters know who they are and what they stand for. More than 21,000 candidates have taken Ballotpedia's candidate survey since we launched it in 2015. Learn more about the survey here . You can ask Elvis Santana to fill out this survey by using the buttons below or emailing info@santananyc.com. 2020 2020 Elvis Santana completed Ballotpedia's Candidate Connection survey in 2020. The survey questions appear in bold and are followed by Santana's responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. Elvis Santana grew up in Morrisania to Dominican parents who instilled in him a strong sense of pride and community. After college at Albertus Magnus College, he returned to the Bronx and has been leading the fight for people of the Bronx with a community-first mindset and results in work ethic. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Funding Education Tenant Rights Workers Right Funding Education Tenant Rights Workers Right What areas of public policy are you personally passionate about? Over the last 10 years, Elvis has dedicated time and effort to ensure both men and women from all parts of the Bronx receive the opportunities available in order to continue calling the Bronx their home. Throughout all parts of New York, he has helped over 3,000 young men and women find employment while also creating relationships with local businesses that have helped reduce the low-income poverty rate in New York.​ Simultaneously, Elvis was able to advocate and organize for local issues such as housing, homelessness, and environmental justice. Today, he leads in bridging the gap between schools and employment by producing true outcomes that all New York schools deserve. Community involvement, opportunities, and leadership are what make Elvis Santana a well-represented Bronx Native. What qualities do you possess that you believe would make you a successful officeholder? Advocated and help pass policy & bill in New York City: Waste Equity Bill Housing Not Warehousing Act Rights to Counsel Waste Equity Bill Housing Not Warehousing Act Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public. If the candidate disagrees with an edit, he or she may request the"
  },
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Elvis_Santana",
    "text": "full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. 2017 2017 Santana provided the following candidate statement for the New York City voter guide: “ The South Bronx is filled with both talent and vision but unfortunately due to low job opportunities, the Bronx is only making the bare minimum. Families making $27,000 or less yearly, can barely make the minimum they need in a city like ours. That is why I believe creating jobs and opportunity would help make our district strong and growing for years to come. I believe that safe and affordable housing is a basic human right. The Bronx is known now as a target area for developers, which can impact what is known to be one of the most diversified populations in all the United States. We are currently facing one of the biggest housing challenges while and preserving the history of our neighborhoods is what I intend to do. Last and never the least, I will promote the expansion of economic growth. That is why if elected, economic growth will be the backbone for families and a continuous tool to be self-sufficient and stable. More than ever, we will aim to help each other. [3] [4] The South Bronx is filled with both talent and vision but unfortunately due to low job opportunities, the Bronx is only making the bare minimum. Families making $27,000 or less yearly, can barely make the minimum they need in a city like ours. That is why I believe creating jobs and opportunity would help make our district strong and growing for years to come. I believe that safe and affordable housing is a basic human right. The Bronx is known now as a target area for developers, which can impact what is known to be one of the most diversified populations in all the United States. We are currently facing one of the biggest housing challenges while and preserving the history of our neighborhoods is what I intend to do. Last and never the least, I will promote the expansion of economic growth. That is why if elected, economic growth will be the backbone for families and a continuous tool to be self-sufficient and stable. More than ever, we will aim to help each other. [3] [4] ” —Elvis Santana (2017) See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 17 Website Facebook Twitter Instagram Candidate New York City Council District 17 Website Facebook Twitter Instagram Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on May 14, 2020 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on May 14, 2020 ↑ New York Election Law , \"Sec 6-160. Primaries,\" accessed July 14, 2017 ↑ New York Election Law , \"Sec 6-160. Primaries,\" accessed July 14, 2017 ↑ New York City Campaign Finance Board, \"2017 General Election Voter Guide,\" accessed October 19, 2017 ↑ New York City Campaign Finance Board, \"2017 General Election Voter Guide,\" accessed October 19, 2017 ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress |"
  },
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Elvis_Santana",
    "text": "Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2020 challenger 2020 primary (defeated) 2025 challenger 2025 primary Democratic Party Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 New York State Assembly candidate, 2020 State House candidate, 2020 State house candidates Empower Society Party 2017 challenger Municipal candidate, 2017 City council candidate, 2017 City council candidate, New York, New York, 2017 Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch"
  },
  {
    "candidate": "Santana, Elvis",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Elvis_Santana",
    "text": "in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]