[
  {
    "candidate": "Sarantopoulos, George",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/George_Sarantopoulos",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia George Sarantopoulos George Sarantopoulos George Sarantopoulos Republican Party Candidate, New York City Council District 47 June 24, 2025 Education Susan E. Wagner High School Campaign website Campaign Facebook Campaign Twitter Campaign Instagram Personal LinkedIn George Sarantopoulos ( Republican Party ) is running for election to the New York City Council to represent District 47 . He is on the ballot in the Republican primary on June 24, 2025 . Sarantopoulos completed Ballotpedia's Candidate Connection survey in 2025. Click here to read the survey answers . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 3 Campaign themes 3.1 2025 3 Campaign themes 3.1 2025 3.1 2025 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography George Sarantopoulos was born in New York, New York . He earned a high school diploma from Susan E. Wagner High School. His career experience includes working as an entrepreneur. He was previously a restaurateur in Manhattan and chair of a national trade group. [1] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election The primary will occur on June 24, 2025. The general election will occur on November 4, 2025. General election candidates will be added here following the primary. Democratic primary election Democratic primary for New York City Council District 47 Kayla Santosuosso and Fedir Usmanov are running in the Democratic primary for New York City Council District 47 on June 24, 2025. Candidate Submit photo Kayla Santosuosso Submit photo Fedir Usmanov There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Republican primary election Republican primary for New York City Council District 47 Dikran Barsamian and George Sarantopoulos are running in the Republican primary for New York City Council District 47 on June 24, 2025. Candidate Submit photo Dikran Barsamian George Sarantopoulos There are no incumbents in this race. There are no incumbents in this race. = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Endorsements Endorsements Ballotpedia is gathering information about candidate endorsements. To send us an endorsement, click here . Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection George Sarantopoulos completed Ballotpedia's Candidate Connection survey in 2025. The survey questions appear in bold and are followed by Sarantopoulos' responses. Candidates are asked three required questions for this survey, but they may answer additional optional questions as well. Expand all | Collapse all Expand all Collapse all Who are you? Tell us about yourself. I'm George Sarantopoulos, a lifelong New Yorker and proud resident of Bay Ridge. I started out as a small business owner and restaurateur, and eventually founded Access One Solutions, an ATM and credit card processing company that now serves customers across the country. Over the years, I’ve built and led successful businesses and nonprofits in a range of industries. I’ve also had the honor of serving as Chairman Emeritus of a national trade association, where I helped amplify the voices of thousands of small business owners nationwide. In public service, I worked as Communications Director for a New York State Assemblyman and have played key roles in several local and state campaigns. At the heart of everything I do is a deep commitment to service, opportunity, and community. I’ve lived in Bay Ridge for more than twenty years with my wife Heidi, our daughter, and our French bulldog, Zeus. Over the years,"
  },
  {
    "candidate": "Sarantopoulos, George",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/George_Sarantopoulos",
    "text": "I’ve built and led successful businesses and nonprofits in a range of industries. I’ve also had the honor of serving as Chairman Emeritus of a national trade association, where I helped amplify the voices of thousands of small business owners nationwide. In public service, I worked as Communications Director for a New York State Assemblyman and have played key roles in several local and state campaigns. Please list below 3 key messages of your campaign. What are the main points you want voters to remember about your goals for your time in office? Making New York safer by fully funding and supporting the NYPD, and being tough on crime. Lower the cost of living by cutting property taxes, and other taxes on everyday goods and services. Expand early detection programs for chronic illnesses for all ages and especially for seniors. Making New York safer by fully funding and supporting the NYPD, and being tough on crime. Lower the cost of living by cutting property taxes, and other taxes on everyday goods and services. Expand early detection programs for chronic illnesses for all ages and especially for seniors. What areas of public policy are you personally passionate about? As a cancer survivor I am very passionate about health policy and specifically early detection programs. What qualities does this office possess that makes it a unique and important part of the state government and legal system? It can improve peoples lives more than any other locally elected official. Who do you look up to? Whose example would you like to follow, and why? My father. He immigrated to this country when he was a boy and worked his way towards the American Dream. Is there a book, essay, film, or something else you would recommend to someone who wants to understand your political philosophy? 1984, The Moon is a Harsh Mistress, Fahrenheit 451 The Dark Knight Returns, and Watchmen What characteristics or principles are most important for an elected official? Elected officials must be transparent, bold in their actions, and above all loyal to their constituents. What qualities do you possess that you believe would make you a successful officeholder? My years of experience owning and running my own buisness has taught me how to effectively manage a team and achieve goals. What do you believe are the core responsibilities for someone elected to this office? To deliver for his constituents. What legacy would you like to leave? I would like to leave the district better condition than I found it. What is the first historical event that happened in your lifetime that you remember? How old were you at the time? The Oil Crisis. I was 6 years old at the time and remembered waiting in line with my dad to get gas. What was your very first job? How long did you have it? When I was 13 I worked odd jobs in my Father's Restaurant untill I went to College. What is your favorite book? Why? Dune If you could be any fictional character, who would you want to be? Bruce Wayne/ Batman What was the last song that got stuck in your head? \"Don't Stop Believing\" by Journey What is something that has been a struggle in your life? My years battle with cancer has pushed me to revaluate what is important in life. Are there any little-known powers or responsibilities held by this office that you believe more people should be aware of? City Council offices have a wide range of options for constituent services. Do you believe that it's beneficial for holders of this office to have previous experience in government or politics? No. What kind of skills or expertise do you believe would be the most helpful for the holders of this office to possess? The ability to work with all kinds of different people. Also financial acumen which is deeply needed to deal with the city's out of control spending. What qualities does this office possess that makes it a unique and important part of the local government? City Council offices have a wide range of options for constituent services. What organizations or individuals have endorsed your campaign? Former Brooklyn GOP Chair Craig Eaton. What are your views on financial transparency and government accountability? I dont think there is enough. Government spends too much money with too little accountability. Note: Ballotpedia reserves the right to edit Candidate Connection survey responses. Any edits made by Ballotpedia will be clearly marked with [brackets] for the public."
  },
  {
    "candidate": "Sarantopoulos, George",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/George_Sarantopoulos",
    "text": "If the candidate disagrees with an edit, he or she may request the full removal of the survey response from Ballotpedia.org. Ballotpedia does not edit or correct typographical errors unless the candidate's campaign requests it. See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 47 Website Facebook Twitter Instagram Candidate New York City Council District 47 Website Facebook Twitter Instagram Personal LinkedIn Personal LinkedIn Footnotes Footnotes ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 14, 2025 ↑ Information submitted to Ballotpedia through the Candidate Connection survey on April 14, 2025 v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2025 challenger 2025 primary Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2025 Republican Party Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected"
  },
  {
    "candidate": "Sarantopoulos, George",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/George_Sarantopoulos",
    "text": "to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  },
  {
    "candidate": "Sarantopoulos, George",
    "category": "bio",
    "score": null,
    "link": "https://georgeforchangenyc.com/meet-george-sarantopoulos/",
    "text": "Home Meet George Sarantopoulos Policies News Contact Us Home Meet George Sarantopoulos Policies News Contact Us Home Meet George Sarantopoulos Policies News Contact Us Home Meet George Sarantopoulos Policies News Contact Us Donate Now Donate Now Meet George Sarantopoulos About Me A lifelong New Yorker and proud Bay Ridge resident, George Sarantopoulos is a proven leader with over 20 years of experience in business, public service, and community advocacy. Starting out as a small business owner and restaurateur, George went on to found Access One Solutions, an ATM and credit card processing company now serving customers in 36 states. George has built and led successful businesses and nonprofits across a variety of industries. He also served as Chairman Emeritus of a national trade association, giving voice to thousands of small business owners across the country. In public service, George worked as Communications Director for a New York State Assemblyman and has played key roles in numerous local and state campaigns. At the heart of everything George does is a commitment to service, opportunity, and community. He’s lived in Bay Ridge for more than two decades with his wife Heidi, their daughter, and their French bulldog Zeus. Come & Join Our Newsletter Subscribe Now Subscribe Now about Home Home Meet George Sarantopoulos Meet George Sarantopoulos Policies Policies News News Contact Us Contact Us Donate Now Donate Now Contact Us 280 85th st suite 100, Brooklyn, NY, 11209 280 85th st suite 100, Brooklyn, NY, 11209 [email protected] [email protected] (646) 907-8815 (646) 907-8815 Facebook-f Facebook-f Instagram Instagram X-twitter X-twitter © 2025 George For Change NYC . All rights reserved."
  }
]