[
  {
    "candidate": "Serrano, Christina",
    "category": "bio",
    "score": null,
    "link": "https://flcourts18.org/christina-serrano-biography/",
    "text": "Chief Judge Crawford has authorized the cancellation of all court proceedings in Seminole and Brevard Counties effective Noon, Tuesday, October 8, 2024, through Thursday, October 10, 2024. A decision will be made Thursday regarding Friday proceedings.Stay informed by following us on Facebook or X (Twitter) . You may also call (321) 637-5700 in Brevard or (407) 665-4945 in Seminole. Chief Judge Crawford has authorized the cancellation of all court proceedings in Seminole and Brevard Counties effective Noon, Tuesday, October 8, 2024, through Thursday, October 10, 2024. A decision will be made Thursday regarding Friday proceedings.Stay informed by following us on Facebook or X (Twitter) . You may also call (321) 637-5700 in Brevard or (407) 665-4945 in Seminole. Home Resources Self-Help Judges Programs & Services Case Management Job Opportunities EMPLOYMENT OPPORTUNITES The Eighteenth Judicial Circuit is an Equal Opportunity Employer . We do not discriminate on the basis of race, color, religion, age, sex (including gender identity, sexual orientation, and pregnancy), national origin, language, marital status, socioeconomic status, genetic information, or disability which does not preclude the performance of essential job functions, and reasonable accommodation(s) is provided, as necessary and judicious. Working for the Florida State Courts System can be a unique and rewarding experience. Please explore other areas of this Web site to familiarize yourself with the many different court programs and services offered. CAREER OPPORTUNITES Click here to view openings and apply Please Note: In order to apply for a position, please follow the instructions found when opening the job title as the instructions for submitting applications differ by position. A pre-employment background check, which includes fingerprinting, is required for every position. × Business Hours Monday – Thursday 8:00 AM to 5:00 PM Fridays 8:00 AM to 4:30 PM. (Closed daily from 12:00 to 1:00 PM for lunch.) Brevard Court Administration 2825 Judge Fran Jamieson Way Viera, FL 32940-8006 321-633-2171 Seminole Court Administration 301 N. Park Avenue Sanford, FL 32771-1292 407-665-4200 EMPLOYMENT OPPORTUNITES OPPORTUNITES OPPORTUNITES The Eighteenth Judicial Circuit is an Equal Opportunity Employer . We do not discriminate on the basis of race, color, religion, age, sex (including gender identity, sexual orientation, and pregnancy), national origin, language, marital status, socioeconomic status, genetic information, or disability which does not preclude the performance of essential job functions, and reasonable accommodation(s) is provided, as necessary and judicious. Working for the Florida State Courts System can be a unique and rewarding experience. Please explore other areas of this Web site to familiarize yourself with the many different court programs and services offered. Equal Opportunity Employer Click here to view openings and apply Please Note: In order to apply for a position, please follow the instructions found when opening the job title as the instructions for submitting applications differ by position. A pre-employment background check, which includes fingerprinting, is required for every position. In order to apply for a position, please follow the instructions found when opening the job title as the instructions for submitting applications differ by position. A pre-employment background check, which includes fingerprinting, is required for every position. In order to apply for a position, please follow the instructions found when opening the job title as the instructions for submitting applications differ by position. A pre-employment background check, which includes fingerprinting, is required for every position. × Business Hours Monday – Thursday 8:00 AM to 5:00 PM Fridays 8:00 AM to 4:30 PM. (Closed daily from 12:00 to 1:00 PM for lunch.) Business Hours Monday – Thursday 8:00 AM to 5:00 PM Fridays 8:00 AM to 4:30 PM. (Closed daily from 12:00 to 1:00 PM for lunch.) Brevard Court Administration 2825 Judge Fran Jamieson Way Viera, FL 32940-8006 321-633-2171 Brevard Court Administration 2825 Judge Fran Jamieson Way Viera, FL 32940-8006 321-633-2171 Seminole Court Administration 301 N. Park Avenue Sanford, FL 32771-1292 407-665-4200 Seminole Court Administration 301 N. Park Avenue Sanford, FL 32771-1292 407-665-4200 Contact Us CIRCUIT JUDGE The Honorable Christina Serrano Division: C, Probate & Guardianship Judicial Assistant : Carmen Reyes Office: (321) 952-4702 | Email Located at the Melbourne Courthouse in Melbourne, Brevard Division: C, Probate & Guardianship Judicial Assistant : Carmen Reyes Office: (321) 952-4702 | Email Located at the Melbourne Courthouse in Melbourne, Brevard Division: C, Probate & Guardianship Judicial Assistant : Carmen Reyes Carmen Reyes Office: (321) 952-4702 | Email Email Located at the Melbourne Courthouse in Melbourne, Brevard Melbourne Courthouse SCHEDULING HEARINGS JACs Dockets & Calendars The Eighteenth Judicial Circuit provides the JACs (Judicial Automatic Calendar System). JACs online scheduling is for attorneys only"
  },
  {
    "candidate": "Serrano, Christina",
    "category": "bio",
    "score": null,
    "link": "https://flcourts18.org/christina-serrano-biography/",
    "text": "and requires a login. It is important to review any policies and procedures that apply before contacting judges’ chambers. If you don’t see the docket you are looking for within the JACs list, please contact the Judicial Assistant. Judge Serrano’s – Division C – Scheduling Policies and Procedures Judge Serrano’s – Division C – Scheduling Policies and Procedures NOTE: Not all of the judges post their calendars online. Calendars are subject to change hourly, so check back frequently to guarantee accurate updates. JACs Available Dockets and Hearing Times Available Dockets and Hearing Times Schedule a Hearing – Requires Login Schedule a Hearing – Requires Login How to sign up for a JACs Account How to sign up for a JACs Account JACs Instructions Attorney Scheduling Instructions Attorney Scheduling Instructions How To Use Docket and Hearing Times Feature How To Use Docket and Hearing Times Feature HOW TO SIGN UP FOR A JACS ACCOUNT Attorneys Only (You will need your Florida Bar Number) ATTORNEYS CLICK HERE TO SIGN-UP OR RESET YOUR ACCOUNT. (You will need your Florida Bar Number) CLICK HERE (You will need your Florida Bar Number) FOR ALL OTHER PLEASE NOTE: The JACS system was designed to work with bar license numbers only, as a way of tracking attorneys who schedule hearings. We will not be able to create a JACS account for you. Luckily, JACS is only one of the many ways we have to schedule hearing dates in our Court. If you require a hearing date please use one of these methods: Work with opposing counsel and have them schedule a hearing on an agreed time/date. Contact the presiding judge’s Judicial Assistant for your scheduling needs. File a motion requesting a hearing per the Florida Trial Court Rules. JACS INSTRUCTIONS JACS General Instructions (Attorneys Only) JACs Available Dockets and Hearing Times Available Dockets and Hearing Times Schedule a Hearing – Requires Login Schedule a Hearing – Requires Login How to sign up for a JACs Account How to sign up for a JACs Account JACs Instructions Attorney Scheduling Instructions Attorney Scheduling Instructions How To Use Docket and Hearing Times Feature How To Use Docket and Hearing Times Feature INSTRUCTIONS AND MORE Judge Serrano's Policies and Procedures (See Below) The Eighteenth Judicial Circuit provides procedural instructions for attorneys along with policies that may differ within the guidelines of the law between judges and county or circuit court. Attorneys in both Brevard and Seminole have the resources offering many new facets of modern technology including but not limited to online scheduling, instructions, provider listings, policies and procedures and much more. There are courtroom rules and policies governing all divisions of the Eighteenth Judicial Circuit Court. All parties are expected to follow these rules. courtroom rules and policies Judge Serrano’s – Division C – Scheduling Policies and Procedures Judge Serrano’s – Division C – Scheduling Policies and Procedures CHRISTINA SERRANO BIOGRAPHY EDUCATION Juris Doctorate, Stetson University College of Law, 2003 BA, Political Science/Criminology, Florida Southern College, 1998 Titusville High School, 1995 JUDICIAL HISTORY Judge Serrano started in the Juvenile Division in July 2021and she is currently establishing Truancy Court, which will start January 20, 2022, at 3 pm. Christina Serrano is the circuit judge for Group 9, of Florida’s Eighteenth Judicial Circuit. She won the seat in the general election on November 8, 2016. She is currently assigned to the Family Division. Administrative Judge for Staff Attorneys ORGANIZATIONS, COMMITTEES, AND COMMISSIONS Family Law Subcommittee Chair for Courthouse Reopening after Covid-19 Past President, Brevard County Association for Women Lawyers Past Board Member and Past Treasurer, Brevard County Bar Foundation Past President, Young Lawyers Division, Brevard County Bar Association Past Board Member, Brevard County Red Cross Volunteer, Habitat for Humanity Volunteer Teacher, Justice Teaching Program Past Member, Toastmasters AOTT Member, Melbourne Alumnae Panhellenic Past Member, Seminole County Bar Association LEAD Brevard Graduate Vassar Carlton Inns of Court AWARDS William F. Blews Pro Bono Service Award Served on the Florida Bar “Codes and Rules of Evidence Committee” Served on the Florida Bar “Small Claims Committee” ESGR “Patriotic Employer Award”, Secretary Department of Defense 51 Nieman Ave Melbourne, FL 32901 (321) 952-4702 51 Nieman Ave Melbourne, FL 32901 (321) 952-4702 Using Google Maps Florida Courts Help available at the touch of a screen: For constituents, customers, or callers seeking help with family law cases – divorce, adoption, name change, custody, order of protection, and much more – there is now a one-stop source for lots of information aimed at self-represented people. Florida Courts Help"
  },
  {
    "candidate": "Serrano, Christina",
    "category": "bio",
    "score": null,
    "link": "https://flcourts18.org/christina-serrano-biography/",
    "text": "is available at app stores as well as online at help.flcourts.gov . help.flcourts.gov Get Directions Moore Justice Center, Viera Melbourne Courthouse Titusville Courthouse Sanford Criminal Justice Center Sanford Civil Courthouse Sanford Juvenile Justice Center Contact Court Administration Brevard Court Administration Harry T. and Harriette V. Moore Justice Center 2825 Judge Fran Jamieson Way Viera, FL 32940-8006 321-633-2171 Seminole Court Administration Seminole Civil Courthouse 301 N. Park Avenue Sanford, FL 32771-1292 407-665-4200 Contact Clerk of Courts If you have a question about a court case or jury duty, please call: Brevard Clerk of Court at (321) 637-5413 Seminole Clerk of Court at (407) 665-4500 Public Records Disclosure: Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Home Courthouse Security Disclaimers Employment Public Records Request Other Useful Links Terms & Conditions Web Accessibility Statement Search for:"
  }
]