[
  {
    "candidate": "Shaende, Jonas",
    "category": "bio",
    "score": null,
    "link": "https://theorg.com/org/rtvi/org-chart/jonas-shaende",
    "text": "Platform Features Pricing Overseas Media Inc. dba RTVI Overseas Media Inc. dba RTVI Jonas Shaende Jonas Shaende Edit position Jonas Shaende Commentator at Overseas Media Inc. dba RTVI Commentator at Contact Jonas Shaende, PhD, currently serves as Deputy Secretary for the New York State Senate since November 2022. Additionally, Jonas has been a Commentator for RTVI International since May 2015, providing regular insights on economic policy and current affairs, and previously served as a Finance/Economy Commentator for Voice of America from February 2017 to June 2023. Jonas held positions such as Head of Research at ICSC and Chief Economist at the Fiscal Policy Institute, along with roles in academia as an Economics Faculty member at Long Island University and Professor of Economics and Finance at John Jay College. Jonas's educational background includes a Doctor of Philosophy in Economics from The New School, complemented by MPhil and MA degrees in the same field from the same institution, and a BA in Economics from Long Island University. Location New York, United States Links Previous companies Org chart Jonas Shaende Commentator No direct reports Teams Content Creation and Editorial Team 6 members Offices Overseas Media Inc. dba RTVI RTVI is the only independent international 24/7 Russian-language TV channel ​with a global reach of more than 75 million people. RTVI broadcasts to 65 countries and regions, including the United States, Canada, Israel, Europe, and Asia. RTVI's audience is engaged, thinking, and open to all new things. RTVI is a multi-platform media promoting dialogue among nations, cultures and religions. In addition to its website RTVI has a strong digital presence on YouTube, Instagram, Facebook, Telegram and other social networks. RTVI branches in the US, Israel, Latvia, Germany, and Russia produce a wide range of political and news talk shows. Our correspondents cover major global events every day, reporting live from cities including Washington D.C., New York, Los Angeles, Tel Aviv, Berlin, Riga, Yerevan, Tbilisi, Kyiv, Tallinn, Paris, London, Vilnius and so on. RTVI's shows often feature politicians, celebrities, businessmen as well as independent experts. Each year, RTVI releases over 30 new projects In addition to entertainment and educational content, we make documentary series, record interviews with prominent figures and broadcast movies and TV shows. The network keeps growing. Over the past two years, the number of web articles that mention RTVI increased by 23%, totaling 400.2 million views annually. RTVI is a major media outlet. We create content that resonates with the Russian-speaking people around the world. Tune in or visit rtvi.com for the latest and unbiased news, specials, and more. Industries Headquarters Employees Links Related people Martine Aurdal Dagbladet Martine Aurdal Dagbladet Longmou Li CCTV+ Longmou Li CCTV+ Christian Miles CONMEBOL Christian Miles CONMEBOL Peter Cardwell TalkTV Peter Cardwell TalkTV Jared Singleton The Southern Conference Jared Singleton The Southern Conference"
  }
]