[
  {
    "candidate": "Shea, John E",
    "category": "bio",
    "score": null,
    "link": "https://www.imdb.com/name/nm0790291/bio/",
    "text": "Menu Movies Release Calendar Top 250 Movies Most Popular Movies Browse Movies by Genre Top Box Office Showtimes & Tickets Movie News India Movie Spotlight Movies Release Calendar Top 250 Movies Most Popular Movies Browse Movies by Genre Top Box Office Showtimes & Tickets Movie News India Movie Spotlight TV Shows What's on TV & Streaming Top 250 TV Shows Most Popular TV Shows Browse TV Shows by Genre TV News TV Shows What's on TV & Streaming Top 250 TV Shows Most Popular TV Shows Browse TV Shows by Genre TV News Watch What to Watch Latest Trailers IMDb Originals IMDb Picks IMDb Spotlight Family Entertainment Guide IMDb Podcasts Watch What to Watch Latest Trailers IMDb Originals IMDb Picks IMDb Spotlight Family Entertainment Guide IMDb Podcasts Awards & Events Oscars Cannes Film Festival Star Wars Asian Pacific American Heritage Month Summer Watch Guide STARmeter Awards Awards Central Festival Central All Events Awards & Events Oscars Cannes Film Festival Star Wars Asian Pacific American Heritage Month Summer Watch Guide STARmeter Awards Awards Central Festival Central All Events Celebs Born Today Most Popular Celebs Celebrity News Celebs Born Today Most Popular Celebs Celebrity News Community Help Center Contributor Zone Polls Community Help Center Contributor Zone Polls For Industry Professionals Language English (United States) Language English (United States) Language English (United States) Language Language Fully supported Fully supported English (United States) English (United States) Partially supported Français (Canada) Français (Canada) Français (France) Français (France) Deutsch (Deutschland) Deutsch (Deutschland) हिंदी (भारत) हिंदी (भारत) Italiano (Italia) Italiano (Italia) Português (Brasil) Português (Brasil) Español (España) Español (España) Español (México) Español (México) All All All All Watchlist Sign In EN Fully supported English (United States) Partially supported Français (Canada) Français (France) Deutsch (Deutschland) हिंदी (भारत) Italiano (Italia) Português (Brasil) Español (España) Español (México) Fully supported Fully supported English (United States) English (United States) Partially supported Français (Canada) Français (Canada) Français (France) Français (France) Deutsch (Deutschland) Deutsch (Deutschland) हिंदी (भारत) हिंदी (भारत) Italiano (Italia) Italiano (Italia) Português (Brasil) Português (Brasil) Español (España) Español (España) Español (México) Español (México) Use app Biography Awards Trivia FAQ All topics Biography John Shea Jump to Overview (3) Biography (1) Family (1) Trivia (20) Quotes (1) Jump to Overview (3) Biography (1) Family (1) Trivia (20) Quotes (1) Edit Overview Overview Born April 14 , 1949 · North Conway, New Hampshire, USA Born Birth name John Victor Shea Birth name Height 6′ 0½″ (1.84 m) Height Biography Biography Handsome, slim-faced, curly-haired actor John Shea is primarily known to TV audiences for his recurring role as the evil Lex Luthor in the early '90s TV series Lois & Clark: The New Adventures of Superman (1993) . John Victor Shea III was born in 1949 in North Conway, New Hampshire, to Elizabeth Mary (Fuller) and Dr. John Victor Shea, a teacher, coach, and assistant Superintendent of Schools. He is of Irish and German descent. John was raised in Massachusetts, and received his BA from Bates College, which he achieved on debating and football scholarships. He then attended Yale University and earned an MFA in directing from its School of Drama. Following New York stage work, including his portrayal of Paris in a production of \"Romeo and Juliet\" (1977), initial on-camera notice came on TV with his reverential portrayal of Joseph in the mini-movie The Nativity (1978) . A few years later on film he appeared in the small but memorable role of the impassioned, ill-fated American idealist who becomes a casualty to Chilean war-torn politics in Costa-Gavras ' Academy Award-winning thriller Missing (1982) . Although Jack Lemmon and Sissy Spacek , who respectively played his despairing father and wife, were nominated for Oscars for their starring performances, John's role was central to the heart of the film and he made quite an impact. The actor was later honored by Amnesty International for his political work following the film's release. Critical kudos, as well as awards, have come in John's direction over the years on stage, film and TV. In the film Windy City (1984) opposite Kate Capshaw , he earned the Best Actor Award at the Montreal Film Festival. On stage, he received a Drama Desk Award for \"American Days\", an Obie Award for \"The Dining Room\" and a 1976 Theatre World Award for his portrayal of the Jewish student \"Avigdor\" in \"Yentl\". The role was later portrayed by Mandy Patinkin in Barbra Streisand 's 1983 film adaptation. On television, John was awarded the coveted Emmy for his depiction of the distressed husband and"
  },
  {
    "candidate": "Shea, John E",
    "category": "bio",
    "score": null,
    "link": "https://www.imdb.com/name/nm0790291/bio/",
    "text": "father wannabe who touches off a legal landmark case in the miniseries, Baby M (1988) . In a career pocked with remarkable versatility, interesting choices and challenging parts, John has played everything from a young Nazi in the miniseries Hitler's S.S.: Portrait in Evil (1985) to 'Robert F. Kennedy' in the epic-styled Kennedy (1983) . He has kept his face alive in guest parts over the years on such well-received series as Sex and the City (1998) , Tales from the Crypt (1989) , The Hitchhiker (1983) , Law & Order (1990) and Medium (2005) . A budding Irish-American filmmaker, John co-wrote, directed and appeared in the low-budget film Southie (1998) , a drama set in the Irish-American section of Boston. The film won the Jury Award for Best Independent Film at the 1998 Seattle International Film Festival. Into the millennium, John found popularity on the Mutant X (2001) sci-fi series playing the role of \"Adam Kane\". Based on Marvel Comic's \"X-Men\", he received a nomination for Canada's prestigious Gemini Award as Best Actor. He also appears in a recurring role on Gossip Girl (2007) and had a regular part in the action drama series Agent X (2015) starring Sharon Stone . In addition, he was also seen in a spat of dramas including The Insurgents (2006) with Mary Stuart Masterson ; the British Framed (2008) and the Indian drama Achchamundu! Achchamundu! (2009) , plus the Jessica Alba drama, An Invisible Sign (2010) , the title role in Julius Caesar (2010) , the horror opus 51 (2011) ,the psychological drama Anatomy of the Tide (2013) and the crime mystery Grey Lady (2017) , which he also wrote and directed. A screenwriter and audio book performer in addition to all his other talents, John lives with his second wife, the painter Melissa MacLeod, and his family are based in New York and on Nantucket Island where he was a founding member of the Nantucket Film Festival and is Artistic Director of the Nantucket Theatre Workshop. He has one son, Jake, from his first marriage, and two children, Miranda and Caiden, by wife Melissa. - IMDb mini biography by: Gary Brumburgh / gr-home@pacbell.net Family Family Spouses Melissa Ann MacLeod (August 28, 2001 - present) (2 children) Laura Weston Pettibone (June 19, 1971 - 2000) (divorced, 1 child) Spouses Melissa Ann MacLeod (August 28, 2001 - present) (2 children) Laura Weston Pettibone (June 19, 1971 - 2000) (divorced, 1 child) Trivia Trivia Used Donald Trump and Richard III as character studies in preparing himself for the role of nemesis Lex Luthor in Lois & Clark: The New Adventures of Superman (1993) . During season two, he had to spend an average of three hours a day in the makeup chair to appear bald. Only three men ever screen tested for the role of Indiana Jones for Steven Spielberg , John, Tom Selleck and, of course, Indiana himself, Harrison Ford . While starring in London's West End production of Larry Kramer 's \"The Normal Heart,\" John suddenly passed out on stage after being stricken by food poisoning. Literally carried off the stage, he was revived and managed to return to finish the performance. In preparation for an explicit nude scene in the British film Hussy (1980) , in which John was making his film debut, the newcomer and his co-star Helen Mirren shared a bottle of red wine. Wore a blond wig, false teeth and spent three months studying Bobby Kennedy's pronounced accent in preparation for his role in the miniseries Kennedy (1983) opposite Martin Sheen as brother Jack. 15 more 15 more 15 more All All All Quotes Quotes When I read a role, I try to find something that I can bring to the role and something that the role brings to me. Something that I don't know anything about and that the character can teach me. Contribute to this page Contribute to this page Learn more about contributing Edit page More from this person More from this person View agent, publicist, legal and company contact details on IMDbPro More to explore Recently viewed You have no recently viewed pages Get the IMDb app Sign in for more access Sign in for more access Sign in for more access Sign in for more access Help Site Index IMDbPro Box Office Mojo License IMDb Data Press Room Advertising Jobs Conditions of Use Privacy Policy Your Ads Privacy Choices © 1990- 2025 by IMDb.com, Inc. Back to top"
  }
]