[
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/",
    "text": "eCollin Learning Center (Blackboard tech support) OST Textbooks and Course Materials POFI 1301 Computer Applications POFI 2301 Word Processing (MS Word 2013) POFT 1127 Introduction to Keyboarding POFT 1307 (offered Fall only) Proofreading and Editing POFT 1319 (offered Spring only) Records and Information Mgmt. POFT 1329 Beginning Keyboarding (using Word 2013) POFT 2301 Intermediate Keyboarding (using Word 2013) POFT 2303 Speed and Accuracy Building POFT 2312 (offered Spring only) Business Correspondence and Communication eCollin Learning Center (Blackboard tech support) OST Textbooks and Course Materials POFI 1301 Computer Applications POFI 2301 Word Processing (MS Word 2013) POFT 1127 Introduction to Keyboarding POFT 1307 (offered Fall only) Proofreading and Editing POFT 1319 (offered Spring only) Records and Information Mgmt. POFT 1329 Beginning Keyboarding (using Word 2013) POFT 2301 Intermediate Keyboarding (using Word 2013) POFT 2303 Speed and Accuracy Building POFT 2312 (offered Spring only) Business Correspondence and Communication Office Systems Technology Department online advisor via email at LThompson@collin.edu . If you encounter challenges with online enrollment because of required prerequisite courses, email me for simple solutions for documenting your skills and bypassing the official prerequisite. Office Hours: On-site office hours at Spring Creek Campus in Plano: 12:00 to 2:00 p.m. Wednesdays at Spring Creek Campus in Suite J-114, Office J-116, or nearby J-122 Online office hours are 7:00-9:00 p.m. Mondays and 11:00 a.m. to 1:00 p.m. Tuesdays via email online at LThompson@collin.edu . E-mail: LThompson@collin.edu (fastest, best way to reach me!) Telephone: 972-548-6815 (voicemail) Students in online classes should contact me in Canvas inbox (if communicating about course) or at LThompson@collin.edu for general, advising, or online office hours communications. Biography: Master of Science degree in Vocational-Technical Educ., Texas A&M Univ. Graduate studies at University of North Texas Bachelor of Science in Education degree in Business Education and English, Southern Arkansas University (later served as Admin. Asst. to President) Professor of Office Systems Technology at Collin College since 1988 Office Occupations Instructor at Paris Junior College, 1984-1987 Business Education Teacher for Greenville High School, 1975-1984 English Teacher for Magnolia Public Schools Microsoft Certified for Word Outstanding Mentor Award Linda Thompson Scholarship Award Collin Distinguished Professor Award Who's Who Among America's Teachers Award Collin Faculty Coordinator of the Year Award Notable Woman of Texas Award Outstanding Young Woman of America Award Texas Distance Learning Association and North Region Group Texas Community College Teachers Association Northeast Texas Consortium of Colleges and Universities Collin Faculty Council Technology Committee Office Systems Technology Department lead/contact Office Systems Technology Department online advisor Office Systems Technology Department webmaster Personal: Married, mother of 5, grandmother to 8 (all living nearby) Animal lover, especially cats and horses Breast cancer survivor! Office Hours: On-site office hours at Spring Creek Campus in Plano: 12:00 to 2:00 p.m. Wednesdays at Spring Creek Campus in Suite J-114, Office J-116, or nearby J-122 Online office hours are 7:00-9:00 p.m. Mondays and 11:00 a.m. to 1:00 p.m. Tuesdays via email online at LThompson@collin.edu . E-mail: LThompson@collin.edu (fastest, best way to reach me!) Telephone: 972-548-6815 (voicemail) Students in online classes should contact me in Canvas inbox (if communicating about course) or at LThompson@collin.edu for general, advising, or online office hours communications. Biography: Master of Science degree in Vocational-Technical Educ., Texas A&M Univ. Graduate studies at University of North Texas Bachelor of Science in Education degree in Business Education and English, Southern Arkansas University (later served as Admin. Asst. to President) Professor of Office Systems Technology at Collin College since 1988 Office Occupations Instructor at Paris Junior College, 1984-1987 Business Education Teacher for Greenville High School, 1975-1984 English Teacher for Magnolia Public Schools Microsoft Certified for Word Outstanding Mentor Award Linda Thompson Scholarship Award Collin Distinguished Professor Award Who's Who Among America's Teachers Award Collin Faculty Coordinator of the Year Award Notable Woman of Texas Award Outstanding Young Woman of America Award Texas Distance Learning Association and North Region Group Texas Community College Teachers Association Northeast Texas Consortium of Colleges and Universities Collin Faculty Council Technology Committee Office Systems Technology Department lead/contact Office Systems Technology Department online advisor Office Systems Technology Department webmaster Personal: Married, mother of 5, grandmother to 8 (all living nearby) Animal lover, especially cats and horses Breast cancer survivor!"
  },
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/POFT2312/orient.htm",
    "text": "Orientation Orientation Orientation Orientation Blackboard Course Site Thompson Homepage Orientation Blackboard Course Site Orientation Blackboard Course Site Thompson Homepage Thompson Homepage WELCOME TO POFT-2312 BUSINESS CORRESPONDENCE AND COMMUNICATION (offered ONLY spring semesters, so plan ahead) This online Business Correspondence and Communication course offers you and your professor a unique opportunity to take advantage of the latest technology and techniques in distance learning. This course will offer interactive features that will make your experience comparable to that of a traditional classroom student at Collin College. Business Correspondence and Communication is an electronic, interactive class with a professor, students, and assignments. You will access the course through the Internet from a computer at home, work, or on campus--anytime, day or night, that you have access to the Internet, with no need to come to campus. Even the Orientation information is presented through the Internet. This course should be one of the last taken in the program. Employers value technology and communication skills. Technology courses are plentiful, but this course is one of few focusing on communication for the workplace. Learning the skills well should provide you a competitive edge! How do I get started? Because your course Web site is on Blackboard, you will not have access to your course until classes begin. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Once you have Blackboard access, all communications and assignments submission must be within Blackboard for your convenience and privacy. You should review everything in this Collin Learning Center (eLC) link, which will include a Contact Information link. Please do take advantage of the tutorials offered there. If you are an experienced online student, the material should be fairly familiar but include a few new tips and the important contact information. Your professor can be more available to you online than within a traditional class that meets on campus only at certain times. You will be expected to check your Blackboard course often for announcements, discussions, and messages. Frequent communication between professor and student is important to your success in this course. You should know how to access a Web site when given an address (URL) or link, use the features of your Web browser, download files, scan pages as PDF files, perform screen captures, and attach files to email or upload them as instructed in Blackboard. If you do not yet know about scanning and screen captures, you will be able to get help with those simple processes by posting your questions in Discussions in Blackboard. Collin libraries have scanners for student use, in case you find that helpful. TEXTBOOK within MindTap e-Bundle: Bundle: Essentials of Business Communication , Loose-Leaf Version, 10th edition + Premium Website, 1 term (6 months) Printed Access Card + LMS Integrated for MindTap® Business Communication, 1 term (6 months), which includes an e-text, eliminating any need for standard printed materials (and saving significant cost). Printed Access Card 9781305699199. IMPORTANT: You will have access to course materials in Blackboard for a three-week trial period when classes begin, which will allow you generous time for obtaining your own new access code for uninterrupted access. SUPPLIES: A portable USB flash drive for backing up files, as needed for transferring files among computers. SOFTWARE: Any recent version of MS Word for Windows software. EQUIPMENT: In order to do course work from home, you will need a scanner that saves files in PDF format and a good Internet Service Provider (ISP). You also have the option of doing all assignments for your online course by using equipment provided by college libraries. SYSTEM/TECHNICAL REQUIREMENTS: Review technical information from the Collin Learning Center (eLC) link. Click the Contact Us link at the top of that page if you have questions or need help with getting your system to work smoothly for your online course. COURSE FORMAT: Your online classroom includes a schedule to keep you on track for assignments and guide you concerning completing assignments for your professor's review. Your professor will work with you using Blackboard to evaluate your assignments and to help you with questions or problems. Your course work will be reviewed and graded by your professor, with feedback provided through My Grades in Blackboard. Grading will include professor comments, if appropriate and/or helpful. Class discussions may be conducted electronically, as appropriate. Even this Orientation information is online, and there will be NO requirement to come to campus for any assignment. You will be able to monitor your progress through"
  },
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/POFT2312/orient.htm",
    "text": "My Grades in Blackboard. This will allow you opportunity to communicate with your professor concerning any differences between your records and your Blackboard grades prior to your final course grade posting. Most of the course credit depends on your satisfactorily completing and submitting all assignments in a timely manner. How do I access the POFT-2312 Business Correspondence and Communications class? First, you must be officially enrolled. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Your username should be your Cougarmail username, and your password should be the last six digits of your CWID (college-wide identification number). Once classes begin, you will be expected to check your Blackboard Discussions and Mail often. Frequent communication between professor and student is important to your success in this course. What is the POFT-2312 course like? After registering for the class and purchasing the course materials, you will: communicate through Blackboard Discussions, Assignments, Mail. study the information on the Blackboard course site. follow the schedule of assignments. complete and submit assignments in Blackboard, including in MindTap within Blackboard . YOU are responsible for scheduling your study time and completing your assignments. You are responsible for keeping up to date with the course schedule, matching the course weeks with your calendar, and keeping a record of the assignments you have submitted. You will be encouraged to communicate with other class members through the Blackboard discussion forum. Your professor is available to help you through the course using Blackboard Discussions (group) and Mail (private) features; please do not hesitate to contact your professor. Your professor acts as a facilitator to help you master the course goals. Realize that this course requires YOUR motivation, commitment, organization , and self-discipline . YOU must supply those success factors. Effective learning results only when students become active participants in control of their learning and take the initiative to do what is necessary. Learning the skills necessary to communicate in an online course format will be a valuable bonus to you in preparing for working in high-tech offices. POFT-2312 Business Correspondence and Communication is a competency-based course. You are expected to meet certain performance objectives, which are found in the course syllabus. The generic syllabus (containing objectives) is posted at http://iws.collin.edu/syllabus . Your professor's syllabus (including how you will be graded) will be posted on the Blackboard course site. Your final grade will be based upon your participation and performance. Following instructions accurately and submitting assignments in a timely manner will be important aspects of course success. Please do \"enjoy\" this class! WELCOME TO POFT-2312 BUSINESS CORRESPONDENCE AND COMMUNICATION (offered ONLY spring semesters, so plan ahead) WELCOME TO POFT-2312 BUSINESS CORRESPONDENCE AND COMMUNICATION (offered ONLY spring semesters, so plan ahead) WELCOME TO POFT-2312 BUSINESS CORRESPONDENCE AND COMMUNICATION (offered ONLY spring semesters, so plan ahead) This online Business Correspondence and Communication course offers you and your professor a unique opportunity to take advantage of the latest technology and techniques in distance learning. This course will offer interactive features that will make your experience comparable to that of a traditional classroom student at Collin College. This online Business Correspondence and Communication course offers you and your professor a unique opportunity to take advantage of the latest technology and techniques in distance learning. This course will offer interactive features that will make your experience comparable to that of a traditional classroom student at Collin College. Business Correspondence and Communication is an electronic, interactive class with a professor, students, and assignments. You will access the course through the Internet from a computer at home, work, or on campus--anytime, day or night, that you have access to the Internet, with no need to come to campus. Even the Orientation information is presented through the Internet. Business Correspondence and Communication is an electronic, interactive class with a professor, students, and assignments. You will access the course through the Internet from a computer at home, work, or on campus--anytime, day or night, that you have access to the Internet, with no need to come to campus. Even the Orientation information is presented through the Internet. This course should be one of the last taken in the program. Employers value technology and communication skills. Technology courses are plentiful, but this course is one of few focusing on communication for the workplace. Learning the skills well should provide you a competitive edge! This course should be one of the last taken in the program. Employers value technology and communication skills. Technology"
  },
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/POFT2312/orient.htm",
    "text": "courses are plentiful, but this course is one of few focusing on communication for the workplace. Learning the skills well should provide you a competitive edge! How do I get started? How do I get started? Because your course Web site is on Blackboard, you will not have access to your course until classes begin. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Once you have Blackboard access, all communications and assignments submission must be within Blackboard for your convenience and privacy. Because your course Web site is on Blackboard, you will not have access to your course until classes begin. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Once you have Blackboard access, all communications and assignments submission must be within Blackboard for your convenience and privacy. You should review everything in this Collin Learning Center (eLC) link, which will include a Contact Information link. Please do take advantage of the tutorials offered there. If you are an experienced online student, the material should be fairly familiar but include a few new tips and the important contact information. Your professor can be more available to you online than within a traditional class that meets on campus only at certain times. You should review everything in this Collin Learning Center (eLC) Collin Learning Center (eLC) link, which will include a Contact Information link. Please do take advantage of the tutorials offered there. If you are an experienced online student, the material should be fairly familiar but include a few new tips and the important contact information. Your professor can be more available to you online than within a traditional class that meets on campus only at certain times. You will be expected to check your Blackboard course often for announcements, discussions, and messages. Frequent communication between professor and student is important to your success in this course. You will be expected to check your Blackboard course often for announcements, discussions, and messages. Frequent communication between professor and student is important to your success in this course. You should know how to access a Web site when given an address (URL) or link, use the features of your Web browser, download files, scan pages as PDF files, perform screen captures, and attach files to email or upload them as instructed in Blackboard. If you do not yet know about scanning and screen captures, you will be able to get help with those simple processes by posting your questions in Discussions in Blackboard. Collin libraries have scanners for student use, in case you find that helpful. You should know how to access a Web site when given an address (URL) or link, use the features of your Web browser, download files, scan pages as PDF files, perform screen captures, and attach files to email or upload them as instructed in Blackboard. If you do not yet know about scanning and screen captures, you will be able to get help with those simple processes by posting your questions in Discussions in Blackboard. Collin libraries have scanners for student use, in case you find that helpful. TEXTBOOK within MindTap e-Bundle: TEXTBOOK within MindTap e-Bundle: Bundle: Essentials of Business Communication , Loose-Leaf Version, 10th edition + Premium Website, 1 term (6 months) Printed Access Card + LMS Integrated for MindTap® Business Communication, 1 term (6 months), which includes an e-text, eliminating any need for standard printed materials (and saving significant cost). Printed Access Card 9781305699199. IMPORTANT: You will have access to course materials in Blackboard for a three-week trial period when classes begin, which will allow you generous time for obtaining your own new access code for uninterrupted access. Bundle: Essentials of Business Communication , Loose-Leaf Version, 10th edition + Premium Website, 1 term (6 months) Printed Access Card + LMS Integrated for MindTap® Business Communication, 1 term (6 months), which includes an e-text, eliminating any need for standard printed materials (and saving significant cost). Printed Access Card 9781305699199. IMPORTANT: You will have access to course materials in Blackboard for a three-week trial period when classes begin, which will allow you generous time for obtaining your own new access code for uninterrupted access. SUPPLIES: A portable USB flash drive for backing up files, as needed for transferring files among computers. SOFTWARE: Any recent version of MS Word for Windows software. EQUIPMENT: In order to do course work from home, you will need a scanner that"
  },
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/POFT2312/orient.htm",
    "text": "saves files in PDF format and a good Internet Service Provider (ISP). You also have the option of doing all assignments for your online course by using equipment provided by college libraries. EQUIPMENT: In order to do course work from home, you will need a scanner that saves files in PDF format and a good Internet Service Provider (ISP). You also have the option of doing all assignments for your online course by using equipment provided by college libraries. SYSTEM/TECHNICAL REQUIREMENTS: SYSTEM/TECHNICAL REQUIREMENTS: Review technical information from the Collin Learning Center (eLC) link. Click the Contact Us link at the top of that page if you have questions or need help with getting your system to work smoothly for your online course. Review technical information from the Collin Learning Center (eLC) Collin Learning Center (eLC) link. Click the Contact Us link at the top of that page if you have questions or need help with getting your system to work smoothly for your online course. COURSE FORMAT: Your online classroom includes a schedule to keep you on track for assignments and guide you concerning completing assignments for your professor's review. COURSE FORMAT: Your online classroom includes a schedule to keep you on track for assignments and guide you concerning completing assignments for your professor's review. Your professor will work with you using Blackboard to evaluate your assignments and to help you with questions or problems. Your course work will be reviewed and graded by your professor, with feedback provided through My Grades in Blackboard. Grading will include professor comments, if appropriate and/or helpful. Class discussions may be conducted electronically, as appropriate. Even this Orientation information is online, and there will be NO requirement to come to campus for any assignment. Your professor will work with you using Blackboard to evaluate your assignments and to help you with questions or problems. Your course work will be reviewed and graded by your professor, with feedback provided through My Grades in Blackboard. Grading will include professor comments, if appropriate and/or helpful. Class discussions may be conducted electronically, as appropriate. Even this Orientation information is online, and there will be NO requirement to come to campus for any assignment. You will be able to monitor your progress through My Grades in Blackboard. This will allow you opportunity to communicate with your professor concerning any differences between your records and your Blackboard grades prior to your final course grade posting. Most of the course credit depends on your satisfactorily completing and submitting all assignments in a timely manner. You will be able to monitor your progress through My Grades in Blackboard. This will allow you opportunity to communicate with your professor concerning any differences between your records and your Blackboard grades prior to your final course grade posting. Most of the course credit depends on your satisfactorily completing and submitting all assignments in a timely manner. How do I access the POFT-2312 Business Correspondence and Communications class? How do I access the POFT-2312 Business Correspondence and Communications class? First, you must be officially enrolled. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Your username should be your Cougarmail username, and your password should be the last six digits of your CWID (college-wide identification number). Once classes begin, you will be expected to check your Blackboard Discussions and Mail often. Frequent communication between professor and student is important to your success in this course. First, you must be officially enrolled. Once classes begin, go to CougarWeb and follow the login instructions there for accessing your Blackboard course site. Your username should be your Cougarmail username, and your password should be the last six digits of your CWID (college-wide identification number). Once classes begin, you will be expected to check your Blackboard Discussions and Mail often. Frequent communication between professor and student is important to your success in this course. What is the POFT-2312 course like? What is the POFT-2312 course like? After registering for the class and purchasing the course materials, you will: After registering for the class and purchasing the course materials, you will: communicate through Blackboard Discussions, Assignments, Mail. study the information on the Blackboard course site. follow the schedule of assignments. complete and submit assignments in Blackboard, including in MindTap within Blackboard . communicate through Blackboard Discussions, Assignments, Mail. study the information on the Blackboard course site. follow the schedule of assignments. complete and submit assignments in Blackboard, including in MindTap within Blackboard"
  },
  {
    "candidate": "Thompson, Collin L",
    "category": "bio",
    "score": null,
    "link": "http://faculty.collin.edu/lthompson/POFT2312/orient.htm",
    "text": ". study the information on the Blackboard course site. follow the schedule of assignments. complete and submit assignments in Blackboard, including in MindTap within Blackboard . follow the schedule of assignments. complete and submit assignments in Blackboard, including in MindTap within Blackboard . complete and submit assignments in Blackboard, including in MindTap within Blackboard YOU are responsible for scheduling your study time and completing your assignments. You are responsible for keeping up to date with the course schedule, matching the course weeks with your calendar, and keeping a record of the assignments you have submitted. You will be encouraged to communicate with other class members through the Blackboard discussion forum. Your professor is available to help you through the course using Blackboard Discussions (group) and Mail (private) features; please do not hesitate to contact your professor. Your professor acts as a facilitator to help you master the course goals. YOU are responsible for scheduling your study time and completing your assignments. You are responsible for keeping up to date with the course schedule, matching the course weeks with your calendar, and keeping a record of the assignments you have submitted. You will be encouraged to communicate with other class members through the Blackboard discussion forum. Your professor is available to help you through the course using Blackboard Discussions (group) and Mail (private) features; please do not hesitate to contact your professor. Your professor acts as a facilitator to help you master the course goals. Realize that this course requires YOUR motivation, commitment, organization , and self-discipline . YOU must supply those success factors. Effective learning results only when students become active participants in control of their learning and take the initiative to do what is necessary. Learning the skills necessary to communicate in an online course format will be a valuable bonus to you in preparing for working in high-tech offices. Realize that this course requires YOUR motivation, commitment, organization , and self-discipline . YOU must supply those success factors. Effective learning results only when students become active participants in control of their learning and take the initiative to do what is necessary. Learning the skills necessary to communicate in an online course format will be a valuable bonus to you in preparing for working in high-tech offices. POFT-2312 Business Correspondence and Communication is a competency-based course. You are expected to meet certain performance objectives, which are found in the course syllabus. The generic syllabus (containing objectives) is posted at http://iws.collin.edu/syllabus . Your professor's syllabus (including how you will be graded) will be posted on the Blackboard course site. Your final grade will be based upon your participation and performance. Following instructions accurately and submitting assignments in a timely manner will be important aspects of course success. POFT-2312 Business Correspondence and Communication is a competency-based course. You are expected to meet certain performance objectives, which are found in the course syllabus. The generic syllabus (containing objectives) is posted at http://iws.collin.edu/syllabus . Your professor's syllabus (including how you will be graded) will be posted on the Blackboard course site. Your final grade will be based upon your participation and performance. Following instructions accurately and submitting assignments in a timely manner will be important aspects of course success. Please do \"enjoy\" this class! Please do \"enjoy\" this class! Orientation | Blackboard Course Login | Thompson Homepage Orientation | Blackboard Course Login | Thompson Homepage Copyright © 2002 Professor Linda Thompson. Collin County Community College District. All Rights Reserved. Updated July 27, 2016 . Copyright © 2002 Professor Linda Thompson. Collin County Community College District. All Rights Reserved. Updated July 27, 2016 ."
  }
]