[
  {
    "candidate": "Thompson, Jammel A",
    "category": "bio",
    "score": null,
    "link": "https://jammelforbrooklyn.com/",
    "text": "Home Portfolio Priorities Community Blog Volunteer Signup Home Portfolio Priorities Community Blog Volunteer Signup Jammel Thompson: A Fresh Voice for Brooklyn's City Council Putting People First in District 41 for a Brighter Future Putting People First in District 41 for a Brighter Future Community Focus Empowering Brooklyn through dedicated community engagement and revitalization efforts. Empowering Brooklyn through dedicated community engagement and revitalization efforts. Youth Opportunities Youth Opportunities Creating pathways for young women and community engagement initiatives. Creating pathways for young women and community engagement initiatives. Senior Support Protecting seniors and enhancing their quality of life initiatives. Protecting seniors and enhancing their quality of life initiatives. Small Business Rebuilding Brooklyn's vibrant small business community for growth. Rebuilding Brooklyn's vibrant small business community for growth. Local Leadership - Empowering Young Women Championing local voices and fostering community-driven solutions. Championing local voices and fostering community-driven solutions. → → → → Community Advocate JAMMEL is dedicated and committed to revitalizing Brooklyn's District 41's neighborhoods and supporting local businesses and residents. JAMMEL is dedicated and committed to revitalizing Brooklyn's District 41's neighborhoods and supporting local businesses and residents. Empowering our youths and seniors. Empowering our youths and seniors. Candidate City Council Campaign Brooklyn Council 2023 - Present Focused on community engagement and creating opportunities for all residents. Local Initiatives Brooklyn Office 2020 - 2023 Worked on programs to support small businesses and enhance community well-being. JAMMEL THOMPSON - Change Candidate JAMMEL THOMPSON - Change Candidate Empowering Brooklyn's Future Together Jammel Thompson is dedicated to revitalizing Brooklyn's City Council District 41 by prioritizing people, protecting seniors, and creating opportunities for young women and small businesses. 150+ 15 Community Support Vote Jammel Contact Us Reach out to Jammel Thompson's campaign to share your thoughts and support for Brooklyn's future. Reach out to Jammel Thompson's campaign to share your thoughts and support for Brooklyn's future. Empowering The District Putting people first for a better Brooklyn. Putting people first for a better Brooklyn. Change Change Future Future contact@jammelthompson.com (917) 459-0498 © 2024. All rights reserved. CommonSense Strategies Group(c)"
  }
]