[
  {
    "candidate": "Thomas-Henry, Shanel",
    "category": "bio",
    "score": null,
    "link": "https://www.shanelforcouncil.com/about",
    "text": "top of page Home Home About About Our District Our District Vision Vision Resources Resources VOLUNTEER VOLUNTEER DONATE DONATE Meet Shanel Thomas-Henry Meet Shanel Thomas-Henry Meet Shanel Thomas-Henry A lifelong resident of Corona and East Elmhurst ready to serve District 21 A lifelong resident of Corona and East Elmhurst ready to serve District 21 A lifelong resident of Corona and East Elmhurst ready to serve District 21 Shanel is a proud lifelong resident of Corona and East Elmhurst, and it's this pride that inspired her to become heavily involved in her local community. She has an extensive background from decades of community service, including serving on numerous local boards, including, but not limited to, the New York City Industrial Development Agency, Elmcor Youth & Adult Activities, Inc., Neighborhood Housing Services of Queens CDC, the 115th Precinct Council and Community Board 3. Shanel is a proud lifelong resident of Corona and East Elmhurst, and it's this pride that inspired her to become heavily involved in her local community. She has an extensive background from decades of community service, including serving on numerous local boards, including, but not limited to, the New York City Industrial Development Agency, Elmcor Youth & Adult Activities, Inc., Neighborhood Housing Services of Queens CDC, the 115th Precinct Council and Community Board 3. With over two decades of experience in community development, including as the public information liaison for the $8 billion LaGuardia Redevelopment Program, her commitment extends beyond just the now. Shanel is focused on building a brighter future for generations of Queens families. With over two decades of experience in community development, including as the public information liaison for the $8 billion LaGuardia Redevelopment Program, her commitment extends beyond just the now. Shanel is focused on building a brighter future for generations of Queens families. Shanel’s family raised her to always be rooted in service and advocacy. Shanel’s mother is from a small country town in Maryland, just a few miles from the birthplace of Harriet Tubman. Her mother raised her and two of her siblings as a single mother, while her father was stationed abroad in the Army. To be closer to Shanel’s father’s family, they moved to the East Elmhurst/Corona neighborhoods — where Shanel was born. Shanel’s family raised her to always be rooted in service and advocacy. Shanel’s mother is from a small country town in Maryland, just a few miles from the birthplace of Harriet Tubman. Her mother raised her and two of her siblings as a single mother, while her father was stationed abroad in the Army. To be closer to Shanel’s father’s family, they moved to the East Elmhurst/Corona neighborhoods — where Shanel was born. Shanel’s father is a 20 year retired army First Sergeant and her mother has had a number of careers from childcare to bus operator for New York City Transit. Shanel is the oldest of five and helped raise her younger sister who is 14 years younger. Shanel’s father is a 20 year retired army First Sergeant and her mother has had a number of careers from childcare to bus operator for New York City Transit. Shanel is the oldest of five and helped raise her younger sister who is 14 years younger. Shanel attended the Learning Tree Pre School on 99th and Northern Blvd, St. John’s Lutheran School in College Point, and graduated from Christ the King High School in the top 20 in her class. Even still, the college advisors told Shanel that she should attend an in-state school and she definitely wouldn’t have the finances to study abroad, a dream of hers. While they might not have believed in her, Shanel did, and so did her family. Against all odds, powered by her community, Shanel overcame the challenge and was admitted to Howard University, her dream school, and studied abroad in Paris. Shanel attended the Learning Tree Pre School on 99th and Northern Blvd, St. John’s Lutheran School in College Point, and graduated from Christ the King High School in the top 20 in her class. Even still, the college advisors told Shanel that she should attend an in-state school and she definitely wouldn’t have the finances to study abroad, a dream of hers. While they might not have believed in her, Shanel did, and so did her family. Against all odds, powered by her community, Shanel overcame the challenge and was admitted to Howard University, her dream school, and studied abroad in Paris. Her experience at Howard taught her fortitude, resilience, overcoming"
  },
  {
    "candidate": "Thomas-Henry, Shanel",
    "category": "bio",
    "score": null,
    "link": "https://www.shanelforcouncil.com/about",
    "text": "adversity and set the blueprint for a scholarship program she would later bring back to her community. This scholarship provided tuition, paid internships and a job offer upon graduation. Shanel graduated with a BA in International Business with a concentration in marketing and a Masters in Public Administration from Howard University. She has also pursued studies abroad at the Sorbonne in Paris, France, and the Cultural Institute in Oaxaca, Mexico. Her educational journey is a huge part of why investing in the next generation has always been a top priority for Shanel. Her experience at Howard taught her fortitude, resilience, overcoming adversity and set the blueprint for a scholarship program she would later bring back to her community. This scholarship provided tuition, paid internships and a job offer upon graduation. Shanel graduated with a BA in International Business with a concentration in marketing and a Masters in Public Administration from Howard University. She has also pursued studies abroad at the Sorbonne in Paris, France, and the Cultural Institute in Oaxaca, Mexico. Her educational journey is a huge part of why investing in the next generation has always been a top priority for Shanel. Although she grew up eating hot dogs from her grandfather's pool hall on 105th and Northern and hanging out at her uncle's hardware store on 99th Street and Northern, the thought of one day owning her own business never crossed her mind. In 2001 Shanel started her first business while in graduate school at Howard and has owned and operated a business ever since in addition to working various 9 to 5’s. Although she grew up eating hot dogs from her grandfather's pool hall on 105th and Northern and hanging out at her uncle's hardware store on 99th Street and Northern, the thought of one day owning her own business never crossed her mind. In 2001 Shanel started her first business while in graduate school at Howard and has owned and operated a business ever since in addition to working various 9 to 5’s. Shanel’s first 9 to 5 job was working as a cashier at La Guardia Airport from the age of 16 until she left for college at 18, a career that would soon bloom into something more when she moved back to Queens after her four years in DC. Shanel served as the Community Outreach Manager for the LaGuardia Redevelopment Program where she pioneered a number of initiatives to directly benefit Corona and East Elmhurst. This included launching the LaGuardia Career Center at Elmcor, establishing the LaGuardia Redevelopment Opportunity Scholarship, initiating the STEM Summer Camp at Langston Hughes Library and East Elmhurst Library, and so much more. Shanel’s first 9 to 5 job was working as a cashier at La Guardia Airport from the age of 16 until she left for college at 18, a career that would soon bloom into something more when she moved back to Queens after her four years in DC. Shanel served as the Community Outreach Manager for the LaGuardia Redevelopment Program where she pioneered a number of initiatives to directly benefit Corona and East Elmhurst. This included launching the LaGuardia Career Center at Elmcor, establishing the LaGuardia Redevelopment Opportunity Scholarship, initiating the STEM Summer Camp at Langston Hughes Library and East Elmhurst Library, and so much more. Shanel remains very connected to the workforce at La Guardia, with many still living in East Elmhurst and Corona, including her old manager from her cashier days who she helped to create his own airline business, a long-time dream of his. A testament to Shanel’s long-term care and commitment for her local community. Shanel remains very connected to the workforce at La Guardia, with many still living in East Elmhurst and Corona, including her old manager from her cashier days who she helped to create his own airline business, a long-time dream of his. A testament to Shanel’s long-term care and commitment for her local community. Shanel Thomas-Henry currently resides in East Elmhurst with her husband Fleetwood Henry and their young daughters, Quinn and Parker. Today Shanel’s daughters attend the Learning Tree STEM Arts School run by Shanel’s former pre-school teacher where she also serves as a board member. Shanel Thomas-Henry currently resides in East Elmhurst with her husband Fleetwood Henry and their young daughters, Quinn and Parker. Today Shanel’s daughters attend the Learning Tree STEM Arts School run by Shanel’s former pre-school teacher where she also serves as a board member. Shanel’s track record of local accomplishments and her deep"
  },
  {
    "candidate": "Thomas-Henry, Shanel",
    "category": "bio",
    "score": null,
    "link": "https://www.shanelforcouncil.com/about",
    "text": "ties to the community makes her a strong advocate for Eastern Queens and the most qualified candidate to serve as the City Council Member for District 21. Shanel’s track record of local accomplishments and her deep ties to the community makes her a strong advocate for Eastern Queens and the most qualified candidate to serve as the City Council Member for District 21. Words she lives by: “My goal in life is to prepare the next generation to ascend beyond what I have achieved; if they can begin their journey where we end ours, that’s true progress.” Words she lives by: “My goal in life is to prepare the next generation to ascend beyond what I have achieved; if they can begin their journey where we end ours, that’s true progress.” ​ ​ ​ ​ ​ Contact | Donate ​ ​ ​ Contact | Donate Contact | Donate Contact Donate ​ ​ ​ ​ ​ ​ ​ Privacy Policy Privacy Policy Privacy Policy Privacy Policy bottom of page"
  }
]