[
  {
    "candidate": "Tilson, Whitney R",
    "category": "bio",
    "score": null,
    "link": "https://stansberryresearch.com/our-team/whitney-tilson",
    "text": "Our Products Our Editors Media Stock Market Trends Log In Sign Up Free Our Products Our Products Our Editors Our Editors Media Media Stock Market Trends Stock Market Trends Log In Log In Sign Up Free Sign Up Free Whitney is the lead analyst for Stansberry Investment Advisory , our flagship newsletter. Whitney graduated magna cum laude from Harvard with a bachelor's degree in government. Upon graduation, he helped Wendy Kopp launch Teach for America. He then went on to earn his MBA at Harvard in 1994. He graduated in the top 5% of his class and was named a Baker Scholar. In his professional life, Whitney founded and ran Kase Capital Management, which managed three value-oriented hedge funds and two mutual funds. Starting out of his bedroom with only $1 million, Tilson grew assets under management to more than $200 million. An accomplished writer, Tilson has published four books, the most recent of which is The Art of Playing Defense: How to Get Ahead by Not Falling Behind (2021) . He has also co-authored two books, The Art of Value Investing: How the World's Best Investors Beat the Market (2013) and More Mortgage Meltdown: 6 Ways to Profit in These Bad Times (2009). And he contributed to Poor Charlie's Almanack: The Essential Wit and Wisdom of Charles T. Munger (2005), the definitive book on Berkshire Hathaway Vice Chairman Charlie Munger. Whitney has appeared dozens of times on CNBC, Bloomberg TV, and Fox Business Network, and has been profiled by the Wall Street Journal and the Washington Post . He has also written for Forbes, the Financial Times, Kiplinger's, the Motley Fool, and TheStreet.com. No spam pledge: We'll never rent, misuse or abuse your email address. By entering your e-mail, you will also begin receiving Whitney Tilson's Daily. You can unsubscribe from Whitney Tilson's Daily at any time. Privacy Policy. Protected by copyright laws of the United States and international treaties. This website may only be used pursuant to the Terms of Use and any reproduction, copying, or redistribution (electronic or otherwise, including on the World Wide Web), in whole or in part, is strictly prohibited without the express written permission of Stansberry & Associates Investment Research, LLC. 1125 N Charles St, Baltimore MD 21201. Copyright © 2025 . Barchart.com , Inc. Quote data is provided and hosted by Barchart Market Data Solutions. Quote Data is delayed by at least 15 minutes, and Volume reflects consolidated markets. Data is provided \"as is\" and is solely for information purposes, not for trading purposes or advice. © 2025 Stansberry & Associates Investment Research, LLC. All rights reserved."
  }
]