[
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "Sign up to receive Ballotpedia's daily newsletter Email * First Name Please complete the Captcha above Ballotpedia on Facebook Share this page Follow Ballotpedia Ballotpedia on Twitter Share this page Follow Ballotpedia Harold Tischler Harold Tischler Harold Tischler This page was current at the end of the individual's last campaign covered by Ballotpedia. Please contact us with any updates. Republican Party March 25, 2025 Education Talmudical Academy of Central New Jersey Campaign website Campaign Twitter Campaign Instagram Campaign YouTube Personal Facebook Harold Tischler (Team Trump Party) (also known as Heshy) ran in a special election to the New York City Council to represent District 44 . Tischler lost in the special general election on March 25, 2025 . Contents 1 Biography 1 Biography 2 Elections 2.1 2025 2.1.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.3 2022 2.4 2021 2.5 2017 2 Elections 2.1 2025 2.1.1 Endorsements 2.1 2025 2.1.1 Endorsements 2.1.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.2 2023 2.2.1 Endorsements 2.2.1 Endorsements 2.3 2022 2.3 2022 2.4 2021 2.4 2021 2.5 2017 2.5 2017 3 Campaign themes 3.1 2025 3.2 2023 3.3 2022 3.4 2021 3.5 2017 3.5.1 Candidate survey 3.5.1.1 Ranking the issues 3.5.1.2 Nationwide municipal issues 3 Campaign themes 3.1 2025 3.1 2025 3.2 2023 3.2 2023 3.3 2022 3.3 2022 3.4 2021 3.4 2021 3.5 2017 3.5.1 Candidate survey 3.5.1.1 Ranking the issues 3.5.1.2 Nationwide municipal issues 3.5 2017 3.5.1 Candidate survey 3.5.1.1 Ranking the issues 3.5.1.2 Nationwide municipal issues 3.5.1 Candidate survey 3.5.1.1 Ranking the issues 3.5.1.1 Ranking the issues 3.5.1.2 Nationwide municipal issues 3.5.1.2 Nationwide municipal issues 4 See also 4 See also 5 External links 5 External links 6 Footnotes 6 Footnotes Biography Biography Tischler's experience includes work in travel and as an expeditor for Greenline Building Consultants, the host of the Just Enough Heshy radio show, a teacher, and a contractor developer. [1] [2] [3] Elections Elections 2025 2025 See also: City elections in New York, New York (2025) General election General election for New York City Council District 44 The ranked-choice voting election was won by Simcha Felder in round 1 . Candidate % Total Votes Transfer Round eliminated Simcha Felder 81.8 4,624 0 Won (1) Harold Tischler 17.3 977 0 1 Undeclared Write-ins Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. 1.0 55 0 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 5,656 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Endorsements Endorsements Ballotpedia did not identify endorsements for Tischler in this election. 2023 2023 See also: City elections in New York, New York (2023) General election General election for New York City Council District 44 Incumbent Kalman Yeger defeated Harold Tischler in the general election for New York City Council District 44 on November 7, 2023. Candidate % Votes ✔ Kalman Yeger (R / D / Conservative Party) 80.0 7,500 Harold Tischler (Boro Park Flatbush Party) 18.5 1,732 Other/Write-in votes 1.6 148 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 9,380 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic Primary for New York City"
  },
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "Council District 44 The following candidates advanced in the ranked-choice voting election: Kalman Yeger in round 1 . Candidate ✔ Kalman Yeger Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Republican primary election Republican Primary for New York City Council District 44 The following candidates advanced in the ranked-choice voting election: Kalman Yeger in round 1 . Candidate % Total Votes Transfer Round eliminated Kalman Yeger 51.2 395 0 Advanced (1) Harold Tischler 47.3 365 0 1 Undeclared Write-ins Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. 1.6 12 0 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 772 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Conservative Party primary election Conservative Primary for New York City Council District 44 The following candidates advanced in the ranked-choice voting election: Kalman Yeger in round 1 . Candidate ✔ Kalman Yeger Incumbents are bolded and underlined . Incumbents are bolded and underlined . = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Endorsements Endorsements Ballotpedia did not identify endorsements for Tischler in this election. 2022 2022 See also: New York State Senate elections, 2022 General election General election for New York State Senate District 22 Incumbent Simcha Felder defeated Marva Brown in the general election for New York State Senate District 22 on November 8, 2022. Candidate % Votes ✔ Simcha Felder (D / R / Conservative Party) 95.1 59,534 Marva Brown (Working Families Party) 4.5 2,846 Other/Write-in votes 0.4 242 Incumbents are bolded and underlined . The results have been certified. Source Incumbents are bolded and underlined . The results have been certified. Source Total votes: 62,622 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election The Democratic primary election was canceled. Incumbent Simcha Felder advanced from the Democratic primary for New York State Senate District 22. Withdrawn or disqualified candidates Harold Tischler (D) Khaled Salem (D) Republican primary election The Republican primary election was canceled. Incumbent Simcha Felder advanced from the Republican primary for New York State Senate District 22. Conservative Party primary election The Conservative Party primary election was canceled. Incumbent Simcha Felder advanced from the Conservative Party primary for New York State Senate District 22. Working Families Party primary election The Working Families Party primary election was canceled. Marva Brown advanced from the Working Families Party primary for New York State Senate District 22. 2021 2021 See also: City elections in New York, New York (2021) General election General election for New York City Council District 48 Inna Vernikov defeated Steven Saperstein in the general election for New York City Council District 48 on November 2, 2021. Candidate % Votes ✔ Inna Vernikov (R / Conservative Party / Centrist Party) 61.6 12,963 Steven Saperstein (D) 38.2 8,038 Other/Write-in votes 0.2 51 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 21,052 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey."
  },
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "If you are a candidate and would like to tell readers and voters more about why they should vote for you, complete the Ballotpedia Candidate Connection Survey. Do you want a spreadsheet of this type of data? Contact our sales team. Do you want a spreadsheet of this type of data? Contact our sales team. Democratic primary election Democratic Primary for New York City Council District 48 Select round: Round 5 Round 4 Round 3 Round 2 Round 1 The following candidates advanced in the ranked-choice voting election: Steven Saperstein in round 5 . The results of Round are displayed below. To see the results of other rounds, use the dropdown menu above to select a round and the table will update. Candidate % Total Votes Transfer Round eliminated Steven Saperstein 57.1 4,542 755 Advanced (5) Mariya Markh 42.9 3,416 555 5 Amber Adler 0.0 0 -2,004 5 Submit photo Binyomin Zev Bendet 0.0 0 0 4 Harold Tischler 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Steven Saperstein 43.8 3,787 629 Advanced (5) Mariya Markh 33.1 2,861 219 5 Amber Adler 23.2 2,004 360 5 Submit photo Binyomin Zev Bendet 0.0 0 -1,589 4 Harold Tischler 0.0 0 0 3 Candidate % Total Votes Transfer Round eliminated Steven Saperstein 35.0 3,158 117 Advanced (5) Mariya Markh 29.2 2,642 56 5 Amber Adler 18.2 1,644 50 5 Submit photo Binyomin Zev Bendet 17.6 1,589 102 4 Harold Tischler 0.0 0 -463 3 Candidate % Total Votes Transfer Round eliminated Steven Saperstein 33.2 3,041 8 Advanced (5) Mariya Markh 28.2 2,586 10 5 Amber Adler 17.4 1,594 7 5 Submit photo Binyomin Zev Bendet 16.2 1,487 2 4 Harold Tischler 5.0 463 2 3 Candidate % Total Votes Transfer Round eliminated Steven Saperstein 32.9 3,033 0 Advanced (5) Mariya Markh 28.0 2,576 0 5 Amber Adler 17.2 1,587 0 5 Submit photo Binyomin Zev Bendet 16.1 1,485 0 4 Harold Tischler 5.0 461 0 3 Undeclared Write-ins Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. Undeclared write-in candidates may advance past the first round in some ranked-choice elections. If the official source reports write-in votes by candidate name, Ballotpedia displays them alongside the ballot-qualified candidates. However, if write-in votes are reported without a name, they will instead be included in the total write-in votes figure in Round 1. Please consult the official elections source for more details about unnamed write-in candidate vote totals past Round 1. 0.7 68 0 There were no incumbents in this race. The results have been certified. Source There were no incumbents in this race. The results have been certified. Source Total votes: 9,210 = candidate completed the Ballotpedia Candidate Connection survey. = candidate completed the Ballotpedia Candidate Connection survey. Republican primary election The Republican primary election was canceled. Inna Vernikov advanced from the Republican primary for New York City Council District 48. Conservative Party primary election The Conservative Party primary election was canceled. Inna Vernikov advanced from the Conservative Party primary for New York City Council District 48. 2017 2017 New York City held elections for mayor, public advocate, comptroller, and all 51 seats on the city council in 2017. New Yorkers also voted for offices in their boroughs: The Bronx , Brooklyn , Manhattan , Queens , and Staten Island . Primary elections were scheduled for September 12, 2017, and the general election was on November 7, 2017. Under New York law, candidates who run unopposed in a primary or general election win the nomination or election automatically, and their names do not appear on the ballot. [4] Kalman Yeger (D) defeated Yoni Hikind (Our Neighborhood) and Harold Tischler (School Choice) in the general election for the District 44 seat on the New York City Council. Party Candidate Vote % Votes Democratic Kalman Yeger 66.86% 11,334 Our Neighborhood Yoni Hikind 28.64% 4,854 School Choice Harold Tischler 3.95% 670 Write-in votes 0.55% 93 Total Votes 16,951 Source: New York City Board of Elections , \"General Election - November 7, 2017,\" accessed January 2, 2018 Campaign themes Campaign themes 2025 2025 Ballotpedia survey responses See also: Ballotpedia's Candidate Connection Harold Tischler"
  },
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "did not complete Ballotpedia's 2025 Candidate Connection survey. 2023 2023 Harold Tischler did not complete Ballotpedia's 2023 Candidate Connection survey. 2022 2022 Harold Tischler did not complete Ballotpedia's 2022 Candidate Connection survey. 2021 2021 Harold Tischler did not complete Ballotpedia's 2021 Candidate Connection survey. 2017 2017 Candidate survey Candidate survey Tischler participated in Ballotpedia's 2017 survey of municipal government candidates. [5] The following sections display his responses to the survey questions. When asked what his top priority would be if elected, the candidate made the following statement: “ Housing and parking [6] ” —Harold Tischler (November 1, 2017) [3] Ranking the issues Ranking the issues The candidate was asked to rank the following issues by importance in the city, with 1 being the most important and 12 being the least important: city services (trash, utilities, etc.), civil rights, crime reduction/prevention, environment, government transparency, homelessness, housing, K-12 education, public pensions/retirement funds, recreational opportunities, transportation, and unemployment. This table displays this candidate's rankings from most to least important. 1 Transportation 7 Candidate did not provide a response 2 Candidate did not provide a response 8 Candidate did not provide a response 3 Candidate did not provide a response 9 Candidate did not provide a response 4 Candidate did not provide a response 10 Candidate did not provide a response 5 Candidate did not provide a response 11 Candidate did not provide a response 6 Candidate did not provide a response 12 Candidate did not provide a response Nationwide municipal issues Nationwide municipal issues The candidate was asked to answer questions from Ballotpedia regarding issues facing cities across America. The questions are in the left column and the candidate's responses are in the right column. Some questions provided multiple choices, which are noted after those questions. Is it important for the city’s budget to be balanced? Answer options: Not important; Not important, but required by state law; A little important; A little important, but required by state law; Important; Very important Important Which level of government do you feel should set a minimum wage? Answer options: None, Local, State, Federal Federal How do you think your city should emphasize economic development? Candidates could write their own answer or choose from the following options: Changing zoning restrictions, Create a more competitive business climate, Focusing on small business development, Instituting a citywide minimum wage, Recruiting new businesses to your city, Regulatory and licensing reforms, and tax reform Changing zoning restrictions What is the one thing you’re most proud of about your city? Local people and organization doing lots of charity What is the one thing you’d most like to change about your city? Police and city agencies all need a clean sweep from the top down Do you approve of the city's approach to policing and public safety? What changes, if any, do you think the city should make? All police need to be made available and to stop issuing traffic tickets Do you approve of the city's sanctuary policy? What changes, if any, do you think the city should make? Yes Do you approve of the city's approach to public transportation? What changes, if any, do you think the city should make? Yes Do you approve of the city's approach to housing policy? What changes, if any, do you think the city should make? No Need to have developers and contractors and private homeowners to sit in a civil created group to over see zoning and the department of buildings and HPD and DEP and BSA Need to have developers and contractors and private homeowners to sit in a civil created group to over see zoning and the department of buildings and HPD and DEP and BSA See also See also 2025 Elections Government Newsletters External links External links Search Google News for this topic Candidate New York City Council District 44 Website Twitter Instagram YouTube Candidate New York City Council District 44 Website Twitter Instagram YouTube Personal Facebook Personal Facebook Footnotes Footnotes ↑ Facebook , \"Harold Tischler,\" accessed October 30, 2017 ↑ Facebook , \"Harold Tischler,\" accessed October 30, 2017 ↑ Facebook , \"Harold Tischler on October 30, 2017,\" accessed October 30, 2017 ↑ Facebook , \"Harold Tischler on October 30, 2017,\" accessed October 30, 2017 ↑ 3.0 3.1 Ballotpedia's municipal government candidate survey, 2017 , \"Harold Tischler's Responses,\" November 1, 2017 ↑ 3.0 3.1 Ballotpedia's municipal government candidate survey, 2017 , \"Harold Tischler's Responses,\" November 1, 2017 ↑ New York Election Law , \"Sec 6-160. Primaries,\" accessed July 14, 2017 ↑ New"
  },
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "York Election Law , \"Sec 6-160. Primaries,\" accessed July 14, 2017 ↑ Note: The candidate's answers have been reproduced here verbatim without edits or corrections by Ballotpedia. ↑ Note: The candidate's answers have been reproduced here verbatim without edits or corrections by Ballotpedia. ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. ↑ Note: This text is quoted verbatim from the original source. Any inconsistencies are attributable to the original source. v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e 2025 Municipal Elections Local Elections Municipal Government • Local Courts • School Boards • Local Ballot Measures Ballotpedia Coverage Federal Politics • State Politics • Local Politics • Public Policy • Influencers v • e State of New York capital What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures What's on my ballot? | Elections in 2025 | How to vote | How to run for office | Ballot measures Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy Who represents me? | U.S. President | U.S. Congress | Federal courts | State executives | State legislature | State and local courts | Counties | Cities | School districts | Public policy 2021 challenger 2021 primary (defeated) 2022 challenger 2023 challenger 2023 general election (defeated) 2023 primary 2025 challenger 2025 general election (defeated) Boro Park Flatbush Party Democratic Party Municipal candidate, 2021 Municipal candidate, 2023 Municipal candidate, 2025 Municipal candidates New York New York City Council candidate, 2021 New York City Council candidate, 2023 New York City Council candidate, 2025 New York State Senate candidate (Withdrew), 2022 New York State Senate candidate, 2022 Republican Party State Senate candidate, 2022 State senate candidates Team Trump Party 2017 challenger Municipal candidate, 2017 City council candidate, 2017 City council candidate, New York, New York, 2017 2017 general election (defeated) 2017 open seat Ballotpedia features 604,973 encyclopedic articles written and curated by our professional staff of editors, writers, and researchers. Click here to contact our editorial staff or report an error . For media inquiries, contact us here . Please donate here to support our continued expansion. Information about voting Information about voting Your 2025 Election Toolkit What's on my ballot? Where do I vote? How do I register to vote? How do I request a ballot? When do I vote? When are polls open? Who Represents Me? 2024 Elections 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections 2024 Ballot measures 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 School board elections 2024 Election analysis 2024 Election analysis 2024 elections analysis hub Pivot Counties in the 2024 presidential election New members elected to Congress Incumbents defeated in state legislative elections State legislative seats that changed party control Ballot measure trends in 2024 2024 general election voter turnout Wave elections in 2024 2025 Elections 2025 Elections Governors State executives State legislatures Ballot measures State judges Municipal officials School boards Trending Trending Elections calendar Confirmation process for Donald Trump's Cabinet nominees, 2025 Wisconsin Supreme Court elections, 2025 2024 general election voter turnout Ballotpedia News Public Policy Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Information for candidates Information for candidates Ballotpedia's Candidate Survey How do I run for office? How do I update a page? Election results Send us candidate contact info Get Engaged Get Engaged Donate to Ballotpedia Contact us Report an error Events Newsletters Ballotpedia Podcast Careers Volunteer Ad Policy Ballotpedia Boutique Services Services Media inquiries Data sales Additional analysis Additional analysis Election legislation tracking State Trifectas State Triplexes Redistricting Pivot Counties State Supreme Court Partisanship Polling indexes SITE NAVIGATION 2025 Elections Upcoming elections 2025 Statewide primary dates"
  },
  {
    "candidate": "Tischler, Harold",
    "category": "bio",
    "score": null,
    "link": "https://ballotpedia.org/Harold_Tischler",
    "text": "2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures Upcoming elections 2025 Statewide primary dates 2025 State executive elections 2025 State legislative elections 2025 Local elections 2025 School board elections 2025 Ballot measures 2024 Election results hub Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 Ballotpedia's 2024 elections analysis Pivot Counties in the 2024 presidential election New members elected to Congress Comparison of state delegations to the 118th and 119th Congresses Congressional margin of victory analysis Congressional elections decided by 10 percentage points or fewer State legislative veto-proof majorities Incumbents defeated in state legislative elections State legislative margin of victory analysis State legislative seats that changed party control State legislative races decided by fewer than 100 votes Ballot measure trends in 2024 Analysis of voter turnout in the 2024 general election Wave elections in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 2024 Elections 2024 Presidential election 2024 Presidential candidates 2024 Congressional elections Special Congressional elections (2023-2024) 2024 State executive elections 2024 State legislative elections 2024 State judge elections 2024 Local elections 2024 Ballot measures Ballotpedia's top 15 elections to watch in 2024 Ballotpedia's top 15 ballot measures to watch in 2024 The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes The Trump administration Donald Trump's cabinet nominees How cabinet nominees are confirmed Executive orders and actions Key legislation Judicial nominations Vetoes Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Government U.S. President U.S. Congress Ballot measures U.S. Supreme Court Federal courts State government Municipal government School boards Recalls Public Policy Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states Administrative state Criminal justice policy Education policy Environmental, social, and corporate governance (ESG) Federalism Unemployment insurance Work requirements Policy in the states More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast More... Ballotpedia's Sample Ballot Ballotpedia's 2024 Voter Toolkit Ballotpedia's Candidate Survey Redistricting Trifectas Election policy Running for office Election legislation tracking Ballotpedia's weekly podcast About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer About us About Ballotpedia Donate Buy Political Data Editorial independence Index Job opportunities News and events Staff Volunteer Privacy policy About Ballotpedia Disclaimers Login"
  }
]