[
  {
    "candidate": "Trafficante, Liliana M",
    "category": "bio",
    "score": null,
    "link": "https://nypost.com/2025/01/18/us-news/ex-con-candidate-liliana-trafficante-says-shes-perfectly-suited-to-run-for-nyc-council/",
    "text": "Primary Menu Sections Sections US News Metro Long Island Politics Metro Long Island Politics World News Page Six Sports NFL MLB Olympics NBA NHL College Football College Basketball WNBA NFL MLB Olympics NBA NHL College Football College Basketball WNBA Post Sports+ Sports Betting Business Personal Finance Personal Finance Opinion Entertainment TV Movies Music Celebrities Awards Theater TV Movies Music Celebrities Awards Theater Shopping Lifestyle Weird But True Sex & Relationships Viral Trends Human Interest Parenting Fashion & Beauty Food & Drink Travel Weird But True Sex & Relationships Viral Trends Human Interest Parenting Fashion & Beauty Food & Drink Travel Health Wellness Fitness Health Care Medicine Men’s Health Women’s Health Mental Health Nutrition Wellness Fitness Health Care Medicine Men’s Health Women’s Health Mental Health Nutrition Real Estate Alexa Media Tech Science Space Environment Wildlife Archaeology Space Environment Wildlife Archaeology Astrology Video Photos Today’s Paper Covers Columnists Horoscopes Crosswords & Games Sports Odds Podcasts Careers Today’s Paper Covers Columnists Horoscopes Crosswords & Games Sports Odds Podcasts Careers Email Newsletters Official Store Home Delivery Tips Email Newsletters Official Store Home Delivery Tips Search Email New York Post Open main U.S. News navigation U.S. News US News Metro Long Island Politics World News US News Metro Long Island Politics World News Search Recommended Metro exclusive Ex-con candidate Liliana Trafficante says she’s perfectly ‘suited’ to run for NYC Council after years in prison for fraud By Matthew Sedacca Published Jan. 18, 2025, 10:53 a.m. ET An ex-con who spent more than three years in federal prison for defrauding investors out of at least $1 million for a sham upstate water park for foster kids is now gunning for a Bronx City Council seat — even though she’s unable to hold office under city law. Liliana Trafficante, 58, announced her campaign earlier this month on Instagram , writing that her sudden calling for public service was driven by there being “no help” for her “hurting community.” Liliana Trafficante is running for a Bronx City Council seat after spending years locked up in federal prison. AP The Country Club resident’s longest-shot candidacy comes just over a decade after she pled guilty to felony wire fraud conspiracy, having bilked investors in a fictitious plan to build a waterpark on 120 acres in Goshen, according to Justice Department officials . Trafficante was sentenced to nearly three years in federal prison and ordered to pay $750,000 in restitution to her victims, of which she’s coughed up just $118, according to Manhattan federal court records. Explore More Former President Biden has 'aggressive' prostate cancer that has spread to his bones $100-an-hour private MTA subway guards are holding doors open for fare beaters, sleeping on the job FBI deputy director gives his verdict on Jeffrey Epstein's cause of death after reviewing files “Any consideration for her to be running for any city employment is a joke,” real estate investor Welby Accely, one of Trafficante’s victims, told The Post. The political neophyte claims she’s pursuing a seat in the Bronx’s 13th District, which is currently repped by freshmen Republican Kristy Marmorato and covers Country Club and Throggs Neck, although she erroneously filed paperwork to run in Manhattan’s 3rd District. Trafficante said that her criminal past makes her “suited” for the job. instagram @ashesmakebeauty If Trafficante somehow bests the incumbent, however, she will be ineligible to serve in the council due to a 2021 law that prohibits people convicted of fraud or public corruption felonies from holding office. The law faces a challenge in Manhattan Supreme Court. Trafficante has received zero donations, according to city campaign finance records. The wannabe pol, who currently works for government services company Maximus, insisted her time in the clink makes her the ideal representative for her nabe. “I just want to serve and make this community better, and I think that if you have lived the problem, you’re better suited,” she said. Filed under city council crime races the bronx wire fraud 1/18/25 Read Next Far-left NYC comptroller pockets mayoral campaign cash fro... Trending Now on NYPost.com This story has been shared 57,657 times. 57,657 Former President Biden has 'aggressive' prostate cancer that has spread to his bones This story has been shared 49,144 times. 49,144 $100-an-hour private MTA subway guards are holding doors open for fare beaters, sleeping on the job This story has been shared 48,117 times. 48,117 Historic Vietnam War photo has 'suspended attribution' after doubts of photographers ownership This story has been shared 41,722 times. 41,722 FBI deputy director gives his verdict on"
  },
  {
    "candidate": "Trafficante, Liliana M",
    "category": "bio",
    "score": null,
    "link": "https://nypost.com/2025/01/18/us-news/ex-con-candidate-liliana-trafficante-says-shes-perfectly-suited-to-run-for-nyc-council/",
    "text": "Jeffrey Epstein's cause of death after reviewing files Most Commented Join the conversation This story has 3.1K comments. 3.1K Trump doesn't hold back after ex-FBI director's ‘86 47’ post: Called for 'assassination' This story has 2.3K comments. 2.3K Secret Service probing ex-FBI chief James Comey for allegedly threatening Trump in since-deleted Instagram post This story has 1.9K comments. 1.9K Biden struggles with key memories — including year son Beau died — during special counsel interview: leaked audio Columnists Charles Gasparino Trump’s ‘crypto council’ has ‘no juice’ as it stumbles out of the gate on key Capitol Hill vote: sources Rikki Schlott Some of Silicon Valley's most prominent schools have ditched honors classes in the name of equity — but it's a terrible idea See All Columnists Page Six Style Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala Gwyneth Paltrow defends selling controversial $75 vagina candle: ‘Go f–k yourself!’ Cannes Film Festival 2025 red carpet: All the celebrity looks Now on Page Six Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala ‘General Hospital’ alum Steve Burton marries Michelle Lundstrom after ex-wife got pregnant by another man Sean ‘Diddy’ Combs’ twin daughters, Jessie and D’Lila, get glamorous for prom amid rapper’s sex-trafficking trial See All Video Viral black smoke ring sparks wild theories — aliens, locusts, pyros & more Metro exclusive Ex-con candidate Liliana Trafficante says she’s perfectly ‘suited’ to run for NYC Council after years in prison for fraud Matthew Sedacca Published Jan. 18, 2025, 10:53 a.m. ET An ex-con who spent more than three years in federal prison for defrauding investors out of at least $1 million for a sham upstate water park for foster kids is now gunning for a Bronx City Council seat — even though she’s unable to hold office under city law. Liliana Trafficante, 58, announced her campaign earlier this month on Instagram , writing that her sudden calling for public service was driven by there being “no help” for her “hurting community.” AP The Country Club resident’s longest-shot candidacy comes just over a decade after she pled guilty to felony wire fraud conspiracy, having bilked investors in a fictitious plan to build a waterpark on 120 acres in Goshen, according to Justice Department officials . Trafficante was sentenced to nearly three years in federal prison and ordered to pay $750,000 in restitution to her victims, of which she’s coughed up just $118, according to Manhattan federal court records. Explore More Former President Biden has 'aggressive' prostate cancer that has spread to his bones $100-an-hour private MTA subway guards are holding doors open for fare beaters, sleeping on the job FBI deputy director gives his verdict on Jeffrey Epstein's cause of death after reviewing files “Any consideration for her to be running for any city employment is a joke,” real estate investor Welby Accely, one of Trafficante’s victims, told The Post. The political neophyte claims she’s pursuing a seat in the Bronx’s 13th District, which is currently repped by freshmen Republican Kristy Marmorato and covers Country Club and Throggs Neck, although she erroneously filed paperwork to run in Manhattan’s 3rd District. instagram @ashesmakebeauty If Trafficante somehow bests the incumbent, however, she will be ineligible to serve in the council due to a 2021 law that prohibits people convicted of fraud or public corruption felonies from holding office. The law faces a challenge in Manhattan Supreme Court. Trafficante has received zero donations, according to city campaign finance records. The wannabe pol, who currently works for government services company Maximus, insisted her time in the clink makes her the ideal representative for her nabe. “I just want to serve and make this community better, and I think that if you have lived the problem, you’re better suited,” she said. Filed under city council crime races the bronx wire fraud 1/18/25 Read Next Trending Now on NYPost.com on NYPost.com This story has been shared 57,657 times. 57,657 Former President Biden has 'aggressive' prostate cancer that has spread to his bones This story has been shared 57,657 times. 57,657 Former President Biden has 'aggressive' prostate cancer that has spread to his bones This story has been shared 49,144 times. 49,144 $100-an-hour private MTA subway guards are holding doors open for fare beaters, sleeping on the job This story has been shared 49,144 times. 49,144 $100-an-hour private MTA subway guards are holding doors open for fare beaters, sleeping on the job This story"
  },
  {
    "candidate": "Trafficante, Liliana M",
    "category": "bio",
    "score": null,
    "link": "https://nypost.com/2025/01/18/us-news/ex-con-candidate-liliana-trafficante-says-shes-perfectly-suited-to-run-for-nyc-council/",
    "text": "has been shared 48,117 times. 48,117 Historic Vietnam War photo has 'suspended attribution' after doubts of photographers ownership This story has been shared 48,117 times. 48,117 Historic Vietnam War photo has 'suspended attribution' after doubts of photographers ownership This story has been shared 41,722 times. 41,722 FBI deputy director gives his verdict on Jeffrey Epstein's cause of death after reviewing files This story has been shared 41,722 times. 41,722 FBI deputy director gives his verdict on Jeffrey Epstein's cause of death after reviewing files Most Commented Join the conversation Join the conversation This story has 3.1K comments. 3.1K Trump doesn't hold back after ex-FBI director's ‘86 47’ post: Called for 'assassination' This story has 3.1K comments. 3.1K Trump doesn't hold back after ex-FBI director's ‘86 47’ post: Called for 'assassination' This story has 2.3K comments. 2.3K Secret Service probing ex-FBI chief James Comey for allegedly threatening Trump in since-deleted Instagram post This story has 2.3K comments. 2.3K Secret Service probing ex-FBI chief James Comey for allegedly threatening Trump in since-deleted Instagram post This story has 1.9K comments. 1.9K Biden struggles with key memories — including year son Beau died — during special counsel interview: leaked audio This story has 1.9K comments. 1.9K Biden struggles with key memories — including year son Beau died — during special counsel interview: leaked audio Columnists Charles Gasparino Trump’s ‘crypto council’ has ‘no juice’ as it stumbles out of the gate on key Capitol Hill vote: sources Charles Gasparino Trump’s ‘crypto council’ has ‘no juice’ as it stumbles out of the gate on key Capitol Hill vote: sources Rikki Schlott Some of Silicon Valley's most prominent schools have ditched honors classes in the name of equity — but it's a terrible idea Rikki Schlott Some of Silicon Valley's most prominent schools have ditched honors classes in the name of equity — but it's a terrible idea See All Columnists Page Six Style Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala Gwyneth Paltrow defends selling controversial $75 vagina candle: ‘Go f–k yourself!’ Gwyneth Paltrow defends selling controversial $75 vagina candle: ‘Go f–k yourself!’ Cannes Film Festival 2025 red carpet: All the celebrity looks Cannes Film Festival 2025 red carpet: All the celebrity looks Now on Page Six Now on Page Six Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala Brittany Mahomes wears strapless dress with high slit to husband Patrick’s 15 and the Mahomies Foundation gala ‘General Hospital’ alum Steve Burton marries Michelle Lundstrom after ex-wife got pregnant by another man ‘General Hospital’ alum Steve Burton marries Michelle Lundstrom after ex-wife got pregnant by another man Sean ‘Diddy’ Combs’ twin daughters, Jessie and D’Lila, get glamorous for prom amid rapper’s sex-trafficking trial Sean ‘Diddy’ Combs’ twin daughters, Jessie and D’Lila, get glamorous for prom amid rapper’s sex-trafficking trial Video Viral black smoke ring sparks wild theories — aliens, locusts, pyros & more Viral black smoke ring sparks wild theories — aliens, locusts, pyros & more More Stories Page Six Meghan Markle 'berated' her wedding caterer so badly Queen Elizabeth stepped in, royal author claims NYPost Former President Biden has 'aggressive' prostate cancer that has spread to his bones Facebook Facebook Twitter Twitter Instagram Instagram LinkedIn LinkedIn Email Email YouTube YouTube Sections & Features US News Metro World News Sports Sports Betting Business Opinion Entertainment Fashion & Beauty Shopping Lifestyle Real Estate Media Tech Science Health Travel Astrology Video Photos Alexa Covers Horoscopes Sports Odds Podcasts Crosswords & Games Columnists Classifieds US News Metro World News Sports Sports Betting Business Opinion Entertainment Fashion & Beauty Shopping Lifestyle Real Estate Media Tech Science Health Travel Astrology Video Photos Alexa Covers Horoscopes Sports Odds Podcasts Crosswords & Games Columnists Classifieds Post Sports+ Subscribe Articles Manage Subscribe Articles Manage Newsletters & Feeds Email Newsletters RSS Feeds NY Post Official Store Home Delivery Subscribe Manage Subscription Delivery Help Email Newsletters RSS Feeds NY Post Official Store Home Delivery Subscribe Manage Subscription Subscribe Manage Subscription Delivery Help Help/Support About New York Post Editorial Standards Customer Service Apps Help Community Guidelines Contact Us Tips Newsroom Letters to the Editor Licensing & Reprints Careers Vulnerability Disclosure Program About New York Post Editorial Standards Customer Service Apps Help Community Guidelines Contact Us Tips Newsroom Letters to the Editor Licensing & Reprints Careers Vulnerability Disclosure Program Tips Newsroom Letters to the"
  },
  {
    "candidate": "Trafficante, Liliana M",
    "category": "bio",
    "score": null,
    "link": "https://nypost.com/2025/01/18/us-news/ex-con-candidate-liliana-trafficante-says-shes-perfectly-suited-to-run-for-nyc-council/",
    "text": "Editor Licensing & Reprints Careers Vulnerability Disclosure Program Apps iPhone App iPad App Android Phone Android Tablet Advertise Media Kit Contact iPhone App iPad App Android Phone Android Tablet Advertise Media Kit Contact Media Kit Contact © 2025 NYP Holdings, Inc. All Rights Reserved"
  }
]