[
  {
    "candidate": "Uribe, Jasmine",
    "category": "bio",
    "score": null,
    "link": "https://www.uribe4ny.com/meet-jasmine",
    "text": "0 0 Español Abrir menú Cerrar menú Español Abrir menú Cerrar menú Español Atrás Jasmine Uribe: A Champion for the Bronx Jasmine Uribe embodies the resilience and determination of the Bronx. A proud Dominican-American and lifelong resident, she has dedicated her career to empowering her neighbors and creating opportunities for families across the borough. Now, as a candidate for NYC Council District 17, Jasmine is poised to deliver bold, transformative leadership for the Bronx. Her journey began at The Bronx School for Law, Government, and Justice, where she discovered her passion for civic engagement and social justice. Early roles at The Bronx Defenders shaped her understanding of how advocacy can transform lives, inspiring her to challenge systemic inequities and fight for underserved communities. Through her work at The Bronx Defenders, Jasmine co-founded Bronx PRYDE, a program focused on mentorship, youth development, and conflict resolution, leaving a lasting impact on young people in the borough. As Director of Operations at The Bronx Collab, Jasmine has led initiatives that create safe spaces for youth, empower educators, and strengthen nonprofits. She founded Collab NYC to amplify the voices of Bronx families and secure the resources they need to thrive. Beyond her professional roles, Jasmine is deeply embedded in her community. As Vice President of her co-op board, she has fought to improve housing conditions and advocate for her neighbors. On Bronx Community Board 3, she has championed policies aimed at expanding access to resources and addressing equitable housing solutions. As a mother raising her son in the Bronx, Jasmine experiences the daily realities her neighbors face. From striving for safer streets to ensuring access to affordable housing and quality education, she understands these challenges not as abstract issues, but as urgent priorities. Her commitment to building a community where families feel safe, supported, and empowered isn’t just policy—it’s personal. Jasmine’s vision for District 17 is bold yet deeply rooted in its realities: safer streets, quality schools, affordable homes, and vibrant, thriving neighborhoods. Her story and leadership is one of unwavering resilience, and an unshakable commitment to building a brighter future for the Bronx. Jasmine Uribe: A Champion for the Bronx Jasmine Uribe: A Champion Champion for the Bronx Jasmine Uribe embodies the resilience and determination of the Bronx. A proud Dominican-American and lifelong resident, she has dedicated her career to empowering her neighbors and creating opportunities for families across the borough. Now, as a candidate for NYC Council District 17, Jasmine is poised to deliver bold, transformative leadership for the Bronx. Jasmine Uribe embodies the resilience and determination of the Bronx. A proud Dominican-American and lifelong resident, she has dedicated her career to empowering her neighbors and creating opportunities for families across the borough. Now, as a candidate for NYC Council District 17, Jasmine is poised to deliver bold, transformative leadership for the Bronx. Her journey began at The Bronx School for Law, Government, and Justice, where she discovered her passion for civic engagement and social justice. Early roles at The Bronx Defenders shaped her understanding of how advocacy can transform lives, inspiring her to challenge systemic inequities and fight for underserved communities. Through her work at The Bronx Defenders, Jasmine co-founded Bronx PRYDE, a program focused on mentorship, youth development, and conflict resolution, leaving a lasting impact on young people in the borough. Her journey began at The Bronx School for Law, Government, and Justice, where she discovered her passion for civic engagement and social justice. Early roles at The Bronx Defenders shaped her understanding of how advocacy can transform lives, inspiring her to challenge systemic inequities and fight for underserved communities. Through her work at The Bronx Defenders, Jasmine co-founded Bronx PRYDE, a program focused on mentorship, youth development, and conflict resolution, leaving a lasting impact on young people in the borough. As Director of Operations at The Bronx Collab, Jasmine has led initiatives that create safe spaces for youth, empower educators, and strengthen nonprofits. She founded Collab NYC to amplify the voices of Bronx families and secure the resources they need to thrive. As Director of Operations at The Bronx Collab, Jasmine has led initiatives that create safe spaces for youth, empower educators, and strengthen nonprofits. She founded Collab NYC to amplify the voices of Bronx families and secure the resources they need to thrive. Beyond her professional roles, Jasmine is deeply embedded in her community. As Vice President of her co-op board, she has fought to improve housing conditions and advocate for her neighbors. On Bronx Community Board 3,"
  },
  {
    "candidate": "Uribe, Jasmine",
    "category": "bio",
    "score": null,
    "link": "https://www.uribe4ny.com/meet-jasmine",
    "text": "she has championed policies aimed at expanding access to resources and addressing equitable housing solutions. Beyond her professional roles, Jasmine is deeply embedded in her community. As Vice President of her co-op board, she has fought to improve housing conditions and advocate for her neighbors. On Bronx Community Board 3, she has championed policies aimed at expanding access to resources and addressing equitable housing solutions. As a mother raising her son in the Bronx, Jasmine experiences the daily realities her neighbors face. From striving for safer streets to ensuring access to affordable housing and quality education, she understands these challenges not as abstract issues, but as urgent priorities. Her commitment to building a community where families feel safe, supported, and empowered isn’t just policy—it’s personal. As a mother raising her son in the Bronx, Jasmine experiences the daily realities her neighbors face. From striving for safer streets to ensuring access to affordable housing and quality education, she understands these challenges not as abstract issues, but as urgent priorities. Her commitment to building a community where families feel safe, supported, and empowered isn’t just policy—it’s personal. Jasmine’s vision for District 17 is bold yet deeply rooted in its realities: safer streets, quality schools, affordable homes, and vibrant, thriving neighborhoods. Her story and leadership is one of unwavering resilience, and an unshakable commitment to building a brighter future for the Bronx. Jasmine’s vision for District 17 is bold yet deeply rooted in its realities: safer streets, quality schools, affordable homes, and vibrant, thriving neighborhoods. Her story and leadership is one of unwavering resilience, and an unshakable commitment to building a brighter future for the Bronx. Paid for by Friends of Jasmine Uribe Jasmine Uribe Donate • Contact • Volunteer (718)-682-2699"
  }
]