[
  {
    "candidate": "Wang, Allen H",
    "category": "bio",
    "score": null,
    "link": "https://cmm.ucsd.edu/research/epigenomics/our-team/current-leadership/allen-wang.html",
    "text": "UC San Diego School of Medicine Search This Site All UCSD Sites Faculty/Staff Search Term About About the Founders Research in San Diego Facilities & Reservations Diversity Employment Contact Us About the Founders Research in San Diego Facilities & Reservations Diversity Employment Contact Us Education Graduate Education Postdoctoral Training CBIO Training Program Genetics Training Program Graduate Education Postdoctoral Training CBIO Training Program Genetics Training Program Faculty Research Labs Agilent Center of Excellence in Cellular Intelligence Biochemistry & Structural Biology Cell Division & Cell Cycle Control Center for RNA Technologies and Therapeutics Developmental Biology DNA Replication & Repair Electron Microscopy Core Center for Epigenomics Gene Expression & Regulation Genetics & Genomics Glycobiology Humanoid Center of Research Excellence Membrane Trafficking Neurodevelopment & Neurodegenerative Disease Signal Transduction Stem Cell Biology Systems Biology Labs Agilent Center of Excellence in Cellular Intelligence Biochemistry & Structural Biology Cell Division & Cell Cycle Control Center for RNA Technologies and Therapeutics Developmental Biology DNA Replication & Repair Electron Microscopy Core Center for Epigenomics Gene Expression & Regulation Genetics & Genomics Glycobiology Humanoid Center of Research Excellence Membrane Trafficking Neurodevelopment & Neurodegenerative Disease Signal Transduction Stem Cell Biology Systems Biology News & Events Seminar Series News Archive Seminar Series News Archive Toggle navigation About About the Founders Research in San Diego Facilities & Reservations Diversity Employment Contact Us About the Founders Research in San Diego Facilities & Reservations Diversity Employment Contact Us Education Graduate Education Postdoctoral Training CBIO Training Program Genetics Training Program Graduate Education Postdoctoral Training CBIO Training Program Genetics Training Program Faculty Research Labs Agilent Center of Excellence in Cellular Intelligence Biochemistry & Structural Biology Cell Division & Cell Cycle Control Center for RNA Technologies and Therapeutics Developmental Biology DNA Replication & Repair Electron Microscopy Core Center for Epigenomics Gene Expression & Regulation Genetics & Genomics Glycobiology Humanoid Center of Research Excellence Membrane Trafficking Neurodevelopment & Neurodegenerative Disease Signal Transduction Stem Cell Biology Systems Biology Labs Agilent Center of Excellence in Cellular Intelligence Biochemistry & Structural Biology Cell Division & Cell Cycle Control Center for RNA Technologies and Therapeutics Developmental Biology DNA Replication & Repair Electron Microscopy Core Center for Epigenomics Gene Expression & Regulation Genetics & Genomics Glycobiology Humanoid Center of Research Excellence Membrane Trafficking Neurodevelopment & Neurodegenerative Disease Signal Transduction Stem Cell Biology Systems Biology News & Events Seminar Series News Archive Seminar Series News Archive Search Scope This Site All UCSD Sites Faculty/Staff Search Term Center for Epigenomics: Dr. Allen Wang Dr. Allen Wang Department of Cellular and Molecular Medicine Research Center for Epigenomics Our Team Current Leadership Allen Wang Allen Wang, PhD is Senior Associate Director for the Center for Epigenomics at UC San Diego. A core component of the center’s mission is to lead epigenomics driven discoveries via deep and productive collaborative projects with teams of multi-disciplinary investigators. As one of the principal scientists and leaders of the Center for Epigenomcis, one of his key research objectives is to collaborate with diverse teams to apply epigenomic concepts and technologies innovatively, effectively, and efficiently towards ambitious research goals. To accomplish this, Dr. Wang leverage his experience leading teams and integrating multiple disciplines such as developmental biology, stem cell engineering, epigenomics, and human genetics. At the UC San Diego Center for Epigenomics, Dr. Wang has a proven track record of extracting meaningful biology from large-scale epigenomic datasets while coordinating efforts across multiple labs/institutes/universities. During his research career, for example he leveraged epigenomic datasets to identify epigenetic mechanisms for classic developmental processes such as developmental competence during endoderm development and to uncover novel potential mechanisms for type 2 diabetes genetic risk. At the UC San Diego Center for Epigenomics, Dr. Wang Currently, in his role of Senior Associate Director, he uses this training, expertise, and experience to manage numerous active collaborative projects with investigators both in and out of San Diego and in the process generating thousands of datasets. These research activities include but are not limited to overseeing data production for several of the largest single-cell ATAC-seq atlases generated to date as well as projects focused on understanding human brain function using functional organoids derived from hiPSCs, the molecular basis of human liver diseases such as NASH, and investigating pediatric lung cell-type diversity as part of LungMAP, etc. Dr. Wang mission to leverage my experience to creatively apply our state-of-the-art epigenomic technology platforms to critical biological questions. Allen Wang, PhD Senior Associate Director a5wang@health.ucsd.edu Full Profile Current Leadership Bing Ren Allen Wang Quan Zhu Nathan Zemke Agnieszka D'Antonio-Chronowska Tiffany Fox Current Leadership Bing Ren"
  },
  {
    "candidate": "Wang, Allen H",
    "category": "bio",
    "score": null,
    "link": "https://cmm.ucsd.edu/research/epigenomics/our-team/current-leadership/allen-wang.html",
    "text": "Allen Wang Quan Zhu Nathan Zemke Agnieszka D'Antonio-Chronowska Tiffany Fox UC San Diego 9500 Gilman Dr. La Jolla, CA 92093 (858) 534-2230 Copyright © 2025 Regents of the University of California. All rights reserved. UC San Diego 9500 Gilman Dr. La Jolla, CA 92093 (858) 534-2230 Copyright © 2025 Regents of the University of California. All rights reserved. 2025 Accessibility Privacy Policy Terms of Use Feedback"
  },
  {
    "candidate": "Wang, Allen H",
    "category": "bio",
    "score": null,
    "link": "https://www.michaeljfox.org/researcher/allen-wang-phd",
    "text": "JavaScript is currently disabled. Please enable JavaScript for an optimal experience. Animations Search Email Sign Up Log In Donate Now Home Page Are you looking for: ${result.term} ${result.term} Donate Now Menu Close Clear Main navigation Why We Exist Why We Exist Our Mission Our Promise Our Impact Our Agenda Michael's Story Current Partnerships Parkinson's Research The State of the Field Our Research Strategy Key Research Initiatives Parkinson’s Biomarkers Prizes Why We Exist Why We Exist Why We Exist Our Mission Our Mission Our Promise Our Promise Our Impact Our Impact Our Agenda Our Agenda Michael's Story Michael's Story Current Partnerships Current Partnerships Parkinson's Research Parkinson's Research The State of the Field The State of the Field Our Research Strategy Our Research Strategy Key Research Initiatives Key Research Initiatives Parkinson’s Biomarkers Parkinson’s Biomarkers Prizes Prizes Understanding Parkinson's Understanding Parkinson's About Parkinson's Parkinson's 101 Causes Symptoms Medications & Treatments Related Conditions Young-Onset The Parkinson's Journey Newly Diagnosed Resources Parkinson's 360° Building a Care Team Work & Benefits Relationships Mental & Physical Health Recursos en Español Education & Inspiration Parkinson’s IQ + You Events Ask the MD Webinars Podcasts Books & Resources Real Talk from Patients Parkinson's Buddy Network Other Resources My Parkinson's Library Understanding Parkinson's Understanding Parkinson's Understanding Parkinson's About Parkinson's About Parkinson's Parkinson's 101 Parkinson's 101 Causes Causes Symptoms Symptoms Medications & Treatments Medications & Treatments Related Conditions Related Conditions Young-Onset Young-Onset The Parkinson's Journey The Parkinson's Journey Newly Diagnosed Resources Newly Diagnosed Resources Parkinson's 360° Parkinson's 360° Building a Care Team Building a Care Team Work & Benefits Work & Benefits Relationships Relationships Mental & Physical Health Mental & Physical Health Recursos en Español Recursos en Español Education & Inspiration Education & Inspiration Parkinson’s IQ + You Events Parkinson’s IQ + You Events Ask the MD Ask the MD Webinars Webinars Podcasts Podcasts Books & Resources Books & Resources Real Talk from Patients Real Talk from Patients Parkinson's Buddy Network Parkinson's Buddy Network Other Resources Other Resources My Parkinson's Library My Parkinson's Library For Researchers For Researchers Funding What We Fund Funding Opportunities Funded Studies Research Integrity Resources Research Tools Data Resources Biospecimens Study Recruitment Assistance Research News The Parkinson’s Research Podcast MJFF Scientific Publications Collaboration Collaborative Research Opportunities Industry Partners Fox Advisors Working with Us Contact Information Key Initiatives and Findings PPMI Clinical Study ASAP Initiative GP2 For Researchers For Researchers For Researchers Funding Funding What We Fund What We Fund Funding Opportunities Funding Opportunities Funded Studies Funded Studies Research Integrity Research Integrity Resources Resources Research Tools Research Tools Data Resources Data Resources Biospecimens Biospecimens Study Recruitment Assistance Study Recruitment Assistance Research News Research News The Parkinson’s Research Podcast The Parkinson’s Research Podcast MJFF Scientific Publications MJFF Scientific Publications Collaboration Collaboration Collaborative Research Opportunities Collaborative Research Opportunities Industry Partners Industry Partners Fox Advisors Fox Advisors Working with Us Working with Us Contact Information Contact Information Key Initiatives and Findings Key Initiatives and Findings PPMI Clinical Study PPMI Clinical Study ASAP Initiative ASAP Initiative GP2 GP2 Take Action Take Action Donate Donate Now Ways to Give In Tribute Corporate Giving Planned Giving Fundraise Find an Event/Fundraiser Be a Fundraiser Run, Walk, Cycle Marathons, Climbs, Endurance Team Fox Do-It-Yourself Fundraising Resources Participate in Research Your Role in Research Join PPMI Fox Trial Finder Real Talk from Participants Advocate Contact Your Policymakers Our Public Policy Priorities Advocacy Resources Updates from Washington The National Parkinson’s Project Take Action Take Action Take Action Donate Donate Donate Now Donate Now Ways to Give Ways to Give In Tribute In Tribute Corporate Giving Corporate Giving Planned Giving Planned Giving Fundraise Fundraise Find an Event/Fundraiser Find an Event/Fundraiser Be a Fundraiser Be a Fundraiser Run, Walk, Cycle Run, Walk, Cycle Marathons, Climbs, Endurance Marathons, Climbs, Endurance Team Fox Do-It-Yourself Team Fox Do-It-Yourself Fundraising Resources Fundraising Resources Participate in Research Participate in Research Your Role in Research Your Role in Research Join PPMI Join PPMI Fox Trial Finder Fox Trial Finder Real Talk from Participants Real Talk from Participants Advocate Advocate Contact Your Policymakers Contact Your Policymakers Our Public Policy Priorities Our Public Policy Priorities Advocacy Resources Advocacy Resources Updates from Washington Updates from Washington The National Parkinson’s Project The National Parkinson’s Project Hello, User Hello, User My Profile Saved For Later Log out Hello, User Hello, User Hello, User My Profile My Profile Saved For Later Saved For Later Log out Log out Log In Home Page Search for topics, articles, videos, research, etc... Hit enter to search or ESC to close Are you looking for: ${result.term}"
  },
  {
    "candidate": "Wang, Allen H",
    "category": "bio",
    "score": null,
    "link": "https://www.michaeljfox.org/researcher/allen-wang-phd",
    "text": "${result.term} Home Page Allen Wang, PhD Allen Wang, PhD Donate Now Allen Wang, PhD Allen Wang, PhD Allen Wang, PhD, is an Associate Director of Single Cell Genomics at the Research Center for Epigenomics, University of California, San Diego (UCSD). He received his PhD in 2010 from University of California, Irvine where he studied cell chain formation in fungi. He joined Prof. Maike Sander’s lab at UCSD as a postdoctoral fellow to study pancreatic differentiation from stem cells, acquiring extensive expertise in developmental biology, stem cell engineering, epigenomics, and human genetics. In 2017, he joined the Research Center for Epigenomics as an Associate Director, responsible for managing multiple active collaborative projects with investigators on the UCSD campus. Dr. Wang is currently a co-PI for two active NIH grants. He will play a vital role in guiding his team to generate single cell RNA-seq and ATAC-seq data to determine different subpopulations of astrocytes and their ability to undergo engineered conversion to neurons in substantia nigra and striatum. Allen Wang, PhD, is an Associate Director of Single Cell Genomics at the Research Center for Epigenomics, University of California, San Diego (UCSD). He received his PhD in 2010 from University of California, Irvine where he studied cell chain formation in fungi. He joined Prof. Maike Sander’s lab at UCSD as a postdoctoral fellow to study pancreatic differentiation from stem cells, acquiring extensive expertise in developmental biology, stem cell engineering, epigenomics, and human genetics. In 2017, he joined the Research Center for Epigenomics as an Associate Director, responsible for managing multiple active collaborative projects with investigators on the UCSD campus. Dr. Wang is currently a co-PI for two active NIH grants. He will play a vital role in guiding his team to generate single cell RNA-seq and ATAC-seq data to determine different subpopulations of astrocytes and their ability to undergo engineered conversion to neurons in substantia nigra and striatum. Allen Wang, PhD, is an Associate Director of Single Cell Genomics at the Research Center for Epigenomics, University of California, San Diego (UCSD). He received his PhD in 2010 from University of California, Irvine where he studied cell chain formation in fungi. He joined Prof. Maike Sander’s lab at UCSD as a postdoctoral fellow to study pancreatic differentiation from stem cells, acquiring extensive expertise in developmental biology, stem cell engineering, epigenomics, and human genetics. In 2017, he joined the Research Center for Epigenomics as an Associate Director, responsible for managing multiple active collaborative projects with investigators on the UCSD campus. Dr. Wang is currently a co-PI for two active NIH grants. He will play a vital role in guiding his team to generate single cell RNA-seq and ATAC-seq data to determine different subpopulations of astrocytes and their ability to undergo engineered conversion to neurons in substantia nigra and striatum. Allen Wang, PhD, is an Associate Director of Single Cell Genomics at the Research Center for Epigenomics, University of California, San Diego (UCSD). He received his PhD in 2010 from University of California, Irvine where he studied cell chain formation in fungi. He joined Prof. Maike Sander’s lab at UCSD as a postdoctoral fellow to study pancreatic differentiation from stem cells, acquiring extensive expertise in developmental biology, stem cell engineering, epigenomics, and human genetics. In 2017, he joined the Research Center for Epigenomics as an Associate Director, responsible for Allen Wang, PhD, is an Associate Director of Single Cell Genomics at the Research Center for Epigenomics, University of California, San Diego (UCSD). He received his PhD in 2010 from University of California, Irvine where he studied cell chain formation in fungi. He joined Prof. Maike Sander’s lab at UCSD as a postdoctoral fellow to study pancreatic differentiation from stem cells, acquiring extensive expertise in developmental biology, stem cell engineering, epigenomics, and human genetics. In 2017, he joined the Research Center for Epigenomics as an Associate Director, responsible for Dr. Wang is currently a co-PI for two active NIH grants. He will play a vital role in guiding his team to generate single cell RNA-seq and ATAC-seq data to determine different subpopulations of astrocytes and their ability to undergo engineered conversion to neurons in substantia nigra and striatum. Dr. Wang is currently a co-PI for two active NIH grants. He will play a vital role in guiding his team to generate single cell RNA-seq and ATAC-seq data to determine different subpopulations of astrocytes and their ability to undergo engineered conversion to neurons in substantia nigra and striatum. Associated Grants Associated Grants Reconstituting the Lost Nigrostriatal Circuitry in"
  },
  {
    "candidate": "Wang, Allen H",
    "category": "bio",
    "score": null,
    "link": "https://www.michaeljfox.org/researcher/allen-wang-phd",
    "text": "Parkinson’s Disease 2021 Read More Reconstituting the Lost Nigrostriatal Circuitry in Parkinson’s Disease 2021 Related Content Researchers Douglas Galasko, MD Researchers Douglas Galasko, MD Douglas Galasko, MD Researchers Pedro Cabrales, PhD Researchers Pedro Cabrales, PhD Pedro Cabrales, PhD Researchers Elizabeth Villa, PhD Researchers Elizabeth Villa, PhD Elizabeth Villa, PhD Join our email list Get the latest news and resources directly to your inbox. Twitter Twitter Facebook Facebook LinkedIn LinkedIn Pinterest Pinterest YouTube YouTube Instagram Instagram Footer utility navigation Foundation Leadership MJFF Feed Press Releases MJFF in the News Foundation Updates Publications Annual Report Financial Report Careers Fox Shop FAQ Glossary of Terms Español Contact Us Footer legal navigation Privacy Policy Terms & Conditions State Nonprofit Disclosures Site Map We use cookies to ensure that you get the best experience. By continuing to use this website, you indicate that you have read our Terms of Service and Privacy Policy . Top Top Here. Until Parkinson's isn't. Join us as we work to find a cure for the 6 million people worldwide living with Parkinson's. ${selected} Jan Jan Feb Feb Mar Mar Apr Apr May May Jun Jun Jul Jul Aug Aug Sep Sep Oct Oct Nov Nov Dec Dec Month ${selected} 1 1 2 2 3 3 4 4 5 5 6 6 7 7 8 8 9 9 10 10 11 11 12 12 13 13 14 14 15 15 16 16 17 17 18 18 19 19 20 20 21 21 22 22 23 23 24 24 25 25 26 26 27 27 28 28 29 29 30 30 31 31 Day ${selected} 2025 2025 2024 2024 2023 2023 2022 2022 2021 2021 2020 2020 2019 2019 2018 2018 2017 2017 2016 2016 2015 2015 2014 2014 2013 2013 2012 2012 2011 2011 2010 2010 2009 2009 2008 2008 2007 2007 2006 2006 2005 2005 2004 2004 2003 2003 2002 2002 2001 2001 2000 2000 1999 1999 1998 1998 1997 1997 1996 1996 1995 1995 1994 1994 1993 1993 1992 1992 1991 1991 1990 1990 1989 1989 1988 1988 1987 1987 1986 1986 1985 1985 1984 1984 1983 1983 1982 1982 1981 1981 1980 1980 1979 1979 1978 1978 1977 1977 1976 1976 1975 1975 1974 1974 1973 1973 1972 1972 1971 1971 1970 1970 1969 1969 1968 1968 1967 1967 1966 1966 1965 1965 1964 1964 1963 1963 1962 1962 1961 1961 1960 1960 1959 1959 1958 1958 1957 1957 1956 1956 1955 1955 1954 1954 1953 1953 1952 1952 1951 1951 1950 1950 1949 1949 1948 1948 1947 1947 1946 1946 1945 1945 1944 1944 1943 1943 1942 1942 1941 1941 1940 1940 1939 1939 1938 1938 1937 1937 1936 1936 1935 1935 1934 1934 1933 1933 1932 1932 1931 1931 1930 1930 1929 1929 1928 1928 1927 1927 1926 1926 1925 1925 Year ${selected} I have PD I have PD Immediate family member has PD Immediate family member has PD Immediate family member had PD Immediate family member had PD Extended family member or friend has PD Extended family member or friend has PD Extended family member or friend had PD Extended family member or friend had PD I am a researcher, clinician or work with the PD community I am a researcher, clinician or work with the PD community Other Other ${selected} 1950 1950 1951 1951 1952 1952 1953 1953 1954 1954 1955 1955 1956 1956 1957 1957 1958 1958 1959 1959 1960 1960 1961 1961 1962 1962 1963 1963 1964 1964 1965 1965 1966 1966 1967 1967 1968 1968 1969 1969 1970 1970 1971 1971 1972 1972 1973 1973 1974 1974 1975 1975 1976 1976 1977 1977 1978 1978 1979 1979 1980 1980 1981 1981 1982 1982 1983 1983 1984 1984 1985 1985 1986 1986 1987 1987 1988 1988 1989 1989 1990 1990 1991 1991 1992 1992 1993 1993 1994 1994 1995 1995 1996 1996 1997 1997 1998 1998 1999 1999 2000 2000 2001 2001 2002 2002 2003 2003 2004 2004 2005 2005 2006 2006 2007 2007 2008 2008 2009 2009 2010 2010 2011 2011 2012 2012 2013 2013 2014 2014 2015 2015 2016 2016 2017 2017 2018 2018 2019 2019 2020 2020 2021 2021 2022 2022 2023 2023 2024 2024 2025 2025 Close"
  }
]