[
  {
    "candidate": "Williams, Nantasha",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/nantasha-williams/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 27 Dr. Nantasha Williams Jamaica, South Jamaica, Springfield Gardens (North)-Rochdale Village, St. Albans, Hollis, Queens Village, Cambria Heights, Laurelton, Jamaica Biography New York City Council Member Dr. Nantasha Williams is the representative for Council District 27 in Southeast Queens, NY and its communities of Cambria Heights, Hollis, Jamaica, St. Albans, Queens Village, Addisleigh Park, and Springfield Gardens. Dr. Williams is a community leader and social justice advocate committed to affecting real change in her community. Creating new economic opportunities, youth development, housing, and protecting our seniors are her top priorities. It is her mission to serve the residents of her hometown, Southeast Queens, New York and continue its rich legacy into the future. Raised by a single mother who worked as a social worker for the city, Dr. Williams learned at an early age the importance of hard work and the demands and rewards of fighting for our most vulnerable community members. Nationally recognized as a political strategist, she dedicates her life in service to marginalized communities throughout the country. Before her election, Dr. Williams was an activist, particularly focused on issues affecting women and girls, a cause close to her heart. To further engage women in politics, Dr. Williams founded the New York City Black Women’s Political Club, an avenue to build political power for Black women across New York City in 2019. Dr. William’s champion spirit for human rights, women’s rights, and racial equality extends beyond the borders of her home state. She helped lead operations and organizing efforts for one of the largest demonstrations in American history, the Women’s March on Washington, D.C Dr. Williams has also shown unwavering dedication to criminal justice reform, combating gun violence, and addressing economic and racial disparities. By volunteering as an advisor to “Until Freedom,” aiding in various justice campaigns nationwide, she has notably contributed to the proceedings in the Breonna Taylor case. Additionally, she served on the board of Life Camp Inc., a program dedicated to curbing gang-related crime and gun violence in the community. During her first year in the City Council, Dr. Williams helped pass historic legislation requiring solicitations for jobs in the nation’s most populous city to include salary ranges, in the name of giving applicants — particularly women and people of color — a better shot at fair pay. Building on her successful efforts during her first year in office, Dr. Williams was able to secure significant investments for her district, including funding for the reconstruction of a local park, resilience upgrades at the Cambria Heights Library, and the revitalization of a playground damaged by Hurricane Ida. As Chair of the Committee on Civil and Human Rights, Dr. Williams has also passed legislation requiring the City of New York to provide anti-racism and anti-racial discrimination training for employees, interns, independent contractors, and volunteers of city agencies. Each employee of the city is now required to complete such training at least once per year. Now, with the launch of the Jamaica Neighborhood Plan, in partnership with New York City Department of City Planning, Queens Borough President Donovan Richards and Speaker Adrienne Adams, Dr. Williams has been able to create a grassroots vision for the future of the Downtown Jamaica and Hollis area that includes more affordable housing and investments to improve the quality of life. The Jamaica Neighborhood Plan aims to create a vision driven by the local community for Jamaica’s future where the community has more people able to live, work and play in the area. Dr. Williams is a distinguished scholar in Social Welfare, possessing a PhD from the CUNY Graduate Center. Her research meticulously examines Social Movements, Public Policy, and Racial Justice. She obtained her undergraduate Bachelor of Arts degree in Political Science from Virginia Commonwealth University and holds a Master’s in Public Administration from Rockefeller College of Public Affairs and Policy. Biography New York City Council Member Dr. Nantasha Williams is the representative for Council District 27 in Southeast Queens, NY and its communities of Cambria Heights, Hollis, Jamaica, St. Albans, Queens Village, Addisleigh Park, and Springfield Gardens. New York City Council Member Dr. Nantasha Williams is the representative for Council District 27 in Southeast Queens, NY and its communities of Cambria Heights, Hollis, Jamaica, St. Albans, Queens Village, Addisleigh Park, and Springfield Gardens. Dr. Williams is a community leader and social justice advocate committed to affecting real change in her"
  },
  {
    "candidate": "Williams, Nantasha",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/nantasha-williams/",
    "text": "community. Creating new economic opportunities, youth development, housing, and protecting our seniors are her top priorities. It is her mission to serve the residents of her hometown, Southeast Queens, New York and continue its rich legacy into the future. Dr. Williams is a community leader and social justice advocate committed to affecting real change in her community. Creating new economic opportunities, youth development, housing, and protecting our seniors are her top priorities. It is her mission to serve the residents of her hometown, Southeast Queens, New York and continue its rich legacy into the future. Raised by a single mother who worked as a social worker for the city, Dr. Williams learned at an early age the importance of hard work and the demands and rewards of fighting for our most vulnerable community members. Nationally recognized as a political strategist, she dedicates her life in service to marginalized communities throughout the country. Before her election, Dr. Williams was an activist, particularly focused on issues affecting women and girls, a cause close to her heart. To further engage women in politics, Dr. Williams founded the New York City Black Women’s Political Club, an avenue to build political power for Black women across New York City in 2019. Raised by a single mother who worked as a social worker for the city, Dr. Williams learned at an early age the importance of hard work and the demands and rewards of fighting for our most vulnerable community members. Nationally recognized as a political strategist, she dedicates her life in service to marginalized communities throughout the country. Before her election, Dr. Williams was an activist, particularly focused on issues affecting women and girls, a cause close to her heart. To further engage women in politics, Dr. Williams founded the New York City Black Women’s Political Club, an avenue to build political power for Black women across New York City in 2019. Dr. William’s champion spirit for human rights, women’s rights, and racial equality extends beyond the borders of her home state. She helped lead operations and organizing efforts for one of the largest demonstrations in American history, the Women’s March on Washington, D.C Dr. William’s champion spirit for human rights, women’s rights, and racial equality extends beyond the borders of her home state. She helped lead operations and organizing efforts for one of the largest demonstrations in American history, the Women’s March on Washington, D.C Dr. Williams has also shown unwavering dedication to criminal justice reform, combating gun violence, and addressing economic and racial disparities. By volunteering as an advisor to “Until Freedom,” aiding in various justice campaigns nationwide, she has notably contributed to the proceedings in the Breonna Taylor case. Additionally, she served on the board of Life Camp Inc., a program dedicated to curbing gang-related crime and gun violence in the community. Dr. Williams has also shown unwavering dedication to criminal justice reform, combating gun violence, and addressing economic and racial disparities. By volunteering as an advisor to “Until Freedom,” aiding in various justice campaigns nationwide, she has notably contributed to the proceedings in the Breonna Taylor case. Additionally, she served on the board of Life Camp Inc., a program dedicated to curbing gang-related crime and gun violence in the community. During her first year in the City Council, Dr. Williams helped pass historic legislation requiring solicitations for jobs in the nation’s most populous city to include salary ranges, in the name of giving applicants — particularly women and people of color — a better shot at fair pay. During her first year in the City Council, Dr. Williams helped pass historic legislation requiring solicitations for jobs in the nation’s most populous city to include salary ranges, in the name of giving applicants — particularly women and people of color — a better shot at fair pay. Building on her successful efforts during her first year in office, Dr. Williams was able to secure significant investments for her district, including funding for the reconstruction of a local park, resilience upgrades at the Cambria Heights Library, and the revitalization of a playground damaged by Hurricane Ida. Building on her successful efforts during her first year in office, Dr. Williams was able to secure significant investments for her district, including funding for the reconstruction of a local park, resilience upgrades at the Cambria Heights Library, and the revitalization of a playground damaged by Hurricane Ida. As Chair of the Committee on Civil and Human Rights, Dr. Williams has also passed legislation requiring the City"
  },
  {
    "candidate": "Williams, Nantasha",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/nantasha-williams/",
    "text": "of New York to provide anti-racism and anti-racial discrimination training for employees, interns, independent contractors, and volunteers of city agencies. Each employee of the city is now required to complete such training at least once per year. As Chair of the Committee on Civil and Human Rights, Dr. Williams has also passed legislation requiring the City of New York to provide anti-racism and anti-racial discrimination training for employees, interns, independent contractors, and volunteers of city agencies. Each employee of the city is now required to complete such training at least once per year. Now, with the launch of the Jamaica Neighborhood Plan, in partnership with New York City Department of City Planning, Queens Borough President Donovan Richards and Speaker Adrienne Adams, Dr. Williams has been able to create a grassroots vision for the future of the Downtown Jamaica and Hollis area that includes more affordable housing and investments to improve the quality of life. The Jamaica Neighborhood Plan aims to create a vision driven by the local community for Jamaica’s future where the community has more people able to live, work and play in the area. Now, with the launch of the Jamaica Neighborhood Plan, in partnership with New York City Department of City Planning, Queens Borough President Donovan Richards and Speaker Adrienne Adams, Dr. Williams has been able to create a grassroots vision for the future of the Downtown Jamaica and Hollis area that includes more affordable housing and investments to improve the quality of life. The Jamaica Neighborhood Plan aims to create a vision driven by the local community for Jamaica’s future where the community has more people able to live, work and play in the area. Dr. Williams is a distinguished scholar in Social Welfare, possessing a PhD from the CUNY Graduate Center. Her research meticulously examines Social Movements, Public Policy, and Racial Justice. She obtained her undergraduate Bachelor of Arts degree in Political Science from Virginia Commonwealth University and holds a Master’s in Public Administration from Rockefeller College of Public Affairs and Policy. Dr. Williams is a distinguished scholar in Social Welfare, possessing a PhD from the CUNY Graduate Center. Her research meticulously examines Social Movements, Public Policy, and Racial Justice. She obtained her undergraduate Bachelor of Arts degree in Political Science from Virginia Commonwealth University and holds a Master’s in Public Administration from Rockefeller College of Public Affairs and Policy. Biography Staff Directory Contact Press Releases and Statements Events Jamaica Neighborhood Plan Visit Jamaica Plan Official Website Visit Jamaica Plan Official Website Participatory Budgeting Polling Sites Polling Sites Street Co-naming Opinions/ Op-Ed We’re Hiring District Office Due to the recent COVID surge, our district office is currently open by appointment only. Contact my office directly to schedule your appointment today. 172-12 Linden Boulevard St. Albans, NY 11434 Phone: 718-776-3700 Fax: 718-487-3580 Legislative Office 250 Broadway Suite 1734 New York, NY 10007 Phone: 212-788-7084 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]