[
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "Menu News E-Hall ä¸­æ Academic Calendar Notice Library News Admissions Global Home News Events About  Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty  Overview High-Level Talents Talent Program Faculty Overview High-Level Talents Talent Program Faculty Academics  Overview Academics Undergraduate Education Graduate Education Overseas Education Schools and Colleges International students Overview Academics Undergraduate Education Graduate Education Overseas Education Schools and Colleges International students Research  Overview Research Centers & Facilities Scientific Achievements Research News Research Administration Overview Research Centers & Facilities Scientific Achievements Research News Research Administration Go Global  Overview Global Engagement SUSTech's International Community SUSTech-KCL School of Medicine UNESCO-ICHEI Shenzhen and SUSTech Overview Global Engagement SUSTech's International Community SUSTech-KCL School of Medicine UNESCO-ICHEI Shenzhen and SUSTech Campus Life  Overview Residential College Housing & Dining Clubs & Organizations Overview Residential College Housing & Dining Clubs & Organizations Home News Events About Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty Overview High-level Talents Talent Program Directory Overview High-level Talents Talent Program Directory Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Campus Life Overview Residential College Housing & Dining Clubs & Organizations Overview Residential College Housing & Dining Clubs & Organizations Email Library Admissions Give University Intranets Old Site Email Library Admissions Give University Intranets Home News Events About About Overview Mission & Vision Leadership Strategic Plans University Governance Milestones Facts & Figures Explore SUSTech Contact us About Overview Mission & Vision Leadership Strategic Plans University Governance Milestones Facts & Figures Explore SUSTech Contact us Faculty Faculty Overview High-Level Talents Talent Program Directory Faculty Overview High-Level Talents Talent Program Directory Academics Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Go Global Overview Global Engagement SUSTechâs International Influence Shenzhen and SUSTech Go Global Overview Global Engagement SUSTechâs International Influence Shenzhen and SUSTech Campus Life Campus Life Overview Residential College Housing & Dining Clubs & Organizations Campus Life Overview Residential College Housing & Dining Clubs & Organizations Faculty Lingling YE Associate Professor 0755-88010536 yell@sustech.edu.cn Personal Homepage Lingling Ye is an Associate Professor in the Department of Earth and Space Sciences at Southern University of Science and Technology (SUSTech). She graduated from the University of Science and Technology of China in 2008 and received a master's degree from the Institute of Geology and Geophysics, Chinese Academy of Sciences in 2011. She received her Ph.D. degree from the University of California, Santa Cruz in 2015, and then worked as the Director's postdoctoral fellow in the Seismology Laboratory at California Institute of Technology. She returned to China at the end of 2017 as a Full Professor at Sun Yat-sen University. She joined SUSTech in March 2021. Her research focuses on the rupture process and physics of global earthquakes, the deep structure of the earth, and understanding the mechanism for natural disasters such as volcanoes, landslides, and tsunamis. She has published more than 50 peer-reviewed papers since 2011 in journals like Science, Science Advances, EPSL, JGR-Solid Earth, GRL, and so on. She was the recipient of the Keiiti Aki Young Seismologist Award from American Geophysics Union in 2018. She has served as Associate Editor of JGR-Solid Earth, The Seismic Record, and Solid Earth Sciences, and committee member for the AGU James B. Macelwane Medal since 2021. EMPOLYMENT 2021- Associate Professor, Southern University of Science and Technology 2018 - 2020 Professor, Sun Yat-sen University 2015 - 2017 Director's Postdoctoral Fellow, Seismological Laboratory, Caltech EDUCATION 2011-2015 PhD in Geophysics, University of California, Santa Cruz 2008-2011 Master in Geophysics, Inst. of Geology and Geophysics, Chinese Academy of Sciences 2004-2008 Bachelor in Geophysics, University of Science and Technology of China FIELD EXPERIENCE 2018 Deployment of seismometers at Mount Usu, Japan (ERI, University of Tokyo) 2014 Summer Internship"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "at Baker Hughes Inc., Numerical Modeling of Hydraulic Fracture Growth in Layered and Discontinuous Media, Palo Alto, CA. 2014 Cascadia Initiative Expedition Team (Leg 5), Deploy & Retrieve ~ 60 OBS. PROFESSIONAL SERVICE Associate Editor for JGR-Solid Earth (2021-2023) Founder Associate Editor for The Seismic Recording (2021-2023). AGU James B. Macelwane Medal Committee member (2020, 2021) AGU Seismology Canvassing Committee member (2019) Chair of Geophysics Program at Sun Yat-sen University (2019-2020) Reviewer for: GRL, EPSL, PEPI, SRL, JGR, Pageoph, Nature, Science, Nature Geoscience, Sci. Adv., Sci. Rep., EPS, ESPS, EPP, Tectonophysics, NSF, NSFC, etc. AGU Session Convener: Energy Partitioning during earthquake, landslides and other shear failure process, 2016. HONORS AND AWARDS 2018 Recipient of Keiiti Aki Young Scientist Award (AGU) 2015 Director's Postdoctoral Fellowship at seismological laboratory, Caltech 2015 Miller Postdoctoral Fellowship, UC Berkeley (declined) 2014 Chancellor's Dissertation-Year Fellowship, UCSC 2014 Chinese Government Award for Outstanding Self-financed Student Abroad 2013 Aaron C. Waters Award for the most outstanding proposal for the PhD research, UCSC 2012 EPS Spring Fellowship Award (research performance), UCSC 2011 Regents' Fellowship, UCSC 2004-2008 Outstanding Student Scholarships and Graduate Scholar, USTC Publications Xia T., L. Ye* ,Y. Bai, T. Lay, H. Kanamori, S. Xu, & L. Rivera (2024), 2022 Southwest Sumatra Earthquake: A Tsunami Earthquake with Small Dip Angle near Trench, submitted. Xia T., L. Ye* ,Y. Bai, T. Lay, H. Kanamori, S. Xu, & L. Rivera (2024), 2022 Southwest Sumatra Earthquake: A Tsunami Earthquake with Small Dip Angle near Trench, submitted. Gong, W.#, L. Ye*, S. Xu, X. Chen Y. Tan (2024), Rupture Behaviors of the Southern Xianshuihe Fault and Seismicity around Mt. Gongga: Insights from the 2022 Luding (China) Earthquake Sequence, in revision. Gong, W.#, L. Ye*, S. Xu, X. Chen Y. Tan (2024), Rupture Behaviors of the Southern Xianshuihe Fault and Seismicity around Mt. Gongga: Insights from the 2022 Luding (China) Earthquake Sequence, in revision. Zeng, L.#, L. Ye*, H. Yao, W. Liu, D. Si, T. Lay, & T. Yang (2024). Intermediate-depth Seismicity in the Peruvian Flat Slab: Narrow Seismogenic Band Related to Flexural Strain in Non-Dehydrating, Possibly Relatively Dry Slab, in revision. Zeng, L.#, L. Ye*, H. Yao, W. Liu, D. Si, T. Lay, & T. Yang (2024). Intermediate-depth Seismicity in the Peruvian Flat Slab: Narrow Seismogenic Band Related to Flexural Strain in Non-Dehydrating, Possibly Relatively Dry Slab, in revision. Ye, L., X. Chen, T. Lay, Y. Sang, Y. Hu, H. Kanamori, F. Romano, S. Lorito (2024), Megathrust Rupture and Faulting Interaction during the 2021 Kermadec Earthquake Sequence, in revision. Ye, L., X. Chen, T. Lay, Y. Sang, Y. Hu, H. Kanamori, F. Romano, S. Lorito (2024), Megathrust Rupture and Faulting Interaction during the 2021 Kermadec Earthquake Sequence, in revision. Garza-Giron, R., T. Lay, L. Ye (2024). The Repeating Major Earthquakes in the Mexican Subduction Zone Along Oaxaca: Implications for Future Events. Seismological Research Letters, in press. Garza-Giron, R., T. Lay, L. Ye (2024). The Repeating Major Earthquakes in the Mexican Subduction Zone Along Oaxaca: Implications for Future Events. Seismological Research Letters, in press. Yao, S., T. Xu, Y. Sang, L. Ye, T. Yang, C. Wu, & M. Zhang (2024). The seismicity in the middle section of the Altyn Tagh Fault System Revealed by a Dense Nodal Seismic Array. Earthquake Research Advances, 100308. Yao, S., T. Xu, Y. Sang, L. Ye, T. Yang, C. Wu, & M. Zhang (2024). The seismicity in the middle section of the Altyn Tagh Fault System Revealed by a Dense Nodal Seismic Array. Earthquake Research Advances, 100308. Wei, G., K. Chen, M. Lyu, W. Gong, L. Dal Zilio, L. Ye, and H. Tu (2023). Complex strike-slip faulting during the 2021 Mw 7. 4 Maduo earthquake. Communications Earth & Environment, 4, no. 1: 319. Wei, G., K. Chen, M. Lyu, W. Gong, L. Dal Zilio, L. Ye, and H. Tu (2023). Complex strike-slip faulting during the 2021 Mw 7. 4 Maduo earthquake. Communications Earth & Environment, 4, no. 1: 319. Jian, H., T. Yang, Z. Chen, L. Ye, J. Hu, and P. Guo (2023). Slab pull drives IBM Trench advance despite the weakened Philippine Sea Plate. Geophysical Research Letters, 50, no. 21: e2023GL106554. Jian, H., T. Yang, Z. Chen, L. Ye, J. Hu, and P. Guo (2023). Slab pull drives IBM Trench advance despite the weakened Philippine Sea Plate. Geophysical Research Letters, 50, no. 21: e2023GL106554. Hu, Y.#, L. Ye*, X. Chen, T. Lay, H. Kanamori, F. Romano, & S. Lorito (2022), Deep Megathrust Rupture and Faulting Interaction during the 2021 Mw 8.1 Kermadec Earthquake Sequence, Journal of Geophysical"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "Research: Solid Earth, under review. (# supervised student) Hu, Y.#, L. Ye*, X. Chen, T. Lay, H. Kanamori, F. Romano, & S. Lorito (2022), Deep Megathrust Rupture and Faulting Interaction during the 2021 Mw 8.1 Kermadec Earthquake Sequence, Journal of Geophysical Research: Solid Earth, under review. (# supervised student) Gong, W.#, L. Ye*, Y. Qiu, T. Lay, & H. Kanamori (2022), Rupture Directivity of the 2021 Mw 6.0 Yangbi, Yunnan Earthquake, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2022JB024321. (# supervised student) Gong, W.#, L. Ye*, Y. Qiu, T. Lay, & H. Kanamori (2022), Rupture Directivity of the 2021 Mw 6.0 Yangbi, Yunnan Earthquake, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2022JB024321. (# supervised student) Bai, Y., C. Liu, T. Lay, K. F. Cheung, & L. Ye (2022), Optimizing a model of coseismic rupture for the 22 July 2020 Mw 7.8 Simeonof earthquake by exploiting acute sensitivity of tsunami excitation across the shelf break, Journal of Geophysical Research: Solid Earth, e2022JB024484, doi: 10.1029/2022JB024484. Bai, Y., C. Liu, T. Lay, K. F. Cheung, & L. Ye (2022), Optimizing a model of coseismic rupture for the 22 July 2020 Mw 7.8 Simeonof earthquake by exploiting acute sensitivity of tsunami excitation across the shelf break, Journal of Geophysical Research: Solid Earth, e2022JB024484, doi: 10.1029/2022JB024484. Ye, L., Y. Bai, T. Lay, F. Cheung, & H. Kanamori (2022), Rupture Model for the 29 July 2021 Mw 8.2 Chignik Earthquake Constrained by Seismic, Geodetic, and Tsunami Observations, Journal of Geophysical Research: Solid Earth, e2021JB023676, doi: 10.1029/2021JB023676 Ye, L., Y. Bai, T. Lay, F. Cheung, & H. Kanamori (2022), Rupture Model for the 29 July 2021 Mw 8.2 Chignik Earthquake Constrained by Seismic, Geodetic, and Tsunami Observations, Journal of Geophysical Research: Solid Earth, e2021JB023676, doi: 10.1029/2021JB023676 Luo, B., H. Zhu, J. Yang, T. Lay, L. Ye, Z. Lu, & D. Lumley (2022), Detecting and locating aftershocks for the 2020 Mw 6.5 Stanley, Idaho earthquake using convolutional neural networks, Seismological Research Letters, 1â12, doi: 10.1785/0220210341. Luo, B., H. Zhu, J. Yang, T. Lay, L. Ye, Z. Lu, & D. Lumley (2022), Detecting and locating aftershocks for the 2020 Mw 6.5 Stanley, Idaho earthquake using convolutional neural networks, Seismological Research Letters, 1â12, doi: 10.1785/0220210341. Takeo, A., K. Nishida, H. Aoyama, M. Ishise, T. Kai, T. Maeda, Y. Mizutani, S. Nagahara, X. Wang, L. Ye, & Y. Aoki (2022), S-wave modelling of the Showa-Shinzan lava dome in Usu Volcano, Northern Japan, from seismic observations, Geophysical Journal International,doi: 10.1093/gji/ggac111. Takeo, A., K. Nishida, H. Aoyama, M. Ishise, T. Kai, T. Maeda, Y. Mizutani, S. Nagahara, X. Wang, L. Ye, & Y. Aoki (2022), S-wave modelling of the Showa-Shinzan lava dome in Usu Volcano, Northern Japan, from seismic observations, Geophysical Journal International,doi: 10.1093/gji/ggac111. Ye, L., W. Gong, T. Lay, H. Kanamori, & X. Chen (2021), Shallow Megathrust Rupture during the 10 February 2021 Mw 7.7 Southeast Loyalty Islands Earthquake Sequence, The Seismic Recording, doi:10.1785/ 0320210035. Ye, L., W. Gong, T. Lay, H. Kanamori, & X. Chen (2021), Shallow Megathrust Rupture during the 10 February 2021 Mw 7.7 Southeast Loyalty Islands Earthquake Sequence, The Seismic Recording, doi:10.1785/ 0320210035. Yang, J., H. Zhu, T. Lay, Y. Niu, L. Ye, Z. Lu, B. Luo, H. Kanamori, J. Huang, & Z. Li (2021), Multifault opposing-dip strike-slip and normal-fault rupture during the 2020 Mw 6.5 Stanley, Idaho earthquake, Geophysical Research Letters, doi: 10.1029/2021GL092510. Yang, J., H. Zhu, T. Lay, Y. Niu, L. Ye, Z. Lu, B. Luo, H. Kanamori, J. Huang, & Z. Li (2021), Multifault opposing-dip strike-slip and normal-fault rupture during the 2020 Mw 6.5 Stanley, Idaho earthquake, Geophysical Research Letters, doi: 10.1029/2021GL092510. Fan, F.#, L. Ye*, H. Kanamori, & T. Lay (2021), Responding to media inquiries about earthquake triggering interactions, Seismological Research Letters, doi: 10.1785/0220200452. (# supervised student) Fan, F.#, L. Ye*, H. Kanamori, & T. Lay (2021), Responding to media inquiries about earthquake triggering interactions, Seismological Research Letters, doi: 10.1785/0220200452. (# supervised student) Ye, L., T. Lay, H. Kanamori., Y. Yamazaki, & K. F. Cheung (2021), The 22 July 2020 Mw 7.8 Shumagin seismic gap earthquake: Partial rupture of a weakly coupled megathrust, Earth and Planetary Science Letters, 562, 116879, doi: 10.1016/j.epsl.2021.116879. Ye, L., T. Lay, H. Kanamori., Y. Yamazaki, & K. F. Cheung (2021), The 22 July 2020 Mw 7.8 Shumagin seismic gap earthquake: Partial rupture of a weakly coupled megathrust, Earth and Planetary Science Letters, 562, 116879, doi: 10.1016/j.epsl.2021.116879. Larson, K. M, T. Lay, Y. Yamazaki, K. F. Cheung, L. Ye, S. D. P. Williams, & J. L. Davis (2021), Dynamic sea"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "level variation from GNSS: 2020 Shumagin earthquake tsunami resonance and hurricane Laura, Geophysical Research Letters, doi: 10.1029/2020GL091378. Larson, K. M, T. Lay, Y. Yamazaki, K. F. Cheung, L. Ye, S. D. P. Williams, & J. L. Davis (2021), Dynamic sea level variation from GNSS: 2020 Shumagin earthquake tsunami resonance and hurricane Laura, Geophysical Research Letters, doi: 10.1029/2020GL091378. Ye, L., T. Lay, & H. Kanamori (2021), The 25 March 2020 Mw 7.5 Paramushir, Northern Kuril Islands Earthquake and major (Mw â¥ 7.0) near-trench intraplate compressional faulting, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2020.116728. Ye, L., T. Lay, & H. Kanamori (2021), The 25 March 2020 Mw 7.5 Paramushir, Northern Kuril Islands Earthquake and major (Mw â¥ 7.0) near-trench intraplate compressional faulting, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2020.116728. Lay, T., L. Ye, Z. Wu, & H. Kanamori (2020), Macrofracturing of oceanic lithosphere in complex large earthquake sequences, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2020JB020137. Lay, T., L. Ye, Z. Wu, & H. Kanamori (2020), Macrofracturing of oceanic lithosphere in complex large earthquake sequences, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2020JB020137. Ye, L., T. Lay, & H. Kanamori (2020), Anomalously low aftershock productivity of the 2019 Mw 8.0 energetic intermediate-depth faulting beneath Peru, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2020.116528. Ye, L., T. Lay, & H. Kanamori (2020), Anomalously low aftershock productivity of the 2019 Mw 8.0 energetic intermediate-depth faulting beneath Peru, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2020.116528. Ye, L., & T. Lay (2020), A Ghost Tsunami without warning. The Science Breaker (invited), doi: 10.25250/thescbr.brk365. Ye, L., & T. Lay (2020), A Ghost Tsunami without warning. The Science Breaker (invited), doi: 10.25250/thescbr.brk365. Ye, L., H. Kanamori, L. Rivera, T. Lay, Y. Zhou, D. Sianipar, & K. Satake (2020). The 22 December 2018 tsunami from flank collapse of Anak Krakatau volcano during eruption. Science Advances, 6, doi: 1126/sciadv.aaz1377. Ye, L., H. Kanamori, L. Rivera, T. Lay, Y. Zhou, D. Sianipar, & K. Satake (2020). The 22 December 2018 tsunami from flank collapse of Anak Krakatau volcano during eruption. Science Advances, 6, doi: 1126/sciadv.aaz1377. Wu, Z., T. Lay, & L. Ye (2019), Shallow megathrust slip during large earthquakes that have high P coda levels, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2019JB018709. Wu, Z., T. Lay, & L. Ye (2019), Shallow megathrust slip during large earthquakes that have high P coda levels, Journal of Geophysical Research: Solid Earth, doi: 10.1029/2019JB018709. Kanamori, H., L. Rivera, L. Ye, T. Lay, S. Murotani, & K. Tsumura (2019), New constraints on the 1922 Atacama, Chile, earthquake from historical seismograms, Geophysical Journal International, 219, 645-661, doi: 10.1093/gji/ggz302. Kanamori, H., L. Rivera, L. Ye, T. Lay, S. Murotani, & K. Tsumura (2019), New constraints on the 1922 Atacama, Chile, earthquake from historical seismograms, Geophysical Journal International, 219, 645-661, doi: 10.1093/gji/ggz302. Ye, L., T. Lay, H. Kanamori, & K. Koper (2019), Reply to: Comment by Rodrigo Cienfuegos on Rapidly Estimated Seismic Source Parameters for the 16 September 2015 Illapel, Chile, Mw 8.3 Earthquake, Pure and Applied Geophysics, 1-1, doi: 10.1007/s00024-019-02214-3. Ye, L., T. Lay, H. Kanamori, & K. Koper (2019), Reply to: Comment by Rodrigo Cienfuegos on Rapidly Estimated Seismic Source Parameters for the 16 September 2015 Illapel, Chile, Mw 8.3 Earthquake, Pure and Applied Geophysics, 1-1, doi: 10.1007/s00024-019-02214-3. Lay, T., L. Ye, H. Kanamori, & K. Satake (2018), Constraining the Dip of Shallow, ShallowlyâDipping Thrust Events Using LongâPeriod Love Wave Radiation Patterns: Applications to the 25 October 2010 Mentawai, Indonesia and 4 May 2018 Hawaii Island Earthquakes, Geophysical Research Letters, doi:10.1029/2018GL080042. Lay, T., L. Ye, H. Kanamori, & K. Satake (2018), Constraining the Dip of Shallow, ShallowlyâDipping Thrust Events Using LongâPeriod Love Wave Radiation Patterns: Applications to the 25 October 2010 Mentawai, Indonesia and 4 May 2018 Hawaii Island Earthquakes, Geophysical Research Letters, doi:10.1029/2018GL080042. Bai, Y., L. Ye, Y. Yamazaki, T. Lay, & K. F. Cheung (2018), The 4 May 2018 Mw 6.9 Hawaii Island Earthquake and Implications for Tsunami Hazards, Geophysical Research Letters, doi: 10.1029/2018GL079742. Bai, Y., L. Ye, Y. Yamazaki, T. Lay, & K. F. Cheung (2018), The 4 May 2018 Mw 6.9 Hawaii Island Earthquake and Implications for Tsunami Hazards, Geophysical Research Letters, doi: 10.1029/2018GL079742. Lay, T., L. Ye, Y. Bai, K. F. Cheung, & H. Kanamori (2018), The 2018 Mw 7.9 Gulf of Alaska Earthquake: Multiple Fault Rupture in the Pacific Plate, Geophysical Research Letters, doi:10.1029/2018GL079813. Lay, T., L. Ye, Y. Bai, K. F. Cheung, & H. Kanamori (2018), The 2018 Mw 7.9 Gulf of Alaska Earthquake: Multiple Fault Rupture in the Pacific"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "Plate, Geophysical Research Letters, doi:10.1029/2018GL079813. Ye, L., H. Kanamori, & T. Lay (2018), Global Variations of Large Megathrust Earthquake Rupture Characteristics, Science Advances, Vol. 4(3), doi: 10.1126/sciadv.aao4915. Ye, L., H. Kanamori, & T. Lay (2018), Global Variations of Large Megathrust Earthquake Rupture Characteristics, Science Advances, Vol. 4(3), doi: 10.1126/sciadv.aao4915. Lay, T., L. Ye, Y. Bai, K. F. Cheung, H. Kanamori, J. Freymueller, G. M. Steblov, & M. G. Kogan (2017), Rupture Along 400 km of the Bering Fracture Zone in the Komandorsky Islands Earthquake (Mw 7.8) of 17 July 2017, Geophysical Research Letters, 44, doi:10.1002/2017GL076148. Lay, T., L. Ye, Y. Bai, K. F. Cheung, H. Kanamori, J. Freymueller, G. M. Steblov, & M. G. Kogan (2017), Rupture Along 400 km of the Bering Fracture Zone in the Komandorsky Islands Earthquake (Mw 7.8) of 17 July 2017, Geophysical Research Letters, 44, doi:10.1002/2017GL076148. Bai, Y., T. Lay, K. F. Cheung, & L. Ye (2017), Two regions of seafloor deformation generated the tsunami for the 13 November 2016, Kaikoura, New Zealand earthquake, Geophysical Research Letters, doi: 10.1002/2017GL073717. Bai, Y., T. Lay, K. F. Cheung, & L. Ye (2017), Two regions of seafloor deformation generated the tsunami for the 13 November 2016, Kaikoura, New Zealand earthquake, Geophysical Research Letters, doi: 10.1002/2017GL073717. Ye, L., T. Lay, Y. Bai, K. F. Cheung, & H. Kanamori (2017), The 2017 Mw 8.2 Chiapas, Mexico Earthquake: Energetic Slab Detachment, Geophysical Research Letters, 44, doi: 10.1002/2017GL076085. Ye, L., T. Lay, Y. Bai, K. F. Cheung, & H. Kanamori (2017), The 2017 Mw 8.2 Chiapas, Mexico Earthquake: Energetic Slab Detachment, Geophysical Research Letters, 44, doi: 10.1002/2017GL076085. Hollingsworth, J., L. Ye, & J. P. Avouac (2017), Dynamically triggered slip on a splay fault in the Mw 7.8, 2016 Kaikoura (New Zealand) earthquake, Geophysical Research Letters, doi: 10.1002/2016GL072228. Hollingsworth, J., L. Ye, & J. P. Avouac (2017), Dynamically triggered slip on a splay fault in the Mw 7.8, 2016 Kaikoura (New Zealand) earthquake, Geophysical Research Letters, doi: 10.1002/2016GL072228. Lay, T., L. Ye, C. Ammon, & H. Kanamori (2017), Intraslab rupture triggering megathrust rupture co-seismically in the December 17, 2016 Solomon Islands Mw 7.9 earthquake, Geophysical Research Letters, doi: 10.1002/2017GL072539. Lay, T., L. Ye, C. Ammon, & H. Kanamori (2017), Intraslab rupture triggering megathrust rupture co-seismically in the December 17, 2016 Solomon Islands Mw 7.9 earthquake, Geophysical Research Letters, doi: 10.1002/2017GL072539. Kanamori H., L. Ye, B. S. Huang, H. H. Huang, W. T. Liang, Y. Y. Lin, K. F. Ma, Y. M. Wu, & T. Y. Yeh (2017), A strong-motion hot spot of the 2016 Meinong, Taiwan, earthquake (Mw = 6.4), special issue of TAO on the 2016 Meinong earthquake, doi: 10.3319/TAO.2016.10.07.01. Kanamori H., L. Ye, B. S. Huang, H. H. Huang, W. T. Liang, Y. Y. Lin, K. F. Ma, Y. M. Wu, & T. Y. Yeh (2017), A strong-motion hot spot of the 2016 Meinong, Taiwan, earthquake (Mw = 6.4), special issue of TAO on the 2016 Meinong earthquake, doi: 10.3319/TAO.2016.10.07.01. Ye, L., T. Lay, H. Kanamori, J. Freymueller, & L. Rivera (2016), Joint inversion of high-rate GPS and teleseismic observations for rupture process of the 23 June 2014 (Mw 7.9) Rat Islands archipelago, Alaska, intermediate-depth earthquake, Natural Hazards and Plate Boundaries (invited), AGU Monograph. Ye, L., T. Lay, H. Kanamori, J. Freymueller, & L. Rivera (2016), Joint inversion of high-rate GPS and teleseismic observations for rupture process of the 23 June 2014 (Mw 7.9) Rat Islands archipelago, Alaska, intermediate-depth earthquake, Natural Hazards and Plate Boundaries (invited), AGU Monograph. Ye, L., H. Kanamori, J. P. Avouac, L. Li, K. F. Cheung, & T. Lay (2016), The 16 April 2016, Mw 7.8 (MS7.5) Ecuador earthquake: a quasi-repeat of the 1942 Ms 7.5 earthquake and partial re-rupture of the 1906 Ms 8.6 Colombia-Ecuador earthquake, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2016.09.006. Ye, L., H. Kanamori, J. P. Avouac, L. Li, K. F. Cheung, & T. Lay (2016), The 16 April 2016, Mw 7.8 (MS7.5) Ecuador earthquake: a quasi-repeat of the 1942 Ms 7.5 earthquake and partial re-rupture of the 1906 Ms 8.6 Colombia-Ecuador earthquake, Earth and Planetary Science Letters, doi: 10.1016/j.epsl.2016.09.006. Lay T., L. Ye, C. Ammon, A. Dunham, & K. Koper (2016), The 2 March 2016 Wharton Basin Mw 7.8 earthquake: High stress drop north-south strike-slip rupture in the diffuse oceanic deformation zone between the Indian and Australian Plates, Geophysical Research Letters, doi: 10.1002/2016GL069931. Lay T., L. Ye, C. Ammon, A. Dunham, & K. Koper (2016), The 2 March 2016 Wharton Basin Mw 7.8 earthquake: High stress drop north-south strike-slip rupture in the"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "diffuse oceanic deformation zone between the Indian and Australian Plates, Geophysical Research Letters, doi: 10.1002/2016GL069931. Ye, L., T. Lay, H. Kanamori, Z. Zhan, & Z. Duputel (2016), Diverse Rupture Processes in the 2015 Peru Deep Earthquake Doublet, Science Advances, 2(6), doi: 10.1126/sciadv.1600581. Ye, L., T. Lay, H. Kanamori, Z. Zhan, & Z. Duputel (2016), Diverse Rupture Processes in the 2015 Peru Deep Earthquake Doublet, Science Advances, 2(6), doi: 10.1126/sciadv.1600581. Li, L., T. Lay, K. F. Cheung, & L. Ye (2016), Joint modeling of teleseismic and tsunami wave observations to constrain the 16 September 2015 Illapel, Chile Mw 8.3 earthquake rupture process, Geophysical Research Letters, 43, doi: 10.1002/2016GL068674. Li, L., T. Lay, K. F. Cheung, & L. Ye (2016), Joint modeling of teleseismic and tsunami wave observations to constrain the 16 September 2015 Illapel, Chile Mw 8.3 earthquake rupture process, Geophysical Research Letters, 43, doi: 10.1002/2016GL068674. Ye, L., T. Lay, H. Kanamori, & K. Koper (2016), Rapidly estimated seismic source parameters for the 16 September 2015 Illapel, Chile Mw 8.3 earthquake, Pure and Applied Geophysics, doi:10. 1007/s00024-015-1202-y. Ye, L., T. Lay, H. Kanamori, & K. Koper (2016), Rapidly estimated seismic source parameters for the 16 September 2015 Illapel, Chile Mw 8.3 earthquake, Pure and Applied Geophysics, doi:10. 1007/s00024-015-1202-y. Lay, T., L. Ye, K. D. Koper, & H. Kanamori (2016), Assessment of teleseismically-determined source parameters for the April 25, 2015 Mw 7.9 Gorkha, Nepal Earthquake and the May 12, 2015, MW 7.2 aftershock, Tectonophysics, doi: 10.1016/j.tecto.2016.05.023. Lay, T., L. Ye, K. D. Koper, & H. Kanamori (2016), Assessment of teleseismically-determined source parameters for the April 25, 2015 Mw 7.9 Gorkha, Nepal Earthquake and the May 12, 2015, MW 7.2 aftershock, Tectonophysics, doi: 10.1016/j.tecto.2016.05.023. Ye, L., T. Lay, H. Kanamori, & L. Rivera (2016), Rupture characteristics of major and great (Mw â¥ 7) megathrust earthquakes from 1990 to 2015: 2. depth dependence, Journal of Geophysical Research: Solid Earth, 121, 845-863, doi: 1002/2015JB012427. Ye, L., T. Lay, H. Kanamori, & L. Rivera (2016), Rupture characteristics of major and great (Mw â¥ 7) megathrust earthquakes from 1990 to 2015: 2. depth dependence, Journal of Geophysical Research: Solid Earth, 121, 845-863, doi: 1002/2015JB012427. Ye, L., T. Lay, H. Kanamori, & L. Rivera (2016), Rupture characteristics of major and great (Mw â¥ 7) megathrust earthquakes from 1990 to 2015: 1. Source parameter scaling relationships, Journal of Geophysical Research: Solid Earth, 121, 821-844, doi: 1002/2015JB012426. Ye, L., T. Lay, H. Kanamori, & L. Rivera (2016), Rupture characteristics of major and great (Mw â¥ 7) megathrust earthquakes from 1990 to 2015: 1. Source parameter scaling relationships, Journal of Geophysical Research: Solid Earth, 121, 821-844, doi: 1002/2015JB012426. Ye, L., T. Lay, Z. Zhan, H. Kanamori, & J. Hao (2016), The isolated ~680 km deep 30 May 2015 Mw 7.9 Ogasawara (Bonin) Islands earthquake, Earth and Planetary Science Letters, 433, 169â179, doi: 10.1016/j.epsl.2015.10.049. Ye, L., T. Lay, Z. Zhan, H. Kanamori, & J. Hao (2016), The isolated ~680 km deep 30 May 2015 Mw 7.9 Ogasawara (Bonin) Islands earthquake, Earth and Planetary Science Letters, 433, 169â179, doi: 10.1016/j.epsl.2015.10.049. He, X., S. Ni, L. Ye, T. Lay, Q. Liu, & K. Koper (2015), Rapid seismological quantification of source parameters of the 25 April 2015 Nepal earthquake, Seismological Research Letters, 86 (6), 1568-1577, doi: 10.1785/0220150131. He, X., S. Ni, L. Ye, T. Lay, Q. Liu, & K. Koper (2015), Rapid seismological quantification of source parameters of the 25 April 2015 Nepal earthquake, Seismological Research Letters, 86 (6), 1568-1577, doi: 10.1785/0220150131. Meng, Q., H. David, L. Ye, T. Lay, D. A. Wiens, M. Jia, & P. R. Cummin (2015), The 3 May 2006 (Mw 8.0) and 19 March 2009 (Mw 7.6) Tonga earthquakes: Intraslab compressional faulting below the megathrust, Journal of Geophysical Research: Solid Earth, doi: 10.1002/2015JB012242. Meng, Q., H. David, L. Ye, T. Lay, D. A. Wiens, M. Jia, & P. R. Cummin (2015), The 3 May 2006 (Mw 8.0) and 19 March 2009 (Mw 7.6) Tonga earthquakes: Intraslab compressional faulting below the megathrust, Journal of Geophysical Research: Solid Earth, doi: 10.1002/2015JB012242. Ye, L., T. Lay, K. D. Koper, R. Smalley, Jr., L. Rivera, M. G. Bevis, A. F. Zakrajsek, & F. N. Teferl (2014), Complementary slip distributions of the August 4, 2003 Mw 7.6 and November 17, 2013 Mw 7.8 South Scotia Ridge earthquakes, Earth and Planetary Science Letters, 401, 15â226, doi: 10.1016/j.epsl.2014.06.007. Ye, L., T. Lay, K. D. Koper, R. Smalley, Jr., L. Rivera, M. G. Bevis, A. F. Zakrajsek, & F. N. Teferl (2014), Complementary slip distributions of the August"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "4, 2003 Mw 7.6 and November 17, 2013 Mw 7.8 South Scotia Ridge earthquakes, Earth and Planetary Science Letters, 401, 15â226, doi: 10.1016/j.epsl.2014.06.007. Bai, Y., K. F. Cheung, Y. Yamazaki, T. Lay, & L. Ye (2014), Tsunami surges around the Hawaiian Islands from the 1 April 2014 North Chile Mw 8.1 earthquake, Geophysical Research Letters, 41(23), 8512â8521, doi: 10.1002/2014GL061686. Bai, Y., K. F. Cheung, Y. Yamazaki, T. Lay, & L. Ye (2014), Tsunami surges around the Hawaiian Islands from the 1 April 2014 North Chile Mw 8.1 earthquake, Geophysical Research Letters, 41(23), 8512â8521, doi: 10.1002/2014GL061686. Ye, L., T. Lay, & H. Kanamori (2014), The 23 June 2014 Mw 7.9 Rat Islands archipelago, Alaska, intermediate-depth earthquake, Geophysical Research Letters, 41(18), 6389â6395, doi: 10.1002/2014GL061153. Ye, L., T. Lay, & H. Kanamori (2014), The 23 June 2014 Mw 7.9 Rat Islands archipelago, Alaska, intermediate-depth earthquake, Geophysical Research Letters, 41(18), 6389â6395, doi: 10.1002/2014GL061153. Ye, L., T. Lay, H. Kanamori, & K. D. Koper (2013), Energy Release of the 2013 Mw 8.3 Sea of Okhotsk Earthquake and Deep Slab Stress Heterogeneity, Science, 341(6152), 1380-1384, doi: 10.1126/science.1242032. Ye, L., T. Lay, H. Kanamori, & K. D. Koper (2013), Energy Release of the 2013 Mw 8.3 Sea of Okhotsk Earthquake and Deep Slab Stress Heterogeneity, Science, 341(6152), 1380-1384, doi: 10.1126/science.1242032. Lay, T., Z. Duputel, L. Ye, & H. Kanamori (2013), The December 7, 2012 Japan Trench intraplate doublet (Mw 7.2, 7.1) and interactions between near-trench intraplate thrust and normal faulting, Physics of the Earth and Planetary Interiors, 220, 73-78, doi: 10.1016/j.pepi.2013.04.009. Lay, T., Z. Duputel, L. Ye, & H. Kanamori (2013), The December 7, 2012 Japan Trench intraplate doublet (Mw 7.2, 7.1) and interactions between near-trench intraplate thrust and normal faulting, Physics of the Earth and Planetary Interiors, 220, 73-78, doi: 10.1016/j.pepi.2013.04.009. Wu, R. S., Y. Geng, & L. Ye (2013), Preliminary study on Dreamlet based compressive sensing data recovery, SEG Expanded Abstracts, pp. 3585-3590. Wu, R. S., Y. Geng, & L. Ye (2013), Preliminary study on Dreamlet based compressive sensing data recovery, SEG Expanded Abstracts, pp. 3585-3590. Wu, R. S., L. Ye, & Y. Zheng (2013), Nonlinear Partial Functional Derivative and Nonlinear LS Seismic Inversion, 75th EAGE Conference & Exhibition incorporating SPE EUROPEC. Wu, R. S., L. Ye, & Y. Zheng (2013), Nonlinear Partial Functional Derivative and Nonlinear LS Seismic Inversion, 75th EAGE Conference & Exhibition incorporating SPE EUROPEC. Ye, L., T. Lay, & H. Kanamori (2013), Large earthquake rupture process variations on the Middle America megathrust, Earth and Planetary Science Letters, 381,147-155, doi: 1016/j.epsl.2013.08.042. Ye, L., T. Lay, & H. Kanamori (2013), Large earthquake rupture process variations on the Middle America megathrust, Earth and Planetary Science Letters, 381,147-155, doi: 1016/j.epsl.2013.08.042. Lay, T., L. Ye, H. Kanamori, Y. Yamazaki, K. F. Cheung, & C. J. Ammon (2013), The February 6, 2013 Mw 8.0 Santa Cruz Islands earthquake and tsunami, Tectonophysics, Vol. 608, 1109-1121, doi: 10.1016/j.tecto.2013.07.001. Lay, T., L. Ye, H. Kanamori, Y. Yamazaki, K. F. Cheung, & C. J. Ammon (2013), The February 6, 2013 Mw 8.0 Santa Cruz Islands earthquake and tsunami, Tectonophysics, Vol. 608, 1109-1121, doi: 10.1016/j.tecto.2013.07.001. Lay, T., L. Ye, H. Kanamori, Y. Yamazaki, K. F. Cheung, K. D. Koper, & K. Kwong (2013), The October 28, 2012 Mw 7.8 Haida Gwaii underthrusting earthquake and tsunami: Slip partitioning along the Queen Charlotte Fault transcompressional plate boundary, Earth and Planetary Science Letters, 375, 57-70, doi: 10.1016/j.epsl.2013.05.005. Lay, T., L. Ye, H. Kanamori, Y. Yamazaki, K. F. Cheung, K. D. Koper, & K. Kwong (2013), The October 28, 2012 Mw 7.8 Haida Gwaii underthrusting earthquake and tsunami: Slip partitioning along the Queen Charlotte Fault transcompressional plate boundary, Earth and Planetary Science Letters, 375, 57-70, doi: 10.1016/j.epsl.2013.05.005. Ye, L., T. Lay, & H. Kanamori (2013), Ground shaking and seismic source spectra for large earthquakes around the megathrust fault offshore of northeastern Honshu, Japan, Bulletin of the Seismological Society of America, 103, no. 2B, 1221â1241, doi: 1785/0120120115. Ye, L., T. Lay, & H. Kanamori (2013), Ground shaking and seismic source spectra for large earthquakes around the megathrust fault offshore of northeastern Honshu, Japan, Bulletin of the Seismological Society of America, 103, no. 2B, 1221â1241, doi: 1785/0120120115. Ye, L., T. Lay, & H. Kanamori (2012), Intraplate and interplate faulting interactions during the August 31, 2012, Philippine Trench earthquake (Mw 7.6) sequence, Geophysical Research Letters, 39, L24310, doi: 10.1029/2012GL054164. Ye, L., T. Lay, & H. Kanamori (2012), Intraplate and interplate faulting interactions during the August 31, 2012, Philippine Trench earthquake (Mw 7.6) sequence, Geophysical Research Letters, 39, L24310, doi:"
  },
  {
    "candidate": "Ye, Ling",
    "category": "bio",
    "score": null,
    "link": "https://www.sustech.edu.cn/en/faculties/yelingling.html",
    "text": "10.1029/2012GL054164. Lay, T., H. Kanamori, C. J. Ammon, K. D. Koper, A. R. Hutko, L. Ye, H. Yue, & T. Rushing (2012), Depth-Varying Rupture Properties of Subduction Zone Megathrust Faults, Journal of Geophysical Research: Solid Earth, 117, B04311, 21, doi: 10.1029/2011JB009133. Lay, T., H. Kanamori, C. J. Ammon, K. D. Koper, A. R. Hutko, L. Ye, H. Yue, & T. Rushing (2012), Depth-Varying Rupture Properties of Subduction Zone Megathrust Faults, Journal of Geophysical Research: Solid Earth, 117, B04311, 21, doi: 10.1029/2011JB009133. Ye, L., T. Lay, & H. Kanamori (2012), The Sanriku-Oki Low Seismicity Region on the Northern Margin of the Great 2011 Tohoku-Oki Earthquake Rupture, Journal of Geophysical Research: Solid Earth, 117, B02305, 17, 10.1029/2011JB008847. Ye, L., T. Lay, & H. Kanamori (2012), The Sanriku-Oki Low Seismicity Region on the Northern Margin of the Great 2011 Tohoku-Oki Earthquake Rupture, Journal of Geophysical Research: Solid Earth, 117, B02305, 17, 10.1029/2011JB008847. å¶ç²ç², æå¨ (2012), ä¸åå°åº660 kmé´æ­é¢éè¿æ³¢éç»æç ç©¶, å°éå­¦æ¥, 34(2), 137-146. å¶ç²ç², æå¨ (2012), ä¸åå°åº660 kmé´æ­é¢éè¿æ³¢éç»æç ç©¶, å°éå­¦æ¥, 34(2), 137-146. Ye, L., J. Li, T. Tseng, & Z. Yao (2011), A Stagnant Slab in a Water-bearing Mantle Transition Zone beneath Northeast China: Implications from Regional SH Waveform Modelling, Geophysical Journal International, 186, 706â710, doi: 10.1111/j.1365-246X.2011.05063.x. Ye, L., J. Li, T. Tseng, & Z. Yao (2011), A Stagnant Slab in a Water-bearing Mantle Transition Zone beneath Northeast China: Implications from Regional SH Waveform Modelling, Geophysical Journal International, 186, 706â710, doi: 10.1111/j.1365-246X.2011.05063.x. 1088 Xueyuan Avenue, Shenzhen 518055, P.R. China (ä¸­æ) fot NEWS Research Highlights Campus News EVENT Event Calendar ABOUT Facts and Figures Contact Us FACULTY Directory Talent Programs ACADEMICS Schools & Departments Undergraduate Programs Graduate Programs International Students RESEARCH Centers and Facilities Office of Research CAMPUS Overview Residential Colleges Clubs & Organizations (ä¸­æ) fot NEWS Research Highlights Campus News EVENT Event Calendar ABOUT Facts and Figures Contact Us FACULTY Directory Talent Programs ACADEMICS Schools & Departments Undergraduate Programs Graduate Programs International Students RESEARCH Centers and Facilities Centers and Facilities Office of Research CAMPUS Overview Residential Colleges Clubs & Organizations"
  }
]