[
  {
    "candidate": "Yu, Eric",
    "category": "bio",
    "score": null,
    "link": "https://aeroastro.mit.edu/realm/team/eric-yu/",
    "text": "People Allen Wang Anjali Parashar Charles Dawson Eric Yu Fei Chen Jaeyoun Choi Jake Arkin Ji Yin Jim Neidhoefer Joseph Zhang Mingxin Yu Niklas Schmid Oswin So Ruixiao Yang Songyuan Zhang Yilun Hao Yingke Li Yongchao Chen Yue Meng People Allen Wang Anjali Parashar Charles Dawson Eric Yu Fei Chen Jaeyoun Choi Jake Arkin Ji Yin Jim Neidhoefer Joseph Zhang Mingxin Yu Niklas Schmid Oswin So Ruixiao Yang Songyuan Zhang Yilun Hao Yingke Li Yongchao Chen Yue Meng Our Research #Research featured by MIT News Automated testing, verification & design optimization Certified Learning for Control LLM-based human-machine interaction Safe human-robot interaction and planning Our Research #Research featured by MIT News Automated testing, verification & design optimization Certified Learning for Control LLM-based human-machine interaction Safe human-robot interaction and planning News ACC 2025 Workshop ICLR2025 Paper Announcements ICRA2024 Paper Announcements ICRA2025 Paper Announcements RSS2025 Paper Announcements News ACC 2025 Workshop ICLR2025 Paper Announcements ICRA2024 Paper Announcements ICRA2025 Paper Announcements RSS2025 Paper Announcements Publications Wiki Contact Prospective Members People show submenu for “People” Allen Wang Anjali Parashar Charles Dawson Eric Yu Fei Chen Jaeyoun Choi Jake Arkin Ji Yin Jim Neidhoefer Joseph Zhang Mingxin Yu Niklas Schmid Oswin So Ruixiao Yang Songyuan Zhang Yilun Hao Yingke Li Yongchao Chen Yue Meng show submenu for “People” show submenu for “People” Allen Wang Anjali Parashar Charles Dawson Eric Yu Fei Chen Jaeyoun Choi Jake Arkin Ji Yin Jim Neidhoefer Joseph Zhang Mingxin Yu Niklas Schmid Oswin So Ruixiao Yang Songyuan Zhang Yilun Hao Yingke Li Yongchao Chen Yue Meng Our Research show submenu for “Our Research” #Research featured by MIT News Automated testing, verification & design optimization Certified Learning for Control LLM-based human-machine interaction Safe human-robot interaction and planning show submenu for “Our Research” show submenu for “Our Research” #Research featured by MIT News Automated testing, verification & design optimization Certified Learning for Control LLM-based human-machine interaction Safe human-robot interaction and planning News show submenu for “News” ACC 2025 Workshop ICLR2025 Paper Announcements ICRA2024 Paper Announcements ICRA2025 Paper Announcements RSS2025 Paper Announcements show submenu for “News” show submenu for “News” ACC 2025 Workshop ICLR2025 Paper Announcements ICRA2024 Paper Announcements ICRA2025 Paper Announcements RSS2025 Paper Announcements Publications Wiki Contact Prospective Members Eric Yu Home | REALM | People | Eric Yu Bio: Hi! I am a graduate student in the Department of Aeronautics and Astronautics at MIT, and an NSF Graduate Research Fellowship awardee. Previously, I obtained my BS and MS in Computer Science at UC San Diego. My general research interests lie in safe reinforcement learning and combinatorial optimization. Email: eyyu@mit.edu Website Return to People Overview. Eric Yu Home | REALM | People | Eric Yu Home | REALM | People | Eric Yu Bio: Hi! I am a graduate student in the Department of Aeronautics and Astronautics at MIT, and an NSF Graduate Research Fellowship awardee. Previously, I obtained my BS and MS in Computer Science at UC San Diego. My general research interests lie in safe reinforcement learning and combinatorial optimization. Email: eyyu@mit.edu Website Return to People Overview. Back to Main AeroAstro Site MIT © 2025 MIT AeroAstro | Accessibility | MIT"
  }
]