[
  {
    "candidate": "Zhuang, Susan",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/susan-zhuang/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 43 Susan Zhuang Sunset Park (Central), Dyker Heights, Bensonhurst, Bath Beach, Gravesend (West), Sunset Park (East)-Borough Park (West), Borough Park, Mapleton-Midwood (West), Gravesend (East)-Homecrest Biography Susan Zhuang has worked diligently to serve the diverse communities of Southern Brooklyn for over a decade. She advocates for pressing issues such as public safety, equitable education, housing, and senior services. Susan was born in Baipu, China, and later came to the United States in 2008 as an international student in pursuit of the American Dream. Susan earned her bachelor’s degree in finance from the State University of New York at Oswego and later an MBA from the University of Southern Indiana. After moving to New York City, she volunteered at the Office of New York State Assemblyman William Colton, where she used her background in finance to help senior citizens and small businesses file tax returns. Driven by her passion for public service, Susan joined Assemblyman Colton’s Office as Chief of Staff in 2014. Since then, Susan has worked tirelessly on issues facing the under-represented families of Bensonhurst, Gravesend, Dyker Heights, and Sunset Park. In addition to her public service experiences, Susan has organized numerous community protests, meetings, and hearings. Susan is an active member of the Asian Pacific Islander American Public Affairs Association and has dedicated herself to voter education, youth leadership, and civic engagement. As an Asian-American, first-generation immigrant, a working wife, a mother, and a proud New Yorker, Susan is determined to bring people together to restore unity in our communities so that everyone will feel safe, seen, and heard. Susan was elected to City Council in 2023 in the newly formed, majority-Asian 43rd District. She is currently living in Bensonhurst with her husband and two young daughters. Biography Susan Zhuang has worked diligently to serve the diverse communities of Southern Brooklyn for over a decade. She advocates for pressing issues such as public safety, equitable education, housing, and senior services. Susan was born in Baipu, China, and later came to the United States in 2008 as an international student in pursuit of the American Dream. Susan earned her bachelor’s degree in finance from the State University of New York at Oswego and later an MBA from the University of Southern Indiana. After moving to New York City, she volunteered at the Office of New York State Assemblyman William Colton, where she used her background in finance to help senior citizens and small businesses file tax returns. Driven by her passion for public service, Susan joined Assemblyman Colton’s Office as Chief of Staff in 2014. Since then, Susan has worked tirelessly on issues facing the under-represented families of Bensonhurst, Gravesend, Dyker Heights, and Sunset Park. In addition to her public service experiences, Susan has organized numerous community protests, meetings, and hearings. Susan is an active member of the Asian Pacific Islander American Public Affairs Association and has dedicated herself to voter education, youth leadership, and civic engagement. As an Asian-American, first-generation immigrant, a working wife, a mother, and a proud New Yorker, Susan is determined to bring people together to restore unity in our communities so that everyone will feel safe, seen, and heard. Susan was elected to City Council in 2023 in the newly formed, majority-Asian 43rd District. She is currently living in Bensonhurst with her husband and two young daughters. Biography Staff Directory Press Releases News Sign Up For Our Online Newsletter District Map Office Services Register To Vote Contact 311 District 43 Job Openings District Office 6514 20th Avenue Brooklyn 11204 Phone: 718-307-7151 Legislative Office 250 Broadway, Suite 1841 New York, NY 10007 Phone: 212-788-7045 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content"
  },
  {
    "candidate": "Zhuang, Susan",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/susan-zhuang/",
    "text": "Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Zhuang, Susan",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/susan-zhuang/office-services/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 43 Susan Zhuang Sunset Park (Central), Dyker Heights, Bensonhurst, Bath Beach, Gravesend (West), Sunset Park (East)-Borough Park (West), Borough Park, Mapleton-Midwood (West), Gravesend (East)-Homecrest Office Services For Legal Immigration Services, please book an appointment by calling our office at (718) 307-7151 Office Services For Legal Immigration Services, please book an appointment by calling our office at (718) 307-7151 Biography Staff Directory Press Releases News Sign Up For Our Online Newsletter District Map Office Services Register To Vote Contact 311 District 43 Job Openings District Office 6514 20th Avenue Brooklyn 11204 Phone: 718-307-7151 Legislative Office 250 Broadway, Suite 1841 New York, NY 10007 Phone: 212-788-7045 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]