[
  {
    "candidate": "Abreu, Shaun",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shaun-abreu/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 7 Shaun Abreu Upper West Side (Central), Upper West Side-Manhattan Valley, Morningside Heights, Manhattanville-West Harlem, Hamilton Heights-Sugar Hill, Washington Heights (South) Biography New York City Council Member Shaun Abreu represents Manhattan’s 7th District, which spans north from the Upper West Side through Morningside Heights, West Harlem, Manhattan Valley, Manhattanville, Hamilton Heights, and Washington Heights. He is the first Latino to represent the district. Shaun was born and raised in Northern Manhattan, where his family experienced good times and bad. When he was a child, his parents lost their jobs, and his family was evicted from their home. But the community was there for him. Neighbors provided a place to live, teachers gave him time and attention, and his parents were fortunate enough to find good jobs—his mother as a bookkeeper at Zabar’s and his father as a janitor for the Port Authority, where they both still work today. With their support, he became the first in his family to graduate from college and established a career as a tenant rights attorney representing families like his own. Now, Shaun is fighting to build a stronger community in the district that he has always called home. He is a steadfast advocate for truly affordable housing, worker rights, universal access to after school programs, and environmental sustainability. Prior to his election, Council Member Abreu worked for the New York Legal Assistance Group, the National Labor Review Board, and the Natural Resource Defense Council. He holds a B.A. from Columbia University and a J.D. from Tulane Law School. Join Our Newsletter! Committees Committee on Sanitation and Solid Waste Management (Chair) Committee on Housing and Buildings Committee on Consumer and Worker Protection Committee on Land Use Committee on Criminal Justice Committee on Mental Health, Disabilities, and Addictions Subcommittee on Zoning and Franchises Caucuses Black, Latino, Asian Caucus (BLAC) Biography New York City Council Member Shaun Abreu represents Manhattan’s 7th District, which spans north from the Upper West Side through Morningside Heights, West Harlem, Manhattan Valley, Manhattanville, Hamilton Heights, and Washington Heights. He is the first Latino to represent the district. Shaun was born and raised in Northern Manhattan, where his family experienced good times and bad. When he was a child, his parents lost their jobs, and his family was evicted from their home. But the community was there for him. Neighbors provided a place to live, teachers gave him time and attention, and his parents were fortunate enough to find good jobs—his mother as a bookkeeper at Zabar’s and his father as a janitor for the Port Authority, where they both still work today. With their support, he became the first in his family to graduate from college and established a career as a tenant rights attorney representing families like his own. Now, Shaun is fighting to build a stronger community in the district that he has always called home. He is a steadfast advocate for truly affordable housing, worker rights, universal access to after school programs, and environmental sustainability. Prior to his election, Council Member Abreu worked for the New York Legal Assistance Group, the National Labor Review Board, and the Natural Resource Defense Council. He holds a B.A. from Columbia University and a J.D. from Tulane Law School. Join Our Newsletter! Committees Committee on Sanitation and Solid Waste Management (Chair) Committee on Housing and Buildings Committee on Consumer and Worker Protection Committee on Land Use Committee on Criminal Justice Committee on Mental Health, Disabilities, and Addictions Subcommittee on Zoning and Franchises Caucuses Black, Latino, Asian Caucus (BLAC) Biography Contact Information District Map News Legislative Record FY26 Discretionary Funding Information Report Sanitation Issues Subscribe to our E-Newsletter Upcoming Events District Office 500 West 141st Street New York, NY 10031 Phone: 212-928-6814 Fax: 646-582-1408 Legislative Office 250 Broadway, Suite 1807 New York, NY 10007 Phone: 212-788-7007 Fax: 646-582-1408 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our"
  },
  {
    "candidate": "Abreu, Shaun",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shaun-abreu/",
    "text": "Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Abreu, Shaun",
    "category": "bio",
    "score": null,
    "link": "https://council.nyc.gov/shaun-abreu/staff-directory/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 7 Shaun Abreu Upper West Side (Central), Upper West Side-Manhattan Valley, Morningside Heights, Manhattanville-West Harlem, Hamilton Heights-Sugar Hill, Washington Heights (South) Contact Information For general inquiries and constituent services, please email district7@council.nyc.gov For legislative and budget inquiries, please email Jalissa Quigley at jquigley@council.nyc.gov For press inquiries, please email d7press@council.nyc.gov Contact Information For general inquiries and constituent services, please email district7@council.nyc.gov For legislative and budget inquiries, please email Jalissa Quigley at jquigley@council.nyc.gov For press inquiries, please email d7press@council.nyc.gov Biography Contact Information District Map News Legislative Record FY26 Discretionary Funding Information Report Sanitation Issues Subscribe to our E-Newsletter Upcoming Events District Office 500 West 141st Street New York, NY 10031 Phone: 212-928-6814 Fax: 646-582-1408 Legislative Office 250 Broadway, Suite 1807 New York, NY 10007 Phone: 212-788-7007 Fax: 646-582-1408 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]