[
  {
    "source": "https://carmenfornyc.com/",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Meet Carmen De La Rosa Meet Carmen De La Rosa Carmen De La Rosa immigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent us in the New York State Assembly. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice and her commitment to the community she loves continues. In November 2016, Carmen was elected to represent us in the New York State Assembly. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice and her commitment to the community she loves continues. As an Assembly Member, she is driven by the needs of our people.  She led the passage of the NYS Dream Act to provide access to education to all students regardless of immigration status, and worked with organizers and advocates to reshape the lives of tenants, delivering real rent reform. Carmen is the lead sponsor in the Assembly for a billionaires tax to #TaxTheRich that will ensure the ultrawealthy finally pay their fair share and help us close budget gaps wreaked by COVID-19. Carmen will fight to make sure that the needs of our community are at the forefront. She will fight to protect our community from irresponsible development and displacement, dismantle fundamental flaws in our criminal justice system, expand our social safety nets, fix our broken education system, and protect  frontline workers and vulnerable small businesses. Carmen De La Rosa is the leader this moment requires. vulnerable  About District 10 District 10 is home to the vibrant communities of Washington Heights, Inwood, and Marble Hill. Since the 1900s, these neighborhoods have been the homes of immigrant communities such as Cubans, German Jews, Russians, Puerto Ricans and now Dominicans who are the primary immigrant group.  Uptown Manhattan is home to the highest number of Dominicans of any neighborhood in the United States who account for nearly 100,000 of the residents. This has earned Uptown the nickname of Little Dominican Republic. The district is home to many seniors, working-class families, and essential workers. Since the 1900s, these neighborhoods have been the homes of immigrant communities such as Cubans, German Jews, Russians, Puerto Ricans and now Dominicans who are the primary immigrant group.  Uptown Manhattan is home to the highest number of Dominicans of any neighborhood in the United States who account for nearly 100,000 of the residents. This has earned Uptown the nickname of Little Dominican Republic. The district is home to many seniors, working-class families, and essential workers. The history of the district, however, is tainted with inequities and exclusion in government. Gentrification threatens the very fabric of the community as long-time residents are pushed out for newer, wealthier ones. Small businesses, too, find it increasingly difficult to survive with rising rents.  When COVID-19 hit, our district one of the hardest hit in the city—highlighting just how much essential workers sacrifice to keep our city running. The next 10 years will be pivotal for our district: we must stop gentrification and build a city that is centered around the needs of the working class. Let’s build truly affordable housing, fund public schools, and support services that will help our community thrive. The structure of power in our community will change on June 22nd, 2021. Make sure your voice is heard. Click Here to Register to Vote.  On the Issues Carmen De La Rosa has used her voice & platform to demand criminal justice reform, the strengthening of rent stabilization laws that protect and prioritize low-income tenants, stood firmly for women’s rights and equality, and has been a leading voice in the development of policies around Mental Health services for minority communities and suicide prevention. Carmen is passionate about using government as a tool for social change and a vehicle to empower and support communities. Housing Justice  Education Equity  Racial Justice & Immigration  Worker Rights  Environmental Justice & Infrastructure  COVID 19 & Health  Reproductive Rights &\n Gender Equality  Disability Rights  Animal Rights  Events Previous Next Instagram carmenfornyc  Today is Election Day. We have a special election Help Mia & I wish the Happiest of Birthdays to our Early voting has begun! Come out and vote make you Today, we honor the 209th anniversary of Juan Pabl Today, we celebrated Dr. King’s life, legacy, an MLK said: Injustice anywhere is a threat to justic Grateful to all those who came out to support our Thank you @weact4ej for organizing such a powerful As we begin this new chapter, we want to offer the Happy New Year to all! May 2022 bring us health an Today I was sworn-in as the City Council Member fo Check out COVID-19 testing sites in Manhattan and All around the world and here in New York City, De Solitary confinement is state sanctioned torture. Check out H+H testing sites in Manhattan. Highbrid Today I testified before the Board of Standards of  Our community has been reaching out to ask how you On my journey to City Hall, I have been so fortuna Follow on Instagram  This error message is only visible to WordPress admins Twitter  55 years ago  Disability Rights Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://carmenfornyc.com/issues/#racialjustice",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Education | Racial Justice | Disability Rights | Environment | Housing | Economy | Immigration | Reproductive Rights Education Equity    Secure high-quality laptops and tablets all students while ensuring access to adequate broadband. COVID-19 has forced many students to fall behind in their studies because they lack access to necessary technology. We must do better for our students and level the playing field, particularly for students with Individualized Education Plans and English Language Learners. Secure high-quality laptops and tablets all students while ensuring access to adequate broadband. COVID-19 has forced many students to fall behind in their studies because they lack access to necessary technology. We must do better for our students and level the playing field, particularly for students with Individualized Education Plans and English Language Learners.    We must remove NYPD officers from schools and end harsh disciplinary processes like zero tolerance. Too often students of color are exposed to the carceral system in everyday life. Schools are institutions for learning, students should not feel like they are in prison by going through metal detectors every day. We must remove NYPD officers from schools and end harsh disciplinary processes like zero tolerance. Too often students of color are exposed to the carceral system in everyday life. Schools are institutions for learning, students should not feel like they are in prison by going through metal detectors every day.    Fund mental health professionals in every school so students have the resources to cope with stress and process the historic inequities of poverty that have existed in their communities. Fund mental health professionals in every school so students have the resources to cope with stress and process the historic inequities of poverty that have existed in their communities.    Community-based groups like Community Education Councils should have veto-power over school closures and be an active voice in the agenda-setting for school culture. Community-based groups like Community Education Councils should have veto-power over school closures and be an active voice in the agenda-setting for school culture.    Allow for a Board of Education that is more independent and subject to oversight from the City Council. Allow for a Board of Education that is more independent and subject to oversight from the City Council.    Open Parent Academies at schools that would offer parenting and skills workshops to increase institutional accessibility and better help their students Open Parent Academies at schools that would offer parenting and skills workshops to increase institutional accessibility and better help their students    Provide professional certification courses and continuing higher-education opportunities for members of our community. Provide professional certification courses and continuing higher-education opportunities for members of our community.       New York City is the most diverse city in the world, we must make sure our curriculum is diverse and representative of its students. We must overhaul the DOE budget and make space for minority and women-led contractors while also setting aside funds to actively recruit teachers of color. New York City is the most diverse city in the world, we must make sure our curriculum is diverse and representative of its students. We must overhaul the DOE budget and make space for minority and women-led contractors while also setting aside funds to actively recruit teachers of color.    Over 110K students in public schools are homeless. A child cannot learn if they do not have a plate of food or a bed to sleep in. We have a duty to provide housing and access to food for our city’s neediest. Over 110K students in public schools are homeless. A child cannot learn if they do not have a plate of food or a bed to sleep in. We have a duty to provide housing and access to food for our city’s neediest.    Advocating for the repeal of Hect-Calandra at the state level, end all discriminatory screens in New York City public schools, and launch a community-led diversity plan for middle schools in Northern Manhattan. Advocating for the repeal of Hect-Calandra at the state level, end all discriminatory screens in New York City public schools, and launch a community-led diversity plan for middle schools in Northern Manhattan.    students within the DOE; add more staff to address the needs of our students. students within the DOE; add more staff to address the needs of our students. Racial Justice Platform    Reject the Borough-Based Plan to Replace Rikers. I support the expedited closure of  Rikers, now we must ensure that city resources are spent to improve our city, not incarcerate our people. I support the expedited closure of  Rikers, now we must ensure that city resources are spent to improve our city, not incarcerate our people. End Solitary Confinement. Khalief Browder’s tragic story reveals the horror of solitary confinement. I strongly support ending the inhumane practice of solitary confinement. Khalief Browder’s tragic story reveals the horror of solitary confinement. I strongly support ending the inhumane practice of solitary confinement. Protester Rights. The Black Lives Matter Movement exposed deeply-rooted bias and loopholes in our policing system. We must end the deployment of tear gas and rubber bullets against protestors The Black Lives Matter Movement exposed deeply-rooted bias and loopholes in our policing system. We must end the deployment of tear gas and rubber bullets against protestors Support Police Residency Laws. 51% of NYPD officers do not live in NYC. We must put Residency Laws to ensure our police officers are members of the community they serve. 51% of NYPD officers do not live in NYC. We must put Residency Laws to ensure our police officers are members of the community they serve. Oversight of NYPD. NYC Council Investigations committee should have expanded investigative and oversight powers in cases of police misconduct and deadly use of force. The NYPD Commissioner must be confirmed by the City Council. Support a Truly Independent Civilian Complaint Review Board Comprehensive review of NYPD Budget and reallocation of resources NYC Council Investigations committee should have expanded investigative and oversight powers in cases of police misconduct and deadly use of force. The NYPD Commissioner must be confirmed by the City Council. The NYPD Commissioner must be confirmed by the City Council. Support a Truly Independent Civilian Complaint Review Board Support a Truly Independent Civilian Complaint Review Board Comprehensive review of NYPD Budget and reallocation of resources Comprehensive review of NYPD Budget and reallocation of resources End Qualified-Immunity for NYPD Officers. Support the removal of NYPD response in homelessness outreach, and mental health calls. Support the removal of NYPD response in homelessness outreach, and mental health calls.    We must remove NYPD officers from schools and end harsh disciplinary processes like zero tolerance. Too often students of color are exposed to the carceral system in everyday life. Schools are institutions for learning, students should not feel like they are in prison by going through metal detectors every day. We must remove NYPD officers from schools and end harsh disciplinary processes like zero tolerance. Too often students of color are exposed to the carceral system in everyday life. Schools are institutions for learning, students should not feel like they are in prison by going through metal detectors every day.    Historically, rezonings have been used as a tool to segregate and displace communities. We need to examine land-use and ULURP processes in the city. I strongly support the requirement of Racial Impact Studies in rezoning and other land-use proposals. Historically, rezonings have been used as a tool to segregate and displace communities. We need to examine land-use and ULURP processes in the city. I strongly support the requirement of Racial Impact Studies in rezoning and other land-use proposals.    I support #FreeCuny which would remove financial barriers to entry to a university education. which would remove financial barriers to entry to a university education. I also support expanding city-funded loans to encourage homeownership and the use of Community Land Trusts for community control of new development in their neighborhoods I also support expanding city-funded loans to encourage homeownership and the use of Community Land Trusts for community control of new development in their neighborhoods I support the Small Business and Jobs Survival Act. 31% of small businesses are minority owned. The SBJSBA would empower small business owners which would grant business owners a right to renewal in the commercial lease process. 31% of small businesses are minority owned. The SBJSBA would empower small business owners which would grant business owners a right to renewal in the commercial lease process. Expand access to loan programs and support for small businesses Expand access to loan programs and support for small businesses    Millions of immigrants contribute to the economic vitality and culture of our city, we must allow undocumented residents to vote in City elections. Millions of immigrants contribute to the economic vitality and culture of our city,    Black and brown people are more likely to feel the impacts of climate change and we must protect vulnerable communities. The Green New Deal would retrofit NYC1HA. The Green New Deal would create green jobs, end the fossil fuel infrastructure, and secure dignified living conditions for people across the city. Black and brown people are more likely to feel the impacts of climate change and we must protect vulnerable communities. The Green New Deal would retrofit NYC1HA. The Green New Deal would create green jobs, end the fossil fuel infrastructure, and secure dignified living conditions for people across the city.  Disability Rights With over 2,000,000 disabled people living in the  Five Boroughs of NYC, many who struggle financially and live on fixed income, we must elevate the plight of people with disabilities and prioritize solutions to make our city the most inclusive and livable city in the world. Disabilities rights is critical to the fight for social justice in our communities. With over 2,000,000 disabled people living in the  Five Boroughs of NYC, many who struggle financially and live on fixed income, we must elevate the plight of people with disabilities and prioritize solutions to make our city the most inclusive and livable city in the world. Disabilities rights is critical to the fight for social justice in our communities.    The New York City Council must collaborate with cultural institutions across the city  to allow free entry/ pay as you can for all disabled visitors to all city controlled Cultural Institutions Group (CIGs).  Allow one Caregiver to accompany the disabled individual at free or discounted entry. The New York City Council must collaborate with cultural institutions across the city  to allow free entry/ pay as you can for all disabled visitors to all city controlled Cultural Institutions Group (CIGs).  Allow one Caregiver to accompany the disabled individual at free or discounted entry.    We must expand the New York City Identification Card program for disabled New Yorkers so they too can enjoy the benefits and access of the program. We must expand the New York City Identification Card program for disabled New Yorkers so they too can enjoy the benefits and access of the program.    Protect the disabled community from eviction, displacement in housing discrimination. We must ensure that disabled New Yorkers are easily able to request repairs and upgrades in their current apartments to allow manageability and accessibility. Protect the disabled community from eviction, displacement in housing discrimination. We must ensure that disabled New Yorkers are easily able to request repairs and upgrades in their current apartments to allow manageability and accessibility.    Support all children with special needs and disabilities and their families. All children should have access to quality education and intervention services, including efficient transportation options and one on one support. Support all children with special needs and disabilities and their families. All children should have access to quality education and intervention services, including efficient transportation options and one on one support.    All businesses adhere to ADA accessibility, there should be a process allowing initial 90 day building code upgrades and financial assistance for ensuring compliance followed by enforcement. All businesses adhere to ADA accessibility, there should be a process allowing initial 90 day building code upgrades and financial assistance for ensuring compliance followed by enforcement.    We must ensure our city’s workforce is inclusive and develop a pipeline of life sustaining employment opportunities available to the disabled community who would like to engage in full time, or part time employment. We must ensure our city’s workforce is inclusive and develop a pipeline of life sustaining employment opportunities available to the disabled community who would like to engage in full time, or part time employment.    We need to ensure access to quality health and mental health care for the diisabled community. We support access  to care for all especially those who are struggling with access to care due to financial hardship. We need to ensure access to quality health and mental health care for the diisabled community. We support access  to care for all especially those who are struggling with access to care due to financial hardship.    New York City should prioritize true accessibility in our public mass transit system. In addition, we must guarantee investment in our city’s infrastructure and sidewalks to ensure our streets are accessible to all. New York City should prioritize true accessibility in our public mass transit system. In addition, we must guarantee investment in our city’s infrastructure and sidewalks to ensure our streets are accessible to all.  Environmental Justice and Infrastructure Pass a Green New Deal for New York City. Support a Green New Deal For NYCHA. Divest From Fossil Fuels. NYC pensions and any other support of the fossil fuel industry. Move Ownership of the energy supply from the private sector to the public Enact a Carbon Tax that will fund capital projects and green infrastructure Fortify Harlem River Esplanade in our District and other vulnerable waterfront areas Make the language around Climate Justice movement more accessible to all, keeping New York’s immigrant community in mind Reduce car dependency, support sidewalk expansions/street closures, prioritize development of green recreational spaces in POC neighborhoods Fight for Increased Federal and State funding of the MTA Address food insecurity and food waste in New York City. Support food-share and expansion of Health Bucks initiative. Divest From Fossil Fuels. NYC pensions and any other support of the fossil fuel industry. NYC pensions and any other support of the fossil fuel industry. Move Ownership of the energy supply from the private sector to the public Move Ownership of the energy supply from the private sector to the public Enact a Carbon Tax that will fund capital projects and green infrastructure that will fund capital projects and green infrastructure Fortify Harlem River Esplanade in our District and other vulnerable waterfront areas in our District and other vulnerable waterfront areas Make the language around Climate Justice movement more accessible to all, keeping New York’s immigrant community in mind Make the language around Climate Justice movement more accessible to all, keeping New York’s immigrant community in mind Reduce car dependency, support sidewalk expansions/street closures, prioritize development of green recreational spaces in POC neighborhoods support sidewalk expansions/street closures, prioritize development of green recreational spaces in POC neighborhoods Fight for Increased Federal and State funding of the MTA  Address food insecurity and food waste in New York City. Support food-share and expansion of Health Bucks initiative. Address food insecurity and food waste in New York City. Support food-share and expansion of Health Bucks initiative. Uptown Food Co-Op Support Renewable Rikers Housing Justice    Counteract the forces of gentrification with a housing policy that deters displacement and empowers low-income renters to become home-owners. Counteract the forces of gentrification with a housing policy that deters displacement and empowers low-income renters to become home-owners.    Guarantee community interests and voices are heard in land-development projects. Guarantee community interests and voices are heard in land-development projects.    Home ownership is a primary method of building and maintaining wealth, we must create city sponsored programs to encourage homeownership, particularly for low-income families. Home ownership is a primary method of building and maintaining wealth, we must create city sponsored programs to encourage homeownership, particularly for low-income families.    Create a community-based platform to ensure accountability. Create a community-based platform to ensure accountability.    Expand legal services and create emergency funds to protect tenants from eviction and homelessness. Expand legal services and create emergency funds to protect tenants from eviction and homelessness.    I will also oppose any privatization efforts of public housing. Support community-led efforts. I will also oppose any privatization efforts of public housing. Support community-led efforts.    Empower members of the community to organize against landlord abuse Empower members of the community to organize against landlord abuse    Historically, rezonings have been used as a tool to segregate and displace communities. We need to examine land-use and ULURP processes in the city. I strongly support the requirement of Racial Impact Studies in rezoning and other land-use proposals. Historically, rezonings have been used as a tool to segregate and displace communities. We need to examine land-use and ULURP processes in the city. I strongly support the requirement of Racial Impact Studies in rezoning and other land-use proposals.    Support a city-level Homes Guarantee campaign by preserving existing affordable public and social housing (including NYCHA), building new social housing units, and advocating for a comprehensive plan. Support a city-level Homes Guarantee campaign by preserving existing affordable public and social housing (including NYCHA), building new social housing units, and advocating for a comprehensive plan. Workers, Jobs, Economic Development, and Small Business Protection Higher Heights Initiative: developing pipeline for our community to access green careers that have not been traditionally accessible to them. Higher Heights Initiative: developing pipeline for our community to access green careers that have not been traditionally accessible to them. Support partnerships with merchants associations Support partnerships with merchants associations The Small Business & Jobs Survival Act has been ignored by the city council for over 30 years. COVID-19 demonstrates the urgency to support our small businesses in the lease renewal process The Small Business & Jobs Survival Act has been ignored by the city council for over 30 years. COVID-19 demonstrates the urgency to support our small businesses in the lease renewal process Support for a minimum wage that automatically matches the rate of inflation Support for a minimum wage that automatically matches the rate of inflation Support scheduling transparency and emergency paid-time off Support scheduling transparency and emergency paid-time off Encourage expansion of small business instead of big-box stores Encourage expansion of small business instead of big-box stores Support hazard pay for essential workers and benefits for excluded workers Support hazard pay for essential workers and benefits for excluded workers End predatory schools and job-placement programs End predatory schools and job-placement programs Support small businesses and vendors by fighting for commercial rent control, Support small businesses and vendors by fighting for commercial rent control, Support Street Vendor and micro-entrepreneurs Support Street Vendor and micro-entrepreneurs Support vendor plazas and pedestrian-friendly marketplaces Support vendor plazas and pedestrian-friendly marketplaces Immigration Immigrants Bill of Rights Immigrants Bill of Rights Formation of the Council of Immigrants Formation of the Council of Immigrants Reimagining NYC as a true Sanctuary city. Support the NYS Liberty For All Bill. Reimagining NYC as a true Sanctuary city. Support the NYS Liberty For All Bill. Preservation of Adult literacy programing and funding Preservation of Adult literacy programing and funding Work to end deportations. Support legal representation for detained immigrants Work to end deportations. Support legal representation for detained immigrants Support of Municipal Voting Legislation Support of Municipal Voting Legislation Support of Citizenship classes & ELL Support of Citizenship classes & ELL Access to healthcare and mental health care services regardless of immigration service Access to healthcare and mental health care services regardless of immigration service Increase language accessibility around municipal programming. Increase language accessibility around municipal programming. Reproductive Rights & Gender Equality I will continue to be a fierce champion of reproductive rights for all. Continue to expand reproductive health services in communities of color to deal with I will continue to be a fierce champion of reproductive rights for all. Continue to expand reproductive health services in communities of color to deal with Standing up for the civil rights of the LGBTQIA+ community including the decriminalization of the trans community. Standing up for the civil rights of the LGBTQIA+ community including the decriminalization of the trans community. Expansion of workplace protections for LGBTQIA+ community and fair compensation. Expansion of workplace protections for LGBTQIA+ community and fair compensation. Support medical and reproductive services for incarcerated women Support medical and reproductive services for incarcerated women Protection of reproductive rights, including abortion access, and preventative care Protection of reproductive rights, including abortion access, and preventative care Closing the Income inequality Gap for women/ women of color. Closing the Income inequality Gap for women/ women of color. Expanding protections against sexual harassment in the workplace Expanding protections against sexual harassment in the workplace Expanding preventative services to combat Maternal Mortality for women of color. Expanding preventative services to combat Maternal Mortality for women of color. Reproductive Services need to get the funding they deserve Reproductive Services need to get the funding they deserve COVID-19 & Health Ensure Equitable Testing and Vaccination rollout . Support citywide education programs to encourage vaccination and prioritize development of vaccination centers in vulnerable communities. . Support citywide education programs to encourage vaccination and prioritize development of vaccination centers in vulnerable communities. Cancel Rent. When COVID-related eviction moratoriums are lifted, New Yorkers will owe thousands of dollars in backrent, we must cancel rent to avoid a tragic eviction crisis. When COVID-related eviction moratoriums are lifted, New Yorkers will owe thousands of dollars in backrent, we must cancel rent to avoid a tragic eviction crisis. Free COVID-19 Treatment. Nobody should go into debt due to this deadly pandemic. Free COVID-19 Treatment will make sure no lives are lost due to financial concerns. Nobody should go into debt due to this deadly pandemic. Free COVID-19 Treatment will make sure no lives are lost due to financial concerns. Expand Mental Health Programs. Mental health has been an untreated problem in communities of color for decades, stress and trauma exacerbated by COVID-19 must be treated so we can all properly heal. We must also decriminalize and de-stigmatize people suffering from mental health crises. Mental health has been an untreated problem in communities of color for decades, stress and trauma exacerbated by COVID-19 must be treated so we can all properly heal. We must also decriminalize and de-stigmatize people suffering from mental health crises. Protect Incarcerated People. We must ensure prisons follow proper social distancing protocols and provide PPE to incarcerated people. Incarcerated people must be included in the vaccination rollout. Additionally, we must ensure access to high-quality medical treatment for any illness in prisons. We must ensure prisons follow proper social distancing protocols and provide PPE to incarcerated people. Incarcerated people must be included in the vaccination rollout. Additionally, we must ensure access to high-quality medical treatment for any illness in prisons. End The Maternal Mortality Crisis. Women of color are particularly vulnerable to maternal mortality, we must support women at all stages of pregnancy to ensure their safety. Women of color are particularly vulnerable to maternal mortality, we must support women at all stages of pregnancy to ensure their safety. Universal Healthcare. Support the passage and implementation of the NY Health ACt. Support the passage and implementation of the NY Health ACt. Racially Representative Healthcare. People of Color have historically been misdiagnosed and undertreated. We must support programs that boost diversity in the healthcare industry and overcome these obstacles. People of Color have historically been misdiagnosed and undertreated. We must support programs that boost diversity in the healthcare industry and overcome these obstacles.   Animal Rights Establish a Department of Animal Advocacy within the NY Government Establish a Department of Animal Advocacy within the NY Government Ban the Sale of Animal-Tested Cosmetics Ban the Sale of Animal-Tested Cosmetics Make Affordable Housing and Shelters more Pet-Friendly/Accessible Make Affordable Housing and Shelters more Pet-Friendly/Accessible Support Legislation that increases NYC Wildlife Protection Support Legislation that increases NYC Wildlife Protection Advocate for More Animal Shelters in Uptown Advocate for More Animal Shelters in Uptown Advocate for Humane Education at All Levels of Schooling Advocate for Humane Education at All Levels of Schooling Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://carmenfornyc.com/priorities/#education",
    "text": "English BIOGRAFIA PLATAFORMA    VOLUNTEER Educación | Justicia racial | Derechos de las personas con discapacida | Medio ambiente | Alojamiento | Economía | Inmigración | Derechos reproductivos Educación Justicia racial Derechos de las personas con discapacida Medio ambiente Economía Inmigración Derechos reproductivos Equidad educativa    Asegure computadoras portátiles y tabletas de alta calidad para todos los estudiantes mientras asegura el acceso a una banda ancha adecuada. COVID-19 ha obligado a muchos estudiantes a retrasarse en sus estudios porque carecen de acceso a la tecnología necesaria. Debemos hacerlo mejor para nuestros estudiantes y nivelar el campo de juego, particularmente para los estudiantes con Planes de Educación Individualizados y Estudiantes del Idioma Inglés. Asegure computadoras portátiles y tabletas de alta calidad para todos los estudiantes mientras asegura el acceso a una banda ancha adecuada. COVID-19 ha obligado a muchos estudiantes a retrasarse en sus estudios porque carecen de acceso a la tecnología necesaria. Debemos hacerlo mejor para nuestros estudiantes y nivelar el campo de juego, particularmente para los estudiantes con Planes de Educación Individualizados y Estudiantes del Idioma Inglés.    Debemos sacar a los oficiales de policía de Nueva York de las escuelas y poner fin a los duros procesos disciplinarios como la tolerancia cero. Con demasiada frecuencia, los estudiantes de color están expuestos al sistema carcelario en la vida cotidiana. Las escuelas son instituciones para el aprendizaje, los estudiantes no deben sentirse en prisión pasando por detectores de metales todos los días. Debemos sacar a los oficiales de policía de Nueva York de las escuelas y poner fin a los duros procesos disciplinarios como la tolerancia cero. Con demasiada frecuencia, los estudiantes de color están expuestos al sistema carcelario en la vida cotidiana. Las escuelas son instituciones para el aprendizaje, los estudiantes no deben sentirse en prisión pasando por detectores de metales todos los días.    Financiar a los profesionales de la salud mental en cada escuela para que los estudiantes tengan los recursos para enfrentar el estrés y procesar las inequidades históricas de la pobreza que han existido en sus comunidades. Financiar a los profesionales de la salud mental en cada escuela para que los estudiantes tengan los recursos para enfrentar el estrés y procesar las inequidades históricas de la pobreza que han existido en sus comunidades.    Los grupos comunitarios como los Consejos de Educación Comunitaria deben tener poder de veto sobre el cierre de escuelas y ser una voz activa en el establecimiento de la agenda para la cultura escolar. Los grupos comunitarios como los Consejos de Educación Comunitaria deben tener poder de veto sobre el cierre de escuelas y ser una voz activa en el establecimiento de la agenda para la cultura escolar.    Permitir una Junta de Educación que sea más independiente y esté sujeta a la supervisión del Concejo Municipal. Permitir una Junta de Educación que sea más independiente y esté sujeta a la supervisión del Concejo Municipal.    Academias abiertas para padres en las escuelas que ofrecerán talleres para padres y habilidades para aumentar la accesibilidad institucional y ayudar mejor a sus estudiantes Academias abiertas para padres en las escuelas que ofrecerán talleres para padres y habilidades para aumentar la accesibilidad institucional y ayudar mejor a sus estudiantes    Brindar cursos de certificación profesional y oportunidades de educación superior continua para los miembros de nuestra comunidad. Brindar cursos de certificación profesional y oportunidades de educación superior continua para los miembros de nuestra comunidad.       La ciudad de Nueva York es la ciudad más diversa del mundo, debemos asegurarnos de que nuestro plan de estudios sea diverso y representativo de sus estudiantes. Debemos revisar el presupuesto del DOE y hacer espacio para los contratistas liderados por mujeres y minorías, al mismo tiempo que apartamos fondos para reclutar activamente maestros de color. La ciudad de Nueva York es la ciudad más diversa del mundo, debemos asegurarnos de que nuestro plan de estudios sea diverso y representativo de sus estudiantes. Debemos revisar el presupuesto del DOE y hacer espacio para los contratistas liderados por mujeres y minorías, al mismo tiempo que apartamos fondos para reclutar activamente maestros de color.    Más de 110.000 estudiantes en las escuelas públicas no tienen hogar. Un niño no puede aprender si no tiene un plato de comida o una cama para dormir. Tenemos el deber de proporcionar vivienda y acceso a alimentos a los más necesitados de nuestra ciudad. Más de 110.000 estudiantes en las escuelas públicas no tienen hogar. Un niño no puede aprender si no tiene un plato de comida o una cama para dormir. Tenemos el deber de proporcionar vivienda y acceso a alimentos a los más necesitados de nuestra ciudad.    Abogar por la derogación de Hect-Calandra a nivel estatal, poner fin a todas las pantallas discriminatorias en las escuelas públicas de la ciudad de Nueva York y lanzar un plan de diversidad dirigido por la comunidad para las escuelas intermedias en el norte de Manhattan. Abogar por la derogación de Hect-Calandra a nivel estatal, poner fin a todas las pantallas discriminatorias en las escuelas públicas de la ciudad de Nueva York y lanzar un plan de diversidad dirigido por la comunidad para las escuelas intermedias en el norte de Manhattan.    Estudiantes dentro del DOE; agregar más personal para atender las necesidades de nuestros estudiantes. Estudiantes dentro del DOE; agregar más personal para atender las necesidades de nuestros estudiantes. Plataforma de justicia racial    Rechace el plan municipal para reemplazar a Rikers. Apoyo el cierre acelerado de Rikers, ahora debemos asegurarnos de que los recursos de la ciudad se gasten para mejorar nuestra ciudad, no para encarcelar a nuestra gente. Rechace el plan municipal para reemplazar a Rikers. Apoyo el cierre acelerado de Rikers, ahora debemos asegurarnos de que los recursos de la ciudad se gasten para mejorar nuestra ciudad, no para encarcelar a nuestra gente. Poner fin al confinamiento solitario. La trágica historia de Khalief Browder revela el horror del confinamiento solitario. Apoyo firmemente el fin de la práctica inhumana del confinamiento solitario. Poner fin al confinamiento solitario. La trágica historia de Khalief Browder revela el horror del confinamiento solitario. Apoyo firmemente el fin de la práctica inhumana del confinamiento solitario. Derechos de los manifestantes. El Movimiento Black Lives Matter expuso prejuicios y lagunas profundamente arraigadas en nuestro sistema policial. Debemos poner fin al despliegue de gases lacrimógenos y balas de goma contra los manifestantes Derechos de los manifestantes. El Movimiento Black Lives Matter expuso prejuicios y lagunas profundamente arraigadas en nuestro sistema policial. Debemos poner fin al despliegue de gases lacrimógenos y balas de goma contra los manifestantes Apoyar las leyes de residencia policial. El 51% de los oficiales de la policía de Nueva York no vive en la ciudad de Nueva York. Debemos promulgar leyes de residencia para asegurarnos de que nuestros oficiales de policía sean miembros de la comunidad a la que sirven. Apoyar las leyes de residencia policial. El 51% de los oficiales de la policía de Nueva York no vive en la ciudad de Nueva York. Debemos promulgar leyes de residencia para asegurarnos de que nuestros oficiales de policía sean miembros de la comunidad a la que sirven. Supervisión de NYPD. El comité de Investigaciones del NYC Council debería haber ampliado los poderes de investigación y supervisión en casos de mala conducta policial y uso letal de la fuerza. El Comisionado de NYPD debe ser confirmado por el Concejo Municipal. Apoyar una junta de revisión de quejas civiles verdaderamente independiente Revisión integral del presupuesto del NYPD y reasignación de recursos. Supervisión de NYPD. El comité de Investigaciones del NYC Council debería haber ampliado los poderes de investigación y supervisión en casos de mala conducta policial y uso letal de la fuerza. El Comisionado de NYPD debe ser confirmado por el Concejo Municipal. El Comisionado de NYPD debe ser confirmado por el Concejo Municipal. Apoyar una junta de revisión de quejas civiles verdaderamente independiente Apoyar una junta de revisión de quejas civiles verdaderamente independiente Revisión integral del presupuesto del NYPD y reasignación de recursos. Revisión integral del presupuesto del NYPD y reasignación de recursos. Poner fin a la inmunidad calificada para los oficiales de policía de Nueva York. Poner fin a la inmunidad calificada para los oficiales de policía de Nueva York. Apoye la eliminación de la respuesta del NYPD en el alcance de personas sin hogar y llamadas de salud mental. Apoye la eliminación de la respuesta del NYPD en el alcance de personas sin hogar y llamadas de salud mental.    Debemos sacar a los oficiales de policía de Nueva York de las escuelas y poner fin a los duros procesos disciplinarios como la tolerancia cero. Con demasiada frecuencia, los estudiantes de color están expuestos al sistema carcelario en la vida cotidiana. Las escuelas son instituciones para el aprendizaje, los estudiantes no deben sentirse en prisión pasando por detectores de metales todos los días. Debemos sacar a los oficiales de policía de Nueva York de las escuelas y poner fin a los duros procesos disciplinarios como la tolerancia cero. Con demasiada frecuencia, los estudiantes de color están expuestos al sistema carcelario en la vida cotidiana. Las escuelas son instituciones para el aprendizaje, los estudiantes no deben sentirse en prisión pasando por detectores de metales todos los días.    Históricamente, las zonificaciones se han utilizado como una herramienta para segregar y desplazar comunidades. Necesitamos examinar los procesos de uso de la tierra y ULURP en la ciudad. Apoyo firmemente el requisito de Estudios de Impacto Racial en la rezonificación y otras propuestas de uso de la tierra. Históricamente, las zonificaciones se han utilizado como una herramienta para segregar y desplazar comunidades. Necesitamos examinar los procesos de uso de la tierra y ULURP en la ciudad. Apoyo firmemente el requisito de Estudios de Impacto Racial en la rezonificación y otras propuestas de uso de la tierra.    Apoyo #FreeCuny , que eliminaría las barreras financieras para ingresar a la educación universitaria. , que eliminaría las barreras financieras para ingresar a la educación universitaria. También apoyó la expansión de préstamos financiados por la ciudad para fomentar la propiedad de vivienda y el uso de Community Land Trusts para el control comunitario de nuevos desarrollos en sus vecindarios También apoyó la expansión de préstamos financiados por la ciudad para fomentar la propiedad de vivienda y el uso de Community Land Trusts para el control comunitario de nuevos desarrollos en sus vecindarios Apoyo la Ley de Supervivencia en el Trabajo y las Pequeñas Empresas. El 31% de las pequeñas empresas son propiedad de minorías. La SBJSBA facultará a los propietarios de pequeñas empresas, lo que les otorgaría a los propietarios de empresas el derecho de renovación en el proceso de arrendamiento comercial. El 31% de las pequeñas empresas son propiedad de minorías. La SBJSBA facultará a los propietarios de pequeñas empresas, lo que les otorgaría a los propietarios de empresas el derecho de renovación en el proceso de arrendamiento comercial. Ampliar el acceso a programas de préstamos y apoyo para pequeñas empresas. Ampliar el acceso a programas de préstamos y apoyo para pequeñas empresas.    Millones de inmigrantes contribuyen a la vitalidad económica y la cultura de nuestra ciudad, debemos permitir que los residentes indocumentados voten en las elecciones municipales. Millones de inmigrantes contribuyen a la vitalidad económica y la cultura de nuestra ciudad, debemos permitir que los residentes indocumentados voten en las elecciones municipales.    Las personas de raza negra y morena tienen más probabilidades de sentir los impactos del cambio climático y debemos proteger a las comunidades vulnerables. El Green New Deal modernizará NYCHA. El Green New Deal crearía empleos verdes, acabaría con la infraestructura de combustibles fósiles y garantizará condiciones de vida dignas para las personas en toda la ciudad. Las personas de raza negra y morena tienen más probabilidades de sentir los impactos del cambio climático y debemos proteger a las comunidades vulnerables. El Green New Deal modernizará NYCHA. El Green New Deal crearía empleos verdes, acabaría con la infraestructura de combustibles fósiles y garantizará condiciones de vida dignas para las personas en toda la ciudad. Derechos de discapacidad Con más de 2,000,000 de personas discapacitadas que viven en los cinco distritos de la ciudad de Nueva York, muchas de las cuales luchan financieramente y viven con ingresos fijos, debemos elevar la difícil situación de las personas con discapacidades y priorizar soluciones para hacer de nuestra ciudad la ciudad más inclusiva y habitable del mundo. Los derechos de las personas con discapacidad son fundamentales para la lucha por la justicia social en nuestras comunidades. Con más de 2,000,000 de personas discapacitadas que viven en los cinco distritos de la ciudad de Nueva York, muchas de las cuales luchan financieramente y viven con ingresos fijos, debemos elevar la difícil situación de las personas con discapacidades y priorizar soluciones para hacer de nuestra ciudad la ciudad más inclusiva y habitable del mundo. Los derechos de las personas con discapacidad son fundamentales para la lucha por la justicia social en nuestras comunidades.    El Ayuntamiento de la ciudad de Nueva York debe colaborar con las instituciones culturales de toda la ciudad para permitir la entrada / pago gratis a todos los visitantes discapacitados a todos los Grupos de Instituciones Culturales (CIG) controlados por la ciudad. Permita que un cuidador acompañe a la persona discapacitada en la entrada gratuita o con descuento. El Ayuntamiento de la ciudad de Nueva York debe colaborar con las instituciones culturales de toda la ciudad para permitir la entrada / pago gratis a todos los visitantes discapacitados a todos los Grupos de Instituciones Culturales (CIG) controlados por la ciudad. Permita que un cuidador acompañe a la persona discapacitada en la entrada gratuita o con descuento.    Debemos expandir el programa de Tarjeta de Identificación de la Ciudad de Nueva York para los neoyorquinos discapacitados para que ellos también puedan disfrutar de los beneficios y el acceso al programa. Debemos expandir el programa de Tarjeta de Identificación de la Ciudad de Nueva York para los neoyorquinos discapacitados para que ellos también puedan disfrutar de los beneficios y el acceso al programa.    Proteger a la comunidad de discapacitados del desalojo, el desplazamiento en la discriminación de vivienda. Debemos asegurarnos de que los neoyorquinos discapacitados puedan solicitar fácilmente reparaciones y mejoras en sus apartamentos actuales para permitir la facilidad de administración y accesibilidad. Proteger a la comunidad de discapacitados del desalojo, el desplazamiento en la discriminación de vivienda. Debemos asegurarnos de que los neoyorquinos discapacitados puedan solicitar fácilmente reparaciones y mejoras en sus apartamentos actuales para permitir la facilidad de administración y accesibilidad.    Apoye a todos los niños con necesidades especiales y discapacidades y a sus familias. Todos los niños deben tener acceso a servicios de intervención y educación de calidad, incluidas opciones de transporte eficientes y apoyo personalizado. Apoye a todos los niños con necesidades especiales y discapacidades y a sus familias. Todos los niños deben tener acceso a servicios de intervención y educación de calidad, incluidas opciones de transporte eficientes y apoyo personalizado.    Todas las empresas se adhieren a la accesibilidad de la ADA, debe haber un proceso que permita actualizaciones iniciales del código de construcción de 90 días y asistencia financiera para garantizar el cumplimiento seguido de la aplicación. Todas las empresas se adhieren a la accesibilidad de la ADA, debe haber un proceso que permita actualizaciones iniciales del código de construcción de 90 días y asistencia financiera para garantizar el cumplimiento seguido de la aplicación.    Debemos asegurarnos de que la fuerza laboral de nuestra ciudad sea inclusiva y desarrollar una serie de oportunidades de empleo para sustentar la vida disponibles para la comunidad discapacitada que desee participar en un empleo de tiempo completo o parcial. Debemos asegurarnos de que la fuerza laboral de nuestra ciudad sea inclusiva y desarrollar una serie de oportunidades de empleo para sustentar la vida disponibles para la comunidad discapacitada que desee participar en un empleo de tiempo completo o parcial.    Necesitamos garantizar el acceso a una atención médica y de salud mental de calidad para la comunidad con discapacidades. Apoyamos el acceso a la atención para todos, especialmente para aquellos que tienen dificultades para acceder a la atención debido a dificultades financieras. Necesitamos garantizar el acceso a una atención médica y de salud mental de calidad para la comunidad con discapacidades. Apoyamos el acceso a la atención para todos, especialmente para aquellos que tienen dificultades para acceder a la atención debido a dificultades financieras.    La ciudad de Nueva York debe priorizar la verdadera accesibilidad en nuestro sistema de transporte público masivo. Además, debemos garantizar la inversión en la infraestructura y las aceras de nuestra ciudad para asegurar que nuestras calles sean accesibles para todos. La ciudad de Nueva York debe priorizar la verdadera accesibilidad en nuestro sistema de transporte público masivo. Además, debemos garantizar la inversión en la infraestructura y las aceras de nuestra ciudad para asegurar que nuestras calles sean accesibles para todos. Medio ambiente Aprobar un Green New Deal para la ciudad de Nueva York. Apoye un nuevo acuerdo ecológico para NYCHA. Desinversión de combustibles fósiles. Pensiones de la ciudad de Nueva York y cualquier otro apoyo de la industria de los combustibles fósiles. Trasladar la propiedad del suministro de energía del sector privado al público Promulgar un impuesto al carbono que financiará proyectos de capital e infraestructura verde Fortificar Harlem River Esplanade en nuestro distrito y otras áreas vulnerables frente al mar Hacer que el lenguaje en torno al movimiento por la justicia climática sea más accesible para todos, teniendo en cuenta a la comunidad de inmigrantes de Nueva York Reducir la dependencia del automóvil , apoyar las expansiones de aceras / cierres de calles, priorizar el desarrollo de espacios recreativos verdes en los vecindarios de POC Desinversión de combustibles fósiles. Pensiones de la ciudad de Nueva York y cualquier otro apoyo de la industria de los combustibles fósiles. Trasladar la propiedad del suministro de energía del sector privado al público Promulgar un impuesto al carbono que financiará proyectos de capital e infraestructura verde Fortificar Harlem River Esplanade en nuestro distrito y otras áreas vulnerables frente al mar Hacer que el lenguaje en torno al movimiento por la justicia climática sea más accesible para todos, teniendo en cuenta a la comunidad de inmigrantes de Nueva York Reducir la dependencia del automóvil , apoyar las expansiones de aceras / cierres de calles, priorizar el desarrollo de espacios recreativos verdes en los vecindarios de POC Desinversión de combustibles fósiles. Pensiones de la ciudad de Nueva York y cualquier otro apoyo de la industria de los combustibles fósiles. Pensiones de la ciudad de Nueva York y cualquier otro apoyo de la industria de los combustibles fósiles. Trasladar la propiedad del suministro de energía del sector privado al público Trasladar la propiedad del suministro de energía del sector privado al público Promulgar un impuesto al carbono que financiará proyectos de capital e infraestructura verde que financiará proyectos de capital e infraestructura verde Fortificar Harlem River Esplanade en nuestro distrito y otras áreas vulnerables frente al mar en nuestro distrito y otras áreas vulnerables frente al mar Hacer que el lenguaje en torno al movimiento por la justicia climática sea más accesible para todos, teniendo en cuenta a la comunidad de inmigrantes de Nueva York Hacer que el lenguaje en torno al movimiento por la justicia climática sea más accesible para todos, teniendo en cuenta a la comunidad de inmigrantes de Nueva York Reducir la dependencia del automóvil , apoyar las expansiones de aceras / cierres de calles, priorizar el desarrollo de espacios recreativos verdes en los vecindarios de POC , apoyar las expansiones de aceras / cierres de calles, priorizar el desarrollo de espacios recreativos verdes en los vecindarios de POC Lucha por una mayor financiación federal y estatal de la MTA Abordar la inseguridad alimentaria y el desperdicio de alimentos en la ciudad de Nueva York. Apoyar la distribución de alimentos y la expansión de la iniciativa Health Bucks. Abordar la inseguridad alimentaria y el desperdicio de alimentos en la ciudad de Nueva York. Apoyar la distribución de alimentos y la expansión de la iniciativa Health Bucks. Abordar la inseguridad alimentaria y el desperdicio de alimentos en la ciudad de Nueva York. Apoyar la distribución de alimentos y la expansión de la iniciativa Health Bucks. Abordar la inseguridad alimentaria y el desperdicio de alimentos en la ciudad de Nueva York. Apoyar la distribución de alimentos y la expansión de la iniciativa Health Bucks. Cooperativa de alimentos Uptown Apoyar a Renewable Rikers  Justicia de la Vivienda    Contrarrestar las fuerzas de la gentrificación con una política de vivienda que disuade el desplazamiento y empodera a los inquilinos de bajos ingresos a convertirse en propietarios de viviendas. Contrarrestar las fuerzas de la gentrificación con una política de vivienda que disuade el desplazamiento y empodera a los inquilinos de bajos ingresos a convertirse en propietarios de viviendas.    Garantizar que se escuchen los intereses y las voces de la comunidad en los proyectos de desarrollo territorial. Garantizar que se escuchen los intereses y las voces de la comunidad en los proyectos de desarrollo territorial.    La propiedad de una vivienda es un método principal para construir y mantener la riqueza, debemos crear programas patrocinados por la ciudad para fomentar la propiedad de la vivienda, especialmente para las familias de bajos ingresos. La propiedad de una vivienda es un método principal para construir y mantener la riqueza, debemos crear programas patrocinados por la ciudad para fomentar la propiedad de la vivienda, especialmente para las familias de bajos ingresos.    Cree una plataforma basada en la comunidad para garantizar la responsabilidad de. Cree una plataforma basada en la comunidad para garantizar la responsabilidad de.    Ampliar los servicios legales y crear fondos de emergencia para proteger a los inquilinos del desalojo y la falta de vivienda. Ampliar los servicios legales y crear fondos de emergencia para proteger a los inquilinos del desalojo y la falta de vivienda.    También me opondré a cualquier esfuerzo de privatización de la vivienda pública. Apoye los esfuerzos liderados por la comunidad. También me opondré a cualquier esfuerzo de privatización de la vivienda pública. Apoye los esfuerzos liderados por la comunidad.    Empoderar a los miembros de la comunidad para que se organicen contra el abuso de los propietarios Empoderar a los miembros de la comunidad para que se organicen contra el abuso de los propietarios    Históricamente, las rezonificaciones se han utilizado como una herramienta para segregar y desplazar comunidades. Necesitamos examinar los procesos de uso de la tierra y ULURP en la ciudad. Apoyo firmemente el requisito de Estudios de Impacto Racial en la rezonificación y otras propuestas de uso de la tierra. Históricamente, las rezonificaciones se han utilizado como una herramienta para segregar y desplazar comunidades. Necesitamos examinar los procesos de uso de la tierra y ULURP en la ciudad. Apoyo firmemente el requisito de Estudios de Impacto Racial en la rezonificación y otras propuestas de uso de la tierra.    Apoye una campaña de Garantía de Viviendas a nivel de la ciudad preservando las viviendas sociales y públicas asequibles existentes (incluida NYCHA), construyendo nuevas unidades de vivienda social y abogando por un plan integral. Apoye una campaña de Garantía de Viviendas a nivel de la ciudad preservando las viviendas sociales y públicas asequibles existentes (incluida NYCHA), construyendo nuevas unidades de vivienda social y abogando por un plan integral. Economía Iniciativa Higher Heights: desarrollo de un canal para que nuestra comunidad acceda a carreras ecológicas que tradicionalmente no han sido accesibles para ellos. Iniciativa Higher Heights: desarrollo de un canal para que nuestra comunidad acceda a carreras ecológicas que tradicionalmente no han sido accesibles para ellos. Apoyar las asociaciones con asociaciones de comerciantes Apoyar las asociaciones con asociaciones de comerciantes El Ayuntamiento de la ciudad ha ignorado la Ley de supervivencia para pequeñas empresas y empleos durante más de 30 años. COVID-19 demuestra la urgencia de apoyar a nuestras pequeñas empresas en el proceso de renovación del arrendamiento El Ayuntamiento de la ciudad ha ignorado la Ley de supervivencia para pequeñas empresas y empleos durante más de 30 años. COVID-19 demuestra la urgencia de apoyar a nuestras pequeñas empresas en el proceso de renovación del arrendamiento Apoyo a un salario mínimo que coincide automáticamente con la tasa de inflación. Apoyo a un salario mínimo que coincide automáticamente con la tasa de inflación. Apoyar la transparencia de la programación y el tiempo libre pagado de emergencia Apoyar la transparencia de la programación y el tiempo libre pagado de emergencia Fomentar la expansión de las pequeñas empresas en lugar de las grandes tiendas. Fomentar la expansión de las pequeñas empresas en lugar de las grandes tiendas. Apoyar la prestación por condiciones de vida peligrosas para los trabajadores esenciales y los beneficios para los trabajadores excluidos Apoyar la prestación por condiciones de vida peligrosas para los trabajadores esenciales y los beneficios para los trabajadores excluidos Poner fin a las escuelas depredadoras y los programas de colocación laboral Poner fin a las escuelas depredadoras y los programas de colocación laboral Apoyar a las pequeñas empresas y a los proveedores luchando por el control de los alquileres comerciales, Apoyar a las pequeñas empresas y a los proveedores luchando por el control de los alquileres comerciales, Apoyar a los vendedores ambulantes y microempresarios Apoyar a los vendedores ambulantes y microempresarios Apoyar plazas de proveedores y mercados amigables para los peatones Apoyar plazas de proveedores y mercados amigables para los peatones Inmigración Declaración de derechos de los inmigrantes Declaración de derechos de los inmigrantes Formación del Consejo de Inmigrantes Formación del Consejo de Inmigrantes Reimaginando Nueva York como una verdadera ciudad santuario. Apoye el proyecto de ley Liberty For All del estado de Nueva York. Reimaginando Nueva York como una verdadera ciudad santuario. Apoye el proyecto de ley Liberty For All del estado de Nueva York. Preservación de la programación y la financiación de la alfabetización de adultos Preservación de la programación y la financiación de la alfabetización de adultos Trabaja para poner fin a las deportaciones. Apoyar la representación legal de inmigrantes detenidos Trabaja para poner fin a las deportaciones. Apoyar la representación legal de inmigrantes detenidos Apoyo a la legislación electoral municipal Apoyo a la legislación electoral municipal Apoyo de clases de ciudadanía y ELL Apoyo de clases de ciudadanía y ELL Acceso a servicios de atención médica y de salud mental independientemente del servicio de inmigración Acceso a servicios de atención médica y de salud mental independientemente del servicio de inmigración Incrementar la accesibilidad lingüística en torno a la programación municipal. Incrementar la accesibilidad lingüística en torno a la programación municipal. Derechos reproductivos Seguiré siendo una feroz defensora de los derechos reproductivos para todos. Continuar expandiendo los servicios de salud reproductiva en las comunidades de color para tratar Seguiré siendo una feroz defensora de los derechos reproductivos para todos. Continuar expandiendo los servicios de salud reproductiva en las comunidades de color para tratar Defender los derechos civiles de la comunidad LGBTQIA + incluida la despenalización de la comunidad trans. Defender los derechos civiles de la comunidad LGBTQIA + incluida la despenalización de la comunidad trans. Expansión de las protecciones en el lugar de trabajo para la comunidad LGBTQIA + y compensación justa. Expansión de las protecciones en el lugar de trabajo para la comunidad LGBTQIA + y compensación justa. Apoyar los servicios médicos y reproductivos para mujeres encarceladas. Apoyar los servicios médicos y reproductivos para mujeres encarceladas. Protección de los derechos reproductivos, incluido el acceso al aborto y la atención preventiva Protección de los derechos reproductivos, incluido el acceso al aborto y la atención preventiva Cerrar la brecha de desigualdad de ingresos para mujeres / mujeres de color. Cerrar la brecha de desigualdad de ingresos para mujeres / mujeres de color. Ampliación de las protecciones contra el acoso sexual en el lugar de trabajo Ampliación de las protecciones contra el acoso sexual en el lugar de trabajo Ampliar los servicios preventivos para combatir la mortalidad materna para mujeres de color. Ampliar los servicios preventivos para combatir la mortalidad materna para mujeres de color. Los servicios reproductivos necesitan obtener la financiación que merecen Los servicios reproductivos necesitan obtener la financiación que merecen Facebook Instagram Twitter Buscar: Páginas Home Page  – Espanol Priorities – Espanol Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://carmenfornyc.com#content",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Meet Carmen De La Rosa Meet Carmen De La Rosa Carmen De La Rosa immigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent us in the New York State Assembly. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice and her commitment to the community she loves continues. In November 2016, Carmen was elected to represent us in the New York State Assembly. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice and her commitment to the community she loves continues. As an Assembly Member, she is driven by the needs of our people.  She led the passage of the NYS Dream Act to provide access to education to all students regardless of immigration status, and worked with organizers and advocates to reshape the lives of tenants, delivering real rent reform. Carmen is the lead sponsor in the Assembly for a billionaires tax to #TaxTheRich that will ensure the ultrawealthy finally pay their fair share and help us close budget gaps wreaked by COVID-19. Carmen will fight to make sure that the needs of our community are at the forefront. She will fight to protect our community from irresponsible development and displacement, dismantle fundamental flaws in our criminal justice system, expand our social safety nets, fix our broken education system, and protect  frontline workers and vulnerable small businesses. Carmen De La Rosa is the leader this moment requires. vulnerable  About District 10 District 10 is home to the vibrant communities of Washington Heights, Inwood, and Marble Hill. Since the 1900s, these neighborhoods have been the homes of immigrant communities such as Cubans, German Jews, Russians, Puerto Ricans and now Dominicans who are the primary immigrant group.  Uptown Manhattan is home to the highest number of Dominicans of any neighborhood in the United States who account for nearly 100,000 of the residents. This has earned Uptown the nickname of Little Dominican Republic. The district is home to many seniors, working-class families, and essential workers. Since the 1900s, these neighborhoods have been the homes of immigrant communities such as Cubans, German Jews, Russians, Puerto Ricans and now Dominicans who are the primary immigrant group.  Uptown Manhattan is home to the highest number of Dominicans of any neighborhood in the United States who account for nearly 100,000 of the residents. This has earned Uptown the nickname of Little Dominican Republic. The district is home to many seniors, working-class families, and essential workers. The history of the district, however, is tainted with inequities and exclusion in government. Gentrification threatens the very fabric of the community as long-time residents are pushed out for newer, wealthier ones. Small businesses, too, find it increasingly difficult to survive with rising rents.  When COVID-19 hit, our district one of the hardest hit in the city—highlighting just how much essential workers sacrifice to keep our city running. The next 10 years will be pivotal for our district: we must stop gentrification and build a city that is centered around the needs of the working class. Let’s build truly affordable housing, fund public schools, and support services that will help our community thrive. The structure of power in our community will change on June 22nd, 2021. Make sure your voice is heard. Click Here to Register to Vote.  On the Issues Carmen De La Rosa has used her voice & platform to demand criminal justice reform, the strengthening of rent stabilization laws that protect and prioritize low-income tenants, stood firmly for women’s rights and equality, and has been a leading voice in the development of policies around Mental Health services for minority communities and suicide prevention. Carmen is passionate about using government as a tool for social change and a vehicle to empower and support communities. Housing Justice  Education Equity  Racial Justice & Immigration  Worker Rights  Environmental Justice & Infrastructure  COVID 19 & Health  Reproductive Rights &\n Gender Equality  Disability Rights  Animal Rights  Events Previous Next Instagram carmenfornyc  Today is Election Day. We have a special election Help Mia & I wish the Happiest of Birthdays to our Early voting has begun! Come out and vote make you Today, we honor the 209th anniversary of Juan Pabl Today, we celebrated Dr. King’s life, legacy, an MLK said: Injustice anywhere is a threat to justic Grateful to all those who came out to support our Thank you @weact4ej for organizing such a powerful As we begin this new chapter, we want to offer the Happy New Year to all! May 2022 bring us health an Today I was sworn-in as the City Council Member fo Check out COVID-19 testing sites in Manhattan and All around the world and here in New York City, De Solitary confinement is state sanctioned torture. Check out H+H testing sites in Manhattan. Highbrid Today I testified before the Board of Standards of  Our community has been reaching out to ask how you On my journey to City Hall, I have been so fortuna Follow on Instagram  Twitter  55 years ago  Disability Rights Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://docs.google.com/forms/d/e/1FAIpQLSdhv_XwvEZPkaFFzBgwCRDeWgZgGDB-28ViWj0CJxxojvV-Tw/viewform",
    "text": "Primer nombre * Apellido * Correo electrónico * ¿En qué vecindario vive / trabaja? * Choose Washington Heights Inwood Marble Hill Género Pronombres preferidos Raza-Etnia (s). Seleccione todas las que correspondan. Indio americano o nativo de Alaska Asiático o asiático americano Negro o afroamericano Hispano, latino, latina o latinx Medio Oriente o África del Norte Nativo hawaiano u otro isleño del Pacífico Blanco Prefiero no contestar esta pregunta Other: Ingresos del hogar menos que $20,000 $20,000 to $34,999 $35,000 to $49,999 $50,000 to $74,999 $75,000 to $99,999 mas que $100,000 menos que $20,000 $20,000 to $34,999 $35,000 to $49,999 $50,000 to $74,999 $75,000 to $99,999 mas que $100,000 Clear selection Clear selection Edad menos que 18 18-24 years old 25-34 years old 35-44 years old 45-54 years old 55-64 years old 65-74 years old mas que 75 menos que 18 18-24 years old 25-34 years old 35-44 years old 45-54 years old 55-64 years old 65-74 years old mas que 75 Clear selection Clear selection Next Next Clear form Clear form Does this form look suspicious? Report Forms"
  },
  {
    "source": "http://twitter.com/carmenfornyc",
    "text": "This browser is no longer supported. Please switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp."
  },
  {
    "source": "https://docs.google.com/forms/d/e/1FAIpQLSejhO5TLI_c0qKrkN3UQCbr-4HqxJow_Fn5OLE1JZkn32aq9A/viewform",
    "text": "First Name * Last Name * Email * What Neighborhood Do You Live/Work In? * Choose Washington Heights Inwood Marble Hill Gender Preferred Pronouns Race-Ethnicity(ies). Select all that apply. American Indian or Alaska Native Asian or Asian American Black or African American Hispanic, Latino, Latina, or Latinx Middle Eastern or Northern African Native Hawaiian or Other Pacific Islander White I prefer not to answer this question Other: Household Income Less than $20,000 $20,000 to $34,999 $35,000 to $49,999 $50,000 to $74,999 $75,000 to $99,999 Over $100,000 Less than $20,000 $20,000 to $34,999 $35,000 to $49,999 $50,000 to $74,999 $75,000 to $99,999 Over $100,000 Clear selection Clear selection Age Under 18 18-24 years old 25-34 years old 35-44 years old 45-54 years old 55-64 years old 65-74 years old 75 and above Under 18 18-24 years old 25-34 years old 35-44 years old 45-54 years old 55-64 years old 65-74 years old 75 and above Clear selection Clear selection Next Next Clear form Clear form Does this form look suspicious? Report Forms"
  },
  {
    "source": "https://carmenfornyc.com/es/home-page-2/",
    "text": "English BIOGRAFIA PLATAFORMA    VOLUNTEER Conoce a Carmen De La Rosa Conoce a Carmen De La Rosa Carmen De La Rosa emigró de República Dominicana cuando era niña y creció en Inwood, donde ha vivido toda su vida. Su defensa y pasión por la justicia están profundamente influenciadas por sus raíces. Ha escuchado y defendido a los más vulnerables, incluso antes de comenzar su carrera en el gobierno. En noviembre de 2016, Carmen fue elegida para representarnos en la Asamblea del Estado de Nueva York. Desde su primer día en el cargo, Carmen ha luchado contra el racismo, la xenofobia y la injusticia económica y su compromiso con la comunidad que ama continúa. Como asambleísta, ella está impulsada por las necesidades de nuestra gente. Lideró la aprobación de la NYS Dream Act para brindar acceso a la educación a todos los estudiantes independientemente de su estatus migratorio, y trabajó con organizadores y defensores para remodelar la vida de los inquilinos, logrando una verdadera reforma del alquiler. Carmen es la patrocinadora principal en la Asamblea de un impuesto a los multimillonarios,#TaxTheRich, que garantizará que los ultrarricos finalmente paguen su parte justa y nos ayudará a cerrar las brechas presupuestarias causadas por COVID-19. Carmen luchará para asegurarse de que las necesidades de nuestra comunidad estén a la vanguardia . Ella luchará para proteger a nuestra comunidad del desarrollo irresponsable y el desplazamiento, desmantelará fallas fundamentales en nuestro sistema de justicia penal, expandirá nuestras redes de seguridad social, arreglará nuestro sistema educativo roto y protegerá a los trabajadores de primera línea y las pequeñas empresas vulnerables. Carmen De La Rosa es la líder que requiere este momento. Sobre el Distrito 10 El Distrito 10 es el hogar de las vibrantes comunidades de Washington Heights, Inwood y Marble Hill. Desde la década de 1900, estos vecindarios han sido el hogar de comunidades de inmigrantes como cubanos, judíos alemanes, rusos, puertorriqueños y ahora dominicanos que son el principal grupo de inmigrantes. Uptown Manhattan es el hogar de la mayor cantidad de dominicanos de cualquier vecindario en los Estados Unidos que representan casi 100,000 de los residentes. Esto le ha valido a Uptown el apodo de Pequeña República Dominicana. El distrito es el hogar de muchas personas mayores, familias de clase trabajadora y trabajadores esenciales. Sin embargo, la historia del distrito está teñida de inequidades y exclusión en el gobierno. La gentrificación amenaza el tejido mismo de la comunidad a medida que los residentes antiguos son empujados por otros más nuevos y ricos. También a las pequeñas empresas les resulta cada vez más difícil sobrevivir con el aumento de los alquileres. Cuando llegó el COVID-19, nuestro distrito fue uno de los más afectados de la ciudad, destacando cuánto se sacrifican los trabajadores esenciales para mantener nuestra ciudad en funcionamiento. Los próximos 10 años serán fundamentales para nuestro distrito: debemos detener la gentrificación y construir una ciudad que se centre en las necesidades de la clase trabajadora. Construyamos viviendas verdaderamente asequibles, financiemos escuelas públicas y servicios de apoyo que ayudarán a nuestra comunidad a prosperar. La estructura de poder en nuestra comunidad cambiará el 22 de junio de 2021. Asegúrese de que su voz sea escuchada. Haga clic aquí para registrarse para votar. El Plan de Carmen Carmen De La Rosa ha utilizado su voz y su plataforma para exigir una reforma de la justicia penal, el fortalecimiento de las leyes de estabilización de alquileres que protegen y priorizan a los inquilinos de bajos ingresos, defendió firmemente los derechos y la igualdad de las mujeres y ha sido una voz líder en el desarrollo de políticas. en torno a los servicios de salud mental para las comunidades minoritarias y la prevención del suicidio. A Carmen le apasiona usar el gobierno como una herramienta para el cambio social y un vehículo para empoderar y apoyar a las comunidades. Derechos de Vivienda  Equidad Educativa  Justicia racial y de inmigración  Derechos de los Trabajadores  Justicia Climática y Infraestructura  COVID-19 y Salud    Derechos Reproductivos e Igualdad de Género  Derechos de los Discapacitados  Instagram carmenfornyc  Today is Election Day. We have a special election Help Mia & I wish the Happiest of Birthdays to our Early voting has begun! Come out and vote make you Today, we honor the 209th anniversary of Juan Pabl Today, we celebrated Dr. King’s life, legacy, an MLK said: Injustice anywhere is a threat to justic Grateful to all those who came out to support our Thank you @weact4ej for organizing such a powerful As we begin this new chapter, we want to offer the Happy New Year to all! May 2022 bring us health an Today I was sworn-in as the City Council Member fo Check out COVID-19 testing sites in Manhattan and All around the world and here in New York City, De Solitary confinement is state sanctioned torture. Check out H+H testing sites in Manhattan. Highbrid Today I testified before the Board of Standards of  Our community has been reaching out to ask how you On my journey to City Hall, I have been so fortuna Follow on Instagram  Twitter  55 años ago  Facebook Instagram Twitter Buscar: Páginas Home Page  – Espanol Priorities – Espanol Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://carmenfornyc.com/updates/",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://carmenfornyc.com/volunteer/",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Volunteer Notice: JavaScript is required for this content. Volunteer Search for: Recent Posts Hello world! Recent Comments A WordPress Commenter on Hello world! A WordPress Commenter Archives November 2019 Categories Uncategorized Meta Log in Entries feed Comments feed WordPress.org Campaign Announcement Video Spanish Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://docs.google.com/forms/d/e/1FAIpQLSefuR-x_ciZjxQN4bawEHcsu7zHUL83okrGDPxnsrviFRdBaw/viewform",
    "text": "First Name * Last Name * Phone Number * I am interested in... * Phonebanking Canvassing Subway Visibility Other: What Day(s) of the Week Are You Available? * Monday Tuesday Wednesday Thursday Friday Saturday Sunday Monday Tuesday Wednesday Thursday Friday Saturday Sunday Submit Submit Clear form Clear form Does this form look suspicious? Report Forms"
  },
  {
    "source": "https://carmenfornyc.com/endorsements/",
    "text": "Español BIOGRAPHY ISSUES EVENTS DONATE    VOLUNTEER Endorsements All Community Organization Community Member 21 in 21 Albania Jimenez Cira Angeles - Español Cira Angeles - English NYC Comptroller Scott Stringer Endorsements All Community Organization Community Member 21 in 21 Albania Jimenez Cira Angeles - Español Cira Angeles - English NYC Comptroller Scott Stringer Facebook Instagram Twitter Search for: Pages Endorsements Home Page Priorities Sign Up for Updates Volunteer Stay Updated TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Sign Up for updates TAKE OUR COMMUNITY SURVEY! ¡HAGA NUESTRA ENCUESTA COMUNITARIA! Carmen de la rosa is interested in the issues  important to the community. Take the survey in English. Realice la encuesta en Español. Take the survey in English. Realice la encuesta en Español.    Contact the De La Rosa Team Your message has been successfully sent Unable to send. Sign Up for Email Updates You have successfully subscribed to the newsletter There was an error while trying to send your request. Please try again."
  },
  {
    "source": "https://council.nyc.gov/carmen-de-la-rosa/staff-directory/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 10 Carmen De La Rosa Washington Heights, Inwood, Marble Hill Staff Directory Scheduling Inquiries: d10scheduling@council.nyc.gov Media Inquiries: Fraynette Familia – Director of Communications ffamilia@council.nyc.gov (917) 581-3358 James Burke – Chief of Staff jburke@council.nyc.gov Kiana Diaz – Deputy Chief of Staff / Director of Legislation and Budget kdiaz@council.nyc.gov (646) 670-6901 Nurys De Oleo – Senior Advisor ndeoleo@council.nyc.gov Jamilah Sandoval – Director of Community Affairs jsandoval@council.nyc.gov (917) 581-3357 Claudia Carias – Director of Constituent Services ccarias@council.nyc.gov (917) 581-3356 Arelys Martinez – Constituent Services Liaison armartinez@council.nyc.gov Luis Rodriguez – Constituent Services Liaison lrodriguez@council.nyc.gov Justin Castro – Community Advocate JuCastro@council.nyc.gov Staff Directory Scheduling Inquiries: d10scheduling@council.nyc.gov Media Inquiries: Fraynette Familia – Director of Communications ffamilia@council.nyc.gov (917) 581-3358 James Burke – Chief of Staff jburke@council.nyc.gov Kiana Diaz – Deputy Chief of Staff / Director of Legislation and Budget kdiaz@council.nyc.gov (646) 670-6901 Nurys De Oleo – Senior Advisor ndeoleo@council.nyc.gov Jamilah Sandoval – Director of Community Affairs jsandoval@council.nyc.gov (917) 581-3357 Claudia Carias – Director of Constituent Services ccarias@council.nyc.gov (917) 581-3356 Arelys Martinez – Constituent Services Liaison armartinez@council.nyc.gov Luis Rodriguez – Constituent Services Liaison lrodriguez@council.nyc.gov Justin Castro – Community Advocate JuCastro@council.nyc.gov Biography Staff Directory News District Office 618 W. 177th Street, Ground Floor New York, NY 10033 Phone: 917-521-2616 Fax: 917-521-1293 Legislative Office 250 Broadway, Suite 1880 New York, NY 10007 Phone: 212-788-7053 Fax: 212-227-5636 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "https://council.nyc.gov/legislation/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate Legislation New York City is diverse, complex, and unlike anywhere else. The Council creates laws to provide a framework for governing our unique city. The Council writes and passes local laws that affect the day-to-day lives of people living in, working in, or visiting New York City. Local laws can impact the lives of New Yorkers in many ways, both large and small. Some examples include: Paid Sick Leave, which enabled New Yorkers who are part-time workers at companies with 5+ employees to take paid time off when they’re ill IDNYC, which created a municipal photo identification program that allows New Yorkers who prove their residence to access city-based services and benefits See legislation The Council can also pass resolutions on state and federal issues that are relevant to New Yorkers. Resolutions allow the Council to express a collective voice of the City, and can play an important role in the development of law and public policy throughout New York State and across the nation. One type of resolution is a State Legislation Resolution (SLR), where the Council makes an official request of the New York State Legislature (also known as a “Home Rule Message”) to pass a special law affecting New York City. Council Members & Committees Council Members are assigned to Committees that examine specific topic areas. These Committees consist of a minimum of five Council Members and are tasked to study the potential impact of local laws and public policies. They then make recommendations for the entire 51-member body to consider and vote upon at Stated Meetings. By studying specific issues, Council Committees ensure that differing community needs are acknowledged. Learn more about Committees Legislative Division Each Council Committee also has a team of staff attorneys and analysts. This team supports the Committee by arranging public hearings and providing the legal and policy-based research needed to make decisions that benefit New York City. Notice for the public (January 14, 2025) Notice for the public (January 23, 2025) The Legislative Process Step 1: Bill introduction Council Members work with the Legislation Division to craft a bill that is introduced at stated meetings, where it is assigned to the appropriate Committee. Step 2: Public hearings The Committee will hold a public hearing on a bill to obtain feedback from the public and other government entities who may be affected by the bill. This may result in amendments to the bill. Step 3: Voting The Committee votes on the bill. If the bill passes the Committee by majority vote, the bill is then sent to the full Council where it will be considered and voted on at a Stated Meeting. The bill must again pass by majority vote. Step 4: Mayoral decision After a bill is passed by the Council, it is presented to the Mayor, who has 30 days to either sign the bill into law, veto the bill or take no action. If the Mayor vetoes the bill, it is sent back to the Council. If this happens, the Council can override the Mayor’s veto with a 2/3 vote. If the Mayor doesn’t sign or veto the bill within 30 days, it becomes law. Step 5: Bill becomes law Once a bill is signed by the Mayor (or its veto has been overridden by Council), it’s then added to the New York City Charter or Administrative Code. The Legislative Division often refers to its Bill Drafting Manual , one of the first local-level drafting manuals in the country to be written and made available to the public. We put together this manual primarily to assist the Council’s Legislative Division in drafting bills and resolutions. We are making it available to the public to further the Council’s interests in transparency and public education. Paid Sick Leave, which enabled New Yorkers who are part-time workers at companies with 5+ employees to take paid time off when they’re ill IDNYC, which created a municipal photo identification program that allows New Yorkers who prove their residence to access city-based services and benefits See legislation The Council can also pass resolutions on state and federal issues that are relevant to New Yorkers. Resolutions allow the Council to express a collective voice of the City, and can play an important role in the development of law and public policy throughout New York State and across the nation. One type of resolution is a State Legislation Resolution (SLR), where the Council makes an official request of the New York State Legislature (also known as a “Home Rule Message”) to pass a special law affecting New York City.  Council Members & Committees Council Members are assigned to Committees that examine specific topic areas. These Committees consist of a minimum of five Council Members and are tasked to study the potential impact of local laws and public policies. They then make recommendations for the entire 51-member body to consider and vote upon at Stated Meetings. By studying specific issues, Council Committees ensure that differing community needs are acknowledged. Learn more about Committees Legislative Division Each Council Committee also has a team of staff attorneys and analysts. This team supports the Committee by arranging public hearings and providing the legal and policy-based research needed to make decisions that benefit New York City. The Legislative Process Step 1: Bill introduction Council Members work with the Legislation Division to craft a bill that is introduced at stated meetings, where it is assigned to the appropriate Committee. Step 2: Public hearings The Committee will hold a public hearing on a bill to obtain feedback from the public and other government entities who may be affected by the bill. This may result in amendments to the bill. Step 3: Voting The Committee votes on the bill. If the bill passes the Committee by majority vote, the bill is then sent to the full Council where it will be considered and voted on at a Stated Meeting. The bill must again pass by majority vote. Step 4: Mayoral decision After a bill is passed by the Council, it is presented to the Mayor, who has 30 days to either sign the bill into law, veto the bill or take no action. If the Mayor vetoes the bill, it is sent back to the Council. If this happens, the Council can override the Mayor’s veto with a 2/3 vote. If the Mayor doesn’t sign or veto the bill within 30 days, it becomes law. Step 5: Bill becomes law Once a bill is signed by the Mayor (or its veto has been overridden by Council), it’s then added to the New York City Charter or Administrative Code. The Legislative Division often refers to its Bill Drafting Manual , one of the first local-level drafting manuals in the country to be written and made available to the public. We put together this manual primarily to assist the Council’s Legislative Division in drafting bills and resolutions. We are making it available to the public to further the Council’s interests in transparency and public education. Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "https://council.nyc.gov/legislation/api/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate Access the Legislative API On November 16, 2017, the Council released the NYC Legistar API, allowing the public to directly access our legislative data. What is an API? The Council shares and archives all of our legislative information, including proposed and passed legislation, hearings, and monthly Stated meetings, on our Legislative Research Center, known as Legistar. The New York City Council Legistar system was built by Granicus using their Legistar Legislative Management Suite. The Legistar Web API for New York City is now available for read access by the public. In Council 2.0, the Council’s technology and engagement roadmap, we outlined different ways to increase access and transparency to our legislative information. Making the NYC Legistar API open to the public will allow individuals to create tools and platforms that pull directly from this data source, ensuring increased accuracy and reliability. Help and Examples Having trouble? Access help, documentation, and examples. Learn More Access the API To get the access token, fill out the form below. You will receive an email with the API Key and further instruction. Name Email (required) Δ Access the Legislative API On November 16, 2017, the Council released the NYC Legistar API, allowing the public to directly access our legislative data.  What is an API? The Council shares and archives all of our legislative information, including proposed and passed legislation, hearings, and monthly Stated meetings, on our Legislative Research Center, known as Legistar. The New York City Council Legistar system was built by Granicus using their Legistar Legislative Management Suite. The Legistar Web API for New York City is now available for read access by the public. In Council 2.0, the Council’s technology and engagement roadmap, we outlined different ways to increase access and transparency to our legislative information. Making the NYC Legistar API open to the public will allow individuals to create tools and platforms that pull directly from this data source, ensuring increased accuracy and reliability. Help and Examples Having trouble? Access help, documentation, and examples. Learn More Access the API To get the access token, fill out the form below. You will receive an email with the API Key and further instruction. Name Email (required) Δ  Name  Email (required)   Δ Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "https://www.essentialaccessibility.com/new-york-city-council/?utm_source=newyorkcitycouncilhomepage&utm_medium=iconlarge&utm_term=eachannelpage&utm_content=header&utm_campaign=newyorkcitycouncil",
    "text": "Company Logo to go to home page Level Access Solution for people at New York City Council Level Access Solution for people at New York City Council New York City Council is committed to digital accessibility . New York City Council is proud to partner with Level Access to ensure our website is accessible and functional for all our customers while providing free assistive technology for people with physical disabilities. View New York City Council‘s  accessibility statement . What is it? Who is it for? How does it work? What is it? The technology is a suite of keyboard, mouse and touch replacement solutions designed to make the digital world accessible to people with physical disabilities . The application features tools such as: Hands-free mouse Voice commands Visual click assist On-screen keyboard Text-to-speech Easy to use and can be activated quickly Who is it for? People who have trouble typing, moving a mouse or reading due to a variety of conditions such as: Stroke/paralysis Arthritis Multiple Sclerosis (MS) Parkinson's disease Cerebral Palsy (CP) Dyslexia Mild visual impairment Limited proficiency in English Literacy deficiencies Other learning or reading issues How does it work? The assistive technology is available for Windows, Mac, and Android devices. Learn more about the system requirements and user guides . Level Access’s innovative assistive technology application enhances the customer experience for people with disabilities. Accessibility is the process of creating experiences that are usable by people with the widest possible range of abilities. This doesn’t only refer to people with disabilities, about 15% of the world’s population, but all people. Share Follow Level Access on LinkedIn Follow Level Access on LinkedIn Like Level Access on Facebook Like Level Access on Facebook Follow Level Access on X Follow Level Access on X Level Access Values Privacy Policy Terms of Service © 2025 Level Access . All rights reserved. © 2025 Level Access . Thank you for downloading our free assistive technology. Download our free assistive technology For support of the assistive technology, please contact Level Access: support@essentialaccessibility.com 1 (866) 333-3909 Close download modal dialog Back to top"
  },
  {
    "source": "https://council.nyc.gov/land-use/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate Planning & Land Use New York City regulates how land is used throughout the five boroughs. When regulations are changed, the City Council must approve the changes. Public Hearings April 23, 2025- Subcommittee on Zoning and Franchises; 10:00 am – 250 Broadway, 16th Floor Committee Room, New York, NY, 10007 To testify at this hearing on the following item(s), please register here. 73-99 Empire Boulevard Rezoning 166 Kings Highway Rezoning 2201-2227 Neptune Avenue Rezoning 19 Maspeth Avenue Rezoning You may submit written testimony to landusetestimony@council.nyc.gov . We will take written testimony up to 72 hours following the completion of the public hearing April 29, 2025 – Subcommittee on Zoning and Franchises; 10:00 am – City Hall Chambers, New York, NY, 10007 To testify at this hearing on the following item(s), please register here . Western Railyards Modifications Grace Houses You may submit written testimony to landusetestimony@council.nyc.gov . We will take written testimony up to 72 hours following the completion of the public hearing For questions about accessibility or to request ASL, CART, or any other accommodations please contact EEO Officer at EEOOfficer@council.nyc.gov or call (212) 788-6936 at least three (3) business days before the hearing. If you need non-English language interpretation, please email translationservice@council.nyc.gov , at least three (3) business days before the hearing. Please include the following information in your email: Name and date of the hearing Your full name, telephone number, and email address In-person hearings do not require pre-registration. For all other questions reference hearings, email hearings@council.nyc.gov or call 212-482-4219 . All individuals who wish to testify in person at City Hall must adhere to the following COVID-19 safety protocols: Properly wear a face covering at all times while in City Hall; Maintain physical distancing of 6 feet from others at all times except when not feasible in limited circumstances; and Complete a COVID-19 health screening questionnaire, which will be posted at the entrance to City Hall, prior to entering the building. City of Yes for Housing Opportunity On November 21, 2024, the Subcommittee on Zoning and Franchises and Committee on Land Use voted to approve this application with modifications, which are summarized in the document below: Summary of Council Modifications New York City Council held a Hybrid Public Meeting on October 21, 2024  and a Public Hearing on October 22, 2024 both at the Subcommittee on Zoning & Franchises. PUBLIC MEETING – Held October 21, 2024 The Council held a public meeting on this item at the subcommittee on zoning and franchises on October 21st. To view a recording of the October 21st public meeting on City of Yes for Housing Opportunity please see Subcommittee on Zoning and Franchises Public Meeting on City of Yes for Housing Opportunity, Oct 21, 2024 PUBLIC HEARING – Held October 22, 2024 The council held a public hearing on this item at the subcommittee on zoning and franchises on October 22 nd . To view a recording of the public hearing and all information for the October 22nd public hearing please see Subcommittee on Zoning & Franchises, Public hearing on City of Yes for Housing Opportunity, Oct 22, 2024 For more information on the City of Yes for Housing Opportunity text amendment please see these useful materials and links: City of Yes for Housing Opportunity Presentation Department of City Planning webpage – City of Yes, Housing Opportunity DCP Housing Opportunity Guide City of Yes Housing Opportunity text amendment City Planning Commission report City Planning Commission approved text amendment to the Zoning Resolution City of Yes: Zoning for Economic Opportunity Summary of Council Modifications and Commitments Use link above for summary of the eighteen “City of Yes” Zoning for Economic Opportunity (ZEO) citywide text amendment proposals and, where applicable, the final modifications made by the New York City Council, as well as related planning and policy commitments. Summary of Proposal 18 – New “M” Districts (with Council Mods) Highlighted Content: Speaker Adrienne Adams’ Planning & Land Use Guidelines and Toolkit Comprehensive planning must be featured throughout the land use process. Speaker Adams’ Planning and Land Use Toolkit provide Council Members, local communities, city agencies, and developers with a framework for improving the land use process to balance local community priorities with citywide needs. A pathway to increase housing production, affordability and equity is needed for our city. Housing Agenda to Confront the City’s Crisis New York City is growing, with its population and jobs far outpacing available homes and housing production. Rents are at historic highs and competition for housing is only increasing. If the city’s housing shortage remains unaddressed, New Yorkers will continue to be pushed out and homelessness will grow. We need to develop more affordable housing, senior housing, homeownership, and supportive housing, as well as market rate housing. Simultaneously, more efforts are needed to protect existing affordable housing and homeownership, and to ensure every New Yorker’s home is healthy and safe. Community Engagement Click on a link below to learn more about community engagement efforts that the City Council Planning and Land Use Division is currently supporting. Parkchester Community Engagement Session Land Use Committee The Council’s Land Use Committee has jurisdiction over all the types of actions listed above. The committee also has two subcommittees, each with its own Chair, that take care of specific sets of issues: Subcommittee on Zoning and Franchises Subcommittee on Landmarks, Public Sitings, and Dispositions A rezoning, for instance, would be handled by the Zoning and Franchises subcommittee, while the designation of a landmark would be handled by the Landmarks, Public Sitings, and Dispositions subcommittee. Links to Legistar: Committee on Land Use Subcommittee on Zoning and Franchises Subcommittee on Landmarks, Public Sitings, and Dispositions The Planning & Land Use Division The Council has a dedicated team of city planners, attorneys, and administrative staff that support Council Members and the Land Use Committee. This division helps the committee Chairs conduct hearings and analyze land use issues on behalf of Council Members. The Division was formerly known as the Land Use Division. City Council Speaker Adrienne Adams changed the name to the Planning & Land Use Division because planning must be at the forefront of the land use process. Planning means understanding the conditions and challenges facing our city and its neighborhoods, identifying shared goals and principles, and applying the policies to address and achieve them. Planning means being intentional about our future and making sure that our decisions collectively align with these goals. And last but not least planning requires meaningful and deep engagement of communities in this work. Before applications for land use changes begin public review and eventually reach the Council, there should be a planning process that involves understanding the conditions of the affected area and engaging stakeholders including Administration agencies and community members including residents and elected officials. Zoning Zoning controls what property owners can do with their land (such as build apartments or a factory) as well as how large buildings can be. When the Mayor or a developer wants to change the zoning, they must go through a public review process involving hearings at the Community Board, the Borough President, the City Planning Commission, and City Council. The Council has the final say in whether the zoning is changed. Landmarks The Landmarks Preservation Commission designates landmarks and historic districts. The Council can approve, modify, or disapprove the Commission’s decision. Once a building is “landmarked,” the owner must apply for permission to alter the façade, to build additions, or to demolish the building City Land & Public Facilities The City often buys, sells, or leases real estate for a specific purpose, such as building a new school, renting an office for an agency, or buying land upstate to protect the City’s water supply. Or the City might sell land to a business so they can expand and employ more people. Or the City might give land to a developer building affordable housing, often with tax exemptions that make the apartments even more affordable. When the City buys or sells land, or gives a tax exemption, the Council can approve or disapprove these actions. The Land Use Process at the Council Stage of ULURP Step 1: Submission of Application to Council Whenever any of the above actions takes place, the Council receives an application explaining the project. Council Members and staff then analyze the application and its potential consequences for the city as a whole, as well as for the local community. Step 2: Council Hearing When the Council receives a land use application, it’s referred to the appropriate subcommittee, which then holds a public hearing and votes on the application. Step 3: Land Use Committee After the subcommittee has heard and voted on the application, the Land Use Committee meets and votes on the application. Step 4: Council Vote The City Council will then hold a meeting with all 51 members and will vote on the application as a body. Step 5: Mayoral Approval or Veto The Mayor may either accept or veto the Council’s decision. However, the Council may override the Mayor’s veto with a 2/3 vote. Public Hearings April 23, 2025- Subcommittee on Zoning and Franchises; 10:00 am – 250 Broadway, 16th Floor Committee Room, New York, NY, 10007 To testify at this hearing on the following item(s), please register here. 73-99 Empire Boulevard Rezoning 166 Kings Highway Rezoning 2201-2227 Neptune Avenue Rezoning 19 Maspeth Avenue Rezoning You may submit written testimony to landusetestimony@council.nyc.gov . We will take written testimony up to 72 hours following the completion of the public hearing April 29, 2025 – Subcommittee on Zoning and Franchises; 10:00 am – City Hall Chambers, New York, NY, 10007 To testify at this hearing on the following item(s), please register here . Western Railyards Modifications Grace Houses You may submit written testimony to landusetestimony@council.nyc.gov . We will take written testimony up to 72 hours following the completion of the public hearing For questions about accessibility or to request ASL, CART, or any other accommodations please contact EEO Officer at EEOOfficer@council.nyc.gov or call (212) 788-6936 at least three (3) business days before the hearing. If you need non-English language interpretation, please email translationservice@council.nyc.gov , at least three (3) business days before the hearing. Please include the following information in your email: Name and date of the hearing Your full name, telephone number, and email address In-person hearings do not require pre-registration. For all other questions reference hearings, email hearings@council.nyc.gov or call 212-482-4219 . All individuals who wish to testify in person at City Hall must adhere to the following COVID-19 safety protocols: Properly wear a face covering at all times while in City Hall; Maintain physical distancing of 6 feet from others at all times except when not feasible in limited circumstances; and Complete a COVID-19 health screening questionnaire, which will be posted at the entrance to City Hall, prior to entering the building. City of Yes for Housing Opportunity On November 21, 2024, the Subcommittee on Zoning and Franchises and Committee on Land Use voted to approve this application with modifications, which are summarized in the document below: Summary of Council Modifications New York City Council held a Hybrid Public Meeting on October 21, 2024  and a Public Hearing on October 22, 2024 both at the Subcommittee on Zoning & Franchises. PUBLIC MEETING – Held October 21, 2024 The Council held a public meeting on this item at the subcommittee on zoning and franchises on October 21st. To view a recording of the October 21st public meeting on City of Yes for Housing Opportunity please see Subcommittee on Zoning and Franchises Public Meeting on City of Yes for Housing Opportunity, Oct 21, 2024 The Council held a public meeting on this item at the subcommittee on zoning and franchises on October 21st. To view a recording of the October 21st public meeting on City of Yes for Housing Opportunity please see Subcommittee on Zoning and Franchises Public Meeting on City of Yes for Housing Opportunity, Oct 21, 2024 PUBLIC HEARING – Held October 22, 2024 The council held a public hearing on this item at the subcommittee on zoning and franchises on October 22 nd . To view a recording of the public hearing and all information for the October 22nd public hearing please see Subcommittee on Zoning & Franchises, Public hearing on City of Yes for Housing Opportunity, Oct 22, 2024 The council held a public hearing on this item at the subcommittee on zoning and franchises on October 22 nd . To view a recording of the public hearing and all information for the October 22nd public hearing please see Subcommittee on Zoning & Franchises, Public hearing on City of Yes for Housing Opportunity, Oct 22, 2024 For more information on the City of Yes for Housing Opportunity text amendment please see these useful materials and links: City of Yes for Housing Opportunity Presentation Department of City Planning webpage – City of Yes, Housing Opportunity DCP Housing Opportunity Guide City of Yes Housing Opportunity text amendment City Planning Commission report City Planning Commission approved text amendment to the Zoning Resolution City of Yes: Zoning for Economic Opportunity Summary of Council Modifications and Commitments Use link above for summary of the eighteen “City of Yes” Zoning for Economic Opportunity (ZEO) citywide text amendment proposals and, where applicable, the final modifications made by the New York City Council, as well as related planning and policy commitments. Summary of Proposal 18 – New “M” Districts (with Council Mods) Highlighted Content: Speaker Adrienne Adams’ Planning & Land Use Guidelines and Toolkit Comprehensive planning must be featured throughout the land use process. Speaker Adams’ Planning and Land Use Toolkit provide Council Members, local communities, city agencies, and developers with a framework for improving the land use process to balance local community priorities with citywide needs. A pathway to increase housing production, affordability and equity is needed for our city. Housing Agenda to Confront the City’s Crisis New York City is growing, with its population and jobs far outpacing available homes and housing production. Rents are at historic highs and competition for housing is only increasing. If the city’s housing shortage remains unaddressed, New Yorkers will continue to be pushed out and homelessness will grow. We need to develop more affordable housing, senior housing, homeownership, and supportive housing, as well as market rate housing. Simultaneously, more efforts are needed to protect existing affordable housing and homeownership, and to ensure every New Yorker’s home is healthy and safe. Community Engagement Click on a link below to learn more about community engagement efforts that the City Council Planning and Land Use Division is currently supporting. Land Use Committee The Council’s Land Use Committee has jurisdiction over all the types of actions listed above. The committee also has two subcommittees, each with its own Chair, that take care of specific sets of issues: Subcommittee on Zoning and Franchises Subcommittee on Landmarks, Public Sitings, and Dispositions A rezoning, for instance, would be handled by the Zoning and Franchises subcommittee, while the designation of a landmark would be handled by the Landmarks, Public Sitings, and Dispositions subcommittee. Links to Legistar: Committee on Land Use Subcommittee on Zoning and Franchises Subcommittee on Landmarks, Public Sitings, and Dispositions The Planning & Land Use Division The Council has a dedicated team of city planners, attorneys, and administrative staff that support Council Members and the Land Use Committee. This division helps the committee Chairs conduct hearings and analyze land use issues on behalf of Council Members. The Division was formerly known as the Land Use Division. City Council Speaker Adrienne Adams changed the name to the Planning & Land Use Division because planning must be at the forefront of the land use process. Planning means understanding the conditions and challenges facing our city and its neighborhoods, identifying shared goals and principles, and applying the policies to address and achieve them. Planning means being intentional about our future and making sure that our decisions collectively align with these goals. And last but not least planning requires meaningful and deep engagement of communities in this work. Before applications for land use changes begin public review and eventually reach the Council, there should be a planning process that involves understanding the conditions of the affected area and engaging stakeholders including Administration agencies and community members including residents and elected officials. Zoning Zoning controls what property owners can do with their land (such as build apartments or a factory) as well as how large buildings can be. When the Mayor or a developer wants to change the zoning, they must go through a public review process involving hearings at the Community Board, the Borough President, the City Planning Commission, and City Council. The Council has the final say in whether the zoning is changed. Landmarks The Landmarks Preservation Commission designates landmarks and historic districts. The Council can approve, modify, or disapprove the Commission’s decision. Once a building is “landmarked,” the owner must apply for permission to alter the façade, to build additions, or to demolish the building City Land & Public Facilities The City often buys, sells, or leases real estate for a specific purpose, such as building a new school, renting an office for an agency, or buying land upstate to protect the City’s water supply. Or the City might sell land to a business so they can expand and employ more people. Or the City might give land to a developer building affordable housing, often with tax exemptions that make the apartments even more affordable. When the City buys or sells land, or gives a tax exemption, the Council can approve or disapprove these actions. The Land Use Process at the Council Stage of ULURP Step 1: Submission of Application to Council Whenever any of the above actions takes place, the Council receives an application explaining the project. Council Members and staff then analyze the application and its potential consequences for the city as a whole, as well as for the local community. Step 2: Council Hearing When the Council receives a land use application, it’s referred to the appropriate subcommittee, which then holds a public hearing and votes on the application. Step 3: Land Use Committee After the subcommittee has heard and voted on the application, the Land Use Committee meets and votes on the application. Step 4: Council Vote The City Council will then hold a meeting with all 51 members and will vote on the application as a body. Step 5: Mayoral Approval or Veto The Mayor may either accept or veto the Council’s decision. However, the Council may override the Mayor’s veto with a 2/3 vote.  Initiatives Parkchester 2024 Community Engagement Bronx Metro North Area Study (BMNS) Engagement Speaker Adams’ Planning Toolkit and Housing Agenda Gowanus Neighborhood Plan: Racial Equity Report on Housing and Opportunity Morningside Heights Planning Study Inwood Rezoning Jerome Avenue Neighborhood Plan Planning for Retail Diversity East Harlem Rezoning Greater East Midtown Plan History Until 1989, the Council had no authority over land use issues. The Board of Estimate had controlled land use issues throughout the five boroughs. However, in the 1980s, the Board of Estimate was declared unconstitutional. And in 1989, the Council was given its land use powers and created the Land Use Committee and the Land Use Division. Mayoral Agencies The City Council controls one specific part of the land use process, but Mayoral agencies handle many other aspects. The Department of City Planning is responsible for zoning, for instance, while the Landmarks Preservation Commission handles landmarks and historic districts. Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "https://council.nyc.gov/news/tag/video/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate Videos January 24, 2022 Speaker Adams and CMs Hold Rally in Support of Delivery Workers January 24, 2022 Speaker Adams and CMs Hold Rally in Support of Delivery Workers January 21, 2022 Speaker Adams Announces Committee Chairs January 21, 2022 Speaker Adams Announces Committee Chairs January 17, 2022 Speaker Adrienne Adams on MLK Jr. Day January 17, 2022 Speaker Adrienne Adams on MLK Jr. Day January 14, 2022 Adrienne Adams Elected Speaker of the New York City Council January 14, 2022 Adrienne Adams Elected Speaker of the New York City Council January 11, 2022 Charter Meting 2022 January 11, 2022 Charter Meting 2022 February 24, 2021 Vaccinate New York February 24, 2021 Vaccinate New York April 22, 2020 City Council Covid-19 relief package April 22, 2020 City Council Covid-19 relief package April 22, 2020 Our first ever virtual Stated Hearing April 22, 2020 Our first ever virtual Stated Hearing Page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Next Page Last Page Submit a “Freedom of Information Law” Request Subscribe to updates Search for: Recent Press Releases Statement from Speaker Adams on Mayoral Administration’s Announcement to Add City for All Funding for Supportive Housing, Homeownership Support, and Tenant Protections in FY26 Executive Budget April 28, 2025 April 28, 2025 Speaker Adrienne Adams Responds to New York State Supreme Court’s TRO Ruling to Block Mayor Adams’ Executive Order Inviting Trump’s ICE to Set Up Office on Rikers April 25, 2025 April 25, 2025 As Trump Administration Threatens Trans and Gender Non-Conforming New Yorkers, New York City Council Votes to Protect Civil Rights and Healthcare Access, Ensure Support April 24, 2025 April 24, 2025 NYC Council Releases Report Outlining Outdoor Dining Laws and Policies to Provide Clear Roadmap ahead of Hearing to Identify Problems Faced by Restaurants and Their Solutions April 23, 2025 April 23, 2025 NYC Council Launches Agency Report Card Initiative to Strengthen Government Accountability and Service Delivery April 21, 2025 April 21, 2025 Share your ideas for how to improve your community! Text Alerts To receive text alerts about when and where you can vote, text PBNYC to 212-676-8384 . Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "http://webapi.legistar.com/Home/Examples",
    "text": "Home API Examples Examples These examples will help you get started with the Legistar Web API.  To use the URLs below, replace {Client} with your client name.  Some clients require use of an API Token . To see all agenda matters, the endpoint is: https://webapi.legistar.com/v1/{Client}/matters Note that queries replies are limited to 1000 responses.  Even with this limit, some calls may return a large amount of data.  To make this query more performant by limiting reults to a smaller set of items or to obtain more items via a second query, use ODATA parameters to page the output like this: https://webapi.legistar.com/v1/{Client}/matters?$top=10&$skip=0\r\nhttps://webapi.legistar.com/v1/{Client}/matters?$top=10&$skip=10 ODATA can also use filters to find more specific data.  For instance, this query will return only events during the month of September, 2014: https://webapi.legistar.com/v1/{Client}/events?$filter=EventDate+ge+datetime%272014-09-01%27+and+EventDate+lt+datetime%272014-10-01%27 The basics of the ODATA URL setup are here: https://www.odata.org/documentation/odata-version-3-0/url-conventions/ The ODATA documentation does not cover all features, including the convenience method datetime’2014-09-01’ shown above. To see actions taken on a Matter (like a vote), look at the Matter Histories endpoint.  Filtering these items by MatterHistoryActionBodyName can help to limit the found actions to just those votes performed by a certain group, for instance just to votes made by the Common Council on a matter 1234: https://webapi.legistar.com/v1/{Client}/matters/1234/histories?$filter=MatterHistoryPassedFlag%20ne%20null%20and%20MatterHistoryActionBodyName%20eq%20%27Common%20Council%27 To then see the vote tally, use the returned Id (5678 in this example) with the EventItems Votes endpoint: https://webapi.legistar.com/v1/{Client}/eventitems/5678/votes There are many other items and relationships in the API.  If you have a specific use case, we’d be happy to help you find the appropriate calls. Tips http and https are both supported for GETs – please use as appropriate for your data and consumer. Items returned to GET requests are limited to those items marked as public and available for view on InSite. Limiting queries by paging and filtering will reduce both the load on the server and the time needed to return the requested data. Fields in the API do not reflect any label customization done for your specific site.  If you need help identifying a field’s relationship to your specific Legistar configuration, please ask. For an especially busy site, ordering by item IDs and paging with a filter GT (greater than) the highest returned ID in a set may be more stable.  If you find you are occasionally missing items in long list queries, this is worthwhile to investigate, but slightly more complex. Tokens Some clients require use of API tokens for access.  If the read-only operations above give an unauthorized response, please refer to that client for their token policy. If you have a token, it can be provided as a URL parameter to the https endpoint of this API. For example: https://webapi.legistar.com/v1/{Client}/matters?token=verylongbase64token © 2025 - Granicus Version: 25.2.10.0"
  },
  {
    "source": "https://www.linkedin.com/company/new-york-city-council",
    "text": "LinkedIn Articles Articles People People Learning Learning Jobs Jobs Games Games Get the app Get the app New York City Council Government Administration New York, NY 14,456 followers  The New York City Council is the law-making body of the City of New York, led by \nSpeaker Adrienne Adams. The New York City Council is the law-making body of the City of New York, led by \nSpeaker Adrienne Adams. Discover all 914 employees Discover all 914 employees Report this company About us The New York City Council is the law-making body of the City of New York. It is comprised of 51 members from 51 different Council Districts throughout the five boroughs. The Council monitors the operation and performance of city agencies, makes land use decisions and has sole responsibility for approving the city's budget. It also legislates on a wide range of other subjects. The Council is an equal partner with the Mayor in the governing of New York City. External link for New York City Council Locations Primary City Hall New York, NY 10007, US Get directions Primary City Hall New York, NY 10007, US Employees at New York City Council Jeffrey Campagna Senior Counsel & Parliamentarian, Office of General Counsel Jeffrey Campagna Senior Counsel & Parliamentarian, Office of General Counsel Andres Madrid Attorney Andres Madrid Attorney John Scott-Richardson John Scott-Richardson Lynn Schulman Lynn Schulman Updates New York City Council 14,456 followers 23h Report this post The Committee on Public Safety held an oversight hearing to question the NYPD regarding disproportionate traffic stops, lax parking permit enforcement, pedestrian and cyclist safety efforts, vehicle chases, and the ghost car task force. 1 Like Comment Share New York City Council 14,456 followers 23h Report this post The Committee on Public Safety held an oversight hearing to question the NYPD regarding disproportionate traffic stops, lax parking permit enforcement, pedestrian and cyclist safety efforts, vehicle chases, and the ghost car task force. 1 Like Comment Share 14,456 followers 23h Report this post The Committee on Public Safety held an oversight hearing to question the NYPD regarding disproportionate traffic stops, lax parking permit enforcement, pedestrian and cyclist safety efforts, vehicle chases, and the ghost car task force.     1 Like Comment Share New York City Council 14,456 followers 3d Report this post Please join us in wishing Council Member Mercedes Narcisse a very happy birthday! 🎂 1 1 Comment Like Comment Share New York City Council 14,456 followers 3d Report this post Please join us in wishing Council Member Mercedes Narcisse a very happy birthday! 🎂 1 1 Comment Like Comment Share 14,456 followers 3d Report this post Please join us in wishing Council Member Mercedes Narcisse a very happy birthday! 🎂  1 Like Comment Share New York City Council 14,456 followers 3d Report this post Please join us in wishing Council Member Christopher Marte a very happy birthday! 🎂 1 Like Comment Share New York City Council 14,456 followers 3d Report this post Please join us in wishing Council Member Christopher Marte a very happy birthday! 🎂 1 Like Comment Share 14,456 followers 3d Report this post Please join us in wishing Council Member Christopher Marte a very happy birthday! 🎂  1 Like Comment Share New York City Council 14,456 followers 3d Report this post RECAP: Earlier today, Council Members, advocates, and New Yorkers held a rally in response to the NY Supreme Court’s decision to extend an order blocking ICE on Rikers Island. …more 12 Like Comment Share New York City Council 14,456 followers 3d Report this post RECAP: Earlier today, Council Members, advocates, and New Yorkers held a rally in response to the NY Supreme Court’s decision to extend an order blocking ICE on Rikers Island. …more 12 Like Comment Share 14,456 followers 3d Report this post RECAP: Earlier today, Council Members, advocates, and New Yorkers held a rally in response to the NY Supreme Court’s decision to extend an order blocking ICE on Rikers Island. 12 Like Comment Share New York City Council 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share New York City Council 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream  Like Comment Share New York City Council 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share New York City Council 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share 14,456 followers 3d Report this post Monday at 1PM: \n\nThe Committee on Veterans will hold an oversight hearing on implementing recommendations from the council’s agency report card initiative, specifically as it relates to the Department of Veterans' Services. \n\n📺 Watch live: council.nyc.gov/livestream  Like Comment Share New York City Council 14,456 followers 4d Report this post Monday at 10AM: \n\nThe Committee on Public Safety will hold an oversight hearing on NYPD parking and traffic enforcement. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share New York City Council 14,456 followers 4d Report this post Monday at 10AM: \n\nThe Committee on Public Safety will hold an oversight hearing on NYPD parking and traffic enforcement. \n\n📺 Watch live: council.nyc.gov/livestream Like Comment Share 14,456 followers 4d Report this post Monday at 10AM: \n\nThe Committee on Public Safety will hold an oversight hearing on NYPD parking and traffic enforcement. \n\n📺 Watch live: council.nyc.gov/livestream  Like Comment Share New York City Council 14,456 followers 4d Report this post I was honored to present a @NYCCouncil proclamation to community leader Harpreet Singh Toor.\n\nFor over 30 years, Harpreet has worked with elected officials, agencies, and institutions to ensure our Sikh community is supported.\n\nCongratulations on this well-deserved recognition! Like Comment Share New York City Council 14,456 followers 4d Report this post I was honored to present a @NYCCouncil proclamation to community leader Harpreet Singh Toor.\n\nFor over 30 years, Harpreet has worked with elected officials, agencies, and institutions to ensure our Sikh community is supported.\n\nCongratulations on this well-deserved recognition! Like Comment Share 14,456 followers 4d Report this post I was honored to present a @NYCCouncil proclamation to community leader Harpreet Singh Toor.\n\nFor over 30 years, Harpreet has worked with elected officials, agencies, and institutions to ensure our Sikh community is supported.\n\nCongratulations on this well-deserved recognition!  Like Comment Share New York City Council 14,456 followers 4d Report this post Tonight, New Yorkers joined us in the People's House for our annual Sikh Heritage Month & Vaisakhi celebration! Like Comment Share New York City Council 14,456 followers 4d Report this post Tonight, New Yorkers joined us in the People's House for our annual Sikh Heritage Month & Vaisakhi celebration! Like Comment Share 14,456 followers 4d Report this post Tonight, New Yorkers joined us in the People's House for our annual Sikh Heritage Month & Vaisakhi celebration!     Like Comment Share New York City Council 14,456 followers 4d Report this post At a time when our trans and gender non-conforming neighbors are under attack, the Council has prioritized policies to protect the rights of gender expansive New Yorkers.  \n\n@CMShahanaHanif explains the package of legislation passed today and the urgency of this moment ⬇️ …more 6 Like Comment Share New York City Council 14,456 followers 4d Report this post At a time when our trans and gender non-conforming neighbors are under attack, the Council has prioritized policies to protect the rights of gender expansive New Yorkers.  \n\n@CMShahanaHanif explains the package of legislation passed today and the urgency of this moment ⬇️ …more 6 Like Comment Share 14,456 followers 4d Report this post At a time when our trans and gender non-conforming neighbors are under attack, the Council has prioritized policies to protect the rights of gender expansive New Yorkers.  \n\n@CMShahanaHanif explains the package of legislation passed today and the urgency of this moment ⬇️ 6 Like Comment Share Join now to see what you are missing Find people you know at New York City Council Find people you know at New York City Council Browse recommended jobs for you Browse recommended jobs for you View all updates, news, and articles View all updates, news, and articles Similar pages City of New York Government Administration New York, New York City of New York Government Administration New York, New York NYC Office of the Mayor Government Administration NYC Office of the Mayor Government Administration New York State Assembly Legislative Offices Albany, NY New York State Assembly Legislative Offices Albany, NY New York State Senate Government Administration Albany, NY New York State Senate Government Administration Albany, NY New York State Executive Chamber Government Administration Albany , New York New York State Executive Chamber Government Administration Albany , New York Office of the Mayor of New York City Government Administration New York, NY Office of the Mayor of New York City Government Administration New York, NY Office of the New York State Attorney General Law Enforcement Office of the New York State Attorney General Law Enforcement NYC Department of Education Primary and Secondary Education New York, NY NYC Department of Education Primary and Secondary Education New York, NY U.S. House of Representatives Legislative Offices Washington, DC U.S. House of Representatives Legislative Offices Washington, DC NYC Department of Social Services Government Administration New York, New York NYC Department of Social Services Government Administration New York, New York Browse jobs Analyst jobs 694,057 open jobs Analyst jobs Attorney jobs 37,177 open jobs Attorney jobs Investigator jobs 19,811 open jobs Investigator jobs Associate jobs 1,091,945 open jobs Associate jobs Assistant jobs 711,811 open jobs Assistant jobs Senior Human Resources Associate jobs 8,460 open jobs Senior Human Resources Associate jobs Public Health Specialist jobs 7,752 open jobs Public Health Specialist jobs Community Outreach Coordinator jobs 5,998 open jobs Community Outreach Coordinator jobs Compliance Associate jobs 65,598 open jobs Compliance Associate jobs Crime Analyst jobs 7,184 open jobs Crime Analyst jobs Director of Investigations jobs 3,906 open jobs Director of Investigations jobs Business Intern jobs 22,088 open jobs Business Intern jobs Talent jobs 573,981 open jobs Talent jobs Executive jobs 690,514 open jobs Executive jobs Employee Relations Specialist jobs 15,658 open jobs Employee Relations Specialist jobs Receptionist jobs 64,579 open jobs Receptionist jobs Coordinator jobs 545,033 open jobs Coordinator jobs Legal Assistant jobs 23,617 open jobs Legal Assistant jobs Researcher jobs 195,654 open jobs Researcher jobs Project Manager jobs 253,048 open jobs Project Manager jobs Associate jobs Scientist jobs Nonprofit jobs Investigations Manager jobs Investigator jobs Environmental Consultant jobs Deputy Chief of Staff jobs Marketing Intern jobs Sustainability Consultant jobs Research Intern jobs Analyst jobs Executive jobs Summer Intern jobs Receptionist jobs Director of Partnerships jobs Director of Advocacy jobs Lobbyist jobs Environmental Analyst jobs Director of Business Development jobs Intern jobs Press Secretary jobs Chief Information Officer jobs Mayor jobs Investment Banking Analyst jobs Attorney jobs Research Assistant jobs Partner jobs Officer jobs Administrative Coordinator jobs Paralegal jobs Project Assistant jobs Senior Product Manager jobs Staff Writer jobs Legal Assistant jobs Research Analyst jobs Office Manager jobs Buyer jobs Coordinator jobs Junior Scientist jobs Assistant jobs Marketing Manager jobs Developer jobs Legal Counsel jobs Manager jobs Communications Manager jobs Legislative Director jobs Executive Assistant jobs Emergency Medical Technician jobs Director jobs Behavior Specialist jobs Professor jobs Support Specialist jobs Assistant Psychologist jobs Virtual Assistant jobs Program Officer jobs Human Resources Specialist jobs Specialist jobs Psychologist jobs Human Resources Business Partner jobs Talent Acquisition Specialist jobs Associate jobs Scientist jobs Nonprofit jobs Investigations Manager jobs Investigator jobs Environmental Consultant jobs Deputy Chief of Staff jobs Marketing Intern jobs Sustainability Consultant jobs Research Intern jobs Analyst jobs Executive jobs Summer Intern jobs Receptionist jobs Director of Partnerships jobs Director of Advocacy jobs Lobbyist jobs Environmental Analyst jobs Director of Business Development jobs Intern jobs Press Secretary jobs Chief Information Officer jobs Mayor jobs Investment Banking Analyst jobs Attorney jobs Research Assistant jobs Partner jobs Officer jobs Administrative Coordinator jobs Paralegal jobs Project Assistant jobs Senior Product Manager jobs Staff Writer jobs Legal Assistant jobs Research Analyst jobs Office Manager jobs Buyer jobs Coordinator jobs Junior Scientist jobs Assistant jobs Marketing Manager jobs Developer jobs Legal Counsel jobs Manager jobs Communications Manager jobs Legislative Director jobs Executive Assistant jobs Emergency Medical Technician jobs Director jobs Behavior Specialist jobs Professor jobs Support Specialist jobs Assistant Psychologist jobs Virtual Assistant jobs Program Officer jobs Human Resources Specialist jobs Specialist jobs Psychologist jobs Human Resources Business Partner jobs Talent Acquisition Specialist jobs LinkedIn © 2025 LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Your California Privacy Choices Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at New York City Council Welcome back   or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . LinkedIn LinkedIn is better on the app Don’t have the app? Get it in the Microsoft Store."
  },
  {
    "source": "https://council.nyc.gov/district-10/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 10 Carmen De La Rosa Washington Heights, Inwood, Marble Hill Carmen De La Rosa emigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent her community as the State Assembly Member of the 72nd District. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice. As a progressive Democrat, Carmen has fought for criminal justice reform, workers’ rights, truly affordable housing and protections for tenants, climate justice, taxing the wealthy, LGBTIA rights, and many other consequential social justice policies. She successfully negotiated and passed the New York State DREAM ACT and the first in the nation Excluded Workers Fund (EWF) at $2.1 Billion. As the member of the Assembly representing the district with the highest number of rent-stabilized apartments, Carmen actively participated in passing the strongest tenant protection laws in a generation. On June 22nd, 2021, Carmen was victorious in the Democratic primary and subsequently won the general election on November 2nd, becoming the first Dominican woman elected to represent District 10 at City Hall. … READ MORE Committees Committee on Health Committee on Public Safety Committee on Transportation and Infrastructure Committee on Civil Service and Labor (Chair) Committee on Fire and Emergency Management Committee on Immigration Caucuses Black, Latino and Asian Caucus Women’s Caucus (Co-Chair) Progressive Caucus Carmen De La Rosa emigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent her community as the State Assembly Member of the 72nd District. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice. As a progressive Democrat, Carmen has fought for criminal justice reform, workers’ rights, truly affordable housing and protections for tenants, climate justice, taxing the wealthy, LGBTIA rights, and many other consequential social justice policies. She successfully negotiated and passed the New York State DREAM ACT and the first in the nation Excluded Workers Fund (EWF) at $2.1 Billion. As the member of the Assembly representing the district with the highest number of rent-stabilized apartments, Carmen actively participated in passing the strongest tenant protection laws in a generation. On June 22nd, 2021, Carmen was victorious in the Democratic primary and subsequently won the general election on November 2nd, becoming the first Dominican woman elected to represent District 10 at City Hall. … READ MORE Committees Committee on Health Committee on Public Safety Committee on Transportation and Infrastructure Committee on Civil Service and Labor (Chair) Committee on Fire and Emergency Management Committee on Immigration Caucuses Black, Latino and Asian Caucus Women’s Caucus (Co-Chair) Progressive Caucus Biography Staff Directory News District Office 618 W. 177th Street, Ground Floor New York, NY 10033 Phone: 917-521-2616 Fax: 917-521-1293 Legislative Office 250 Broadway, Suite 1880 New York, NY 10007 Phone: 212-788-7053 Fax: 212-227-5636 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  },
  {
    "source": "https://council.nyc.gov/carmen-de-la-rosa/",
    "text": "New York City Council Search for:   Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 10 Carmen De La Rosa Washington Heights, Inwood, Marble Hill Biography Carmen De La Rosa emigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent her community as the State Assembly Member of the 72nd District. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice. As a progressive Democrat, Carmen has fought for criminal justice reform, workers’ rights, truly affordable housing and protections for tenants, climate justice, taxing the wealthy, LGBTIA rights, and many other consequential social justice policies. She successfully negotiated and passed the New York State DREAM ACT and the first in the nation Excluded Workers Fund (EWF) at $2.1 Billion. As the member of the Assembly representing the district with the highest number of rent-stabilized apartments, Carmen actively participated in passing the strongest tenant protection laws in a generation. On June 22nd, 2021, Carmen was victorious in the Democratic primary and subsequently won the general election on November 2nd, becoming the first Dominican woman elected to represent District 10 at City Hall. Carmen will fight to make sure that the needs of our community are at the forefront. She will fight to protect our community from irresponsible development and displacement, dismantle fundamental flaws in our criminal justice system, expand our social safety nets, fix our broken education system, and protect frontline workers and vulnerable small businesses. Carmen De La Rosa is committed to building a community-driven government rooted in the principles of co-governance and participatory democracy. Working alongside the community she is committed to improving the lives of residents in the community. Carmen is proudly Mia’s Mom, raising her daughter in the community where her parents also reside. As a proud product of uptown, Carmen looks forward to continuing to serve the community she loves and the community that helped raise her. Biography Carmen De La Rosa emigrated from the Dominican Republic as a child and grew up in Inwood where she has lived her entire life. Her advocacy and passion for justice are deeply influenced by her roots. She has listened and advocated for the most vulnerable, even before she started her career in government. In November 2016, Carmen was elected to represent her community as the State Assembly Member of the 72nd District. Since her first day in office, Carmen has fought against racism, xenophobia and economic injustice. As a progressive Democrat, Carmen has fought for criminal justice reform, workers’ rights, truly affordable housing and protections for tenants, climate justice, taxing the wealthy, LGBTIA rights, and many other consequential social justice policies. She successfully negotiated and passed the New York State DREAM ACT and the first in the nation Excluded Workers Fund (EWF) at $2.1 Billion. As the member of the Assembly representing the district with the highest number of rent-stabilized apartments, Carmen actively participated in passing the strongest tenant protection laws in a generation. On June 22nd, 2021, Carmen was victorious in the Democratic primary and subsequently won the general election on November 2nd, becoming the first Dominican woman elected to represent District 10 at City Hall. Carmen will fight to make sure that the needs of our community are at the forefront. She will fight to protect our community from irresponsible development and displacement, dismantle fundamental flaws in our criminal justice system, expand our social safety nets, fix our broken education system, and protect frontline workers and vulnerable small businesses. Carmen De La Rosa is committed to building a community-driven government rooted in the principles of co-governance and participatory democracy. Working alongside the community she is committed to improving the lives of residents in the community. Carmen is proudly Mia’s Mom, raising her daughter in the community where her parents also reside. As a proud product of uptown, Carmen looks forward to continuing to serve the community she loves and the community that helped raise her. Biography Staff Directory News District Office 618 W. 177th Street, Ground Floor New York, NY 10033 Phone: 917-521-2616 Fax: 917-521-1293 Legislative Office 250 Broadway, Suite 1880 New York, NY 10007 Phone: 212-788-7053 Fax: 212-227-5636 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here.        About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement  General Inquiries Error: Contact form not found. ×"
  }
]