[
  {
    "candidate": "Athayde, Kyle",
    "category": "Education",
    "score": 7,
    "link": "http://www.kyleathaydedanceparty.com/menu",
    "text": "Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us Meet The Band Who is Kyle Athayde? Photo: Harrison Linsey Kyle Athayde is a San Francisco Bay Area based composer, arranger, performer, teacher, and bandleader. A native of Orinda, California, Kyle primarily plays vibraphone, piano, trumpet, and drums, as well as bongo, congas, timbales, string bass, bass clarinet, sousaphone, and vocal percussion. He is the leader, conductor, and principal writer for the San Francisco/New York based big band, \"Kyle Athayde Dance Party\", a group acclaimed for its versatility in the wide scope of styles it performs. He is also the composer and arranger for Eddie Barbash’s double quartet, as well as a member of the Nate Sparks Big Band, the Jon Hatamiya Big Band and Nonet, Ryan DeWeese’s RADJazz Orchestra. Influenced by the music of J. S. Bach, Duke Ellington, Pyotr Ilyich Tchaikovsky, Eric Dolphy, Dmitri Shostakovich, Louis Armstrong, Igor Stravinsky, Charlie Parker, Olivier Messiaen, Art Tatum, and many others, Athayde composes and arranges music in a variety of genres, with an emphasis on jazz, classical, salsa, and electronic. While an undergraduate student at Juilliard, Kyle was heavily immersed in an inter-disciplinary arts environment which included dance, drama, and music, which provided him the opportunity to further develop and refine his programmatic approach to composition. Athayde’s recent commissioned compositions and premieres include a double concerto for the New York Sinfonietta, a tone poem for Bobby Sanabria and The Manhattan School of Music Afro-Cuban Jazz Orchestra (the title track of their most recent album, ¡QUE VIVA HARLEM!), and music for the ending credits of the film \"Diller, Scofidio + Renfro: Reimagining Lincoln Center and the High Line.\" He also arranged the music for the halftime show for the University of California at Berkeley Marching Band in their final performance of the 2013 season. Kyle has also written commissions for the Canadian Brass, The New York Trumpet Ensemble, Manhattan School of Music Trumpet Ensemble, The University of Scranton, and the San Francisco Conservatory Brass Choir. Committed to inter-disciplinary educational outreach in the arts, Kyle has offered classes, clinics, lessons and masterclasses at schools, workshops, and camps in California, New York, Pennsylvania, Texas, and Alaska. A regular visiting faculty member of the Sitka Fine Arts Camp, he developed and taught classes on video game music, vocal hip hop, and jazz bands. He is the Director of Curriculum at the Lafayette Summer Music Workshop, and regularly offers clinics and masterclasses to middle school and high school bands throughout Northern California. Kyle has a wide range of interests, and loves to teach and learn about a variety of subjects, which brings a wide stylistic variety to his music, as his diverse interests inspire his work. A passionate fan of American football, the ruthless power and strategy of the sport influence his exciting writing style. An avid gamer, the music of these games has inspired some of his most unusual and engaging compositions. Individual band member bios coming soon! All photos on this webpage were taken by Harrison Linsey, Silvie Cheng, and Dan Chmielinski. All rights reserved. Click to Download mp3: Super Mario Ground Theme Take The A Train The Wolf Girl The Killer The Movement Chelsea Bridge L's Shadow Mr. Sandman Haus of Claus CONTACT US! We love to hear from our fans. Click the link above if you have any questions about the Dance Party or would like to hire us for an event."
  },
  {
    "candidate": "Athayde, Kyle",
    "category": "Uncategorized",
    "score": 0,
    "link": "http://www.kyleathaydedanceparty.com/listen/",
    "text": "Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us 2013 Demo: The First Cuts Kyle Athayde Dance Party We encourage you to download, share, and listen to the tracks above. If you do take a little bit of the Kyle Athayde Dance Party home with you, please consider clicking the donate button below and pay what you can afford; you decide the price! It's your donations that lead to other recordings of the band, KADP merchandise and hopefully a performance near you! 4:14 Take The A Train 6:19 Super Mario Ground Theme 6:41 The Wolf Girl 4:56 The Killer 9:39 The Movement 8:50 Chelsea Bridge 5:57 L's Shadow 3:29 Mr. Sandman 8:26 Haus of Claus All photos on this webpage were taken by Harrison Linsey, Silvie Cheng, and Dan Chmielinski. All rights reserved. Click to Download mp3: Super Mario Ground Theme Take The A Train The Wolf Girl The Killer The Movement Chelsea Bridge L's Shadow Mr. Sandman Haus of Claus CONTACT US! We love to hear from our fans. Click the link above if you have any questions about the Dance Party or would like to hire us for an event."
  },
  {
    "candidate": "Athayde, Kyle",
    "category": "Uncategorized",
    "score": 0,
    "link": "http://www.kyleathaydedanceparty.com/",
    "text": "We're mixing our Afro-Cuban Album! Lookout for tour/release updates! DONATE NOW ENTER SITE DONATE TO THE NEW ALBUM"
  },
  {
    "candidate": "Athayde, Kyle",
    "category": "Uncategorized",
    "score": 0,
    "link": "http://www.kyleathaydedanceparty.com/welcome",
    "text": "Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us Welcome Welcome Purchase Sheet Music Purchase Sheet Music Meet The Band Meet The Band Our Offerings Our Offerings Performances Performances Listen Listen Photos Photos Contact Us Contact Us The Kyle Athayde Dance Party Where can we be seen? The Kyle Athayde Dance Party Official website of the New York/San Francisco-based big band. SCROLL DOWN The Kyle Athayde Dance Party Official website of the New York/San Francisco-based big band. View fullsize Leo Pellegrino and the KADP live at Dizzy's Club Coca Cola. Photos: Silvie Cheng Why listen to us? Kyle's music draws inspiration from a wide variety of sources, from video games and internet memes to jazz and classical masterworks. The arc of a Dance Party performance ranges from images of nature to Japanese Anime scenes to Swing, Hip-Hop, and Rock grooves. In addition to original music, Kyle also writes arrangements of well-known and popular songs of all kinds, while still retaining the unique sound and excitement for which the Dance Party is known. Where can we be seen? The KADP performs regularly around New York City and the San Francisco Bay Area in a wide variety of venues, such as The Garage Restaurant and Cafe, Armando’s, The Zinc Bar, and Dizzy's Club at Jazz at Lincoln Center. On particularly sunny days in the spring and fall you can find us performing outside at places like Washington Square Park, Union Square, and the Lafayette Plaza. We encourage you to check out our performances page and follow us on social media to keep up with all our events. You can find us on Facebook and follow us on Twitter ! Where can we be seen? The KADP performs regularly around New York City and the San Francisco Bay Area in a wide variety of venues, such as The Garage Restaurant and Cafe, Armando’s, The Zinc Bar, and Dizzy's Club at Jazz at Lincoln Center. On particularly sunny days in the spring and fall you can find us performing outside at places like Washington Square Park, Union Square, and the Lafayette Plaza. We encourage you to check out our performances page and follow us on social media to keep up with all our events. You can find us on Facebook and follow us on Twitter ! View fullsize View fullsize View fullsize All photos on this webpage were taken by Harrison Linsey, Silvie Cheng, and Dan Chmielinski. All rights reserved. Click to Download mp3: Super Mario Ground Theme Take The A Train The Wolf Girl The Killer The Movement Chelsea Bridge L's Shadow Mr. Sandman Haus of Claus CONTACT US! We love to hear from our fans. Click the link above if you have any questions about the Dance Party or would like to hire us for an event."
  }
]