[
  {
    "candidate": "Felder, Simcha",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://www.nysenate.gov/senators/simcha-felder/contact",
    "text": "former New York State Senator Simcha Felder Served from January 1, 2013 – April 9, 2025 About Our District Newsroom Legislation Events Contact Search Search icon Search login Search Search icon Search Contact Senator Simcha Felder's Office District Office 1412 Avenue J, Suite 2E Brooklyn, NY 11230 Phone: (718) 253-2015 Fax: (718) 253-2030 Office Hours: District Office map Albany Office 809 Legislative Office Building Albany, NY 12247 Phone: (518) 455-2754 Fax: (518) 426-6931 Office Hours: Albany Office map Email Address: felder@nysenate.gov Media Inquiries stoiv@nysenate.gov Phone: (917) 332-7508 Send a message to Simcha Felder's office If you would like to send a message related to legislation or issues, please create an account here . Inquiry General Inquiry Press Inquiry First name Last name Subject Message Your e-mail address Phone Number (Optional) Street Address City Zip Leave this field blank Contact Senator Simcha Felder's Office District Office 1412 Avenue J, Suite 2E Brooklyn, NY 11230 Phone: Fax: Office Hours: Albany Office 809 Legislative Office Building Albany, NY 12247 Phone: Fax: Office Hours: Email Address: Media Inquiries Phone: Send a message to Simcha Felder's office If you would like to send a message related to legislation or issues, please create an account here . Inquiry NYSenate.gov Socials Follow the New York State Senate News & Issues Senators & Committees Bills & Laws Budget Events About the Senate Footer Right Contact the Senate Report a Website Issue Home Rule Form Site Policies About this Website GET INVOLVED"
  },
  {
    "candidate": "Felder, Simcha",
    "category": "Public Transit",
    "score": 2,
    "link": "https://council.nyc.gov/simcha-felder/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 44 Simcha Felder Bensonhurst, Gravesend (West), Sunset Park (East)-Borough Park (West), Borough Park, Mapleton-Midwood (West), Midwood, Gravesend (East)-Homecrest Biography Biography coming soon! Biography Biography coming soon! Biography News District Office 4424 16th Avenue Brooklyn, NY 11204 718-853-2704 Legislative Office 250 Broadway Room 1738 New York, NY 10007 212-788-7357 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  },
  {
    "candidate": "Felder, Simcha",
    "category": "LGBTQ+ Rights",
    "score": 2,
    "link": "https://council.nyc.gov/simcha-felder/",
    "text": "New York City Council Search for: Find My District Budget Committees Land Use Legislation Press Releases Translate this page Google Translate District 44 Simcha Felder Bensonhurst, Gravesend (West), Sunset Park (East)-Borough Park (West), Borough Park, Mapleton-Midwood (West), Midwood, Gravesend (East)-Homecrest Biography Biography coming soon! Biography Biography coming soon! Biography News District Office 4424 16th Avenue Brooklyn, NY 11204 718-853-2704 Legislative Office 250 Broadway Room 1738 New York, NY 10007 212-788-7357 Visit the Council We're located at New York City Hall. Council Members each have an office at 250 Broadway , as well as offices in each of their districts. We want to hear from you You can reach us via social media, email, paper mail, or at your district office. For issues specific to a neighborhood, it's best to contact the Council Member representing that community. Have questions, comments or feedback? Email us here. About Events What we do Caucuses Visit the Council District Info Job Opportunities Collective Bargaining Agreement Subscribe for Updates Our Privacy Policy Legislation Our Legislative Process Register to Testify Hearing Calendar and Video Archive Search legislation Legislative API Data Press & News Submit a “Freedom of Information Law” (FOIL) Request Press Releases Photos Past Featured Content Videos Media Inquiries For media inquiries, please contact press@council.nyc.gov Accessibility Read our Accessibility Statement General Inquiries Error: Contact form not found. ×"
  }
]