[
  {
    "candidate": "Fishermen, Allen",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://puntaallenmexico.com/",
    "text": "Not Acceptable! An appropriate representation of the requested resource could not be found on this server. This error was generated by Mod_Security."
  },
  {
    "candidate": "Fishermen, Allen",
    "category": "Civil Rights & Discrimination",
    "score": 9,
    "link": "https://allenflyfishing.com/",
    "text": "Sale Fly Reels Kraken XLA Series Kraken Series Alpha Series ATS Series Source Series Spare Spools Kraken XLA Series Kraken XLA Series Kraken Series Kraken Series Alpha Series Alpha Series ATS Series ATS Series Source Series Source Series Spare Spools Spare Spools Rods Volant Series Heritage Series Alluvion Series Compass Series Source Series Volant Series Volant Series Heritage Series Heritage Series Alluvion Series Alluvion Series Compass Series Compass Series Source Series Source Series Fly Tying Hooks Barbless Fly Tying Hooks Dry Fly Jig Nymph Streamer Wet Fly Carp Egg Multipurpose Saltwater Terrestrial Barbless Fly Tying Hooks Barbless Fly Tying Hooks Dry Fly Dry Fly Jig Jig Nymph Nymph Streamer Streamer Wet Fly Wet Fly Carp Carp Egg Egg Multipurpose Multipurpose Saltwater Saltwater Terrestrial Terrestrial Fly Tying Beads Tungsten Beads Brass Beads Dumbells Beadchain Eyes Tungsten Beads Tungsten Beads Brass Beads Brass Beads Dumbells Dumbells Beadchain Eyes Beadchain Eyes Accessories & Apparel Accessories Leaders Apparel Accessories Accessories Leaders Leaders Apparel Apparel 0 Menu Sale Fly Reels Loading image: Fly Reels Fly Reels Kraken XLA Series Kraken Series Alpha Series ATS Series Source Series Spare Spools View Fly Reels Loading image: Fly Reels Kraken XLA Series Kraken Series Alpha Series ATS Series Source Series Spare Spools Rods Loading image: Rods Volant Series Heritage Series Alluvion Series Compass Series Source Series View Rods Loading image: Volant Series Heritage Series Alluvion Series Compass Series Source Series Fly Tying Hooks Loading image: Fly Tying Hooks Barbless Fly Tying Hooks Dry Fly Jig Nymph Streamer Wet Fly Carp Egg Multipurpose Saltwater Terrestrial View Fly Tying Hooks Loading image: Barbless Fly Tying Hooks Dry Fly Jig Nymph Streamer Wet Fly Carp Egg Multipurpose Saltwater Terrestrial Fly Tying Beads Loading image: Silver Fly Tying Beads Tungsten Beads Brass Beads Dumbells Beadchain Eyes View Fly Tying Beads Loading image: Silver Tungsten Beads Brass Beads Dumbells Beadchain Eyes Accessories & Apparel Loading image: Accessories & Apparel Accessories Leaders Apparel View Accessories & Apparel Loading image: Accessories Leaders Apparel Info@allenflyfishing.com Join Our Newsletter Reel in exclusive offers, expert tips, and first casts at new gear. Join our community of passionate anglers and stay ahead of the stream! Loading image: Loading image: Spring Is Here - Upgrade Your Gear This Season! Explore Our Premium Collection of Fly Rods and Reels Loading image: Alpha Series Reel $209.99 $209.99 $209.99 Alpha Series Reel Alpha Series Reel Alpha Series Reel Loading image: Kraken XLA Series Reel $199.99 $399.99 $199.99 $199.99 $399.99 $399.99 Kraken XLA Series Reel Kraken XLA Series Reel Kraken XLA Series Reel Loading image: Kraken Series Reel $149.99 $299.99 $149.99 $149.99 $299.99 $299.99 Kraken Series Reel Kraken Series Reel Kraken Series Reel Sold Out Sold Out Loading image: Source Reel Series $79.99 $79.99 $79.99 Source Reel Series Source Reel Series Sold Out Sold Out Source Reel Series Loading image: ATS Series Reel $65.00 $129.99 $65.00 $65.00 $129.99 $129.99 ATS Series Reel ATS Series Reel ATS Series Reel Loading image: Volant Rod Series $259.99 $259.99 $259.99 Volant Rod Series Volant Rod Series Volant Rod Series Loading image: Alluvion Rod Series $229.99 $229.99 $229.99 Alluvion Rod Series Alluvion Rod Series Alluvion Rod Series Loading image: Compass Rod Series $149.99 $149.99 $149.99 Compass Rod Series Compass Rod Series Compass Rod Series Loading image: Heritage Rod Series from $74.99 $189.99 from $74.99 $74.99 $189.99 $189.99 Heritage Rod Series Heritage Rod Series Heritage Rod Series Loading image: Fly Tying Hooks Loading image: Slotted Tungsten Beads Tungsten Beads Loading image: Brass Barbell w/eyes Brass Beads Unleash the Kraken: The Ultimate Saltwater Fly Reel Loading image: Loading image: Control how much of each overlapping image is shown Black Dorado Blog posts Loading image: Exciting Changes at Allen Fly Fishing: Welcoming New Leadership and Reviving Customer Favorites Sep 13, 2024 Exciting Changes at Allen Fly Fishing: Welcoming New Leadership and Reviving Customer Favorites Read more Loading image: Building Toward An Exciting Year Feb 24, 2020 Building Toward An Exciting Year Read more Loading image: It&#39;s Resolution Time! Jan 3, 2020 It's Resolution Time! Read more Our Location 565 Commerce St Ste 100 Southlake, Tx 76092 Info@Allenflyfishing.com Monday - Friday - 9:00am to 5:00pm Saturday - Sunday - Closed Loading image: Loading image: Founded in 2007, Allen Fly Fishing started with a focus on premium fly hooks and beads. Over the years, we’ve evolved into a respected name in the fly fishing community, expanding our offerings to include a wide range of high-quality gear. Our commitment to innovation is exemplified by our award-winning Omega series, soon making its highly anticipated return. At"
  },
  {
    "candidate": "Fishermen, Allen",
    "category": "Government & Ethics",
    "score": 4,
    "link": "https://allenflyfishing.com/",
    "text": "Allen Fly Fishing, we’re dedicated to enhancing your fishing experience with reliable products that inspire your next adventure. Join Our Newsletter Reel in exclusive offers, expert tips, and first casts at new gear. Join our community of passionate anglers and stay ahead of the stream! Information Contact Us Refund Policy Shipping Policy Privacy Policy Contact Info@allenflyfishing.com Australia (USD $) Australia (USD $) (USD $) Austria (USD $) Austria (USD $) (USD $) Belgium (USD $) Belgium (USD $) (USD $) Canada (USD $) Canada (USD $) (USD $) Czechia (USD $) Czechia (USD $) (USD $) Denmark (USD $) Denmark (USD $) (USD $) Finland (USD $) Finland (USD $) (USD $) France (USD $) France (USD $) (USD $) Germany (USD $) Germany (USD $) (USD $) Hong Kong SAR (USD $) Hong Kong SAR (USD $) (USD $) Ireland (USD $) Ireland (USD $) (USD $) Israel (USD $) Israel (USD $) (USD $) Italy (USD $) Italy (USD $) (USD $) Japan (USD $) Japan (USD $) (USD $) Malaysia (USD $) Malaysia (USD $) (USD $) Netherlands (USD $) Netherlands (USD $) (USD $) New Zealand (USD $) New Zealand (USD $) (USD $) Norway (USD $) Norway (USD $) (USD $) Poland (USD $) Poland (USD $) (USD $) Portugal (USD $) Portugal (USD $) (USD $) Singapore (USD $) Singapore (USD $) (USD $) South Korea (USD $) South Korea (USD $) (USD $) Spain (USD $) Spain (USD $) (USD $) Sweden (USD $) Sweden (USD $) (USD $) Switzerland (USD $) Switzerland (USD $) (USD $) United Arab Emirates (USD $) United Arab Emirates (USD $) (USD $) United Kingdom (USD $) United Kingdom (USD $) (USD $) United States (USD $) United States (USD $) (USD $) American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa Powered by Shopify © 2025, Allen Fly Fishing Powered by Shopify © 2025, Allen Fly Fishing Search our store Recent searches Main menu Sale Fly Reels Rods Fly Tying Hooks Fly Tying Beads Accessories & Apparel Back to top Shopping Cart Your cart is currently empty"
  }
]