[
  {
    "candidate": "Horowitz, Jeffrey",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://jeffreyhorowitznyc.com/meet-jeffrey/",
    "text": "Meet Jeffrey Meet Jeffrey Contact Jeffrey Contact Jeffrey Policies Policies Supporters Supporters Events Events Bluesky Facebook Instagram Threads X Bluesky Bluesky Facebook Facebook Instagram Instagram Threads Threads X X Meet Jeffrey My name is Jeffrey Horowitz, and I’m a nineteen-year-old college freshman, born and raised in Annadale, Staten Island. Growing up in a working-class family has given me a deep understanding of the everyday challenges faced by our community. My father is a custodian and a proud union member of 32BJ, while my mother works as an attendance teacher and is a member of AFT & UFT. Their hard work and dedication have instilled in me the values that I carry with me today. As a member of the Jewish community, I am deeply connected to my roots and committed to advocating for the needs of my neighbors. I’m running for New York City Council in the 51st District because I have seen firsthand how public policies often miss the mark when it comes to supporting our community. I believe it’s time for a new generational leader to step up and bring fresh perspectives and innovative ideas to the table. Staten Islanders work tirelessly and deserve to have their voices heard in the decisions that shape our daily lives. My campaign is driven by my passion for fairness, smarter policies, and real solutions that benefit our community. I am ready to advocate for the beliefs of my community and my generation. I’m prepared to muster the support, time, and energy needed to make a positive impact. Together, we can ensure that Staten Islanders are no longer overlooked and that our community thrives. Bluesky Bluesky Facebook Facebook Instagram Instagram Threads Threads X X Website Powered by WordPress and Built by Daniel Mulladzhanov Paid for by Jeffrey Horowitz for City Council Loading Comments..."
  },
  {
    "candidate": "Horowitz, Jeffrey",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://jeffreyhorowitznyc.com/",
    "text": "Meet Jeffrey Meet Jeffrey Contact Jeffrey Contact Jeffrey Policies Policies Supporters Supporters Events Events Bluesky Facebook Instagram Threads X Bluesky Bluesky Facebook Facebook Instagram Instagram Threads Threads X X Meet Jeffrey Hi, I’m Jeffrey Horowitz, a nineteen-year-old college freshman from Annadale, Staten Island. Growing up in a working-class family, I understand the challenges our community faces. I’m running for New York City Council in the 51st District because I’ve seen firsthand how public policies often miss the mark for us. I’m committed to bringing fresh perspectives and real solutions to ensure Staten Islanders have a strong voice in the decisions that shape our daily lives. Learn More About Jeffrey’s Solutions to Bring Change to Staten Island We need new and innovative solutions to lead into the future not the same old platitudes, a new generation leader with new ideas. Bluesky Bluesky Facebook Facebook Instagram Instagram Threads Threads X X Website Powered by WordPress and Built by Daniel Mulladzhanov Paid for by Jeffrey Horowitz for City Council Loading Comments..."
  }
]