[
  {
    "candidate": "Leonard, James J",
    "category": "Policing & Public Safety",
    "score": 3,
    "link": "https://www.njcriminalpodcast.com/guests/james-j-leonard-jr/",
    "text": "Sign up to get updates from us Home Episodes All Episodes 113 By Category Cannabis Legalization Podcasts 12 Lindbergh Kidnapping Podcast 5 True Crime 33 Crime Authors 14 Philly Mob 4 Case Law 12 Jeffrey Epstein Case 1 Ghislaine Maxwell Case 1 Court Stories 29 South Jersey Criminal Law 71 See all categories → 113 By Category 12 5 33 14 4 12 1 1 29 71 Videos Blog Contact Guests Reviews All Reviews Leave a Review Rate on Apple Podcasts Rate on Spotify Follow Apple Podcasts Spotify Castro RSS Feed Search Search James J. Leonard Jr., Esq. Criminal Defense Attorney Jim is a multiple repeat guest and was our choice to celebrate the 100th episode of the NJCP. Upon graduating from Villanova University School of Law in 2001, Jim became an associate at a prominent Camden County law firm specializing in criminal defense work. In 2002, Mr. Leonard left the firm and started his own practice, the Leonard Law Group, specializing in aggressive criminal defense litigation. In 2003, Mr. Leonard won two high-profile jury trials that established his reputation as a highly skilled trial attorney. In 2015, Mr. Leonard was nominated by his peers as a Super Lawyer. While the scope of Mr. Leonard’s practice and his reputation have evolved significantly over the last decade, the primary focus is and always will be aggressive criminal defense litigation for defendants charged in Juvenile Court, Municipal Court, Superior Court and Federal Court throughout the State of New Jersey. Eastbound Strangler Atlantic City Serial Killer with James Leonard Jim Leonard pt4 - an Edward P. Kozmor Story Jim Leonard pt3 - Table Your Ego Jim Leonard pt2 - Eastbound Strangler Quadruple Homicide Atlantic City Jim Leonard pt1 - Eastbound Strangler Atlantic City Serial Killer Jim Leonard pt1 ⛹️‍♂️ Pivoting Jim Leonard pt2 ⛹️‍♂️ Run DMC, et al. Jim Leonard pt3 ⛹️‍♂️ Podcasting & Contraptions Jim Leonard pt4 ⛹️‍♂️ Where to Pivot Next? New Jersey's law podcast. Legal conversations hosted by trial attorney's throughout NJ. Join us for true crime cases and lawyer talk. Episodes Videos Blog Partners Niche Podcast Network Podcasting Sound Brilliant Top Podcast Production Firm in New Jersey JFK Assassination Contact Guests New Host Setup Reviews © 2025 NJ Criminal Podcast"
  },
  {
    "candidate": "Leonard, James J",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://www.leonardwarrenleonard.com/",
    "text": "www.leonardwarrenleonard.com Verifying you are human. This may take a few seconds. Enable JavaScript and cookies to continue"
  }
]