[
  {
    "candidate": "Lerman, Brian A*",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://muckrack.com/brian-lerman",
    "text": "muckrack.com Verifying you are human. This may take a few seconds. Enable JavaScript and cookies to continue"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "Academia.edu no longer supports Internet Explorer. To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser . Log In Sign Up more About Press Papers Terms Privacy Copyright We're Hiring! Help Center less About Press Papers Terms Privacy Copyright We're Hiring! Help Center less download Download Free PDF Thirty Years of Research on the Functional Analysis of Problem Behavior 2013, Journal of Applied Behavior Analysis visibility … description 21 pages link 1 file description download bookmark Save to Library share Share close Sign up for access to the world's latest research arrow_forward check Get notified about relevant papers check Save papers to use in your research check Join the discussion with peers check Track your impact Abstract and McCord (2003) reviewed studies published through 2000 on the functional analysis (FA) of problem behavior. We update that review for 2001 through 2012, including 158 more recent studies that reported data from 445 FAs. Combined with data obtained from Hanley et al., 435 FA studies, with line graphs for 981 FAs, have been published since 1961. We comment on recent trends in FA research and introduce the studies in the 2013 special issue of the Journal of Applied Behavior Analysis. ... Read more arrow_back_ios arrow_forward_ios Related papers Journal of Applied Behavior Analysis, 2015 When inconclusive functional analysis (FA) outcomes occur, a number of modifications have been made to enhance the putative establishing operation or consequence associated with behavioral maintenance. However, a systematic method for identifying relevant events to test during modified FAs has not been evaluated. The purpose of this study was to develop and evaluate a technology for systematically identifying events to test in a modified FA after an initial FA led to inconclusive outcomes. Six individuals whose initial FA showed little or no responding or high levels only in the control condition participated. An indirect assessment (IA) questionnaire developed for identifying idiosyncratic variables was administered, and a descriptive analysis (DA) was conducted. Results from the IA only or a combination of the IA and DA were used to inform modified FA test and control conditions. Conclusive FA outcomes were obtained with five of the six participants during the modified FA phase. Keywords descriptive analysis; functional analysis; idiosyncratic variables; indirect assessment Functional analysis (FA; Iwata, Dorsey, Slifer, Bauman, & Richman, 1982/1994) has had a substantial impact in the field of applied behavior analysis. By conducting an FA, variables maintaining problem behavior can be identified, permitting the development of effective function-based treatment. The utility of FA for informing successful intervention has been demonstrated across a wide range of behavioral functions and response topographies. Furthermore, research suggests that the increased use of a pretreatment FA has been associated with decreased use of punishment (Pelios, Morren, Tesch, & Axelrod, 1999). An FA typically involves three or four standard test conditions, including alone or no interaction, attention, escape, and tangible, and a control condition, play. Each of these test conditions involves manipulation of commonly occurring antecedent events (e.g., low download Download free PDF View PDF chevron_right , Education and Treatment of Children, 2014 Functional analyses (FA) have proven useful for identifying contingencies -sessed in an FA, further assessment may be necessary to identify the variables children. Function-based treatments were implemented to increase appropriate behavior and decrease problem behavior; however, treatment did not re-were used to decrease problem behavior and increase appropriate behavior. ment throughout the day. download Download free PDF View PDF chevron_right 2019 This thesis is dedicated to my family. Michael, thank you for your unwavering support and patience. Ava and Max, I hope that you both follow your hearts and reach for the stars because you can both achieve anything you set your minds to. In the words of B. F. Skinner, \"When you run into something interesting, drop everything and study it.\" ACKNOWLEDGMENTS I would like to express my sincere gratitude to my advisor, Dr. Sarah Bloom for her continuous guidance, support, patience, and immense knowledge. I would also like to thank Dr. Andrew Samaha for his mentorship, for encouraging me to step outside of my comfort zone, and for always challenging me to try even harder. You have both shaped by behavior in ways that I know have made me a better scientist, and for that I am eternally grateful. Additionally, I would also like to acknowledge Marlesha Bell, Paige Talhelm, and Laurel Porter for their assistance with data collection and support throughout this project. Finally, I would like to thank"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "Dr. Cynthia Livingston and Bitsy for their guidance and invaluable mentorship. i TABLE OF CONTENTS List of Tables . download Download free PDF View PDF chevron_right Clinical Psychology Review, 1990 This theoretical study reviews the theoretical and applied foundations of a functional analysis strategy in clinical case-formulation. Functional relations between variables are those that demonstrate a mathematical association. Causal functional relations between variables require: (a) covariance, (b) a logical connection, (c) temporal precedence of the causal variable, and (d) absence of a third variable explaining the relation. There are unidirectional, bidirectional, moderating, and mediating (i.e., explanatory) causal functional relations. In a functional analysis the relevant, controllable, and causal functional relations that apply to particular behaviors of an individual are identified. A functionalanalytic approach to case-formulation is designed to minimize clinical judgment bias and optimize clinical decision-making in the assessment and treatment processes. Additional features of a functional analysis and its use for intervention design are discussed within the context of a patient diagnosed with Schizophrenia Paranoid Type. This article also considers the conditional nature and limitations of a functional-analytic approach in clinical psychology. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2002 This study evaluated a variation of functional assessment methodology, the structured descriptive assessment (SDA). The SDA is conducted in an individual's natural environment and involves systematically manipulating antecedent variables while leaving consequences free to vary. Results were evaluated by comparing the results of an SDA with results obtained from an analogue functional analysis with 4 children who exhibited problem behavior. For 3 of 4 participants, the results of the two assessments suggested similar hypotheses about variables maintaining problem behavior. Interventions based on the results of the SDA were implemented for 3 children and resulted in significant reductions in rates of problem behavior. DESCRIPTORS: functional assessment, functional analysis, intervention, problem behavior Research has demonstrated the utility of the analogue functional analysis methodology developed by Iwata, Dorsey, Slifer, Bauman, and Richman (1982/1994) for identifying sources of reinforcement that maintain aberrant behavior. This methodology systematically assesses situations hypothesized to be analogueous to those in the natural environment by directly manipulating putative antecedents and consequences for problem behavior. The major advantage of this methodology compared to other methods of functional assessment is that it allows greater control over the environment, resulting in a more direct inference of functional relations. In contrast to the analogue functional analysis, descriptive assessments involve direct observation of behavior and events in the individual's natural environment and in download Download free PDF View PDF chevron_right Intervention In School And Clinic, 1993 Functional assessment has significantly improved the success of behavioral treatment of problem behaviors in adults with mental retardation. Functional assessment methods (i.e., techniques that yield a hypothesis of functional relationships) include direct observation, interviews, and checklists. Functional analysis consists of empirical methods that demonstrate behavioral function in controlled settings. Each method has advantages and limitations that reflect differences in both available resources and individual client characteristics. These methods and issues are reviewed, and future directions for both the research field and the adult population are suggested. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 download Download free PDF View PDF chevron_right 2020 Functional analyses allow a clinician to identify causal relations between environmental stimuli and problem behavior. Recent developments in functional analysis methodology have been devoted to creating practical procedures that can be conducted in a brief period of time. However, the extent to which improvements in analytic efficiency affect treatment outcomes have yet to be fully explored. We conducted a consecutive case series with 13 individuals who exhibited problem behavior. The participants experienced a comprehensive assessment and treatment program beginning with a functional analysis using 3-min sessions and ending with functional communication training and delay/denial tolerance training. Results demonstrated near elimination of problem behavior by the terminal treatment goal for all participants. This suggests that a clinician can still successfully treat problem behavior following relatively rapid assessment periods download Download free PDF View PDF chevron_right The Analysis of verbal behavior, 2002 This study describes procedures and outcomes in a functional analysis of problem behavior of 2 public school students. For a 13-year-old honors student, bizarre tacts (labeled as psychotic speech by school staff) were maintained by attention. For a 15-year-old with autism, the functional analysis revealed that perseverative mands for toileting were controlled by attention; mands for edible items were controlled by access to any food item; and mands for nonedible items were maintained by access to"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "Dr. Cynthia Livingston and Bitsy for their guidance and invaluable mentorship. i TABLE OF CONTENTS List of Tables . download Download free PDF View PDF chevron_right Clinical Psychology Review, 1990 This theoretical study reviews the theoretical and applied foundations of a functional analysis strategy in clinical case-formulation. Functional relations between variables are those that demonstrate a mathematical association. Causal functional relations between variables require: (a) covariance, (b) a logical connection, (c) temporal precedence of the causal variable, and (d) absence of a third variable explaining the relation. There are unidirectional, bidirectional, moderating, and mediating (i.e., explanatory) causal functional relations. In a functional analysis the relevant, controllable, and causal functional relations that apply to particular behaviors of an individual are identified. A functionalanalytic approach to case-formulation is designed to minimize clinical judgment bias and optimize clinical decision-making in the assessment and treatment processes. Additional features of a functional analysis and its use for intervention design are discussed within the context of a patient diagnosed with Schizophrenia Paranoid Type. This article also considers the conditional nature and limitations of a functional-analytic approach in clinical psychology. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2002 This study evaluated a variation of functional assessment methodology, the structured descriptive assessment (SDA). The SDA is conducted in an individual's natural environment and involves systematically manipulating antecedent variables while leaving consequences free to vary. Results were evaluated by comparing the results of an SDA with results obtained from an analogue functional analysis with 4 children who exhibited problem behavior. For 3 of 4 participants, the results of the two assessments suggested similar hypotheses about variables maintaining problem behavior. Interventions based on the results of the SDA were implemented for 3 children and resulted in significant reductions in rates of problem behavior. DESCRIPTORS: functional assessment, functional analysis, intervention, problem behavior Research has demonstrated the utility of the analogue functional analysis methodology developed by Iwata, Dorsey, Slifer, Bauman, and Richman (1982/1994) for identifying sources of reinforcement that maintain aberrant behavior. This methodology systematically assesses situations hypothesized to be analogueous to those in the natural environment by directly manipulating putative antecedents and consequences for problem behavior. The major advantage of this methodology compared to other methods of functional assessment is that it allows greater control over the environment, resulting in a more direct inference of functional relations. In contrast to the analogue functional analysis, descriptive assessments involve direct observation of behavior and events in the individual's natural environment and in download Download free PDF View PDF chevron_right Intervention In School And Clinic, 1993 Functional assessment has significantly improved the success of behavioral treatment of problem behaviors in adults with mental retardation. Functional assessment methods (i.e., techniques that yield a hypothesis of functional relationships) include direct observation, interviews, and checklists. Functional analysis consists of empirical methods that demonstrate behavioral function in controlled settings. Each method has advantages and limitations that reflect differences in both available resources and individual client characteristics. These methods and issues are reviewed, and future directions for both the research field and the adult population are suggested. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 download Download free PDF View PDF chevron_right 2020 Functional analyses allow a clinician to identify causal relations between environmental stimuli and problem behavior. Recent developments in functional analysis methodology have been devoted to creating practical procedures that can be conducted in a brief period of time. However, the extent to which improvements in analytic efficiency affect treatment outcomes have yet to be fully explored. We conducted a consecutive case series with 13 individuals who exhibited problem behavior. The participants experienced a comprehensive assessment and treatment program beginning with a functional analysis using 3-min sessions and ending with functional communication training and delay/denial tolerance training. Results demonstrated near elimination of problem behavior by the terminal treatment goal for all participants. This suggests that a clinician can still successfully treat problem behavior following relatively rapid assessment periods download Download free PDF View PDF chevron_right The Analysis of verbal behavior, 2002 This study describes procedures and outcomes in a functional analysis of problem behavior of 2 public school students. For a 13-year-old honors student, bizarre tacts (labeled as psychotic speech by school staff) were maintained by attention. For a 15-year-old with autism, the functional analysis revealed that perseverative mands for toileting were controlled by attention; mands for edible items were controlled by access to any food item; and mands for nonedible items were maintained by access to"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 6,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "Dr. Cynthia Livingston and Bitsy for their guidance and invaluable mentorship. i TABLE OF CONTENTS List of Tables . download Download free PDF View PDF chevron_right Clinical Psychology Review, 1990 This theoretical study reviews the theoretical and applied foundations of a functional analysis strategy in clinical case-formulation. Functional relations between variables are those that demonstrate a mathematical association. Causal functional relations between variables require: (a) covariance, (b) a logical connection, (c) temporal precedence of the causal variable, and (d) absence of a third variable explaining the relation. There are unidirectional, bidirectional, moderating, and mediating (i.e., explanatory) causal functional relations. In a functional analysis the relevant, controllable, and causal functional relations that apply to particular behaviors of an individual are identified. A functionalanalytic approach to case-formulation is designed to minimize clinical judgment bias and optimize clinical decision-making in the assessment and treatment processes. Additional features of a functional analysis and its use for intervention design are discussed within the context of a patient diagnosed with Schizophrenia Paranoid Type. This article also considers the conditional nature and limitations of a functional-analytic approach in clinical psychology. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2002 This study evaluated a variation of functional assessment methodology, the structured descriptive assessment (SDA). The SDA is conducted in an individual's natural environment and involves systematically manipulating antecedent variables while leaving consequences free to vary. Results were evaluated by comparing the results of an SDA with results obtained from an analogue functional analysis with 4 children who exhibited problem behavior. For 3 of 4 participants, the results of the two assessments suggested similar hypotheses about variables maintaining problem behavior. Interventions based on the results of the SDA were implemented for 3 children and resulted in significant reductions in rates of problem behavior. DESCRIPTORS: functional assessment, functional analysis, intervention, problem behavior Research has demonstrated the utility of the analogue functional analysis methodology developed by Iwata, Dorsey, Slifer, Bauman, and Richman (1982/1994) for identifying sources of reinforcement that maintain aberrant behavior. This methodology systematically assesses situations hypothesized to be analogueous to those in the natural environment by directly manipulating putative antecedents and consequences for problem behavior. The major advantage of this methodology compared to other methods of functional assessment is that it allows greater control over the environment, resulting in a more direct inference of functional relations. In contrast to the analogue functional analysis, descriptive assessments involve direct observation of behavior and events in the individual's natural environment and in download Download free PDF View PDF chevron_right Intervention In School And Clinic, 1993 Functional assessment has significantly improved the success of behavioral treatment of problem behaviors in adults with mental retardation. Functional assessment methods (i.e., techniques that yield a hypothesis of functional relationships) include direct observation, interviews, and checklists. Functional analysis consists of empirical methods that demonstrate behavioral function in controlled settings. Each method has advantages and limitations that reflect differences in both available resources and individual client characteristics. These methods and issues are reviewed, and future directions for both the research field and the adult population are suggested. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 download Download free PDF View PDF chevron_right 2020 Functional analyses allow a clinician to identify causal relations between environmental stimuli and problem behavior. Recent developments in functional analysis methodology have been devoted to creating practical procedures that can be conducted in a brief period of time. However, the extent to which improvements in analytic efficiency affect treatment outcomes have yet to be fully explored. We conducted a consecutive case series with 13 individuals who exhibited problem behavior. The participants experienced a comprehensive assessment and treatment program beginning with a functional analysis using 3-min sessions and ending with functional communication training and delay/denial tolerance training. Results demonstrated near elimination of problem behavior by the terminal treatment goal for all participants. This suggests that a clinician can still successfully treat problem behavior following relatively rapid assessment periods download Download free PDF View PDF chevron_right The Analysis of verbal behavior, 2002 This study describes procedures and outcomes in a functional analysis of problem behavior of 2 public school students. For a 13-year-old honors student, bizarre tacts (labeled as psychotic speech by school staff) were maintained by attention. For a 15-year-old with autism, the functional analysis revealed that perseverative mands for toileting were controlled by attention; mands for edible items were controlled by access to any food item; and mands for nonedible items were maintained by access to"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the specific item manded. The &quot;problematic&quot; aspects of the verbal behavior differed-the bizarre speech was problematic based on its content, but the perseverative verbalizations resulted in high response cost for classroom staff. Research in the area of problematic verbal behavior is sparse and warrants further attention from behavior analysts who work in public school settings. This research demonstrates the applicability and relevance of functionally analyzing problematic verbal... download Download free PDF View PDF chevron_right Research in developmental disabilities The convergent validity of an experimental (analog) functional analysis was investigated by a comparison of three separate ways of interpreting the data derived from such an assessment: two previously published methods and the criterion Z method derived by the authors. Data from the experimental functional analysis of the challenging behavior(s) of 27 individuals with intellectual disabilities were analyzed to assess agreement between the three forms of interpretation. The test-retest reliability of all three methods over periods of 2 weeks, 1 month, and 3 months was also calculated. The results suggest that the methods of interpreting function from experimental assessments can give different results and that the test-retest reliability of the experimental functional analyses is poor. The implications of these findings are discussed in relation to clinical practice. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2013 The Functional Analysis Screening Tool (FAST) is a 16-item questionnaire about antecedent and consequent events that might be correlated with the occurrence of problem behavior. Items are organized into 4 functional categories based on contingencies that maintain problem behavior. We assessed interrater reliability of the FAST with 196 problem behaviors through independent administration to pairs of raters (Study 1). Mean item-by-item agreement between pairs of raters was 71.5%. Agreement for individual items ranged from 53.3% to 84.5%. Agreement on FAST outcomes, based on comparison of informants' highest totals, was 64.8%. We assessed the validity of the FAST by comparing its outcomes with results of 69 functional analyses (Study 2). The FAST score predicted the condition of the functional analysis in which the highest rate of problem behavior occurred in 44 cases (63.8%). Potential uses of the FAST in the context of a clinical interview, as well as limitations, are discussed. download Download free PDF View PDF chevron_right Behavior Modification, 2008 Precursor behaviors are innocuous behaviors that reliably precede the occurrence of problem behavior. Intervention efforts applied to precursors might prevent the occurrence of severe problem behavior. We examined the relationship between precursor behavior and problem behavior in three individuals with developmental disabilities. First, a descriptive (correlational) assessment focusing on transitional probabilities, which established that problem behavior typically followed precursor behavior, was conducted. Next, a functional (experimental) analysis was conducted to evaluate the relationship between precursor and problem behavior. Results suggested that these two behaviors served the same function. Finally, in the intervention phase, participants were taught a response that was functionally equivalent to the precursor behavior. Results demonstrated a decrease in the frequency of problem behavior. Collectively, these results suggest that prevention efforts might profitably be focus... download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature demonstrating the relative effectiveness for each method, but in clinical practice, each can produce ambiguous or difficult-to-interpret outcomes that may impede treatment development. This paper outlines potential sources of variability in assessment outcomes and then reviews the evidence on strategies for avoiding ambiguous outcomes and/or clarifying initially ambiguous results. The end result for each assessment method is a set of best practice guidelines, given the available evidence, for conducting the initial assessment. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 1999 Self-injurious behavior (SIB) and aggression have been the concern of researchers because of the serious impact these behaviors have on individuals' lives. Despite the plethora of research on the treatment of SIB and aggressive behavior, the reported findings have been inconsistent regarding the effectiveness of reinforcement-based versus punishment-based procedures. We conducted a literature review"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the specific item manded. The &quot;problematic&quot; aspects of the verbal behavior differed-the bizarre speech was problematic based on its content, but the perseverative verbalizations resulted in high response cost for classroom staff. Research in the area of problematic verbal behavior is sparse and warrants further attention from behavior analysts who work in public school settings. This research demonstrates the applicability and relevance of functionally analyzing problematic verbal... download Download free PDF View PDF chevron_right Research in developmental disabilities The convergent validity of an experimental (analog) functional analysis was investigated by a comparison of three separate ways of interpreting the data derived from such an assessment: two previously published methods and the criterion Z method derived by the authors. Data from the experimental functional analysis of the challenging behavior(s) of 27 individuals with intellectual disabilities were analyzed to assess agreement between the three forms of interpretation. The test-retest reliability of all three methods over periods of 2 weeks, 1 month, and 3 months was also calculated. The results suggest that the methods of interpreting function from experimental assessments can give different results and that the test-retest reliability of the experimental functional analyses is poor. The implications of these findings are discussed in relation to clinical practice. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2013 The Functional Analysis Screening Tool (FAST) is a 16-item questionnaire about antecedent and consequent events that might be correlated with the occurrence of problem behavior. Items are organized into 4 functional categories based on contingencies that maintain problem behavior. We assessed interrater reliability of the FAST with 196 problem behaviors through independent administration to pairs of raters (Study 1). Mean item-by-item agreement between pairs of raters was 71.5%. Agreement for individual items ranged from 53.3% to 84.5%. Agreement on FAST outcomes, based on comparison of informants' highest totals, was 64.8%. We assessed the validity of the FAST by comparing its outcomes with results of 69 functional analyses (Study 2). The FAST score predicted the condition of the functional analysis in which the highest rate of problem behavior occurred in 44 cases (63.8%). Potential uses of the FAST in the context of a clinical interview, as well as limitations, are discussed. download Download free PDF View PDF chevron_right Behavior Modification, 2008 Precursor behaviors are innocuous behaviors that reliably precede the occurrence of problem behavior. Intervention efforts applied to precursors might prevent the occurrence of severe problem behavior. We examined the relationship between precursor behavior and problem behavior in three individuals with developmental disabilities. First, a descriptive (correlational) assessment focusing on transitional probabilities, which established that problem behavior typically followed precursor behavior, was conducted. Next, a functional (experimental) analysis was conducted to evaluate the relationship between precursor and problem behavior. Results suggested that these two behaviors served the same function. Finally, in the intervention phase, participants were taught a response that was functionally equivalent to the precursor behavior. Results demonstrated a decrease in the frequency of problem behavior. Collectively, these results suggest that prevention efforts might profitably be focus... download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature demonstrating the relative effectiveness for each method, but in clinical practice, each can produce ambiguous or difficult-to-interpret outcomes that may impede treatment development. This paper outlines potential sources of variability in assessment outcomes and then reviews the evidence on strategies for avoiding ambiguous outcomes and/or clarifying initially ambiguous results. The end result for each assessment method is a set of best practice guidelines, given the available evidence, for conducting the initial assessment. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 1999 Self-injurious behavior (SIB) and aggression have been the concern of researchers because of the serious impact these behaviors have on individuals' lives. Despite the plethora of research on the treatment of SIB and aggressive behavior, the reported findings have been inconsistent regarding the effectiveness of reinforcement-based versus punishment-based procedures. We conducted a literature review"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the specific item manded. The &quot;problematic&quot; aspects of the verbal behavior differed-the bizarre speech was problematic based on its content, but the perseverative verbalizations resulted in high response cost for classroom staff. Research in the area of problematic verbal behavior is sparse and warrants further attention from behavior analysts who work in public school settings. This research demonstrates the applicability and relevance of functionally analyzing problematic verbal... download Download free PDF View PDF chevron_right Research in developmental disabilities The convergent validity of an experimental (analog) functional analysis was investigated by a comparison of three separate ways of interpreting the data derived from such an assessment: two previously published methods and the criterion Z method derived by the authors. Data from the experimental functional analysis of the challenging behavior(s) of 27 individuals with intellectual disabilities were analyzed to assess agreement between the three forms of interpretation. The test-retest reliability of all three methods over periods of 2 weeks, 1 month, and 3 months was also calculated. The results suggest that the methods of interpreting function from experimental assessments can give different results and that the test-retest reliability of the experimental functional analyses is poor. The implications of these findings are discussed in relation to clinical practice. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2013 The Functional Analysis Screening Tool (FAST) is a 16-item questionnaire about antecedent and consequent events that might be correlated with the occurrence of problem behavior. Items are organized into 4 functional categories based on contingencies that maintain problem behavior. We assessed interrater reliability of the FAST with 196 problem behaviors through independent administration to pairs of raters (Study 1). Mean item-by-item agreement between pairs of raters was 71.5%. Agreement for individual items ranged from 53.3% to 84.5%. Agreement on FAST outcomes, based on comparison of informants' highest totals, was 64.8%. We assessed the validity of the FAST by comparing its outcomes with results of 69 functional analyses (Study 2). The FAST score predicted the condition of the functional analysis in which the highest rate of problem behavior occurred in 44 cases (63.8%). Potential uses of the FAST in the context of a clinical interview, as well as limitations, are discussed. download Download free PDF View PDF chevron_right Behavior Modification, 2008 Precursor behaviors are innocuous behaviors that reliably precede the occurrence of problem behavior. Intervention efforts applied to precursors might prevent the occurrence of severe problem behavior. We examined the relationship between precursor behavior and problem behavior in three individuals with developmental disabilities. First, a descriptive (correlational) assessment focusing on transitional probabilities, which established that problem behavior typically followed precursor behavior, was conducted. Next, a functional (experimental) analysis was conducted to evaluate the relationship between precursor and problem behavior. Results suggested that these two behaviors served the same function. Finally, in the intervention phase, participants were taught a response that was functionally equivalent to the precursor behavior. Results demonstrated a decrease in the frequency of problem behavior. Collectively, these results suggest that prevention efforts might profitably be focus... download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature demonstrating the relative effectiveness for each method, but in clinical practice, each can produce ambiguous or difficult-to-interpret outcomes that may impede treatment development. This paper outlines potential sources of variability in assessment outcomes and then reviews the evidence on strategies for avoiding ambiguous outcomes and/or clarifying initially ambiguous results. The end result for each assessment method is a set of best practice guidelines, given the available evidence, for conducting the initial assessment. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 1999 Self-injurious behavior (SIB) and aggression have been the concern of researchers because of the serious impact these behaviors have on individuals' lives. Despite the plethora of research on the treatment of SIB and aggressive behavior, the reported findings have been inconsistent regarding the effectiveness of reinforcement-based versus punishment-based procedures. We conducted a literature review"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "to determine whether a trend could be detected in researchers' selection of reinforcement-based procedures versus punishmentbased procedures, particularly since the introduction of functional analysis to behavioral assessment. The data are consistent with predictions made in the past regarding the potential impact of functional analysis methodology. Specifically, the findings indicate that, once maintaining variables for problem behavior are identified, experimenters tend to choose reinforcement-based procedures rather than punishment-based procedures as treatment for both SIB and aggressive behavior. Results indicated an increased interest in studies on the treatment of SIB and aggressive behavior, particularly since 1988. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Behaviour Change, 2006 Effective behaviour change is based on understanding the reasons for difficult behaviour, However, current functional anafytlc tedmology is often limited in its effectiveness in the clinical setting because the focus is on labelling and classifying behavioural outcomes rather than conducting a detailed analysis of the manner in which these outcomes assist the client to operate in the environment. The effectiveness of existing fmxctional ~mafytic techniques might be enhanced by moving the focus of the investigation from identifying the consequent variables that impact on behaviour to systematically exploring client-environment interactions as well as the mariner in which the client experiences the consequences of his/her actions. One potential method (Valued Outcomes Analysis) that provides a framework for the systematic investigation of the effects of 'inner skin' factors on the incidence of behavioural difficulties is described here. download Download free PDF View PDF chevron_right download Download free PDF View PDF chevron_right Journal of applied behavior …, 2005 The functional analysis methodology developed by Richman (1982/1994) has been successfully used to identify the variables that maintain the problem behavior of individuals with developmental disabilities. download Download free PDF View PDF chevron_right , Behavioral Interventions, 2004 Extensive research has validated the standard functional analysis as a useful technology for identifying the function of problem behavior in individuals with developmental disabilities. The assessment of low rate problem behavior is one area that has yet to receive a significant amount of research. Some problem behaviors may occur at rates too low to be observed during a standard functional analysis, despite the fact that they may be highly destructive behaviors. The current study evaluated the effectiveness of initiating functional analysis sessions contingent on the occurrence of bursts of problem behavior for producing interpretable functional analysis results. While a standard functional analysis did not produce definitive results with respect to behavioral function, the 'low rate' functional analysis produced interpretable results for all three participants. Two of the three participants were available for the evaluation of treatments based on their functional analysis results. Function-based treatments suppressed rates of problem behavior for both participants. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 Functional analyses that were conducted in two settings (playground and classroom) indicated that problem behavior was sensitive to adult attention on the playground and tangible items in the classroom. Attention-and tangible-based interventions were designed based on the results from each of the assessment environments and were compared. The attention-based intervention was more effective on the playground, and the tangible-based intervention was more effective in the classroom. Findings are discussed in regards to the generality of functional analysis results across environments. download Download free PDF View PDF chevron_right keyboard_arrow_down View more papers Related topics Psychology add Follow add Cognitive Science add Follow add Functional Analysis add Follow add Applied Behavior Analysis add Follow add Medicine add Follow add Behavioral symptoms add Follow add Cited by Journal of Positive Behavior Interventions, 2015 Trial-based functional analysis (TBFA) is"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "to determine whether a trend could be detected in researchers' selection of reinforcement-based procedures versus punishmentbased procedures, particularly since the introduction of functional analysis to behavioral assessment. The data are consistent with predictions made in the past regarding the potential impact of functional analysis methodology. Specifically, the findings indicate that, once maintaining variables for problem behavior are identified, experimenters tend to choose reinforcement-based procedures rather than punishment-based procedures as treatment for both SIB and aggressive behavior. Results indicated an increased interest in studies on the treatment of SIB and aggressive behavior, particularly since 1988. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Behaviour Change, 2006 Effective behaviour change is based on understanding the reasons for difficult behaviour, However, current functional anafytlc tedmology is often limited in its effectiveness in the clinical setting because the focus is on labelling and classifying behavioural outcomes rather than conducting a detailed analysis of the manner in which these outcomes assist the client to operate in the environment. The effectiveness of existing fmxctional ~mafytic techniques might be enhanced by moving the focus of the investigation from identifying the consequent variables that impact on behaviour to systematically exploring client-environment interactions as well as the mariner in which the client experiences the consequences of his/her actions. One potential method (Valued Outcomes Analysis) that provides a framework for the systematic investigation of the effects of 'inner skin' factors on the incidence of behavioural difficulties is described here. download Download free PDF View PDF chevron_right download Download free PDF View PDF chevron_right Journal of applied behavior …, 2005 The functional analysis methodology developed by Richman (1982/1994) has been successfully used to identify the variables that maintain the problem behavior of individuals with developmental disabilities. download Download free PDF View PDF chevron_right , Behavioral Interventions, 2004 Extensive research has validated the standard functional analysis as a useful technology for identifying the function of problem behavior in individuals with developmental disabilities. The assessment of low rate problem behavior is one area that has yet to receive a significant amount of research. Some problem behaviors may occur at rates too low to be observed during a standard functional analysis, despite the fact that they may be highly destructive behaviors. The current study evaluated the effectiveness of initiating functional analysis sessions contingent on the occurrence of bursts of problem behavior for producing interpretable functional analysis results. While a standard functional analysis did not produce definitive results with respect to behavioral function, the 'low rate' functional analysis produced interpretable results for all three participants. Two of the three participants were available for the evaluation of treatments based on their functional analysis results. Function-based treatments suppressed rates of problem behavior for both participants. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 Functional analyses that were conducted in two settings (playground and classroom) indicated that problem behavior was sensitive to adult attention on the playground and tangible items in the classroom. Attention-and tangible-based interventions were designed based on the results from each of the assessment environments and were compared. The attention-based intervention was more effective on the playground, and the tangible-based intervention was more effective in the classroom. Findings are discussed in regards to the generality of functional analysis results across environments. download Download free PDF View PDF chevron_right keyboard_arrow_down View more papers Related topics Psychology add Follow add Cognitive Science add Follow add Functional Analysis add Follow add Applied Behavior Analysis add Follow add Medicine add Follow add Behavioral symptoms add Follow add Cited by Journal of Positive Behavior Interventions, 2015 Trial-based functional analysis (TBFA) is"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 6,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "to determine whether a trend could be detected in researchers' selection of reinforcement-based procedures versus punishmentbased procedures, particularly since the introduction of functional analysis to behavioral assessment. The data are consistent with predictions made in the past regarding the potential impact of functional analysis methodology. Specifically, the findings indicate that, once maintaining variables for problem behavior are identified, experimenters tend to choose reinforcement-based procedures rather than punishment-based procedures as treatment for both SIB and aggressive behavior. Results indicated an increased interest in studies on the treatment of SIB and aggressive behavior, particularly since 1988. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Behaviour Change, 2006 Effective behaviour change is based on understanding the reasons for difficult behaviour, However, current functional anafytlc tedmology is often limited in its effectiveness in the clinical setting because the focus is on labelling and classifying behavioural outcomes rather than conducting a detailed analysis of the manner in which these outcomes assist the client to operate in the environment. The effectiveness of existing fmxctional ~mafytic techniques might be enhanced by moving the focus of the investigation from identifying the consequent variables that impact on behaviour to systematically exploring client-environment interactions as well as the mariner in which the client experiences the consequences of his/her actions. One potential method (Valued Outcomes Analysis) that provides a framework for the systematic investigation of the effects of 'inner skin' factors on the incidence of behavioural difficulties is described here. download Download free PDF View PDF chevron_right download Download free PDF View PDF chevron_right Journal of applied behavior …, 2005 The functional analysis methodology developed by Richman (1982/1994) has been successfully used to identify the variables that maintain the problem behavior of individuals with developmental disabilities. download Download free PDF View PDF chevron_right , Behavioral Interventions, 2004 Extensive research has validated the standard functional analysis as a useful technology for identifying the function of problem behavior in individuals with developmental disabilities. The assessment of low rate problem behavior is one area that has yet to receive a significant amount of research. Some problem behaviors may occur at rates too low to be observed during a standard functional analysis, despite the fact that they may be highly destructive behaviors. The current study evaluated the effectiveness of initiating functional analysis sessions contingent on the occurrence of bursts of problem behavior for producing interpretable functional analysis results. While a standard functional analysis did not produce definitive results with respect to behavioral function, the 'low rate' functional analysis produced interpretable results for all three participants. Two of the three participants were available for the evaluation of treatments based on their functional analysis results. Function-based treatments suppressed rates of problem behavior for both participants. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2009 Functional analyses that were conducted in two settings (playground and classroom) indicated that problem behavior was sensitive to adult attention on the playground and tangible items in the classroom. Attention-and tangible-based interventions were designed based on the results from each of the assessment environments and were compared. The attention-based intervention was more effective on the playground, and the tangible-based intervention was more effective in the classroom. Findings are discussed in regards to the generality of functional analysis results across environments. download Download free PDF View PDF chevron_right keyboard_arrow_down View more papers Related topics Psychology add Follow add Cognitive Science add Follow add Functional Analysis add Follow add Applied Behavior Analysis add Follow add Medicine add Follow add Behavioral symptoms add Follow add Cited by Journal of Positive Behavior Interventions, 2015 Trial-based functional analysis (TBFA) is"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "a procedure for experimentally identifying the function of challenging behavior within applied settings. The purpose of this study was to examine the effects of a TBFA teacher-training package in the context of two Head Start centers implementing programwide positive behavior support (PWPBS). Four Head Start teachers were trained in TBFA procedures as part of ongoing technical assistance on individualized behavior supports. Following training and performance feedback, all teachers were able to implement TBFA with 100% fidelity during simulation probes. With minimal additional coaching, teachers implemented TBFA sessions with a child in their classroom with 100% fidelity. Implications for future research and for the use of TBFA in early childhood settings are presented. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2014 Everyone, including children with developmental disabilities, encounters stimuli they find aversive every day (e.g., the sound of a classmate tapping their pencil). These aversive stimuli may not be problematic for typically developing individuals, because they learn to behave in ways that allow them to escape or avoid this aversive stimulation. They could, for example, mand (i.e., request) for something to be changed in the environment (e.g., ask their classmates to stop tapping their pencils). A child with developmental disabilities, however, may not have the communication skills necessary to request the termination of aversive stimuli, which may result in frequent exposure to aversive situations. For these children, it may be useful to acquire a general mand (e.g., saying, \"No, thank you\") which could be used to avoid or terminate a variety of aversive stimuli. Previous researchers teaching mands for negative reinforcement have focused on replacing problem behavior maintained by escape from task demands. The current study extended the literature on teaching mands for negative reinforcement by teaching children with developmental disabilities to mand for escape from a variety of nonpreferred stimuli, while assessing generalization to untrained stimuli and settings. Participants were two school-aged boys with autism who engaged in problem behavior when they encountered nonpreferred stimuli, and did not use an appropriate mand for negative reinforcement. First, we employed a nonpreferred stimulus assessment to identify stimuli for subsequent use in mand training. Next, we iv conducted mand training sequentially across nonpreferred stimuli until sufficient exemplars were trained for generalization to untrained stimuli to occur. Finally, we conducted probes to assess generalization of the mand response to nontraining contexts outside of the experimental setting. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2015 Treatment relapse, defined as the reemergence of problem behavior after treatment, is a serious difficulty faced by clinicians. Failures of treatment integrity (i.e., failure to implement interventions as intended) are often invoked to explain the reemergence of problem behavior. Basic studies suggest that the prevailing stimulus context might also contribute. We conducted 2 experiments in which reinforcement for a target response was followed by 2 phases of extinction with different or identical stimulus contexts relative to baseline (ABA renewal). In Experiment 1, pigeons served as subjects using procedures typical of those used in basic behavioral research. Experiment 2 was designed as a translational replication of Experiment 1, and children who had been diagnosed with autism served as participants. Returning to the previously reinforced stimulus context in both species produced a clear and immediate increase of extinguished responding. These findings are consistent with previous studies that have suggested that both reinforcement contingencies and stimulus context influence the reemergence of extinguished behavior. download Download free PDF View PDF chevron_right , Journal of Applied Behavior Analysis, 2013 Functional analyses have been useful in determining function-based treatments for problem behavior. Recently, however, researchers have evaluated the use of arbitrary reinforcers (e.g., positive reinforcers) to decrease problem behavior maintained by negative reinforcement, particularly in the absence of extinction. We provide a brief review of recent research on this topic and discuss implications regarding mechanisms, practice, and future research directions. download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "a procedure for experimentally identifying the function of challenging behavior within applied settings. The purpose of this study was to examine the effects of a TBFA teacher-training package in the context of two Head Start centers implementing programwide positive behavior support (PWPBS). Four Head Start teachers were trained in TBFA procedures as part of ongoing technical assistance on individualized behavior supports. Following training and performance feedback, all teachers were able to implement TBFA with 100% fidelity during simulation probes. With minimal additional coaching, teachers implemented TBFA sessions with a child in their classroom with 100% fidelity. Implications for future research and for the use of TBFA in early childhood settings are presented. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2014 Everyone, including children with developmental disabilities, encounters stimuli they find aversive every day (e.g., the sound of a classmate tapping their pencil). These aversive stimuli may not be problematic for typically developing individuals, because they learn to behave in ways that allow them to escape or avoid this aversive stimulation. They could, for example, mand (i.e., request) for something to be changed in the environment (e.g., ask their classmates to stop tapping their pencils). A child with developmental disabilities, however, may not have the communication skills necessary to request the termination of aversive stimuli, which may result in frequent exposure to aversive situations. For these children, it may be useful to acquire a general mand (e.g., saying, \"No, thank you\") which could be used to avoid or terminate a variety of aversive stimuli. Previous researchers teaching mands for negative reinforcement have focused on replacing problem behavior maintained by escape from task demands. The current study extended the literature on teaching mands for negative reinforcement by teaching children with developmental disabilities to mand for escape from a variety of nonpreferred stimuli, while assessing generalization to untrained stimuli and settings. Participants were two school-aged boys with autism who engaged in problem behavior when they encountered nonpreferred stimuli, and did not use an appropriate mand for negative reinforcement. First, we employed a nonpreferred stimulus assessment to identify stimuli for subsequent use in mand training. Next, we iv conducted mand training sequentially across nonpreferred stimuli until sufficient exemplars were trained for generalization to untrained stimuli to occur. Finally, we conducted probes to assess generalization of the mand response to nontraining contexts outside of the experimental setting. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2015 Treatment relapse, defined as the reemergence of problem behavior after treatment, is a serious difficulty faced by clinicians. Failures of treatment integrity (i.e., failure to implement interventions as intended) are often invoked to explain the reemergence of problem behavior. Basic studies suggest that the prevailing stimulus context might also contribute. We conducted 2 experiments in which reinforcement for a target response was followed by 2 phases of extinction with different or identical stimulus contexts relative to baseline (ABA renewal). In Experiment 1, pigeons served as subjects using procedures typical of those used in basic behavioral research. Experiment 2 was designed as a translational replication of Experiment 1, and children who had been diagnosed with autism served as participants. Returning to the previously reinforced stimulus context in both species produced a clear and immediate increase of extinguished responding. These findings are consistent with previous studies that have suggested that both reinforcement contingencies and stimulus context influence the reemergence of extinguished behavior. download Download free PDF View PDF chevron_right , Journal of Applied Behavior Analysis, 2013 Functional analyses have been useful in determining function-based treatments for problem behavior. Recently, however, researchers have evaluated the use of arbitrary reinforcers (e.g., positive reinforcers) to decrease problem behavior maintained by negative reinforcement, particularly in the absence of extinction. We provide a brief review of recent research on this topic and discuss implications regarding mechanisms, practice, and future research directions. download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "a procedure for experimentally identifying the function of challenging behavior within applied settings. The purpose of this study was to examine the effects of a TBFA teacher-training package in the context of two Head Start centers implementing programwide positive behavior support (PWPBS). Four Head Start teachers were trained in TBFA procedures as part of ongoing technical assistance on individualized behavior supports. Following training and performance feedback, all teachers were able to implement TBFA with 100% fidelity during simulation probes. With minimal additional coaching, teachers implemented TBFA sessions with a child in their classroom with 100% fidelity. Implications for future research and for the use of TBFA in early childhood settings are presented. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2014 Everyone, including children with developmental disabilities, encounters stimuli they find aversive every day (e.g., the sound of a classmate tapping their pencil). These aversive stimuli may not be problematic for typically developing individuals, because they learn to behave in ways that allow them to escape or avoid this aversive stimulation. They could, for example, mand (i.e., request) for something to be changed in the environment (e.g., ask their classmates to stop tapping their pencils). A child with developmental disabilities, however, may not have the communication skills necessary to request the termination of aversive stimuli, which may result in frequent exposure to aversive situations. For these children, it may be useful to acquire a general mand (e.g., saying, \"No, thank you\") which could be used to avoid or terminate a variety of aversive stimuli. Previous researchers teaching mands for negative reinforcement have focused on replacing problem behavior maintained by escape from task demands. The current study extended the literature on teaching mands for negative reinforcement by teaching children with developmental disabilities to mand for escape from a variety of nonpreferred stimuli, while assessing generalization to untrained stimuli and settings. Participants were two school-aged boys with autism who engaged in problem behavior when they encountered nonpreferred stimuli, and did not use an appropriate mand for negative reinforcement. First, we employed a nonpreferred stimulus assessment to identify stimuli for subsequent use in mand training. Next, we iv conducted mand training sequentially across nonpreferred stimuli until sufficient exemplars were trained for generalization to untrained stimuli to occur. Finally, we conducted probes to assess generalization of the mand response to nontraining contexts outside of the experimental setting. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2015 Treatment relapse, defined as the reemergence of problem behavior after treatment, is a serious difficulty faced by clinicians. Failures of treatment integrity (i.e., failure to implement interventions as intended) are often invoked to explain the reemergence of problem behavior. Basic studies suggest that the prevailing stimulus context might also contribute. We conducted 2 experiments in which reinforcement for a target response was followed by 2 phases of extinction with different or identical stimulus contexts relative to baseline (ABA renewal). In Experiment 1, pigeons served as subjects using procedures typical of those used in basic behavioral research. Experiment 2 was designed as a translational replication of Experiment 1, and children who had been diagnosed with autism served as participants. Returning to the previously reinforced stimulus context in both species produced a clear and immediate increase of extinguished responding. These findings are consistent with previous studies that have suggested that both reinforcement contingencies and stimulus context influence the reemergence of extinguished behavior. download Download free PDF View PDF chevron_right , Journal of Applied Behavior Analysis, 2013 Functional analyses have been useful in determining function-based treatments for problem behavior. Recently, however, researchers have evaluated the use of arbitrary reinforcers (e.g., positive reinforcers) to decrease problem behavior maintained by negative reinforcement, particularly in the absence of extinction. We provide a brief review of recent research on this topic and discuss implications regarding mechanisms, practice, and future research directions. download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 6,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "a procedure for experimentally identifying the function of challenging behavior within applied settings. The purpose of this study was to examine the effects of a TBFA teacher-training package in the context of two Head Start centers implementing programwide positive behavior support (PWPBS). Four Head Start teachers were trained in TBFA procedures as part of ongoing technical assistance on individualized behavior supports. Following training and performance feedback, all teachers were able to implement TBFA with 100% fidelity during simulation probes. With minimal additional coaching, teachers implemented TBFA sessions with a child in their classroom with 100% fidelity. Implications for future research and for the use of TBFA in early childhood settings are presented. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2014 Everyone, including children with developmental disabilities, encounters stimuli they find aversive every day (e.g., the sound of a classmate tapping their pencil). These aversive stimuli may not be problematic for typically developing individuals, because they learn to behave in ways that allow them to escape or avoid this aversive stimulation. They could, for example, mand (i.e., request) for something to be changed in the environment (e.g., ask their classmates to stop tapping their pencils). A child with developmental disabilities, however, may not have the communication skills necessary to request the termination of aversive stimuli, which may result in frequent exposure to aversive situations. For these children, it may be useful to acquire a general mand (e.g., saying, \"No, thank you\") which could be used to avoid or terminate a variety of aversive stimuli. Previous researchers teaching mands for negative reinforcement have focused on replacing problem behavior maintained by escape from task demands. The current study extended the literature on teaching mands for negative reinforcement by teaching children with developmental disabilities to mand for escape from a variety of nonpreferred stimuli, while assessing generalization to untrained stimuli and settings. Participants were two school-aged boys with autism who engaged in problem behavior when they encountered nonpreferred stimuli, and did not use an appropriate mand for negative reinforcement. First, we employed a nonpreferred stimulus assessment to identify stimuli for subsequent use in mand training. Next, we iv conducted mand training sequentially across nonpreferred stimuli until sufficient exemplars were trained for generalization to untrained stimuli to occur. Finally, we conducted probes to assess generalization of the mand response to nontraining contexts outside of the experimental setting. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2015 Treatment relapse, defined as the reemergence of problem behavior after treatment, is a serious difficulty faced by clinicians. Failures of treatment integrity (i.e., failure to implement interventions as intended) are often invoked to explain the reemergence of problem behavior. Basic studies suggest that the prevailing stimulus context might also contribute. We conducted 2 experiments in which reinforcement for a target response was followed by 2 phases of extinction with different or identical stimulus contexts relative to baseline (ABA renewal). In Experiment 1, pigeons served as subjects using procedures typical of those used in basic behavioral research. Experiment 2 was designed as a translational replication of Experiment 1, and children who had been diagnosed with autism served as participants. Returning to the previously reinforced stimulus context in both species produced a clear and immediate increase of extinguished responding. These findings are consistent with previous studies that have suggested that both reinforcement contingencies and stimulus context influence the reemergence of extinguished behavior. download Download free PDF View PDF chevron_right , Journal of Applied Behavior Analysis, 2013 Functional analyses have been useful in determining function-based treatments for problem behavior. Recently, however, researchers have evaluated the use of arbitrary reinforcers (e.g., positive reinforcers) to decrease problem behavior maintained by negative reinforcement, particularly in the absence of extinction. We provide a brief review of recent research on this topic and discuss implications regarding mechanisms, practice, and future research directions. download Download free PDF View PDF chevron_right Behavioral Interventions, 2014 Severe problem behavior (e.g., self-injury and aggression) remains among the most serious challenges for the habilitation of persons with intellectual disabilities and is a significant obstacle to community integration. The current standard of behavior analytic treatment for problem behavior in this population consists of a functional assessment and treatment model. Within that model, the first step is to assess the behavior-environment relations that give rise to and maintain problem behavior, a functional behavioral assessment. Conventional methods of assessing behavioral function include indirect, descriptive, and experimental assessments of problem behavior. Clinical investigators have produced a rich literature"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "demonstrating the relative effectiveness for each method, but in clinical practice, each can produce ambiguous or difficult-to-interpret outcomes that may impede treatment development. This paper outlines potential sources of variability in assessment outcomes and then reviews the evidence on strategies for avoiding ambiguous outcomes and/or clarifying initially ambiguous results. The end result for each assessment method is a set of best practice guidelines, given the available evidence, for conducting the initial assessment. download Download free PDF View PDF chevron_right Remedial and Special Education, 2015 download Download free PDF View PDF chevron_right International journal of environmental research and public health, 2018 Internet-enabled smartphones are increasingly ubiquitous in the Western world. Research suggests a number of problems can result from mobile phone overuse, including dependence, dangerous and prohibited use. For over a decade, this has been measured by the Problematic Mobile Phone Use Questionnaire (PMPU-Q). Given the rapid developments in mobile technologies, changes of use patterns and possible problematic and addictive use, the aim of the present study was to investigate and validate an updated contemporary version of the PMPU-Q (PMPU-Q-R). A mixed methods convergent design was employed, including a psychometric survey (= 512) alongside qualitative focus groups (= 21), to elicit experiences and perceptions of problematic smartphone use. The results suggest the PMPU-Q-R factor structure can be updated to include smartphone dependence, dangerous driving, and antisocial smartphone use factors. Theories of problematic mobile phone use require consideration of the ubiquity and indispe... download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research Background One in five adults with intellectual disabilities (ID) known to services display challenging behaviours (CBs), and these individuals are at risk for restrictive practices and poor care. Staff attitudes may contribute to the development and/or maintenance of CBs. We investigated the effectiveness of coproduced Who's Challenging Who? training delivered by people with ID to staff. Method This study involved a cluster randomised controlled trial (RCT) of Who's Challenging Who? training with follow-up at six and 20 weeks postrandomisation. Participants: two staff from each of 118 residential care settings for adults with ID at least one of whom displayed aggressive CB. Primary outcome: Self-reported Staff Empathy for people with Challenging Behaviour Questionnaire. Analysis: intention to treat of all randomised settings. ISCRTN registration: ISRCTN53763600. Results 118 residential settings (including 236 staff) were randomised to either receive training (59 settings) or to receive training after a delay (59 settings). The primary analysis included data from 121 staff in 76 settings (51% of staff, 64% of settings). The adjusted mean difference on the transformed (cubed) Staff Empathy for people with Challenging Behaviour Questionnaire score at the primary end point was 1073.2 (95% CI:-938.1 to 3084.5, P = 0.296) in favour of the intervention group (effect size Cohen's d = .19). Conclusions This is the first large-scale RCT of a co-produced training course delivered by people with ID. Findings indicated a small positive (but statistically non-significant) effect on increased staff empathy at 20 weeks, and small to moderate effects for staff reported secondary outcomes in favour of the intervention group. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis In their review of synthesis within the functional analysis (FA) literature, Slaton and Hanley (2018) reported that most synthesized contingency analyses have included multiple topographies of problem behavior in the reinforcement contingency class. This leaves the question of whether one, some, or all forms of problem behavior are sensitive to the synthesized reinforcement contingencies in published analyses. To address this ambiguity, all topographies of problem behavior that were reported by caregivers to co-occur with the most concerning problem behavior were analyzed for 10 participants. We implemented extinction across one or more forms of problem behavior to determine whether all forms reported to co-occur were sensitive to the same synthesized reinforcement contingency. For nine of 10 participants, the most concerning topographies were sensitive to the same synthesized reinforcement contingencies as the less concerning topographies (results were inconclusive for one). Implications for inferring response class membership from single analyses are discussed. download Download free PDF View PDF chevron_right Journal of Autism and Developmental Disorders Proponents of autism intervention and those of the neurodiversity movement often appear at odds, the former advocating for intensive treatments and the latter arguing that autism must be accepted as a form of diversity. The history of behavioral intervention has understandably outraged many in the Autistic community, though many still value supports focused on quality of life. This commentary argues that Naturalistic Developmental Behavioral Interventions (NDBIs) hold"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Civil Rights & Discrimination",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "demonstrating the relative effectiveness for each method, but in clinical practice, each can produce ambiguous or difficult-to-interpret outcomes that may impede treatment development. This paper outlines potential sources of variability in assessment outcomes and then reviews the evidence on strategies for avoiding ambiguous outcomes and/or clarifying initially ambiguous results. The end result for each assessment method is a set of best practice guidelines, given the available evidence, for conducting the initial assessment. download Download free PDF View PDF chevron_right Remedial and Special Education, 2015 download Download free PDF View PDF chevron_right International journal of environmental research and public health, 2018 Internet-enabled smartphones are increasingly ubiquitous in the Western world. Research suggests a number of problems can result from mobile phone overuse, including dependence, dangerous and prohibited use. For over a decade, this has been measured by the Problematic Mobile Phone Use Questionnaire (PMPU-Q). Given the rapid developments in mobile technologies, changes of use patterns and possible problematic and addictive use, the aim of the present study was to investigate and validate an updated contemporary version of the PMPU-Q (PMPU-Q-R). A mixed methods convergent design was employed, including a psychometric survey (= 512) alongside qualitative focus groups (= 21), to elicit experiences and perceptions of problematic smartphone use. The results suggest the PMPU-Q-R factor structure can be updated to include smartphone dependence, dangerous driving, and antisocial smartphone use factors. Theories of problematic mobile phone use require consideration of the ubiquity and indispe... download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research Background One in five adults with intellectual disabilities (ID) known to services display challenging behaviours (CBs), and these individuals are at risk for restrictive practices and poor care. Staff attitudes may contribute to the development and/or maintenance of CBs. We investigated the effectiveness of coproduced Who's Challenging Who? training delivered by people with ID to staff. Method This study involved a cluster randomised controlled trial (RCT) of Who's Challenging Who? training with follow-up at six and 20 weeks postrandomisation. Participants: two staff from each of 118 residential care settings for adults with ID at least one of whom displayed aggressive CB. Primary outcome: Self-reported Staff Empathy for people with Challenging Behaviour Questionnaire. Analysis: intention to treat of all randomised settings. ISCRTN registration: ISRCTN53763600. Results 118 residential settings (including 236 staff) were randomised to either receive training (59 settings) or to receive training after a delay (59 settings). The primary analysis included data from 121 staff in 76 settings (51% of staff, 64% of settings). The adjusted mean difference on the transformed (cubed) Staff Empathy for people with Challenging Behaviour Questionnaire score at the primary end point was 1073.2 (95% CI:-938.1 to 3084.5, P = 0.296) in favour of the intervention group (effect size Cohen's d = .19). Conclusions This is the first large-scale RCT of a co-produced training course delivered by people with ID. Findings indicated a small positive (but statistically non-significant) effect on increased staff empathy at 20 weeks, and small to moderate effects for staff reported secondary outcomes in favour of the intervention group. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis In their review of synthesis within the functional analysis (FA) literature, Slaton and Hanley (2018) reported that most synthesized contingency analyses have included multiple topographies of problem behavior in the reinforcement contingency class. This leaves the question of whether one, some, or all forms of problem behavior are sensitive to the synthesized reinforcement contingencies in published analyses. To address this ambiguity, all topographies of problem behavior that were reported by caregivers to co-occur with the most concerning problem behavior were analyzed for 10 participants. We implemented extinction across one or more forms of problem behavior to determine whether all forms reported to co-occur were sensitive to the same synthesized reinforcement contingency. For nine of 10 participants, the most concerning topographies were sensitive to the same synthesized reinforcement contingencies as the less concerning topographies (results were inconclusive for one). Implications for inferring response class membership from single analyses are discussed. download Download free PDF View PDF chevron_right Journal of Autism and Developmental Disorders Proponents of autism intervention and those of the neurodiversity movement often appear at odds, the former advocating for intensive treatments and the latter arguing that autism must be accepted as a form of diversity. The history of behavioral intervention has understandably outraged many in the Autistic community, though many still value supports focused on quality of life. This commentary argues that Naturalistic Developmental Behavioral Interventions (NDBIs) hold"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 6,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "promise for bridging the gap between early intervention and the neurodiversity movement. However, we recognize NDBIs have much room to grow and suggest multiple strategies for improvement. We believe these updates are not only feasible for clinicians and researchers to implement but will ultimately lead to improved quality of life for Autistic individuals. download Download free PDF View PDF chevron_right Journal of Abnormal Child Psychology, 2016 We conducted a 6 month, randomized trial of parent training (PT) versus a parent education program (PEP) in 180 young children (158 boys, 22 girls), ages 3-7 years, with autism spectrum disorder (ASD). PT was superior to PEP in decreasing disruptive and noncompliant behaviors. In the current study, we assess moderators of treatment response in this trial. Thirteen clinical and demographic variables were evaluated as potential moderators of three outcome variables: the Aberrant Behavior Checklist-Irritability subscale (ABC-I), Home Situations Questionnaire (HSQ), and Clinical Global Impressions-Improvement Scale (CGI-I). We used an intent-to-treat model and random effects regression. Neither IQ nor ASD severity moderated outcome on the selected outcome measures. Severity of Attention Deficit Hyperactivity Disorder (ADHD) and anxiety moderated outcomes on the ABC-I and HSQ. For instance, there was a 6.6 point difference on the ABC-I between high and low ADHD groups (p = .05) and a 5.3 point difference between high and low Anxiety groups (p = .04). Oppositional defiant disorder symptoms and household income moderated outcomes on the HSQ. None of the baseline variables moderated outcome on the CGI-I. That IQ and ASD symptom severity did not moderate outcome suggests that PT is likely to benefit a wide range of children with ASD and disruptive behavior. download Download free PDF View PDF chevron_right Behavior Analysis, 2018 Applied Behaviour Analysis (ABA) is recognised as the scientific basis of effective interventions in many educational, social, and medical fields, including autism. In this chapter, the basic tenets of ABA are described and briefly reviewed. Autism aetiology, diagnosis and prevalence are sketched out and the remainder of the chapter focuses on ABA-based interventions for children with autism. The chapter concludes with an examination of internationally recognised training standards for behaviour analysts. download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2020 Although fatigue usually goes unnoticed, it is a symptom that poses great challenges to patients with fibromyalgia and is a strong limitation. The aim of this study is to identify and describe the variables involved in fatigue in nine different situations of the Goal Pursuit Questionnaire (GPQ) that may occur in the daily lives of women with fibromyalgia, according to an ABC (Antecedents–Behaviors–Consequences) model. This study followed a qualitative descriptive research method and a deductive–inductive hybrid approach based on a phenomenological paradigm. Twenty-six women with fibromyalgia participated in focus group discussions between February and March of 2018. Thematic content analysis was carried out from transcribed verbatim interviews. We identified nine major themes that emerged from the participants’ conversations: self-imposed duties, muscle fatigue, overwhelming feeling of tiredness, difficulty thinking, difficulty concentrating, negative emotions, lifestyle changes, af... download Download free PDF View PDF chevron_right Behavior Analysis in Practice Ensuring that Board Certified Behavior Analysts (BCBAs) receive sufficient training in various forms of practice is an area of clinical importance that necessitates additional attention. Given that there is relatively limited information available on the extent to which BCBAs receive ongoing training and support, Reed and Henley (Behavior Analysis in Practice, 8, 16-26, 2015) conducted a study to evaluate the various types of training offered to BCBAs and aspiring certificants. As such, the purpose of the current investigation was to extend the findings of Reed and Henley by surveying BCBA respondents who practice (a) primarily in the home setting and (b) with clients who engage in severe problem behavior. The results are discussed with respect to 3 socially significant findings. First, 43% of respondents had been assigned their first severe case without initial or ongoing support. Second, only 35.2% of respondents received training on functional analyses more than 1 time. Finally, 5 respondents (4%) answered that the majority of their work was with clients 19 years old or older. download Download free PDF View PDF chevron_right Indian journal of pediatrics, 2016 The study of the evolution in the diagnosis and treatment of autism is a lesson in the dangers of medical beliefs or doctrines that are not grounded in medical science. The early descriptions of autism suggested that it was the result of childhood psychoses or psychodynamic disturbances of parent-child relationships. This flawed conceptualization"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "promise for bridging the gap between early intervention and the neurodiversity movement. However, we recognize NDBIs have much room to grow and suggest multiple strategies for improvement. We believe these updates are not only feasible for clinicians and researchers to implement but will ultimately lead to improved quality of life for Autistic individuals. download Download free PDF View PDF chevron_right Journal of Abnormal Child Psychology, 2016 We conducted a 6 month, randomized trial of parent training (PT) versus a parent education program (PEP) in 180 young children (158 boys, 22 girls), ages 3-7 years, with autism spectrum disorder (ASD). PT was superior to PEP in decreasing disruptive and noncompliant behaviors. In the current study, we assess moderators of treatment response in this trial. Thirteen clinical and demographic variables were evaluated as potential moderators of three outcome variables: the Aberrant Behavior Checklist-Irritability subscale (ABC-I), Home Situations Questionnaire (HSQ), and Clinical Global Impressions-Improvement Scale (CGI-I). We used an intent-to-treat model and random effects regression. Neither IQ nor ASD severity moderated outcome on the selected outcome measures. Severity of Attention Deficit Hyperactivity Disorder (ADHD) and anxiety moderated outcomes on the ABC-I and HSQ. For instance, there was a 6.6 point difference on the ABC-I between high and low ADHD groups (p = .05) and a 5.3 point difference between high and low Anxiety groups (p = .04). Oppositional defiant disorder symptoms and household income moderated outcomes on the HSQ. None of the baseline variables moderated outcome on the CGI-I. That IQ and ASD symptom severity did not moderate outcome suggests that PT is likely to benefit a wide range of children with ASD and disruptive behavior. download Download free PDF View PDF chevron_right Behavior Analysis, 2018 Applied Behaviour Analysis (ABA) is recognised as the scientific basis of effective interventions in many educational, social, and medical fields, including autism. In this chapter, the basic tenets of ABA are described and briefly reviewed. Autism aetiology, diagnosis and prevalence are sketched out and the remainder of the chapter focuses on ABA-based interventions for children with autism. The chapter concludes with an examination of internationally recognised training standards for behaviour analysts. download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2020 Although fatigue usually goes unnoticed, it is a symptom that poses great challenges to patients with fibromyalgia and is a strong limitation. The aim of this study is to identify and describe the variables involved in fatigue in nine different situations of the Goal Pursuit Questionnaire (GPQ) that may occur in the daily lives of women with fibromyalgia, according to an ABC (Antecedents–Behaviors–Consequences) model. This study followed a qualitative descriptive research method and a deductive–inductive hybrid approach based on a phenomenological paradigm. Twenty-six women with fibromyalgia participated in focus group discussions between February and March of 2018. Thematic content analysis was carried out from transcribed verbatim interviews. We identified nine major themes that emerged from the participants’ conversations: self-imposed duties, muscle fatigue, overwhelming feeling of tiredness, difficulty thinking, difficulty concentrating, negative emotions, lifestyle changes, af... download Download free PDF View PDF chevron_right Behavior Analysis in Practice Ensuring that Board Certified Behavior Analysts (BCBAs) receive sufficient training in various forms of practice is an area of clinical importance that necessitates additional attention. Given that there is relatively limited information available on the extent to which BCBAs receive ongoing training and support, Reed and Henley (Behavior Analysis in Practice, 8, 16-26, 2015) conducted a study to evaluate the various types of training offered to BCBAs and aspiring certificants. As such, the purpose of the current investigation was to extend the findings of Reed and Henley by surveying BCBA respondents who practice (a) primarily in the home setting and (b) with clients who engage in severe problem behavior. The results are discussed with respect to 3 socially significant findings. First, 43% of respondents had been assigned their first severe case without initial or ongoing support. Second, only 35.2% of respondents received training on functional analyses more than 1 time. Finally, 5 respondents (4%) answered that the majority of their work was with clients 19 years old or older. download Download free PDF View PDF chevron_right Indian journal of pediatrics, 2016 The study of the evolution in the diagnosis and treatment of autism is a lesson in the dangers of medical beliefs or doctrines that are not grounded in medical science. The early descriptions of autism suggested that it was the result of childhood psychoses or psychodynamic disturbances of parent-child relationships. This flawed conceptualization"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "promise for bridging the gap between early intervention and the neurodiversity movement. However, we recognize NDBIs have much room to grow and suggest multiple strategies for improvement. We believe these updates are not only feasible for clinicians and researchers to implement but will ultimately lead to improved quality of life for Autistic individuals. download Download free PDF View PDF chevron_right Journal of Abnormal Child Psychology, 2016 We conducted a 6 month, randomized trial of parent training (PT) versus a parent education program (PEP) in 180 young children (158 boys, 22 girls), ages 3-7 years, with autism spectrum disorder (ASD). PT was superior to PEP in decreasing disruptive and noncompliant behaviors. In the current study, we assess moderators of treatment response in this trial. Thirteen clinical and demographic variables were evaluated as potential moderators of three outcome variables: the Aberrant Behavior Checklist-Irritability subscale (ABC-I), Home Situations Questionnaire (HSQ), and Clinical Global Impressions-Improvement Scale (CGI-I). We used an intent-to-treat model and random effects regression. Neither IQ nor ASD severity moderated outcome on the selected outcome measures. Severity of Attention Deficit Hyperactivity Disorder (ADHD) and anxiety moderated outcomes on the ABC-I and HSQ. For instance, there was a 6.6 point difference on the ABC-I between high and low ADHD groups (p = .05) and a 5.3 point difference between high and low Anxiety groups (p = .04). Oppositional defiant disorder symptoms and household income moderated outcomes on the HSQ. None of the baseline variables moderated outcome on the CGI-I. That IQ and ASD symptom severity did not moderate outcome suggests that PT is likely to benefit a wide range of children with ASD and disruptive behavior. download Download free PDF View PDF chevron_right Behavior Analysis, 2018 Applied Behaviour Analysis (ABA) is recognised as the scientific basis of effective interventions in many educational, social, and medical fields, including autism. In this chapter, the basic tenets of ABA are described and briefly reviewed. Autism aetiology, diagnosis and prevalence are sketched out and the remainder of the chapter focuses on ABA-based interventions for children with autism. The chapter concludes with an examination of internationally recognised training standards for behaviour analysts. download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2020 Although fatigue usually goes unnoticed, it is a symptom that poses great challenges to patients with fibromyalgia and is a strong limitation. The aim of this study is to identify and describe the variables involved in fatigue in nine different situations of the Goal Pursuit Questionnaire (GPQ) that may occur in the daily lives of women with fibromyalgia, according to an ABC (Antecedents–Behaviors–Consequences) model. This study followed a qualitative descriptive research method and a deductive–inductive hybrid approach based on a phenomenological paradigm. Twenty-six women with fibromyalgia participated in focus group discussions between February and March of 2018. Thematic content analysis was carried out from transcribed verbatim interviews. We identified nine major themes that emerged from the participants’ conversations: self-imposed duties, muscle fatigue, overwhelming feeling of tiredness, difficulty thinking, difficulty concentrating, negative emotions, lifestyle changes, af... download Download free PDF View PDF chevron_right Behavior Analysis in Practice Ensuring that Board Certified Behavior Analysts (BCBAs) receive sufficient training in various forms of practice is an area of clinical importance that necessitates additional attention. Given that there is relatively limited information available on the extent to which BCBAs receive ongoing training and support, Reed and Henley (Behavior Analysis in Practice, 8, 16-26, 2015) conducted a study to evaluate the various types of training offered to BCBAs and aspiring certificants. As such, the purpose of the current investigation was to extend the findings of Reed and Henley by surveying BCBA respondents who practice (a) primarily in the home setting and (b) with clients who engage in severe problem behavior. The results are discussed with respect to 3 socially significant findings. First, 43% of respondents had been assigned their first severe case without initial or ongoing support. Second, only 35.2% of respondents received training on functional analyses more than 1 time. Finally, 5 respondents (4%) answered that the majority of their work was with clients 19 years old or older. download Download free PDF View PDF chevron_right Indian journal of pediatrics, 2016 The study of the evolution in the diagnosis and treatment of autism is a lesson in the dangers of medical beliefs or doctrines that are not grounded in medical science. The early descriptions of autism suggested that it was the result of childhood psychoses or psychodynamic disturbances of parent-child relationships. This flawed conceptualization"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Public Transit",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "LGBTQ+ Rights",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "of autism spectrum disorders (ASD) gave way to advances in medical science, which have established ASD as a neurobiological disorder of early brain development. There are many genetic, epigenetic, metabolic, hormonal, immunological, neuroanatomical and neurophysiological etiologies of ASD, as well as an array of gastrointestinal and other systemic co-morbid disorders. Thus, ASD are a biologically heterogeneous population with extensive neurodiversity. Early identification and understanding of ASD is crucial; interventions at younger ages are associated with improved outcomes. The advent of understanding the biological sub-phenotypes of ASD,... download Download free PDF View PDF chevron_right Cureus, 2021 Intellectual disability (ID) encompasses a wide variety of disorders that can severely affect an individual's cognitive, social, emotional, and physical development, even when identified early in life. Initially, individuals with such disorders had shorter life expectancies. However, medical advances have increased the life expectancy of individuals with ID similar to that of the general population. More attention must be paid to manage diseases affecting the intellectually disabled elderly, such as diabetes, cardiovascular disease, chronic constipation, and behavioral disorders. download Download free PDF View PDF chevron_right Behavior Analysis in Practice, 2019 Indirect assessments are a commonly used component of functional behavior assessment by behavior analysts in practice who work with individuals with severe behavior disorders. Although used frequently, closed-ended indirect assessments have repeatedly been shown to have low to moderate interrater reliability and poor concurrent validity with functional analysis. Recently, the use of open-ended interviews has become more commonly adopted in applied clinical practice, despite no studies evaluating the psychometric properties of such assessments. In the present study, we evaluated the interrater reliability and concurrent validity of an open-ended functional assessment interview. We compared the results of two open-ended indirect assessments conducted with a common caregiver and subsequently conducted functional analyses in an attempt to validate hypotheses generated from the interviews. Interrater agreement for the open-ended interviews was higher than previous research on closed-ended interviews (75%); however, concurrent validity with functional analysis was relatively poor (50%). We discuss these findings in the context of assessment and treatment for severe behavior disorders, as well as best practice methods during functional behavior assessment. download Download free PDF View PDF chevron_right Clinical Case Studies, 2018 We report the case of a man who had intellectual disability and physical impairment, required assistance from care-providers when ambulating, and demonstrated aggression during transitions between locations. Results of a functional analysis suggested that aggression was negatively reinforced by termination of transition-assisted guidance from care-providers. Intervention evaluation found that aggression during transitions was eliminated by providing the man with ambulatory support through a gait-trainer device that removed the need for care-provider assistance. The case study supports and extends previous research on the analysis and treatment of problem behaviors occurring during environmental transitions. download Download free PDF View PDF chevron_right Rural Special Education Quarterly, 2017 Functional analysis (FA) is an assessment procedure involving the systematic manipulation of an individual’s environment to determine why a target behavior is occurring. An analog FA provides practitioners the opportunity to manipulate variables in a controlled environment and formulate a hypothesis for the function of a behavior. In previous studies, researchers have attempted to train practitioners who have no experience with FA to implement the conditions with procedural integrity. In these studies, researchers used a traditional professional development model (e.g., didactic training, role-play). To date, simulation and virtual environments have not been used to enhance FA training procedures in the preparation of teachers and behavior analysts. In the current investigation, we sought to train educators to implement two test conditions of an analog FA (i.e., attention, escape). The intervention package included a didactic training and individual and group-rehearsed FA trainings ... download Download free PDF View PDF chevron_right The journal of primary prevention, 2016 Elopement exhibited by school-aged children with special health care needs is a relatively low frequency problem behavior with the potential for severe negative consequences for the child and family. Using data from the Centers for Disease Control and Prevention (CDC) Survey of Pathways to Diagnosis and Services, our results represent one of the first empirical studies of variables that may be associated with children with special health care needs engaging in elopement. Using data from a nationally representative sample of children with special health care needs, our results revealed two variables that were statistically significant predictors of parent-reported elopement in the past year: (1) the child&#39;s chronological age, and (2) the presence of an autism spectrum disorder (ASD) diagnosis. We found that the likelihood of an"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "elopement event was inversely related to age, but positively associated with the presence of an ASD diagnosis. Using parent-response items from the CDC da... download Download free PDF View PDF chevron_right Journal of Developmental and Physical Disabilities, 2018 Self-injurious behavior (SIB) is one of the most detrimental behaviors for the person showing it, as well as for their environment. Nevertheless, structured clinical assessments of SIB are scarce. Staff completed a Self-Harm Scale (SHS) every time they witnessed SIB in clients with an intellectual disability (ID) and co-occurring psychopathology (N = 33). Descriptive statistics were conducted to explore the nature of the incidents of SIB and the characteristics of the people involved in the incidents. In 41 weeks, 104 SIB incidents were reported for 8 out of 33 clients (24%). Incidents were most prevalent on Mondays (23%). As far as the methods of SIB concerned, cutting was the most used method (63%). Clients who showed SIB differed significantly from clients who did not on gender, having a personality disorder and communicative abilities. This study was one of the few that used an incident-based record form to report SIB by direct observation. It is hoped that the SHS helps to gain more download Download free PDF View PDF chevron_right Journal of Applied Research in Intellectual Disabilities, 2019 People with intellectual disabilities (ID) are at greater risk of developing psychopathology than people without ID (Matson & Shoemaker, 2011). In addition, they relatively often engage in disruptive and challenging behaviours (CB), including aggressive behaviour, self-injurious behaviour (SIB) and sexualized challenging behaviour (SCB) (Luiselli, 2012). CB can be seen as \"the product of interaction between the individual and its environment\" (Bank et al., 2007). Therefore, the environments of people with ID, and particularly their support staff, could play a key role in the prevention and management of CB (van den Bogaard, Nijman, Palmstierna, & Embregts, 2018a; Hastings, 2010). Several previous studies have addressed the explicit role that support staff may have in triggering and reacting to CB. For example, support staff members have noted that their interactions with people with ID could be triggers for CB and that they consider their interventions necessary to stopping or controlling CB (e.g. van download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2022 Functional analyses (FA) and functional communication training (FCT) are the most commonly used behavioral assessment and treatment approaches via telehealth for children with autism spectrum disorder (ASD) who display challenging behavior. The FA + FCT telehealth model has been shown to maintain treatment effectiveness (i.e., child behavioral outcomes and parent acceptability), as well as demonstrate treatment efficiency (i.e., cost savings). However, the majority of these studies have been conducted in the United States. Therefore, the purpose of this study was to evaluate the outcomes obtained with the telehealth FA + FCT model that included global applications. Descriptive statistics were used to analyze the results of the 199 participants who enrolled in the telehealth project across all project sites. The results showed that behavioral outcomes and parent acceptability maintained at similar levels to previous studies across all sites. Additionally, very few differences were fo... download Download free PDF View PDF chevron_right Foundations of Management By integrating several prominent theories and models in technology adoption, this study develops a research model to examine the factors affecting jobseekers’ intention to use job boards. The validity and reliability of the researcher-developed instrument, the SEDA-IUQ (SEDA-Intention to Use Questionnaire), were assessed using a combination of statistical methods. Utilizing the data collected from 447 Iranian respondents, findings from the exploratory factor analysis provided evidence for the five-factor solution, that is, technological innovation, functional adequacy, content accessibility, practical utility, and reputation-seeking intention, for the 36-item SEDA-IUQ. Various relationships in the research model are tested using confirmatory factor analysis and structural equation modeling. In addition to developing a practical questionnaire that the e-recruitment researchers and practitioners can deploy to study jobseekers’ behavioral intentions, this is the first study on job sear... download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2016 Stimulus equivalence-based instruction (EBI) was used to teach four, 4-member classes representing functions of behavior to ten graduate students. The classes represented behavior maintained by attention (Class 1), escape (Class 2), access to tangibles (Class 3), and automatic reinforcement (Class 4). Stimuli within each class consisted of a single textual label, and multiple exemplars of textual descriptions, graphical representations, and clinical vignettes. EBI was conducted using custom computer software in a match-to-sample (MTS) format."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "elopement event was inversely related to age, but positively associated with the presence of an ASD diagnosis. Using parent-response items from the CDC da... download Download free PDF View PDF chevron_right Journal of Developmental and Physical Disabilities, 2018 Self-injurious behavior (SIB) is one of the most detrimental behaviors for the person showing it, as well as for their environment. Nevertheless, structured clinical assessments of SIB are scarce. Staff completed a Self-Harm Scale (SHS) every time they witnessed SIB in clients with an intellectual disability (ID) and co-occurring psychopathology (N = 33). Descriptive statistics were conducted to explore the nature of the incidents of SIB and the characteristics of the people involved in the incidents. In 41 weeks, 104 SIB incidents were reported for 8 out of 33 clients (24%). Incidents were most prevalent on Mondays (23%). As far as the methods of SIB concerned, cutting was the most used method (63%). Clients who showed SIB differed significantly from clients who did not on gender, having a personality disorder and communicative abilities. This study was one of the few that used an incident-based record form to report SIB by direct observation. It is hoped that the SHS helps to gain more download Download free PDF View PDF chevron_right Journal of Applied Research in Intellectual Disabilities, 2019 People with intellectual disabilities (ID) are at greater risk of developing psychopathology than people without ID (Matson & Shoemaker, 2011). In addition, they relatively often engage in disruptive and challenging behaviours (CB), including aggressive behaviour, self-injurious behaviour (SIB) and sexualized challenging behaviour (SCB) (Luiselli, 2012). CB can be seen as \"the product of interaction between the individual and its environment\" (Bank et al., 2007). Therefore, the environments of people with ID, and particularly their support staff, could play a key role in the prevention and management of CB (van den Bogaard, Nijman, Palmstierna, & Embregts, 2018a; Hastings, 2010). Several previous studies have addressed the explicit role that support staff may have in triggering and reacting to CB. For example, support staff members have noted that their interactions with people with ID could be triggers for CB and that they consider their interventions necessary to stopping or controlling CB (e.g. van download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2022 Functional analyses (FA) and functional communication training (FCT) are the most commonly used behavioral assessment and treatment approaches via telehealth for children with autism spectrum disorder (ASD) who display challenging behavior. The FA + FCT telehealth model has been shown to maintain treatment effectiveness (i.e., child behavioral outcomes and parent acceptability), as well as demonstrate treatment efficiency (i.e., cost savings). However, the majority of these studies have been conducted in the United States. Therefore, the purpose of this study was to evaluate the outcomes obtained with the telehealth FA + FCT model that included global applications. Descriptive statistics were used to analyze the results of the 199 participants who enrolled in the telehealth project across all project sites. The results showed that behavioral outcomes and parent acceptability maintained at similar levels to previous studies across all sites. Additionally, very few differences were fo... download Download free PDF View PDF chevron_right Foundations of Management By integrating several prominent theories and models in technology adoption, this study develops a research model to examine the factors affecting jobseekers’ intention to use job boards. The validity and reliability of the researcher-developed instrument, the SEDA-IUQ (SEDA-Intention to Use Questionnaire), were assessed using a combination of statistical methods. Utilizing the data collected from 447 Iranian respondents, findings from the exploratory factor analysis provided evidence for the five-factor solution, that is, technological innovation, functional adequacy, content accessibility, practical utility, and reputation-seeking intention, for the 36-item SEDA-IUQ. Various relationships in the research model are tested using confirmatory factor analysis and structural equation modeling. In addition to developing a practical questionnaire that the e-recruitment researchers and practitioners can deploy to study jobseekers’ behavioral intentions, this is the first study on job sear... download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2016 Stimulus equivalence-based instruction (EBI) was used to teach four, 4-member classes representing functions of behavior to ten graduate students. The classes represented behavior maintained by attention (Class 1), escape (Class 2), access to tangibles (Class 3), and automatic reinforcement (Class 4). Stimuli within each class consisted of a single textual label, and multiple exemplars of textual descriptions, graphical representations, and clinical vignettes. EBI was conducted using custom computer software in a match-to-sample (MTS) format."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "elopement event was inversely related to age, but positively associated with the presence of an ASD diagnosis. Using parent-response items from the CDC da... download Download free PDF View PDF chevron_right Journal of Developmental and Physical Disabilities, 2018 Self-injurious behavior (SIB) is one of the most detrimental behaviors for the person showing it, as well as for their environment. Nevertheless, structured clinical assessments of SIB are scarce. Staff completed a Self-Harm Scale (SHS) every time they witnessed SIB in clients with an intellectual disability (ID) and co-occurring psychopathology (N = 33). Descriptive statistics were conducted to explore the nature of the incidents of SIB and the characteristics of the people involved in the incidents. In 41 weeks, 104 SIB incidents were reported for 8 out of 33 clients (24%). Incidents were most prevalent on Mondays (23%). As far as the methods of SIB concerned, cutting was the most used method (63%). Clients who showed SIB differed significantly from clients who did not on gender, having a personality disorder and communicative abilities. This study was one of the few that used an incident-based record form to report SIB by direct observation. It is hoped that the SHS helps to gain more download Download free PDF View PDF chevron_right Journal of Applied Research in Intellectual Disabilities, 2019 People with intellectual disabilities (ID) are at greater risk of developing psychopathology than people without ID (Matson & Shoemaker, 2011). In addition, they relatively often engage in disruptive and challenging behaviours (CB), including aggressive behaviour, self-injurious behaviour (SIB) and sexualized challenging behaviour (SCB) (Luiselli, 2012). CB can be seen as \"the product of interaction between the individual and its environment\" (Bank et al., 2007). Therefore, the environments of people with ID, and particularly their support staff, could play a key role in the prevention and management of CB (van den Bogaard, Nijman, Palmstierna, & Embregts, 2018a; Hastings, 2010). Several previous studies have addressed the explicit role that support staff may have in triggering and reacting to CB. For example, support staff members have noted that their interactions with people with ID could be triggers for CB and that they consider their interventions necessary to stopping or controlling CB (e.g. van download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2022 Functional analyses (FA) and functional communication training (FCT) are the most commonly used behavioral assessment and treatment approaches via telehealth for children with autism spectrum disorder (ASD) who display challenging behavior. The FA + FCT telehealth model has been shown to maintain treatment effectiveness (i.e., child behavioral outcomes and parent acceptability), as well as demonstrate treatment efficiency (i.e., cost savings). However, the majority of these studies have been conducted in the United States. Therefore, the purpose of this study was to evaluate the outcomes obtained with the telehealth FA + FCT model that included global applications. Descriptive statistics were used to analyze the results of the 199 participants who enrolled in the telehealth project across all project sites. The results showed that behavioral outcomes and parent acceptability maintained at similar levels to previous studies across all sites. Additionally, very few differences were fo... download Download free PDF View PDF chevron_right Foundations of Management By integrating several prominent theories and models in technology adoption, this study develops a research model to examine the factors affecting jobseekers’ intention to use job boards. The validity and reliability of the researcher-developed instrument, the SEDA-IUQ (SEDA-Intention to Use Questionnaire), were assessed using a combination of statistical methods. Utilizing the data collected from 447 Iranian respondents, findings from the exploratory factor analysis provided evidence for the five-factor solution, that is, technological innovation, functional adequacy, content accessibility, practical utility, and reputation-seeking intention, for the 36-item SEDA-IUQ. Various relationships in the research model are tested using confirmatory factor analysis and structural equation modeling. In addition to developing a practical questionnaire that the e-recruitment researchers and practitioners can deploy to study jobseekers’ behavioral intentions, this is the first study on job sear... download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2016 Stimulus equivalence-based instruction (EBI) was used to teach four, 4-member classes representing functions of behavior to ten graduate students. The classes represented behavior maintained by attention (Class 1), escape (Class 2), access to tangibles (Class 3), and automatic reinforcement (Class 4). Stimuli within each class consisted of a single textual label, and multiple exemplars of textual descriptions, graphical representations, and clinical vignettes. EBI was conducted using custom computer software in a match-to-sample (MTS) format."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Economic Development",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "elopement event was inversely related to age, but positively associated with the presence of an ASD diagnosis. Using parent-response items from the CDC da... download Download free PDF View PDF chevron_right Journal of Developmental and Physical Disabilities, 2018 Self-injurious behavior (SIB) is one of the most detrimental behaviors for the person showing it, as well as for their environment. Nevertheless, structured clinical assessments of SIB are scarce. Staff completed a Self-Harm Scale (SHS) every time they witnessed SIB in clients with an intellectual disability (ID) and co-occurring psychopathology (N = 33). Descriptive statistics were conducted to explore the nature of the incidents of SIB and the characteristics of the people involved in the incidents. In 41 weeks, 104 SIB incidents were reported for 8 out of 33 clients (24%). Incidents were most prevalent on Mondays (23%). As far as the methods of SIB concerned, cutting was the most used method (63%). Clients who showed SIB differed significantly from clients who did not on gender, having a personality disorder and communicative abilities. This study was one of the few that used an incident-based record form to report SIB by direct observation. It is hoped that the SHS helps to gain more download Download free PDF View PDF chevron_right Journal of Applied Research in Intellectual Disabilities, 2019 People with intellectual disabilities (ID) are at greater risk of developing psychopathology than people without ID (Matson & Shoemaker, 2011). In addition, they relatively often engage in disruptive and challenging behaviours (CB), including aggressive behaviour, self-injurious behaviour (SIB) and sexualized challenging behaviour (SCB) (Luiselli, 2012). CB can be seen as \"the product of interaction between the individual and its environment\" (Bank et al., 2007). Therefore, the environments of people with ID, and particularly their support staff, could play a key role in the prevention and management of CB (van den Bogaard, Nijman, Palmstierna, & Embregts, 2018a; Hastings, 2010). Several previous studies have addressed the explicit role that support staff may have in triggering and reacting to CB. For example, support staff members have noted that their interactions with people with ID could be triggers for CB and that they consider their interventions necessary to stopping or controlling CB (e.g. van download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2022 Functional analyses (FA) and functional communication training (FCT) are the most commonly used behavioral assessment and treatment approaches via telehealth for children with autism spectrum disorder (ASD) who display challenging behavior. The FA + FCT telehealth model has been shown to maintain treatment effectiveness (i.e., child behavioral outcomes and parent acceptability), as well as demonstrate treatment efficiency (i.e., cost savings). However, the majority of these studies have been conducted in the United States. Therefore, the purpose of this study was to evaluate the outcomes obtained with the telehealth FA + FCT model that included global applications. Descriptive statistics were used to analyze the results of the 199 participants who enrolled in the telehealth project across all project sites. The results showed that behavioral outcomes and parent acceptability maintained at similar levels to previous studies across all sites. Additionally, very few differences were fo... download Download free PDF View PDF chevron_right Foundations of Management By integrating several prominent theories and models in technology adoption, this study develops a research model to examine the factors affecting jobseekers’ intention to use job boards. The validity and reliability of the researcher-developed instrument, the SEDA-IUQ (SEDA-Intention to Use Questionnaire), were assessed using a combination of statistical methods. Utilizing the data collected from 447 Iranian respondents, findings from the exploratory factor analysis provided evidence for the five-factor solution, that is, technological innovation, functional adequacy, content accessibility, practical utility, and reputation-seeking intention, for the 36-item SEDA-IUQ. Various relationships in the research model are tested using confirmatory factor analysis and structural equation modeling. In addition to developing a practical questionnaire that the e-recruitment researchers and practitioners can deploy to study jobseekers’ behavioral intentions, this is the first study on job sear... download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2016 Stimulus equivalence-based instruction (EBI) was used to teach four, 4-member classes representing functions of behavior to ten graduate students. The classes represented behavior maintained by attention (Class 1), escape (Class 2), access to tangibles (Class 3), and automatic reinforcement (Class 4). Stimuli within each class consisted of a single textual label, and multiple exemplars of textual descriptions, graphical representations, and clinical vignettes. EBI was conducted using custom computer software in a match-to-sample (MTS) format."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "elopement event was inversely related to age, but positively associated with the presence of an ASD diagnosis. Using parent-response items from the CDC da... download Download free PDF View PDF chevron_right Journal of Developmental and Physical Disabilities, 2018 Self-injurious behavior (SIB) is one of the most detrimental behaviors for the person showing it, as well as for their environment. Nevertheless, structured clinical assessments of SIB are scarce. Staff completed a Self-Harm Scale (SHS) every time they witnessed SIB in clients with an intellectual disability (ID) and co-occurring psychopathology (N = 33). Descriptive statistics were conducted to explore the nature of the incidents of SIB and the characteristics of the people involved in the incidents. In 41 weeks, 104 SIB incidents were reported for 8 out of 33 clients (24%). Incidents were most prevalent on Mondays (23%). As far as the methods of SIB concerned, cutting was the most used method (63%). Clients who showed SIB differed significantly from clients who did not on gender, having a personality disorder and communicative abilities. This study was one of the few that used an incident-based record form to report SIB by direct observation. It is hoped that the SHS helps to gain more download Download free PDF View PDF chevron_right Journal of Applied Research in Intellectual Disabilities, 2019 People with intellectual disabilities (ID) are at greater risk of developing psychopathology than people without ID (Matson & Shoemaker, 2011). In addition, they relatively often engage in disruptive and challenging behaviours (CB), including aggressive behaviour, self-injurious behaviour (SIB) and sexualized challenging behaviour (SCB) (Luiselli, 2012). CB can be seen as \"the product of interaction between the individual and its environment\" (Bank et al., 2007). Therefore, the environments of people with ID, and particularly their support staff, could play a key role in the prevention and management of CB (van den Bogaard, Nijman, Palmstierna, & Embregts, 2018a; Hastings, 2010). Several previous studies have addressed the explicit role that support staff may have in triggering and reacting to CB. For example, support staff members have noted that their interactions with people with ID could be triggers for CB and that they consider their interventions necessary to stopping or controlling CB (e.g. van download Download free PDF View PDF chevron_right International Journal of Environmental Research and Public Health, 2022 Functional analyses (FA) and functional communication training (FCT) are the most commonly used behavioral assessment and treatment approaches via telehealth for children with autism spectrum disorder (ASD) who display challenging behavior. The FA + FCT telehealth model has been shown to maintain treatment effectiveness (i.e., child behavioral outcomes and parent acceptability), as well as demonstrate treatment efficiency (i.e., cost savings). However, the majority of these studies have been conducted in the United States. Therefore, the purpose of this study was to evaluate the outcomes obtained with the telehealth FA + FCT model that included global applications. Descriptive statistics were used to analyze the results of the 199 participants who enrolled in the telehealth project across all project sites. The results showed that behavioral outcomes and parent acceptability maintained at similar levels to previous studies across all sites. Additionally, very few differences were fo... download Download free PDF View PDF chevron_right Foundations of Management By integrating several prominent theories and models in technology adoption, this study develops a research model to examine the factors affecting jobseekers’ intention to use job boards. The validity and reliability of the researcher-developed instrument, the SEDA-IUQ (SEDA-Intention to Use Questionnaire), were assessed using a combination of statistical methods. Utilizing the data collected from 447 Iranian respondents, findings from the exploratory factor analysis provided evidence for the five-factor solution, that is, technological innovation, functional adequacy, content accessibility, practical utility, and reputation-seeking intention, for the 36-item SEDA-IUQ. Various relationships in the research model are tested using confirmatory factor analysis and structural equation modeling. In addition to developing a practical questionnaire that the e-recruitment researchers and practitioners can deploy to study jobseekers’ behavioral intentions, this is the first study on job sear... download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2016 Stimulus equivalence-based instruction (EBI) was used to teach four, 4-member classes representing functions of behavior to ten graduate students. The classes represented behavior maintained by attention (Class 1), escape (Class 2), access to tangibles (Class 3), and automatic reinforcement (Class 4). Stimuli within each class consisted of a single textual label, and multiple exemplars of textual descriptions, graphical representations, and clinical vignettes. EBI was conducted using custom computer software in a match-to-sample (MTS) format."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "A pretesttrain-posttest design conducted during a single session evaluated performances on computer MTS, written multiple-choice, and oral tests. Scores improved from pretests to posttests on all three tests for all students following EBI. In addition, class-consistent performances maintained 2 weeks after posttests were conducted. These results demonstrated that EBI can be used to effectively teach the functions of behavior and that a MTS teaching protocol administered on a computer can promote the emergence of class-consistent responding to selection-based (i.e., multiplechoice) and topography-based (i.e., oral) tests. download Download free PDF View PDF chevron_right Journal of Policy and Practice in Intellectual Disabilities, 2020 Issues: The International Association for the Scientific Study of Intellectual and Developmental Disabilities (IASSIDD) is an international group of researchers, clinicians, students, parents, and self-advocates that promotes worldwide research and exchange of information on intellectual and developmental disabilities. IASSIDD recently developed a policy statement regarding their opposition to the use of contingent electric skin shock (CESS) with individuals with challenging behavior and intellectual and developmental disabilities. To support the policy, the available literature was reviewed to evaluate the efficacy, side effects, generalization, and long-term effectiveness of the procedure as an intervention for challenging behavior. Findings: The review provides a history that demonstrates that, although CESS can decrease the frequency of challenging behavior, it comes at a cost in terms of physical and emotional side effects, and questions remain regarding the long-term effectiveness of the procedure. In addition, we raise several ethical and methodological issues that make the research on the use of CESS even more concerning. Conclusions: Although research continues in some countries, these studies are now rare. In fact, in the United States, the Food and Drug Administration has just banned the use of such devices with individuals with self-injury and aggression. It is hoped that, because there are many other forms of treatment that have shown to be effective for severe challenging behavior, we can completely avoid the use of CESS. download Download free PDF View PDF chevron_right Behavior Modification, 2019 An increasing number of children fail to meet the recommended levels of physical activity. The purpose of this study was to examine the effects of peer presence on variables that have been shown to evoke moderate-to-vigorous physical activity (MVPA) in children. We recorded the levels of MVPA in three preschool children across no adult, attention, and interactive play conditions, with a peer present and absent. All conditions were compared with a naturalistic baseline and presented in a multielement design with a brief reversal to baseline and reintroduction of the most effective condition. All three participants displayed most MVPA during the interactive play condition with a peer present. This study furthers research on the identification of variables that evoke MVPA in young children and emphasizes the interaction of peer presence and contingent social positive reinforcement as relevant variables. download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2018 Background-Individuals with fragile X syndrome (FXS), the most common known inherited form of intellectual disability (ID), are at increased risk for showing specific forms of selfinjurious behaviour (SIB) such as hand biting and head hitting, suggesting that biological factors associated with the syndrome confers increased risk for SIB. Few studies, however, have examined the extent to which social-environmental variables can influence the occurrence of these behaviours in this population. Method-Twenty-two adolescent boys with FXS, aged 10 to 18 years were systematically exposed to seven environmental conditions in functional analyses of SIB conducted over 2 days at our research centre. Results-Fourteen (63.6%) boys with FXS engaged in SIB during the functional analyses. Ten (45.5%) boys engaged in SIB that was maintained by social-environmental variables, that is, gaining access to attention/tangibles and/or escaping from social interaction, task demands and/or transition demands. For two boys, SIB was undifferentiated across conditions, and for two boys, SIB appeared to be maintained by automatic reinforcement. Conclusions-Social-environmental variables appeared to maintain SIB in a significant proportion of boys with FXS. Given that pharmacological treatments for SIB have limited efficacy in this population, the potential role of social-environmental factors on SIB should be examined before pharmacological treatments are implemented for these behaviours. download Download free PDF View PDF chevron_right Children (Basel, Switzerland), 2017 Sleep disturbances in children with autism spectrum disorder (ASD) are significantly more prevalent than found in typically developing (TD) children. Given the detrimental impact of poor sleep on cognitive, emotional, and behavioral functioning, it is imperative to screen and assess for sleep disturbances in this population. In this paper, we describe"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "A pretesttrain-posttest design conducted during a single session evaluated performances on computer MTS, written multiple-choice, and oral tests. Scores improved from pretests to posttests on all three tests for all students following EBI. In addition, class-consistent performances maintained 2 weeks after posttests were conducted. These results demonstrated that EBI can be used to effectively teach the functions of behavior and that a MTS teaching protocol administered on a computer can promote the emergence of class-consistent responding to selection-based (i.e., multiplechoice) and topography-based (i.e., oral) tests. download Download free PDF View PDF chevron_right Journal of Policy and Practice in Intellectual Disabilities, 2020 Issues: The International Association for the Scientific Study of Intellectual and Developmental Disabilities (IASSIDD) is an international group of researchers, clinicians, students, parents, and self-advocates that promotes worldwide research and exchange of information on intellectual and developmental disabilities. IASSIDD recently developed a policy statement regarding their opposition to the use of contingent electric skin shock (CESS) with individuals with challenging behavior and intellectual and developmental disabilities. To support the policy, the available literature was reviewed to evaluate the efficacy, side effects, generalization, and long-term effectiveness of the procedure as an intervention for challenging behavior. Findings: The review provides a history that demonstrates that, although CESS can decrease the frequency of challenging behavior, it comes at a cost in terms of physical and emotional side effects, and questions remain regarding the long-term effectiveness of the procedure. In addition, we raise several ethical and methodological issues that make the research on the use of CESS even more concerning. Conclusions: Although research continues in some countries, these studies are now rare. In fact, in the United States, the Food and Drug Administration has just banned the use of such devices with individuals with self-injury and aggression. It is hoped that, because there are many other forms of treatment that have shown to be effective for severe challenging behavior, we can completely avoid the use of CESS. download Download free PDF View PDF chevron_right Behavior Modification, 2019 An increasing number of children fail to meet the recommended levels of physical activity. The purpose of this study was to examine the effects of peer presence on variables that have been shown to evoke moderate-to-vigorous physical activity (MVPA) in children. We recorded the levels of MVPA in three preschool children across no adult, attention, and interactive play conditions, with a peer present and absent. All conditions were compared with a naturalistic baseline and presented in a multielement design with a brief reversal to baseline and reintroduction of the most effective condition. All three participants displayed most MVPA during the interactive play condition with a peer present. This study furthers research on the identification of variables that evoke MVPA in young children and emphasizes the interaction of peer presence and contingent social positive reinforcement as relevant variables. download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2018 Background-Individuals with fragile X syndrome (FXS), the most common known inherited form of intellectual disability (ID), are at increased risk for showing specific forms of selfinjurious behaviour (SIB) such as hand biting and head hitting, suggesting that biological factors associated with the syndrome confers increased risk for SIB. Few studies, however, have examined the extent to which social-environmental variables can influence the occurrence of these behaviours in this population. Method-Twenty-two adolescent boys with FXS, aged 10 to 18 years were systematically exposed to seven environmental conditions in functional analyses of SIB conducted over 2 days at our research centre. Results-Fourteen (63.6%) boys with FXS engaged in SIB during the functional analyses. Ten (45.5%) boys engaged in SIB that was maintained by social-environmental variables, that is, gaining access to attention/tangibles and/or escaping from social interaction, task demands and/or transition demands. For two boys, SIB was undifferentiated across conditions, and for two boys, SIB appeared to be maintained by automatic reinforcement. Conclusions-Social-environmental variables appeared to maintain SIB in a significant proportion of boys with FXS. Given that pharmacological treatments for SIB have limited efficacy in this population, the potential role of social-environmental factors on SIB should be examined before pharmacological treatments are implemented for these behaviours. download Download free PDF View PDF chevron_right Children (Basel, Switzerland), 2017 Sleep disturbances in children with autism spectrum disorder (ASD) are significantly more prevalent than found in typically developing (TD) children. Given the detrimental impact of poor sleep on cognitive, emotional, and behavioral functioning, it is imperative to screen and assess for sleep disturbances in this population. In this paper, we describe"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 5,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "A pretesttrain-posttest design conducted during a single session evaluated performances on computer MTS, written multiple-choice, and oral tests. Scores improved from pretests to posttests on all three tests for all students following EBI. In addition, class-consistent performances maintained 2 weeks after posttests were conducted. These results demonstrated that EBI can be used to effectively teach the functions of behavior and that a MTS teaching protocol administered on a computer can promote the emergence of class-consistent responding to selection-based (i.e., multiplechoice) and topography-based (i.e., oral) tests. download Download free PDF View PDF chevron_right Journal of Policy and Practice in Intellectual Disabilities, 2020 Issues: The International Association for the Scientific Study of Intellectual and Developmental Disabilities (IASSIDD) is an international group of researchers, clinicians, students, parents, and self-advocates that promotes worldwide research and exchange of information on intellectual and developmental disabilities. IASSIDD recently developed a policy statement regarding their opposition to the use of contingent electric skin shock (CESS) with individuals with challenging behavior and intellectual and developmental disabilities. To support the policy, the available literature was reviewed to evaluate the efficacy, side effects, generalization, and long-term effectiveness of the procedure as an intervention for challenging behavior. Findings: The review provides a history that demonstrates that, although CESS can decrease the frequency of challenging behavior, it comes at a cost in terms of physical and emotional side effects, and questions remain regarding the long-term effectiveness of the procedure. In addition, we raise several ethical and methodological issues that make the research on the use of CESS even more concerning. Conclusions: Although research continues in some countries, these studies are now rare. In fact, in the United States, the Food and Drug Administration has just banned the use of such devices with individuals with self-injury and aggression. It is hoped that, because there are many other forms of treatment that have shown to be effective for severe challenging behavior, we can completely avoid the use of CESS. download Download free PDF View PDF chevron_right Behavior Modification, 2019 An increasing number of children fail to meet the recommended levels of physical activity. The purpose of this study was to examine the effects of peer presence on variables that have been shown to evoke moderate-to-vigorous physical activity (MVPA) in children. We recorded the levels of MVPA in three preschool children across no adult, attention, and interactive play conditions, with a peer present and absent. All conditions were compared with a naturalistic baseline and presented in a multielement design with a brief reversal to baseline and reintroduction of the most effective condition. All three participants displayed most MVPA during the interactive play condition with a peer present. This study furthers research on the identification of variables that evoke MVPA in young children and emphasizes the interaction of peer presence and contingent social positive reinforcement as relevant variables. download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2018 Background-Individuals with fragile X syndrome (FXS), the most common known inherited form of intellectual disability (ID), are at increased risk for showing specific forms of selfinjurious behaviour (SIB) such as hand biting and head hitting, suggesting that biological factors associated with the syndrome confers increased risk for SIB. Few studies, however, have examined the extent to which social-environmental variables can influence the occurrence of these behaviours in this population. Method-Twenty-two adolescent boys with FXS, aged 10 to 18 years were systematically exposed to seven environmental conditions in functional analyses of SIB conducted over 2 days at our research centre. Results-Fourteen (63.6%) boys with FXS engaged in SIB during the functional analyses. Ten (45.5%) boys engaged in SIB that was maintained by social-environmental variables, that is, gaining access to attention/tangibles and/or escaping from social interaction, task demands and/or transition demands. For two boys, SIB was undifferentiated across conditions, and for two boys, SIB appeared to be maintained by automatic reinforcement. Conclusions-Social-environmental variables appeared to maintain SIB in a significant proportion of boys with FXS. Given that pharmacological treatments for SIB have limited efficacy in this population, the potential role of social-environmental factors on SIB should be examined before pharmacological treatments are implemented for these behaviours. download Download free PDF View PDF chevron_right Children (Basel, Switzerland), 2017 Sleep disturbances in children with autism spectrum disorder (ASD) are significantly more prevalent than found in typically developing (TD) children. Given the detrimental impact of poor sleep on cognitive, emotional, and behavioral functioning, it is imperative to screen and assess for sleep disturbances in this population. In this paper, we describe"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "A pretesttrain-posttest design conducted during a single session evaluated performances on computer MTS, written multiple-choice, and oral tests. Scores improved from pretests to posttests on all three tests for all students following EBI. In addition, class-consistent performances maintained 2 weeks after posttests were conducted. These results demonstrated that EBI can be used to effectively teach the functions of behavior and that a MTS teaching protocol administered on a computer can promote the emergence of class-consistent responding to selection-based (i.e., multiplechoice) and topography-based (i.e., oral) tests. download Download free PDF View PDF chevron_right Journal of Policy and Practice in Intellectual Disabilities, 2020 Issues: The International Association for the Scientific Study of Intellectual and Developmental Disabilities (IASSIDD) is an international group of researchers, clinicians, students, parents, and self-advocates that promotes worldwide research and exchange of information on intellectual and developmental disabilities. IASSIDD recently developed a policy statement regarding their opposition to the use of contingent electric skin shock (CESS) with individuals with challenging behavior and intellectual and developmental disabilities. To support the policy, the available literature was reviewed to evaluate the efficacy, side effects, generalization, and long-term effectiveness of the procedure as an intervention for challenging behavior. Findings: The review provides a history that demonstrates that, although CESS can decrease the frequency of challenging behavior, it comes at a cost in terms of physical and emotional side effects, and questions remain regarding the long-term effectiveness of the procedure. In addition, we raise several ethical and methodological issues that make the research on the use of CESS even more concerning. Conclusions: Although research continues in some countries, these studies are now rare. In fact, in the United States, the Food and Drug Administration has just banned the use of such devices with individuals with self-injury and aggression. It is hoped that, because there are many other forms of treatment that have shown to be effective for severe challenging behavior, we can completely avoid the use of CESS. download Download free PDF View PDF chevron_right Behavior Modification, 2019 An increasing number of children fail to meet the recommended levels of physical activity. The purpose of this study was to examine the effects of peer presence on variables that have been shown to evoke moderate-to-vigorous physical activity (MVPA) in children. We recorded the levels of MVPA in three preschool children across no adult, attention, and interactive play conditions, with a peer present and absent. All conditions were compared with a naturalistic baseline and presented in a multielement design with a brief reversal to baseline and reintroduction of the most effective condition. All three participants displayed most MVPA during the interactive play condition with a peer present. This study furthers research on the identification of variables that evoke MVPA in young children and emphasizes the interaction of peer presence and contingent social positive reinforcement as relevant variables. download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2018 Background-Individuals with fragile X syndrome (FXS), the most common known inherited form of intellectual disability (ID), are at increased risk for showing specific forms of selfinjurious behaviour (SIB) such as hand biting and head hitting, suggesting that biological factors associated with the syndrome confers increased risk for SIB. Few studies, however, have examined the extent to which social-environmental variables can influence the occurrence of these behaviours in this population. Method-Twenty-two adolescent boys with FXS, aged 10 to 18 years were systematically exposed to seven environmental conditions in functional analyses of SIB conducted over 2 days at our research centre. Results-Fourteen (63.6%) boys with FXS engaged in SIB during the functional analyses. Ten (45.5%) boys engaged in SIB that was maintained by social-environmental variables, that is, gaining access to attention/tangibles and/or escaping from social interaction, task demands and/or transition demands. For two boys, SIB was undifferentiated across conditions, and for two boys, SIB appeared to be maintained by automatic reinforcement. Conclusions-Social-environmental variables appeared to maintain SIB in a significant proportion of boys with FXS. Given that pharmacological treatments for SIB have limited efficacy in this population, the potential role of social-environmental factors on SIB should be examined before pharmacological treatments are implemented for these behaviours. download Download free PDF View PDF chevron_right Children (Basel, Switzerland), 2017 Sleep disturbances in children with autism spectrum disorder (ASD) are significantly more prevalent than found in typically developing (TD) children. Given the detrimental impact of poor sleep on cognitive, emotional, and behavioral functioning, it is imperative to screen and assess for sleep disturbances in this population. In this paper, we describe"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 8,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the screening and assessment process, as well as specific measures commonly used for assessing sleep in children with ASD. Advantages and limitations for use in children with ASD are discussed. While subjective measures, such as parent-report questionnaires and sleep diaries, are the most widely used, more objective measures such as actigraphy, polysomnography, and videosomnography provide additional valuable information for both diagnostic purposes and treatment planning. These objective measures, nonetheless, are limited by cost, availability, and feasibility of use with children with ASD. The current review provides an argument for ... download Download free PDF View PDF chevron_right Behavioral Disorders, 2015 This survey study assessed the acceptability of a variety of functional behavioral assessment (FBA) procedures (i.e., functional assessment interviews, rating scales/questionnaires, systematic direct observations, functional analysis manipulations) to a national sample of 123 special educators and a state sample of 140 school psychologists. Results indicated that special educators and school psychologists reported generally positive perceptions regarding their willingness to participate in, the appropriateness of, the usefulness of, and the feasibility of the FBA procedures. Special educators were significantly more likely to endorse the use of systematic direct observation and functional analysis manipulation strategies than school psychologists, although no differences were found regarding the social desirability of FBA procedures for individuals exhibiting mild and severe problem behaviors. School psychologists were also more likely than special educators to express concerns abou... download Download free PDF View PDF chevron_right The Psychological Record, 2018 The Gambling Functional Assessment (GFA) hypothesized four possible maintaining functions of gambling behavior, including social attention, escape from aversive events, access to tangible items, and sensory stimulation. In the years following the GFA's release, research teams have argued for a revised model of the GFA to account for just two possible functions maintaining gambling behavior (positive and negative reinforcement). In the current study, we examined the extent to which a four-factor gambling functional assessment was possible, sustaining a conceptual and theoretical orientation consistent with a functional behavioral account of gambling. Three hundred and sixty-five recreational and disordered gamblers completed a demographic survey, the South Oaks Gambling Screen (SOGS), and the GFA. An exploratory factor analysis was first conducted to determine GFA functional items that loaded onto a common factor, and a confirmatory factor analysis was conducted to determine if a fourfactor model, consistent with the functional categories of the GFA, provided a good fit for the obtained data. Outcomes supported the model, suggesting that a four-factor functional account of gambling behavior can be obtained. Differing results obtained by separate research teams, however, suggest that more precise research may be needed in the development and analysis of functional instruments for use with gamblers. Keywords Addiction. Behavior analysis. Disordered gambling. Gambling functional assessment Attempts to understand why people gamble when the odds of winning are against them have included a myriad of self-report assessments that hope to gain insight into the minds of gamblers (e.g., download Download free PDF View PDF chevron_right Journal of Autism and Developmental Disorders, 2020 Parent-mediated interventions can reduce behavioral and emotional problems in children with ASD. This report discusses the development of the first group parent intervention targeting behaviors and anxiety in children with ASD, across the spectrum of cognitive and language ability. 'Predictive Parenting' was developed from the clinical observation (and emerging evidence base) that children with ASD struggle with 'prediction' and anticipating change. It integrates well-established parenting strategies within an ASD-specific framework. The concept was co-created with patient and public involvement panels of parents and adults with ASD. A feasibility study found the programme is acceptable and accessible. Qualitative feedback from participants was largely positive, and critiques were used to inform a larger, pilot randomized controlled trial of the intervention. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2019 We conducted this study to determine if the efficiency of the functional analysis could be improved without detrimental effects on control. In Experiment 1, we reanalyzed functional analyses conducted for the problem behavior of 18 children. We analyzed rates of problem behavior during the first 5 min and first 3 min of the original 10-min sessions and evaluated if changes in the level of control over problem behavior by the programmed contingency were evident from the analyses of shorter session duration. In Experiment 2, we conducted 8 consecutive functional analyses with 3-min sessions to further evaluate the utility of brief session durations. We found that control over problem behavior was demonstrated when conducting functional analyses with sessions as brief as 3 min."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the screening and assessment process, as well as specific measures commonly used for assessing sleep in children with ASD. Advantages and limitations for use in children with ASD are discussed. While subjective measures, such as parent-report questionnaires and sleep diaries, are the most widely used, more objective measures such as actigraphy, polysomnography, and videosomnography provide additional valuable information for both diagnostic purposes and treatment planning. These objective measures, nonetheless, are limited by cost, availability, and feasibility of use with children with ASD. The current review provides an argument for ... download Download free PDF View PDF chevron_right Behavioral Disorders, 2015 This survey study assessed the acceptability of a variety of functional behavioral assessment (FBA) procedures (i.e., functional assessment interviews, rating scales/questionnaires, systematic direct observations, functional analysis manipulations) to a national sample of 123 special educators and a state sample of 140 school psychologists. Results indicated that special educators and school psychologists reported generally positive perceptions regarding their willingness to participate in, the appropriateness of, the usefulness of, and the feasibility of the FBA procedures. Special educators were significantly more likely to endorse the use of systematic direct observation and functional analysis manipulation strategies than school psychologists, although no differences were found regarding the social desirability of FBA procedures for individuals exhibiting mild and severe problem behaviors. School psychologists were also more likely than special educators to express concerns abou... download Download free PDF View PDF chevron_right The Psychological Record, 2018 The Gambling Functional Assessment (GFA) hypothesized four possible maintaining functions of gambling behavior, including social attention, escape from aversive events, access to tangible items, and sensory stimulation. In the years following the GFA's release, research teams have argued for a revised model of the GFA to account for just two possible functions maintaining gambling behavior (positive and negative reinforcement). In the current study, we examined the extent to which a four-factor gambling functional assessment was possible, sustaining a conceptual and theoretical orientation consistent with a functional behavioral account of gambling. Three hundred and sixty-five recreational and disordered gamblers completed a demographic survey, the South Oaks Gambling Screen (SOGS), and the GFA. An exploratory factor analysis was first conducted to determine GFA functional items that loaded onto a common factor, and a confirmatory factor analysis was conducted to determine if a fourfactor model, consistent with the functional categories of the GFA, provided a good fit for the obtained data. Outcomes supported the model, suggesting that a four-factor functional account of gambling behavior can be obtained. Differing results obtained by separate research teams, however, suggest that more precise research may be needed in the development and analysis of functional instruments for use with gamblers. Keywords Addiction. Behavior analysis. Disordered gambling. Gambling functional assessment Attempts to understand why people gamble when the odds of winning are against them have included a myriad of self-report assessments that hope to gain insight into the minds of gamblers (e.g., download Download free PDF View PDF chevron_right Journal of Autism and Developmental Disorders, 2020 Parent-mediated interventions can reduce behavioral and emotional problems in children with ASD. This report discusses the development of the first group parent intervention targeting behaviors and anxiety in children with ASD, across the spectrum of cognitive and language ability. 'Predictive Parenting' was developed from the clinical observation (and emerging evidence base) that children with ASD struggle with 'prediction' and anticipating change. It integrates well-established parenting strategies within an ASD-specific framework. The concept was co-created with patient and public involvement panels of parents and adults with ASD. A feasibility study found the programme is acceptable and accessible. Qualitative feedback from participants was largely positive, and critiques were used to inform a larger, pilot randomized controlled trial of the intervention. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2019 We conducted this study to determine if the efficiency of the functional analysis could be improved without detrimental effects on control. In Experiment 1, we reanalyzed functional analyses conducted for the problem behavior of 18 children. We analyzed rates of problem behavior during the first 5 min and first 3 min of the original 10-min sessions and evaluated if changes in the level of control over problem behavior by the programmed contingency were evident from the analyses of shorter session duration. In Experiment 2, we conducted 8 consecutive functional analyses with 3-min sessions to further evaluate the utility of brief session durations. We found that control over problem behavior was demonstrated when conducting functional analyses with sessions as brief as 3 min."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "the screening and assessment process, as well as specific measures commonly used for assessing sleep in children with ASD. Advantages and limitations for use in children with ASD are discussed. While subjective measures, such as parent-report questionnaires and sleep diaries, are the most widely used, more objective measures such as actigraphy, polysomnography, and videosomnography provide additional valuable information for both diagnostic purposes and treatment planning. These objective measures, nonetheless, are limited by cost, availability, and feasibility of use with children with ASD. The current review provides an argument for ... download Download free PDF View PDF chevron_right Behavioral Disorders, 2015 This survey study assessed the acceptability of a variety of functional behavioral assessment (FBA) procedures (i.e., functional assessment interviews, rating scales/questionnaires, systematic direct observations, functional analysis manipulations) to a national sample of 123 special educators and a state sample of 140 school psychologists. Results indicated that special educators and school psychologists reported generally positive perceptions regarding their willingness to participate in, the appropriateness of, the usefulness of, and the feasibility of the FBA procedures. Special educators were significantly more likely to endorse the use of systematic direct observation and functional analysis manipulation strategies than school psychologists, although no differences were found regarding the social desirability of FBA procedures for individuals exhibiting mild and severe problem behaviors. School psychologists were also more likely than special educators to express concerns abou... download Download free PDF View PDF chevron_right The Psychological Record, 2018 The Gambling Functional Assessment (GFA) hypothesized four possible maintaining functions of gambling behavior, including social attention, escape from aversive events, access to tangible items, and sensory stimulation. In the years following the GFA's release, research teams have argued for a revised model of the GFA to account for just two possible functions maintaining gambling behavior (positive and negative reinforcement). In the current study, we examined the extent to which a four-factor gambling functional assessment was possible, sustaining a conceptual and theoretical orientation consistent with a functional behavioral account of gambling. Three hundred and sixty-five recreational and disordered gamblers completed a demographic survey, the South Oaks Gambling Screen (SOGS), and the GFA. An exploratory factor analysis was first conducted to determine GFA functional items that loaded onto a common factor, and a confirmatory factor analysis was conducted to determine if a fourfactor model, consistent with the functional categories of the GFA, provided a good fit for the obtained data. Outcomes supported the model, suggesting that a four-factor functional account of gambling behavior can be obtained. Differing results obtained by separate research teams, however, suggest that more precise research may be needed in the development and analysis of functional instruments for use with gamblers. Keywords Addiction. Behavior analysis. Disordered gambling. Gambling functional assessment Attempts to understand why people gamble when the odds of winning are against them have included a myriad of self-report assessments that hope to gain insight into the minds of gamblers (e.g., download Download free PDF View PDF chevron_right Journal of Autism and Developmental Disorders, 2020 Parent-mediated interventions can reduce behavioral and emotional problems in children with ASD. This report discusses the development of the first group parent intervention targeting behaviors and anxiety in children with ASD, across the spectrum of cognitive and language ability. 'Predictive Parenting' was developed from the clinical observation (and emerging evidence base) that children with ASD struggle with 'prediction' and anticipating change. It integrates well-established parenting strategies within an ASD-specific framework. The concept was co-created with patient and public involvement panels of parents and adults with ASD. A feasibility study found the programme is acceptable and accessible. Qualitative feedback from participants was largely positive, and critiques were used to inform a larger, pilot randomized controlled trial of the intervention. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2019 We conducted this study to determine if the efficiency of the functional analysis could be improved without detrimental effects on control. In Experiment 1, we reanalyzed functional analyses conducted for the problem behavior of 18 children. We analyzed rates of problem behavior during the first 5 min and first 3 min of the original 10-min sessions and evaluated if changes in the level of control over problem behavior by the programmed contingency were evident from the analyses of shorter session duration. In Experiment 2, we conducted 8 consecutive functional analyses with 3-min sessions to further evaluate the utility of brief session durations. We found that control over problem behavior was demonstrated when conducting functional analyses with sessions as brief as 3 min."
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "download Download free PDF View PDF chevron_right Behavioral Interventions, 2018 download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2017 The application of telehealth technology to conduct functional analysis (FA) and functional communication training (FCT) is emerging for children with developmental disabilities and behaviour support needs. The current study was designed to extend FA + FCT for self-injurious behaviour by using telehealth in home with parents as interventionists receiving real-time remote coaching. Two families with school-aged boys with developmental disabilities associated with intellectual disability participated, one with cerebral palsy and the other with autism spectrum disorder. Results indicated that parent-implemented FA + FCT via telehealth was effective for reducing self-injurious behaviour and increasing mands (communication requests) for both children. Both families successfully implemented the FA + FCT protocol with 95% overall fidelity via telehealth-supported coaching. Results are discussed in terms of their relationship to previous research, limitations and future directions. Keywords functional analysis; functional communication training; self-injurious behaviour; telehealth Self-injurious behaviour (SIB) (e.g. hand to head hitting, eye poking and biting oneself) is aheterogenous behavioural disorder that can emerge early in life (e.g. Berkson, Tupa, & download Download free PDF View PDF chevron_right Behavioral Sciences The intention to repurchase is a key component in relationship marketing. However, minimal attention has been paid to how customers’ habitual behavior moderates the relationship between customers’ evaluation of benefits received from a service provider and the intention to revisit, specifically in a personal service business where customer-service provider interactions likely constitute the core of a sustainable relationship. To address this gap, the current study proposes and tests a comprehensive model to advance the theory of relationship marketing (RM) and additionally contributes to social exchange theory (SET), as well as the theory of repurchase decision making (TRD), in the business service context. Structural equation modeling (SEM) was employed to examine the relationships of the research model. Based on data collected from 482 customers on their perceptions of hairstylists, the empirical findings revealed that relational benefits significantly affect post-experience behav... download Download free PDF View PDF chevron_right Behavior Modification, 2018 Tic disorders are characterized by a class of responses assumed to be neurobiological in origin. Still, several studies have shown that tic frequency can be influenced by antecedent environmental events and social consequences. Prior reviews have summarized the effects of environmental events but have not examined relations between tic diagnosis, behavioral deficits (e.g., intellectual disability), tic topography, and the consequences observed to maintain tics. These variables might be important when attempting to predict or identify relevant consequences. A more thorough understanding of the variables that maintain and give rise to tics might also be useful in predicting responsiveness to treatment and intervention refinement. We reviewed and summarized results from the 13 attempts to experimentally identify maintaining consequences for tics (i.e., functional analyses) that have been published to date. We examined patterns of functions across tic diagnoses (i.e., Tourette's syndrome or not), communication impairments (i.e., an intellectual disability or reported language difficulty), and tic topography. Results suggested that individuals with Tourette's syndrome and those without communication impairments are more likely to have functional analysis outcomes consistent with automatic reinforcement, but exceptions in both directions highlight the utility of functional analysis in treating tics. download Download free PDF View PDF chevron_right Journal of Personalized Medicine Autism spectrum disorder (ASD), characterized by social, communication, and behavioral abnormalities, affects 1 in 36 children according to the CDC. Several co-occurring conditions are often associated with ASD, including sleep and immune disorders and gastrointestinal (GI) problems. ASD is also associated with sensory sensitivities. Some individuals with ASD exhibit episodes of challenging behaviors that can endanger themselves or others, including aggression and self-injurious behavior (SIB). In this work, we explored the use of artificial intelligence models to predict behavior episodes based on past data of co-occurring conditions and environmental factors for 80 individuals in a residential setting. We found that our models predict occurrences of behavior and non-behavior with accuracies as high as 90% for some individuals, and that environmental, as well as gastrointestinal, factors are notable predictors across the population examined. While more work is needed to examine the... download Download free PDF View PDF chevron_right Behavior analysis in practice, 2020 The present brief practice examined 6 randomly selected studies from the Journal of Applied Behavior Analysis that included functional analysis data replotted on the functional analysis celeration chart (FACC). The FACC showcases the practicality of a standard celeration chart-derived visual display. The research question asked, what level values"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Public Transit",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "download Download free PDF View PDF chevron_right Behavioral Interventions, 2018 download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2017 The application of telehealth technology to conduct functional analysis (FA) and functional communication training (FCT) is emerging for children with developmental disabilities and behaviour support needs. The current study was designed to extend FA + FCT for self-injurious behaviour by using telehealth in home with parents as interventionists receiving real-time remote coaching. Two families with school-aged boys with developmental disabilities associated with intellectual disability participated, one with cerebral palsy and the other with autism spectrum disorder. Results indicated that parent-implemented FA + FCT via telehealth was effective for reducing self-injurious behaviour and increasing mands (communication requests) for both children. Both families successfully implemented the FA + FCT protocol with 95% overall fidelity via telehealth-supported coaching. Results are discussed in terms of their relationship to previous research, limitations and future directions. Keywords functional analysis; functional communication training; self-injurious behaviour; telehealth Self-injurious behaviour (SIB) (e.g. hand to head hitting, eye poking and biting oneself) is aheterogenous behavioural disorder that can emerge early in life (e.g. Berkson, Tupa, & download Download free PDF View PDF chevron_right Behavioral Sciences The intention to repurchase is a key component in relationship marketing. However, minimal attention has been paid to how customers’ habitual behavior moderates the relationship between customers’ evaluation of benefits received from a service provider and the intention to revisit, specifically in a personal service business where customer-service provider interactions likely constitute the core of a sustainable relationship. To address this gap, the current study proposes and tests a comprehensive model to advance the theory of relationship marketing (RM) and additionally contributes to social exchange theory (SET), as well as the theory of repurchase decision making (TRD), in the business service context. Structural equation modeling (SEM) was employed to examine the relationships of the research model. Based on data collected from 482 customers on their perceptions of hairstylists, the empirical findings revealed that relational benefits significantly affect post-experience behav... download Download free PDF View PDF chevron_right Behavior Modification, 2018 Tic disorders are characterized by a class of responses assumed to be neurobiological in origin. Still, several studies have shown that tic frequency can be influenced by antecedent environmental events and social consequences. Prior reviews have summarized the effects of environmental events but have not examined relations between tic diagnosis, behavioral deficits (e.g., intellectual disability), tic topography, and the consequences observed to maintain tics. These variables might be important when attempting to predict or identify relevant consequences. A more thorough understanding of the variables that maintain and give rise to tics might also be useful in predicting responsiveness to treatment and intervention refinement. We reviewed and summarized results from the 13 attempts to experimentally identify maintaining consequences for tics (i.e., functional analyses) that have been published to date. We examined patterns of functions across tic diagnoses (i.e., Tourette's syndrome or not), communication impairments (i.e., an intellectual disability or reported language difficulty), and tic topography. Results suggested that individuals with Tourette's syndrome and those without communication impairments are more likely to have functional analysis outcomes consistent with automatic reinforcement, but exceptions in both directions highlight the utility of functional analysis in treating tics. download Download free PDF View PDF chevron_right Journal of Personalized Medicine Autism spectrum disorder (ASD), characterized by social, communication, and behavioral abnormalities, affects 1 in 36 children according to the CDC. Several co-occurring conditions are often associated with ASD, including sleep and immune disorders and gastrointestinal (GI) problems. ASD is also associated with sensory sensitivities. Some individuals with ASD exhibit episodes of challenging behaviors that can endanger themselves or others, including aggression and self-injurious behavior (SIB). In this work, we explored the use of artificial intelligence models to predict behavior episodes based on past data of co-occurring conditions and environmental factors for 80 individuals in a residential setting. We found that our models predict occurrences of behavior and non-behavior with accuracies as high as 90% for some individuals, and that environmental, as well as gastrointestinal, factors are notable predictors across the population examined. While more work is needed to examine the... download Download free PDF View PDF chevron_right Behavior analysis in practice, 2020 The present brief practice examined 6 randomly selected studies from the Journal of Applied Behavior Analysis that included functional analysis data replotted on the functional analysis celeration chart (FACC). The FACC showcases the practicality of a standard celeration chart-derived visual display. The research question asked, what level values"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "download Download free PDF View PDF chevron_right Behavioral Interventions, 2018 download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2017 The application of telehealth technology to conduct functional analysis (FA) and functional communication training (FCT) is emerging for children with developmental disabilities and behaviour support needs. The current study was designed to extend FA + FCT for self-injurious behaviour by using telehealth in home with parents as interventionists receiving real-time remote coaching. Two families with school-aged boys with developmental disabilities associated with intellectual disability participated, one with cerebral palsy and the other with autism spectrum disorder. Results indicated that parent-implemented FA + FCT via telehealth was effective for reducing self-injurious behaviour and increasing mands (communication requests) for both children. Both families successfully implemented the FA + FCT protocol with 95% overall fidelity via telehealth-supported coaching. Results are discussed in terms of their relationship to previous research, limitations and future directions. Keywords functional analysis; functional communication training; self-injurious behaviour; telehealth Self-injurious behaviour (SIB) (e.g. hand to head hitting, eye poking and biting oneself) is aheterogenous behavioural disorder that can emerge early in life (e.g. Berkson, Tupa, & download Download free PDF View PDF chevron_right Behavioral Sciences The intention to repurchase is a key component in relationship marketing. However, minimal attention has been paid to how customers’ habitual behavior moderates the relationship between customers’ evaluation of benefits received from a service provider and the intention to revisit, specifically in a personal service business where customer-service provider interactions likely constitute the core of a sustainable relationship. To address this gap, the current study proposes and tests a comprehensive model to advance the theory of relationship marketing (RM) and additionally contributes to social exchange theory (SET), as well as the theory of repurchase decision making (TRD), in the business service context. Structural equation modeling (SEM) was employed to examine the relationships of the research model. Based on data collected from 482 customers on their perceptions of hairstylists, the empirical findings revealed that relational benefits significantly affect post-experience behav... download Download free PDF View PDF chevron_right Behavior Modification, 2018 Tic disorders are characterized by a class of responses assumed to be neurobiological in origin. Still, several studies have shown that tic frequency can be influenced by antecedent environmental events and social consequences. Prior reviews have summarized the effects of environmental events but have not examined relations between tic diagnosis, behavioral deficits (e.g., intellectual disability), tic topography, and the consequences observed to maintain tics. These variables might be important when attempting to predict or identify relevant consequences. A more thorough understanding of the variables that maintain and give rise to tics might also be useful in predicting responsiveness to treatment and intervention refinement. We reviewed and summarized results from the 13 attempts to experimentally identify maintaining consequences for tics (i.e., functional analyses) that have been published to date. We examined patterns of functions across tic diagnoses (i.e., Tourette's syndrome or not), communication impairments (i.e., an intellectual disability or reported language difficulty), and tic topography. Results suggested that individuals with Tourette's syndrome and those without communication impairments are more likely to have functional analysis outcomes consistent with automatic reinforcement, but exceptions in both directions highlight the utility of functional analysis in treating tics. download Download free PDF View PDF chevron_right Journal of Personalized Medicine Autism spectrum disorder (ASD), characterized by social, communication, and behavioral abnormalities, affects 1 in 36 children according to the CDC. Several co-occurring conditions are often associated with ASD, including sleep and immune disorders and gastrointestinal (GI) problems. ASD is also associated with sensory sensitivities. Some individuals with ASD exhibit episodes of challenging behaviors that can endanger themselves or others, including aggression and self-injurious behavior (SIB). In this work, we explored the use of artificial intelligence models to predict behavior episodes based on past data of co-occurring conditions and environmental factors for 80 individuals in a residential setting. We found that our models predict occurrences of behavior and non-behavior with accuracies as high as 90% for some individuals, and that environmental, as well as gastrointestinal, factors are notable predictors across the population examined. While more work is needed to examine the... download Download free PDF View PDF chevron_right Behavior analysis in practice, 2020 The present brief practice examined 6 randomly selected studies from the Journal of Applied Behavior Analysis that included functional analysis data replotted on the functional analysis celeration chart (FACC). The FACC showcases the practicality of a standard celeration chart-derived visual display. The research question asked, what level values"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Veterans & Military",
    "score": 4,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "download Download free PDF View PDF chevron_right Behavioral Interventions, 2018 download Download free PDF View PDF chevron_right Journal of Intellectual Disability Research, 2017 The application of telehealth technology to conduct functional analysis (FA) and functional communication training (FCT) is emerging for children with developmental disabilities and behaviour support needs. The current study was designed to extend FA + FCT for self-injurious behaviour by using telehealth in home with parents as interventionists receiving real-time remote coaching. Two families with school-aged boys with developmental disabilities associated with intellectual disability participated, one with cerebral palsy and the other with autism spectrum disorder. Results indicated that parent-implemented FA + FCT via telehealth was effective for reducing self-injurious behaviour and increasing mands (communication requests) for both children. Both families successfully implemented the FA + FCT protocol with 95% overall fidelity via telehealth-supported coaching. Results are discussed in terms of their relationship to previous research, limitations and future directions. Keywords functional analysis; functional communication training; self-injurious behaviour; telehealth Self-injurious behaviour (SIB) (e.g. hand to head hitting, eye poking and biting oneself) is aheterogenous behavioural disorder that can emerge early in life (e.g. Berkson, Tupa, & download Download free PDF View PDF chevron_right Behavioral Sciences The intention to repurchase is a key component in relationship marketing. However, minimal attention has been paid to how customers’ habitual behavior moderates the relationship between customers’ evaluation of benefits received from a service provider and the intention to revisit, specifically in a personal service business where customer-service provider interactions likely constitute the core of a sustainable relationship. To address this gap, the current study proposes and tests a comprehensive model to advance the theory of relationship marketing (RM) and additionally contributes to social exchange theory (SET), as well as the theory of repurchase decision making (TRD), in the business service context. Structural equation modeling (SEM) was employed to examine the relationships of the research model. Based on data collected from 482 customers on their perceptions of hairstylists, the empirical findings revealed that relational benefits significantly affect post-experience behav... download Download free PDF View PDF chevron_right Behavior Modification, 2018 Tic disorders are characterized by a class of responses assumed to be neurobiological in origin. Still, several studies have shown that tic frequency can be influenced by antecedent environmental events and social consequences. Prior reviews have summarized the effects of environmental events but have not examined relations between tic diagnosis, behavioral deficits (e.g., intellectual disability), tic topography, and the consequences observed to maintain tics. These variables might be important when attempting to predict or identify relevant consequences. A more thorough understanding of the variables that maintain and give rise to tics might also be useful in predicting responsiveness to treatment and intervention refinement. We reviewed and summarized results from the 13 attempts to experimentally identify maintaining consequences for tics (i.e., functional analyses) that have been published to date. We examined patterns of functions across tic diagnoses (i.e., Tourette's syndrome or not), communication impairments (i.e., an intellectual disability or reported language difficulty), and tic topography. Results suggested that individuals with Tourette's syndrome and those without communication impairments are more likely to have functional analysis outcomes consistent with automatic reinforcement, but exceptions in both directions highlight the utility of functional analysis in treating tics. download Download free PDF View PDF chevron_right Journal of Personalized Medicine Autism spectrum disorder (ASD), characterized by social, communication, and behavioral abnormalities, affects 1 in 36 children according to the CDC. Several co-occurring conditions are often associated with ASD, including sleep and immune disorders and gastrointestinal (GI) problems. ASD is also associated with sensory sensitivities. Some individuals with ASD exhibit episodes of challenging behaviors that can endanger themselves or others, including aggression and self-injurious behavior (SIB). In this work, we explored the use of artificial intelligence models to predict behavior episodes based on past data of co-occurring conditions and environmental factors for 80 individuals in a residential setting. We found that our models predict occurrences of behavior and non-behavior with accuracies as high as 90% for some individuals, and that environmental, as well as gastrointestinal, factors are notable predictors across the population examined. While more work is needed to examine the... download Download free PDF View PDF chevron_right Behavior analysis in practice, 2020 The present brief practice examined 6 randomly selected studies from the Journal of Applied Behavior Analysis that included functional analysis data replotted on the functional analysis celeration chart (FACC). The FACC showcases the practicality of a standard celeration chart-derived visual display. The research question asked, what level values"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 7,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "occurred related to the original authors' determination of function? Results indicated all functions had a ×2 level multiplier or higher when placed on the FACC. download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2020 In the present study, we sought to extend the current literature on utilizing behavioral skills training (BST) to teach practitioners how to implement functional analyses (FA). We used a non-concurrent multiple baseline design across ten participants to measure the effects of a remote BST package on accuracy of implementing FA procedures. The entire remote BST package was delivered via secure remote technology. Each participant experienced four phases which included baseline (only instructions with a simulated client), BST (instructions, modeling, rehearsal, and feedback with a simulated client), post-training probes (probes with a simulated client), and in situ probes (probes with actual clients). All participants increased their accuracy in implementing FAs during the remote BST phase. During post-training probes with a simulated client and in situ probes with actual clients, eight of the ten participants maintained their performance at or above mastery criterion. Two of the ten participants needed additional coaching and training. These results suggest that the use of remote technology for training purposes could be a cost-effective and feasible solution to increase the quality of services and number of trained professionals in underserved areas. download Download free PDF View PDF chevron_right Perspectives on Behavior Science Intractable self-injury, aggressive, and other destructive behaviors are real human conditions. Contingent electric skin shock (CESS) is a technology, based on behavior-analytic principles, used to ameliorate such behaviors. However, CESS has always been extraordinarily controversial. The Association for Behavior Analysis (ABAI), commissioned an independent Task Force to examine the issue. After a comprehensive review, the Task Force suggested the treatment should be available for use in select cases through a largely accurate report. Yet, ABAI adopted a position indicating CESS is never appropriate. On the issue of CESS, we are extremely concerned behavior analysis departed from the fundamental epistemology of positivism and is misleading nascent behavior analysts and consumers of behavioral technology. Destructive behaviors are extremely difficult to treat. In our commentary, we outline clarifications regarding aspects of the Task Force Report, proliferation of falsehoods by leade... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2017 Hanley, Jin, Vanselow, and Hanratty (2014) described a functional analysis (FA) format that relied on a synthesis of multiple contingencies described by caregivers during open-ended interviews. These interview-informed synthesized contingency analyses (IISCA) provided effective baselines from which to develop socially validated treatments, but the synthesis precluded a precise understanding of individual contingencies influencing problem behavior. We conducted IISCAs and standard FAs (Iwata, Dorsey, Slifer, Bauman, & Richman, 1982/ 1994) for nine children with autism to evaluate the likelihood of differentiation given a number of synthesized versus isolated variables. The IISCA was differentiated for all. The standard FA was differentiated for four; this number increased to six when we included precursors in the standard FA. We then compared treatments based on sets of differentiated analyses for four children. Treatment based on the IISCA was effective for all four; treatments based on the standard FA were effective for two. The role of synthesis in analysis is discussed. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2020 When problem behavior is controlled by a synthesized reinforcement contingency, a simple omnibus mand that yields access to all reinforcers simultaneously has been shown to effectively replace problem behavior. The question arises as to whether teaching an omnibus mand will preclude the acquisition of specifying"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Public Transit",
    "score": 2,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "occurred related to the original authors' determination of function? Results indicated all functions had a ×2 level multiplier or higher when placed on the FACC. download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2020 In the present study, we sought to extend the current literature on utilizing behavioral skills training (BST) to teach practitioners how to implement functional analyses (FA). We used a non-concurrent multiple baseline design across ten participants to measure the effects of a remote BST package on accuracy of implementing FA procedures. The entire remote BST package was delivered via secure remote technology. Each participant experienced four phases which included baseline (only instructions with a simulated client), BST (instructions, modeling, rehearsal, and feedback with a simulated client), post-training probes (probes with a simulated client), and in situ probes (probes with actual clients). All participants increased their accuracy in implementing FAs during the remote BST phase. During post-training probes with a simulated client and in situ probes with actual clients, eight of the ten participants maintained their performance at or above mastery criterion. Two of the ten participants needed additional coaching and training. These results suggest that the use of remote technology for training purposes could be a cost-effective and feasible solution to increase the quality of services and number of trained professionals in underserved areas. download Download free PDF View PDF chevron_right Perspectives on Behavior Science Intractable self-injury, aggressive, and other destructive behaviors are real human conditions. Contingent electric skin shock (CESS) is a technology, based on behavior-analytic principles, used to ameliorate such behaviors. However, CESS has always been extraordinarily controversial. The Association for Behavior Analysis (ABAI), commissioned an independent Task Force to examine the issue. After a comprehensive review, the Task Force suggested the treatment should be available for use in select cases through a largely accurate report. Yet, ABAI adopted a position indicating CESS is never appropriate. On the issue of CESS, we are extremely concerned behavior analysis departed from the fundamental epistemology of positivism and is misleading nascent behavior analysts and consumers of behavioral technology. Destructive behaviors are extremely difficult to treat. In our commentary, we outline clarifications regarding aspects of the Task Force Report, proliferation of falsehoods by leade... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2017 Hanley, Jin, Vanselow, and Hanratty (2014) described a functional analysis (FA) format that relied on a synthesis of multiple contingencies described by caregivers during open-ended interviews. These interview-informed synthesized contingency analyses (IISCA) provided effective baselines from which to develop socially validated treatments, but the synthesis precluded a precise understanding of individual contingencies influencing problem behavior. We conducted IISCAs and standard FAs (Iwata, Dorsey, Slifer, Bauman, & Richman, 1982/ 1994) for nine children with autism to evaluate the likelihood of differentiation given a number of synthesized versus isolated variables. The IISCA was differentiated for all. The standard FA was differentiated for four; this number increased to six when we included precursors in the standard FA. We then compared treatments based on sets of differentiated analyses for four children. Treatment based on the IISCA was effective for all four; treatments based on the standard FA were effective for two. The role of synthesis in analysis is discussed. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2020 When problem behavior is controlled by a synthesized reinforcement contingency, a simple omnibus mand that yields access to all reinforcers simultaneously has been shown to effectively replace problem behavior. The question arises as to whether teaching an omnibus mand will preclude the acquisition of specifying"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Health Care Access",
    "score": 7,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "occurred related to the original authors' determination of function? Results indicated all functions had a ×2 level multiplier or higher when placed on the FACC. download Download free PDF View PDF chevron_right Journal of Behavioral Education, 2020 In the present study, we sought to extend the current literature on utilizing behavioral skills training (BST) to teach practitioners how to implement functional analyses (FA). We used a non-concurrent multiple baseline design across ten participants to measure the effects of a remote BST package on accuracy of implementing FA procedures. The entire remote BST package was delivered via secure remote technology. Each participant experienced four phases which included baseline (only instructions with a simulated client), BST (instructions, modeling, rehearsal, and feedback with a simulated client), post-training probes (probes with a simulated client), and in situ probes (probes with actual clients). All participants increased their accuracy in implementing FAs during the remote BST phase. During post-training probes with a simulated client and in situ probes with actual clients, eight of the ten participants maintained their performance at or above mastery criterion. Two of the ten participants needed additional coaching and training. These results suggest that the use of remote technology for training purposes could be a cost-effective and feasible solution to increase the quality of services and number of trained professionals in underserved areas. download Download free PDF View PDF chevron_right Perspectives on Behavior Science Intractable self-injury, aggressive, and other destructive behaviors are real human conditions. Contingent electric skin shock (CESS) is a technology, based on behavior-analytic principles, used to ameliorate such behaviors. However, CESS has always been extraordinarily controversial. The Association for Behavior Analysis (ABAI), commissioned an independent Task Force to examine the issue. After a comprehensive review, the Task Force suggested the treatment should be available for use in select cases through a largely accurate report. Yet, ABAI adopted a position indicating CESS is never appropriate. On the issue of CESS, we are extremely concerned behavior analysis departed from the fundamental epistemology of positivism and is misleading nascent behavior analysts and consumers of behavioral technology. Destructive behaviors are extremely difficult to treat. In our commentary, we outline clarifications regarding aspects of the Task Force Report, proliferation of falsehoods by leade... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2018 Functional analysis (FA) of problem behavior typically includes the contingent delivery of a single reinforcer following problem behavior. However, the FA literature also includes examples of analyses that have delivered multiple reinforcers, arranged multiple establishing operations in one or more test conditions, or both. These analyses have been successfully applied under heterogeneous conditions over several decades and with various synthesized establishing operations and reinforcers, but their qualitative details, outcomes, and contributions to the literature have never been described in a comprehensive manner. The purpose of the current review is to: (a) identify articles that have reported the use of synthesized FAs or treatments; (b) describe the nature and scope of synthesis as it has been applied in the FA literature; (c) analyze outcomes of synthesized FAs and treatments to determine general benefits and disadvantages of synthesis; and (d) offer recommendations for future... download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2017 Hanley, Jin, Vanselow, and Hanratty (2014) described a functional analysis (FA) format that relied on a synthesis of multiple contingencies described by caregivers during open-ended interviews. These interview-informed synthesized contingency analyses (IISCA) provided effective baselines from which to develop socially validated treatments, but the synthesis precluded a precise understanding of individual contingencies influencing problem behavior. We conducted IISCAs and standard FAs (Iwata, Dorsey, Slifer, Bauman, & Richman, 1982/ 1994) for nine children with autism to evaluate the likelihood of differentiation given a number of synthesized versus isolated variables. The IISCA was differentiated for all. The standard FA was differentiated for four; this number increased to six when we included precursors in the standard FA. We then compared treatments based on sets of differentiated analyses for four children. Treatment based on the IISCA was effective for all four; treatments based on the standard FA were effective for two. The role of synthesis in analysis is discussed. download Download free PDF View PDF chevron_right Journal of Applied Behavior Analysis, 2020 When problem behavior is controlled by a synthesized reinforcement contingency, a simple omnibus mand that yields access to all reinforcers simultaneously has been shown to effectively replace problem behavior. The question arises as to whether teaching an omnibus mand will preclude the acquisition of specifying"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Public Transit",
    "score": 3,
    "link": "https://www.academia.edu/102067299/Thirty_Years_of_Research_on_the_Functional_Analysis_of_Problem_Behavior",
    "text": "mands for each of the combined reinforcers. In this study, after 3 students diagnosed with autism acquired an omnibus mand (\"My way, please\") that yielded all identified reinforcers simultaneously, specifying mands (e.g., \"All done,\" \"May I have my toys?\" \"Play with me\") were taught to yield each individual reinforcer (e.g., escape, tangibles, attention). Problem behavior was immediately eliminated for all children, and the omnibus mand was acquired quickly. Teaching an omnibus mand did not preclude acquisition of specifying mands for any learner and instead allowed for the acquisition of specifying mands once problem behavior had been effectively reduced. download Download free PDF View PDF chevron_right keyboard_arrow_down View more papers download Loading Preview Sorry, preview is currently unavailable. You can download the paper by clicking the button above. Explore Papers Topics Features Mentions Analytics PDF Packages Advanced Search Search Alerts Journals Academia.edu Journals My submissions Reviewer Hub Why publish with us Testimonials Company About Careers Press Help Center Terms Privacy Copyright Content Policy"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Affordable Housing",
    "score": 3,
    "link": "https://www.goodwinlaw.com/en/people/l/lerman-brian",
    "text": "Goodwin Expertise Expertise People People Careers Legal Paralegal Science Advisor Global Operations Team Careers Legal Legal Paralegal Paralegal Science Advisor Science Advisor Global Operations Team Global Operations Team Insights & Resources Insights & Resources About Us Our Story Opportunity, Inclusion, and Belonging Pro Bono Firm Leadership About Us Our Story Our Story Opportunity, Inclusion, and Belonging Opportunity, Inclusion, and Belonging Pro Bono Pro Bono Firm Leadership Firm Leadership Locations Locations News & Events News & Events Alumni Alumni Search by industry, practice, or name... Brian Lerman Brian Lerman Partner View PDF View PDF VCard VCard Email Email Share Share Share Brian Lerman is a partner in Goodwin’s Real Estate Industry practice. He brings deep real estate experience given his more than 15 years of practice, including almost nine years as in-house counsel in a public REIT. His work includes real estate investments, leasing, development, construction, finance, joint ventures, hospitality, workouts, REITs, and equity issues. He has experience negotiating on behalf of institutional investors, public companies, private corporations and developers of office buildings, retail shopping centers, hotels, multifamily housing properties, industrial properties, and medical facilities. He has also investors in the PropTech space through direct and fund related investments. Experience Experience Served as an in-house resource for a public REIT for purchases, sales, financings, joint ventures, and other development-related activities Managed a 20 asset hotel mezzanine foreclosure and loan restructuring Represented a large institutional investor in taking a private multi-billion dollar hotel REIT private Represented a public REIT in the development of a 40+ acre mixed-use center in an infill location, covering zoning, permitting, and land use Managed a successful construction defect litigation for a multifamily REIT Participated in investment committee meetings, audit committee meetings, and disclosure committee meetings as in-house counsel Assisted client in the making of direct investments in PropTech companies and investments in investment funds dedicated to PropTech Areas of Practice Real Estate Real Estate Financial Services Financial Services Capital Markets Capital Markets Proptech Proptech Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Professional Experience Professional Experience Brian started his career as an associate at Goodwin. He joined a public multifamily housing REIT in 2013 and served in various capacities, most recently as Vice President – Associate General Counsel. He returned to Goodwin in 2022 bringing nine years of institutional experience. Professional Activities Professional Activities Brian is a member of the American Bar Association. Credentials Education JD JD Boston College Law School BA BA Boston College Admissions Bars Massachusetts District of Columbia Recognition & Awards Recognition & Awards Brian was recognized as a recommended lawyer for Real Estate by the Legal 500 US 2024. While attending law school, Brian was the Editor-in-Chief of the Boston College Environmental Affairs Law Review. Publications Publications Author, “ Inclusionary Housing: The Answer to the Affordable Housing Problem ,” Boston College Environmental Affairs Law Review, 2006 Related Content Insight May 8, 2023 Amplifying Operational Real Estate with Proptech Insight May 8, 2023 Amplifying Operational Real Estate with Proptech In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Real Estate Real Estate Financial Services Financial Services Proptech Proptech Capital Markets Capital Markets Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Attorney Advertising Attorney Advertising Cookie Policy Cookie Policy Legal Notices Legal Notices Privacy Policy Privacy Policy Secure Login Secure Login You@Goodwin You@Goodwin"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Education",
    "score": 3,
    "link": "https://www.goodwinlaw.com/en/people/l/lerman-brian",
    "text": "Goodwin Expertise Expertise People People Careers Legal Paralegal Science Advisor Global Operations Team Careers Legal Legal Paralegal Paralegal Science Advisor Science Advisor Global Operations Team Global Operations Team Insights & Resources Insights & Resources About Us Our Story Opportunity, Inclusion, and Belonging Pro Bono Firm Leadership About Us Our Story Our Story Opportunity, Inclusion, and Belonging Opportunity, Inclusion, and Belonging Pro Bono Pro Bono Firm Leadership Firm Leadership Locations Locations News & Events News & Events Alumni Alumni Search by industry, practice, or name... Brian Lerman Brian Lerman Partner View PDF View PDF VCard VCard Email Email Share Share Share Brian Lerman is a partner in Goodwin’s Real Estate Industry practice. He brings deep real estate experience given his more than 15 years of practice, including almost nine years as in-house counsel in a public REIT. His work includes real estate investments, leasing, development, construction, finance, joint ventures, hospitality, workouts, REITs, and equity issues. He has experience negotiating on behalf of institutional investors, public companies, private corporations and developers of office buildings, retail shopping centers, hotels, multifamily housing properties, industrial properties, and medical facilities. He has also investors in the PropTech space through direct and fund related investments. Experience Experience Served as an in-house resource for a public REIT for purchases, sales, financings, joint ventures, and other development-related activities Managed a 20 asset hotel mezzanine foreclosure and loan restructuring Represented a large institutional investor in taking a private multi-billion dollar hotel REIT private Represented a public REIT in the development of a 40+ acre mixed-use center in an infill location, covering zoning, permitting, and land use Managed a successful construction defect litigation for a multifamily REIT Participated in investment committee meetings, audit committee meetings, and disclosure committee meetings as in-house counsel Assisted client in the making of direct investments in PropTech companies and investments in investment funds dedicated to PropTech Areas of Practice Real Estate Real Estate Financial Services Financial Services Capital Markets Capital Markets Proptech Proptech Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Professional Experience Professional Experience Brian started his career as an associate at Goodwin. He joined a public multifamily housing REIT in 2013 and served in various capacities, most recently as Vice President – Associate General Counsel. He returned to Goodwin in 2022 bringing nine years of institutional experience. Professional Activities Professional Activities Brian is a member of the American Bar Association. Credentials Education JD JD Boston College Law School BA BA Boston College Admissions Bars Massachusetts District of Columbia Recognition & Awards Recognition & Awards Brian was recognized as a recommended lawyer for Real Estate by the Legal 500 US 2024. While attending law school, Brian was the Editor-in-Chief of the Boston College Environmental Affairs Law Review. Publications Publications Author, “ Inclusionary Housing: The Answer to the Affordable Housing Problem ,” Boston College Environmental Affairs Law Review, 2006 Related Content Insight May 8, 2023 Amplifying Operational Real Estate with Proptech Insight May 8, 2023 Amplifying Operational Real Estate with Proptech In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Real Estate Real Estate Financial Services Financial Services Proptech Proptech Capital Markets Capital Markets Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Attorney Advertising Attorney Advertising Cookie Policy Cookie Policy Legal Notices Legal Notices Privacy Policy Privacy Policy Secure Login Secure Login You@Goodwin You@Goodwin"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Climate & Environment",
    "score": 2,
    "link": "https://www.goodwinlaw.com/en/people/l/lerman-brian",
    "text": "Goodwin Expertise Expertise People People Careers Legal Paralegal Science Advisor Global Operations Team Careers Legal Legal Paralegal Paralegal Science Advisor Science Advisor Global Operations Team Global Operations Team Insights & Resources Insights & Resources About Us Our Story Opportunity, Inclusion, and Belonging Pro Bono Firm Leadership About Us Our Story Our Story Opportunity, Inclusion, and Belonging Opportunity, Inclusion, and Belonging Pro Bono Pro Bono Firm Leadership Firm Leadership Locations Locations News & Events News & Events Alumni Alumni Search by industry, practice, or name... Brian Lerman Brian Lerman Partner View PDF View PDF VCard VCard Email Email Share Share Share Brian Lerman is a partner in Goodwin’s Real Estate Industry practice. He brings deep real estate experience given his more than 15 years of practice, including almost nine years as in-house counsel in a public REIT. His work includes real estate investments, leasing, development, construction, finance, joint ventures, hospitality, workouts, REITs, and equity issues. He has experience negotiating on behalf of institutional investors, public companies, private corporations and developers of office buildings, retail shopping centers, hotels, multifamily housing properties, industrial properties, and medical facilities. He has also investors in the PropTech space through direct and fund related investments. Experience Experience Served as an in-house resource for a public REIT for purchases, sales, financings, joint ventures, and other development-related activities Managed a 20 asset hotel mezzanine foreclosure and loan restructuring Represented a large institutional investor in taking a private multi-billion dollar hotel REIT private Represented a public REIT in the development of a 40+ acre mixed-use center in an infill location, covering zoning, permitting, and land use Managed a successful construction defect litigation for a multifamily REIT Participated in investment committee meetings, audit committee meetings, and disclosure committee meetings as in-house counsel Assisted client in the making of direct investments in PropTech companies and investments in investment funds dedicated to PropTech Areas of Practice Real Estate Real Estate Financial Services Financial Services Capital Markets Capital Markets Proptech Proptech Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Professional Experience Professional Experience Brian started his career as an associate at Goodwin. He joined a public multifamily housing REIT in 2013 and served in various capacities, most recently as Vice President – Associate General Counsel. He returned to Goodwin in 2022 bringing nine years of institutional experience. Professional Activities Professional Activities Brian is a member of the American Bar Association. Credentials Education JD JD Boston College Law School BA BA Boston College Admissions Bars Massachusetts District of Columbia Recognition & Awards Recognition & Awards Brian was recognized as a recommended lawyer for Real Estate by the Legal 500 US 2024. While attending law school, Brian was the Editor-in-Chief of the Boston College Environmental Affairs Law Review. Publications Publications Author, “ Inclusionary Housing: The Answer to the Affordable Housing Problem ,” Boston College Environmental Affairs Law Review, 2006 Related Content Insight May 8, 2023 Amplifying Operational Real Estate with Proptech Insight May 8, 2023 Amplifying Operational Real Estate with Proptech In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Real Estate Real Estate Financial Services Financial Services Proptech Proptech Capital Markets Capital Markets Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Attorney Advertising Attorney Advertising Cookie Policy Cookie Policy Legal Notices Legal Notices Privacy Policy Privacy Policy Secure Login Secure Login You@Goodwin You@Goodwin"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Veterans & Military",
    "score": 4,
    "link": "https://www.goodwinlaw.com/en/people/l/lerman-brian",
    "text": "Goodwin Expertise Expertise People People Careers Legal Paralegal Science Advisor Global Operations Team Careers Legal Legal Paralegal Paralegal Science Advisor Science Advisor Global Operations Team Global Operations Team Insights & Resources Insights & Resources About Us Our Story Opportunity, Inclusion, and Belonging Pro Bono Firm Leadership About Us Our Story Our Story Opportunity, Inclusion, and Belonging Opportunity, Inclusion, and Belonging Pro Bono Pro Bono Firm Leadership Firm Leadership Locations Locations News & Events News & Events Alumni Alumni Search by industry, practice, or name... Brian Lerman Brian Lerman Partner View PDF View PDF VCard VCard Email Email Share Share Share Brian Lerman is a partner in Goodwin’s Real Estate Industry practice. He brings deep real estate experience given his more than 15 years of practice, including almost nine years as in-house counsel in a public REIT. His work includes real estate investments, leasing, development, construction, finance, joint ventures, hospitality, workouts, REITs, and equity issues. He has experience negotiating on behalf of institutional investors, public companies, private corporations and developers of office buildings, retail shopping centers, hotels, multifamily housing properties, industrial properties, and medical facilities. He has also investors in the PropTech space through direct and fund related investments. Experience Experience Served as an in-house resource for a public REIT for purchases, sales, financings, joint ventures, and other development-related activities Managed a 20 asset hotel mezzanine foreclosure and loan restructuring Represented a large institutional investor in taking a private multi-billion dollar hotel REIT private Represented a public REIT in the development of a 40+ acre mixed-use center in an infill location, covering zoning, permitting, and land use Managed a successful construction defect litigation for a multifamily REIT Participated in investment committee meetings, audit committee meetings, and disclosure committee meetings as in-house counsel Assisted client in the making of direct investments in PropTech companies and investments in investment funds dedicated to PropTech Areas of Practice Real Estate Real Estate Financial Services Financial Services Capital Markets Capital Markets Proptech Proptech Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Professional Experience Professional Experience Brian started his career as an associate at Goodwin. He joined a public multifamily housing REIT in 2013 and served in various capacities, most recently as Vice President – Associate General Counsel. He returned to Goodwin in 2022 bringing nine years of institutional experience. Professional Activities Professional Activities Brian is a member of the American Bar Association. Credentials Education JD JD Boston College Law School BA BA Boston College Admissions Bars Massachusetts District of Columbia Recognition & Awards Recognition & Awards Brian was recognized as a recommended lawyer for Real Estate by the Legal 500 US 2024. While attending law school, Brian was the Editor-in-Chief of the Boston College Environmental Affairs Law Review. Publications Publications Author, “ Inclusionary Housing: The Answer to the Affordable Housing Problem ,” Boston College Environmental Affairs Law Review, 2006 Related Content Insight May 8, 2023 Amplifying Operational Real Estate with Proptech Insight May 8, 2023 Amplifying Operational Real Estate with Proptech In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) In the Press April 9, 2025 Wave Of Algorithmic Pricing Laws Crashes Over Rental Market (Law360 Real Estate Authority) Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Press Release December 19, 2024 Novo Holdings Completes $16.5 Billion Acquisition of Catalent Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Awards and Rankings June 13, 2024 The Legal 500 US 2024 Recognizes 44 Goodwin Practices and 186 Lawyers Real Estate Real Estate Financial Services Financial Services Proptech Proptech Capital Markets Capital Markets Real Estate Joint Ventures Real Estate Joint Ventures Real Estate Finance & Restructuring Real Estate Finance & Restructuring Operational Real Estate Operational Real Estate Distressed Real Estate Distressed Real Estate Attorney Advertising Attorney Advertising Cookie Policy Cookie Policy Legal Notices Legal Notices Privacy Policy Privacy Policy Secure Login Secure Login You@Goodwin You@Goodwin"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Elections & Democracy",
    "score": 2,
    "link": "https://www.vote4lerman.com/",
    "text": "Embedded Files Skip to main content Skip to navigation This Site Is Under Development. Please Be Patient Brian Lerman Home Learn More Donate Mission Contact Brian Lerman Home Learn More Donate Mission Contact More Home Learn More Donate Mission Contact Home Learn More Donate Mission Contact Brian Lerman Brian Lerman Brian Lerman For nyc mayor Brian Lerman For nyc mayor Brian Lerman is running for New York City Mayor as a proud republican in the 2025 election! Brian Lerman is running for New York City Mayor as a proud republican in the 2025 election! Learn more CORE VALUE CORE VALUE Here is where you can write more information about your team's core value. Here is where you can write more information about your team's core value. CORE VALUE CORE VALUE Here is where you can write more information about your team's core value. Here is where you can write more information about your team's core value. CORE VALUE CORE VALUE Here is where you can write more information about your team's core value. Here is where you can write more information about your team's core value. A description of your team photo A description of your team photo Subscribe to our mailing list at [EMAIL] Subscribe to our mailing list at [EMAIL] Donate Contact Donate Contact Google Sites Report abuse Page details Page updated"
  },
  {
    "candidate": "Lerman, Brian A*",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://www.avvo.com/attorneys/20036-dc-brian-lerman-1333297.html",
    "text": "www.avvo.com Verifying you are human. This may take a few seconds. Enable JavaScript and cookies to continue"
  }
]