[
  {
    "candidate": "Lynch, Lawman",
    "category": "Government & Ethics",
    "score": 2,
    "link": "https://www.lawmanlynchfoundation.org/",
    "text": "Upcoming Event Facebook Facebook Instagram Instagram Home Who We Are What We Do Music For Life Contact Us Menu Home Who We Are What We Do Music For Life Contact Us Donate Now Donate Now BUY TICKETS BUY TICKETS $ 0.00 $ 0.00 $ 0.00 $ 0 Cart 0 Cart Welcome To The Lawman Lynch Foundation BECOME A VOLUNTEER Raise Your Hand Lend your Support For Our Youths MAKE A DONATION Previous Next Become A Volunteer Join your hands with us for a better life and beautiful future Register Now Give Donation Join your hands with us for a better life and beautiful future Donate Today Music For Life Join your hands with us for a better life and beautiful future Learn More Our primary focus is on child, youth and community development. We need your help to change lives! The Lawman Lynch Foundation (LLF) is a 501 (c) 3 Non-Profit Organization. Our mission is based on our commitment to serve those in need; with a primary focus on child, youth and community development, by initiating and/or participating in activities that will generate resources/aid for the vulnerable (primarily, but not limited to women, children and the socially oppressed). Read More 2008 - 2018 The Lawman Lynch Foundation celebrates 10 years of service. We thank our volunteers and donors for believing in us. We Need Your Help! We are dedicated to improving lives and building a future for our children Donate Today! LLF Help Fund – For Jamaica Household Workers Union $425 of $1,000 raised $ Donation Amount: US Dollars Canadian Dollars Jamaican dollar $50.00 $100.00 You Decide The Amount Donate Now Select Payment Method Test Donation Offline Donation Stripe - Credit Card Personal Info First Name * Last Name Company Name Email Address * Make this an anonymous donation. Credit Card Info This is a secure SSL encrypted payment. Card Number * CVC * Cardholder Name * Expiration * Billing Details Country * United States Canada United Kingdom Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darrussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo, Democratic People's Republic Congo, Republic of Cook Islands Costa Rica Cote d'Ivoire Croatia/Hrvatska Cuba Cyprus Island Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt Equatorial Guinea El Salvador Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Greece Ghana Gibraltar Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Holy See (City Vatican State) Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Island Poland Portugal Puerto Rico Qatar Reunion Island Romania Russian Federation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and the Grenadines San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovak Republic Slovenia Solomon Islands Somalia South Africa South Georgia South Korea Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Islands Eswatini Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Togo Tokelau Tonga Thailand Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands (British) Virgin Islands (USA) Wallis and Futuna Islands Western Sahara Western Samoa Yemen Yugoslavia Zambia Zimbabwe Address 1 * Address 2 City * State * Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "Veterans & Military",
    "score": 4,
    "link": "https://www.lawmanlynchfoundation.org/",
    "text": "Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming American Samoa Canal Zone Commonwealth of the Northern Mariana Islands Federated States of Micronesia Guam Marshall Islands Northern Mariana Islands Palau Philippine Islands Puerto Rico Trust Territory of the Pacific Islands Virgin Islands Armed Forces - Americas Armed Forces - Europe, Canada, Middle East, Africa Armed Forces - Pacific Zip / Postal Code * Donation Total: $1.00 Previous Next Become A Volunteer Join your hands with us for a better life and beautiful future Join your hands with us for a better life and beautiful future Register Now Give Donation Join your hands with us for a better life and beautiful future Join your hands with us for a better life and beautiful future Donate Today Music For Life Join your hands with us for a better life and beautiful future Join your hands with us for a better life and beautiful future Learn More Our primary focus is on child, youth and community development. We need your help to change lives! The Lawman Lynch Foundation (LLF) is a 501 (c) 3 Non-Profit Organization. Our mission is based on our commitment to serve those in need; with a primary focus on child, youth and community development, by initiating and/or participating in activities that will generate resources/aid for the vulnerable (primarily, but not limited to women, children and the socially oppressed). Read More Read More 2008 - 2018 The Lawman Lynch Foundation celebrates 10 years of service. We thank our volunteers and donors for believing in us. We Need Your Help! We are dedicated to improving lives and building a future for our children Donate Today! LLF Help Fund – For Jamaica Household Workers Union $425 $1,000 $ $50.00 $100.00 You Decide The Amount Test Donation Offline Donation Stripe - Credit Card First Name * * Last Name Company Name Email Address * * Make this an anonymous donation. This is a secure SSL encrypted payment. * * * * Country * United States Canada United Kingdom Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darrussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo, Democratic People's Republic Congo, Republic of Cook Islands Costa Rica Cote d'Ivoire Croatia/Hrvatska Cuba Cyprus Island Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt Equatorial Guinea El Salvador Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Greece Ghana Gibraltar Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Holy See (City Vatican State) Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Island Poland Portugal Puerto Rico Qatar Reunion Island Romania Russian Federation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and the Grenadines San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovak Republic Slovenia Solomon Islands Somalia South Africa South Georgia South Korea Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Islands Eswatini Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Togo Tokelau Tonga Thailand Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands (British) Virgin Islands (USA) Wallis and Futuna Islands Western Sahara Western Samoa Yemen Yugoslavia Zambia Zimbabwe * Address 1 * * Address 2 City * * State * Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio"
  },
  {
    "candidate": "Lynch, Lawman",
    "category": "Veterans & Military",
    "score": 3,
    "link": "https://www.lawmanlynchfoundation.org/",
    "text": "Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming American Samoa Canal Zone Commonwealth of the Northern Mariana Islands Federated States of Micronesia Guam Marshall Islands Northern Mariana Islands Palau Philippine Islands Puerto Rico Trust Territory of the Pacific Islands Virgin Islands Armed Forces - Americas Armed Forces - Europe, Canada, Middle East, Africa Armed Forces - Pacific State * Zip / Postal Code * * Donation Total: $1.00 Donation Total: $1.00 Our mission is based on our commitment to serve those in need; with a primary focus on child, youth and community development, by initiating and/or participating in activities that will generate resources/aid for the vulnerable (primarily, but not limited to women, children and the socially oppressed). Facebook Facebook Instagram Instagram Facebook Instagram © 2023 All rights reserved​ Made with ❤ By: Next Step Digital Solutions"
  }
]