[
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Affordable Housing",
    "score": 6,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "Assemblymember Zohran K. Mamdani Assembly District 36 Home About Biography District Map Biography District Map Newsroom Press Releases Publications News Articles Press Releases Publications News Articles Media Video Video Legislation Committee Membership Contact Assembly Home Contact Join email list Map & Offices Biography Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Education",
    "score": 11,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "Assemblymember Zohran K. Mamdani Assembly District 36 Home About Biography District Map Biography District Map Newsroom Press Releases Publications News Articles Press Releases Publications News Articles Media Video Video Legislation Committee Membership Contact Assembly Home Contact Join email list Map & Offices Biography Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Health Care Access",
    "score": 6,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "Assemblymember Zohran K. Mamdani Assembly District 36 Home About Biography District Map Biography District Map Newsroom Press Releases Publications News Articles Press Releases Publications News Articles Media Video Video Legislation Committee Membership Contact Assembly Home Contact Join email list Map & Offices Biography Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Affordable Housing",
    "score": 5,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember,"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Education",
    "score": 13,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember,"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "LGBTQ+ Rights",
    "score": 2,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember,"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Health Care Access",
    "score": 12,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember,"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Elections & Democracy",
    "score": 2,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember, Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office. Zohran Kwame Mamdani was born and raised in Kampala, Uganda, moving to New York City with his family at the age of 7. A graduate of the NYC Public School System, he attended the Bronx High School of Science and received a Bachelor’s Degree in Africana Studies from Bowdoin College. A few years later in 2018, he became naturalized as an American citizen. Prior to representing the 36th Assembly District and its neighborhoods of Astoria, Ditmars-Steinway, and Astoria Heights, Zohran worked as a foreclosure prevention housing counselor, helping low-income homeowners of color across Queens fight off eviction and stay in their homes. It was this job that led him to run for office. After having spent every day negotiating with banks that valued profits over people, he came face-to-face with the reality that this housing crisis – one which predated this pandemic – was not natural to our lives, but instead a choice. A choice that was the consequence of decades of pro-corporate policies enacted across our country as well as our state. Yet, like with any choice, we always have the opportunity to change and Zohran is excited to be a part of that. More than his professional experience, however it was the act of organizing that led to Zohran becoming politically active in the first place. In high school, Zohran co-founded his school’s first ever cricket team, which would go on to participate in the Public School Athletic League’s inaugural cricket season. This act, though not ostensibly a political one, taught him how coming together with a few like-minded individuals can transform rhetoric into reality. Prior to that, his politics had been expressed primarily through long Facebook posts whose impact was the same as the Yankees’ rings from the last 10 years. Taking that lesson with him, he went on to co-found his college’s first Students for Justice in Palestine chapter and later organize across the country with different progressive organizations seeking to win national elections as well as expand healthcare coverage. As life took its inevitable turns, with detours in film, rap, and writing, it was always organizing that ensured that the events of our world would not lead him to despair, but to action. As an Assemblymember,"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://nyassembly.gov/mem/Zohran-Mamdani",
    "text": "Zohran fights every day for a future where each and every New Yorker lives a dignified life and where the distribution of that dignity is not determined by the market. At a time when almost a quarter of his neighbors across Astoria spend half their income on rent, when they breathe the most polluted air in Queens, and where they are profiled at the highest rates of any neighborhood in the borough, Zohran believes that the future we deserve is one where housing, energy, and justice are for the many, not just the few. Zohran is proud to be the first South Asian man to serve in the NYS Assembly as well as the first Ugandan and only the third Muslim to ever be a member of the body. For too long, communities such as these have been left out of our state’s politics and priorities. Zohran will seek to amplify the voices of the preferably unheard across both the district and the state for as long as he remains in office."
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Affordable Housing",
    "score": 13,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Policing & Public Safety",
    "score": 2,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Public Transit",
    "score": 22,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "LGBTQ+ Rights",
    "score": 4,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Health Care Access",
    "score": 2,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Veterans & Military",
    "score": 3,
    "link": "https://www.zohranfornyc.com/",
    "text": "About Platform Endorsements Press Volunteer Zohran Mamdani is running for Mayor to lower the cost of living for working class New Yorkers. Zohran Mamdani This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. This campaign is for every person who believes in the dignity of their neighbors and that the government's job is to actually make our lives better. Meet Zohran Zohran Kwame Mamdani is a New York State Assemblymember and democratic socialist running for Mayor. Born in Uganda and raised in New York City, he has fought for the working class in and outside the legislature: hunger striking alongside taxi drivers to achieve more than $450 million in transformative debt relief, winning over $100 million in the state budget for increased subway service and a successful fare-free bus pilot, and organizing New Yorkers to defeat a proposed dirty power plant. The cost of living is crushing working people but Zohran believes that government can lower costs and make life easier in our city — he’ll use every tool available to bring down the rent, create world class public transit, and make it easier to raise a family. Join Zohran for NYC This campaign is about talking to thousands of New Yorkers across the city about how we make this city work better for the many and not the few. And to do this, we need you. Join an upcoming canvass (or two!) and learn how to have positive conversations with New Yorkers about freezing the rent, free and fast buses, universal childcare and more! No experience is required. All canvasses start with a training and you will be paired up with a partner if you are new to this. We can't wait to see you! Sign up to volunteer New York is too expensive. Zohran will lower costs and make life easier. Freeze the rent. A majority of New Yorkers are tenants, and more than two million of them live in rent stabilized apartments. These homes should be the bedrock of economic security for the city’s working class. Instead, Eric Adams has taken every opportunity to squeeze tenants, with his hand-picked appointees to the Rent Guidelines Board jacking up rents on stabilized apartments by 9% (and counting)–the most since a Republican ran City Hall. As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent. The number one reason working families are leaving our city is the housing crisis. The Mayor has the power to change that. Fast, fare free buses. Public transit should be reliable, safe and universally accessible. But one in five New Yorkers struggle to afford the ever rising fare. Adding insult to injury: our city’s buses are the slowest in the nation, robbing working people of precious time for family, leisure and rest. Zohran won New York’s first fare-free bus pilot on five lines across the city. As Mayor, he’ll permanently eliminate the fare on every city bus – and make them faster by rapidly building priority lanes, expanding bus queue jump signals, and dedicated loading zones to keep double parkers out of the way. Fast and free buses will not only make buses reliable and accessible but will improve safety for riders and operators – creating the world-class service New Yorkers deserve. The Department of Community Safety All New Yorkers deserve to be safe. But the Adams administration has failed to deliver the sense of safety and security that everyone should feel walking down our streets, riding our subways, or taking our buses. Zohran will create the Department of Community Safety to prevent violence before it happens by prioritizing solutions which have been consistently shown to improve safety. Police have a critical role to play. But right now, we’re relying on them to deal with the failures of our social safety net—which prevents them from doing their actual jobs. Through this new city agency and whole-of-government approach, community safety will be prioritized like never before in NYC. The Department will invest in citywide mental health programs and crisis response—including deploying dedicated outreach workers in 100 subway stations, providing medical services in vacant commercial units, and increasing Transit Ambassadors to assist New Yorkers on their journeys—expand evidence-based gun violence prevention programs, and increase funding to hate violence prevention programs by 800%. Read more in the NYT , and the full"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Affordable Housing",
    "score": 14,
    "link": "https://www.zohranfornyc.com/",
    "text": "proposal here . No cost childcare. After rent, the biggest cost for New York’s working families is childcare. It’s literally driving them out of the city: New Yorkers with children under six are leaving at double the rate of all others. The burden falls heaviest on mothers, who are giving up paying jobs to do unpaid childcare. Zohran will implement free childcare for every New Yorker aged 6 weeks to 5 years, ensuring high quality programming for all families. And he will bring up wages for childcare workers – a quarter of whom currently live in poverty – to be at parity with public school teachers. It will foster early childhood development, save parents money and keep our families in the city they call home. City-owned grocery stores. Food prices are out of control. Nearly 9 in 10 New Yorkers say the cost of groceries is rising faster than their income. Only the very wealthiest aren’t feeling squeezed at the register. As Mayor, Zohran will create a network of city-owned grocery stores focused on keeping prices low, not making a profit. Without having to pay rent or property taxes, they will reduce overhead and pass on savings to shoppers. They will buy and sell at wholesale prices, centralize warehousing and distribution, and partner with local neighborhoods on products and sourcing. With New York City already spending millions of dollars to subsidize private grocery store operators (which are not even required to take SNAP/WIC!) , we should redirect public money to a real “public option.” Housing by and for New York. We need a lot more affordable housing. But for decades, New York City has relied almost entirely on changing the zoning code to entice private development – with results that can fall short of the big promises. And the housing that does get built is often out of reach for the working class who need it the most. As Mayor, Zohran will put our public dollars to work and triple the City’s production of permanently affordable, union-built, rent-stabilized homes – constructing 200,000 new units over the next 10 years. Any 100% affordable development gets fast-tracked: no more pointless delays. And Zohran will fully staff our City’s housing agencies so we can actually get the work done. For the additional housing we need, Zohran will initiate a Comprehensive Plan for New York City to create a holistic vision for affordability, equity, and growth. This planning will allow NYC to address the legacy of racially discriminatory zoning, increase density near transit hubs, end the requirement to build parking lots and proactively chart our future. Cracking down on bad landlords. One in ten renter households reported a lack of adequate heat last winter. One in four reported mice or rats in their homes. Half a million live in poor quality housing. Every New Yorker deserves a safe and healthy place to call home. That’s why Zohran will overhaul the Mayor’s Office to Protect Tenants and coordinate code enforcement under one roof, making sure agencies work together to hold owners responsible for the conditions of their buildings. Tenants will be able to schedule and track inspections with a revamped 311. If a landlord refuses to make a repair, the City will do it and send them the bill. And in the most extreme cases, when an owner demonstrates consistent neglect for their tenants, the City will decisively step in and take control of their properties. The worst landlords will be put out of business. Taxes on big corporations and the wealthiest New Yorkers Zohran has a plan to bring down the cost-of-living through city-owned grocery stores, universal childcare, and other bold proposals, and he knows exactly how to pay for it, too. Zohran’s revenue plan will raise the corporate tax rate to match New Jersey’s 11.5%, bringing in $5 billion. And he will tax the wealthiest 1% of New Yorkers—those earning above $1 million annually—a flat 2% tax (right now city income tax rates are essentially the same whether you make $50,000 or $50 million). Zohran will also implement common-sense procurement reform, end senseless no-bid contracts, hire more tax auditors, and crack down on fine collection from corrupt landlords to raise an additional $1 billion. Read Zohran’s platform on all of the issues New Yorkers are facing HERE . Endorsements New York Working Families Party New York Working Families Party DC37 DC37 NYC DSA NYC DSA UNITEHERE! Local 100 UNITEHERE! Local 100 Sunrise Movement National Sunrise Movement National United Auto Workers - Region 9A"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Education",
    "score": 4,
    "link": "https://www.zohranfornyc.com/",
    "text": "proposal here . No cost childcare. After rent, the biggest cost for New York’s working families is childcare. It’s literally driving them out of the city: New Yorkers with children under six are leaving at double the rate of all others. The burden falls heaviest on mothers, who are giving up paying jobs to do unpaid childcare. Zohran will implement free childcare for every New Yorker aged 6 weeks to 5 years, ensuring high quality programming for all families. And he will bring up wages for childcare workers – a quarter of whom currently live in poverty – to be at parity with public school teachers. It will foster early childhood development, save parents money and keep our families in the city they call home. City-owned grocery stores. Food prices are out of control. Nearly 9 in 10 New Yorkers say the cost of groceries is rising faster than their income. Only the very wealthiest aren’t feeling squeezed at the register. As Mayor, Zohran will create a network of city-owned grocery stores focused on keeping prices low, not making a profit. Without having to pay rent or property taxes, they will reduce overhead and pass on savings to shoppers. They will buy and sell at wholesale prices, centralize warehousing and distribution, and partner with local neighborhoods on products and sourcing. With New York City already spending millions of dollars to subsidize private grocery store operators (which are not even required to take SNAP/WIC!) , we should redirect public money to a real “public option.” Housing by and for New York. We need a lot more affordable housing. But for decades, New York City has relied almost entirely on changing the zoning code to entice private development – with results that can fall short of the big promises. And the housing that does get built is often out of reach for the working class who need it the most. As Mayor, Zohran will put our public dollars to work and triple the City’s production of permanently affordable, union-built, rent-stabilized homes – constructing 200,000 new units over the next 10 years. Any 100% affordable development gets fast-tracked: no more pointless delays. And Zohran will fully staff our City’s housing agencies so we can actually get the work done. For the additional housing we need, Zohran will initiate a Comprehensive Plan for New York City to create a holistic vision for affordability, equity, and growth. This planning will allow NYC to address the legacy of racially discriminatory zoning, increase density near transit hubs, end the requirement to build parking lots and proactively chart our future. Cracking down on bad landlords. One in ten renter households reported a lack of adequate heat last winter. One in four reported mice or rats in their homes. Half a million live in poor quality housing. Every New Yorker deserves a safe and healthy place to call home. That’s why Zohran will overhaul the Mayor’s Office to Protect Tenants and coordinate code enforcement under one roof, making sure agencies work together to hold owners responsible for the conditions of their buildings. Tenants will be able to schedule and track inspections with a revamped 311. If a landlord refuses to make a repair, the City will do it and send them the bill. And in the most extreme cases, when an owner demonstrates consistent neglect for their tenants, the City will decisively step in and take control of their properties. The worst landlords will be put out of business. Taxes on big corporations and the wealthiest New Yorkers Zohran has a plan to bring down the cost-of-living through city-owned grocery stores, universal childcare, and other bold proposals, and he knows exactly how to pay for it, too. Zohran’s revenue plan will raise the corporate tax rate to match New Jersey’s 11.5%, bringing in $5 billion. And he will tax the wealthiest 1% of New Yorkers—those earning above $1 million annually—a flat 2% tax (right now city income tax rates are essentially the same whether you make $50,000 or $50 million). Zohran will also implement common-sense procurement reform, end senseless no-bid contracts, hire more tax auditors, and crack down on fine collection from corrupt landlords to raise an additional $1 billion. Read Zohran’s platform on all of the issues New Yorkers are facing HERE . Endorsements New York Working Families Party New York Working Families Party DC37 DC37 NYC DSA NYC DSA UNITEHERE! Local 100 UNITEHERE! Local 100 Sunrise Movement National Sunrise Movement National United Auto Workers - Region 9A"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Public Transit",
    "score": 2,
    "link": "https://www.zohranfornyc.com/",
    "text": "proposal here . No cost childcare. After rent, the biggest cost for New York’s working families is childcare. It’s literally driving them out of the city: New Yorkers with children under six are leaving at double the rate of all others. The burden falls heaviest on mothers, who are giving up paying jobs to do unpaid childcare. Zohran will implement free childcare for every New Yorker aged 6 weeks to 5 years, ensuring high quality programming for all families. And he will bring up wages for childcare workers – a quarter of whom currently live in poverty – to be at parity with public school teachers. It will foster early childhood development, save parents money and keep our families in the city they call home. City-owned grocery stores. Food prices are out of control. Nearly 9 in 10 New Yorkers say the cost of groceries is rising faster than their income. Only the very wealthiest aren’t feeling squeezed at the register. As Mayor, Zohran will create a network of city-owned grocery stores focused on keeping prices low, not making a profit. Without having to pay rent or property taxes, they will reduce overhead and pass on savings to shoppers. They will buy and sell at wholesale prices, centralize warehousing and distribution, and partner with local neighborhoods on products and sourcing. With New York City already spending millions of dollars to subsidize private grocery store operators (which are not even required to take SNAP/WIC!) , we should redirect public money to a real “public option.” Housing by and for New York. We need a lot more affordable housing. But for decades, New York City has relied almost entirely on changing the zoning code to entice private development – with results that can fall short of the big promises. And the housing that does get built is often out of reach for the working class who need it the most. As Mayor, Zohran will put our public dollars to work and triple the City’s production of permanently affordable, union-built, rent-stabilized homes – constructing 200,000 new units over the next 10 years. Any 100% affordable development gets fast-tracked: no more pointless delays. And Zohran will fully staff our City’s housing agencies so we can actually get the work done. For the additional housing we need, Zohran will initiate a Comprehensive Plan for New York City to create a holistic vision for affordability, equity, and growth. This planning will allow NYC to address the legacy of racially discriminatory zoning, increase density near transit hubs, end the requirement to build parking lots and proactively chart our future. Cracking down on bad landlords. One in ten renter households reported a lack of adequate heat last winter. One in four reported mice or rats in their homes. Half a million live in poor quality housing. Every New Yorker deserves a safe and healthy place to call home. That’s why Zohran will overhaul the Mayor’s Office to Protect Tenants and coordinate code enforcement under one roof, making sure agencies work together to hold owners responsible for the conditions of their buildings. Tenants will be able to schedule and track inspections with a revamped 311. If a landlord refuses to make a repair, the City will do it and send them the bill. And in the most extreme cases, when an owner demonstrates consistent neglect for their tenants, the City will decisively step in and take control of their properties. The worst landlords will be put out of business. Taxes on big corporations and the wealthiest New Yorkers Zohran has a plan to bring down the cost-of-living through city-owned grocery stores, universal childcare, and other bold proposals, and he knows exactly how to pay for it, too. Zohran’s revenue plan will raise the corporate tax rate to match New Jersey’s 11.5%, bringing in $5 billion. And he will tax the wealthiest 1% of New Yorkers—those earning above $1 million annually—a flat 2% tax (right now city income tax rates are essentially the same whether you make $50,000 or $50 million). Zohran will also implement common-sense procurement reform, end senseless no-bid contracts, hire more tax auditors, and crack down on fine collection from corrupt landlords to raise an additional $1 billion. Read Zohran’s platform on all of the issues New Yorkers are facing HERE . Endorsements New York Working Families Party New York Working Families Party DC37 DC37 NYC DSA NYC DSA UNITEHERE! Local 100 UNITEHERE! Local 100 Sunrise Movement National Sunrise Movement National United Auto Workers - Region 9A"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Government & Ethics",
    "score": 4,
    "link": "https://www.zohranfornyc.com/",
    "text": "proposal here . No cost childcare. After rent, the biggest cost for New York’s working families is childcare. It’s literally driving them out of the city: New Yorkers with children under six are leaving at double the rate of all others. The burden falls heaviest on mothers, who are giving up paying jobs to do unpaid childcare. Zohran will implement free childcare for every New Yorker aged 6 weeks to 5 years, ensuring high quality programming for all families. And he will bring up wages for childcare workers – a quarter of whom currently live in poverty – to be at parity with public school teachers. It will foster early childhood development, save parents money and keep our families in the city they call home. City-owned grocery stores. Food prices are out of control. Nearly 9 in 10 New Yorkers say the cost of groceries is rising faster than their income. Only the very wealthiest aren’t feeling squeezed at the register. As Mayor, Zohran will create a network of city-owned grocery stores focused on keeping prices low, not making a profit. Without having to pay rent or property taxes, they will reduce overhead and pass on savings to shoppers. They will buy and sell at wholesale prices, centralize warehousing and distribution, and partner with local neighborhoods on products and sourcing. With New York City already spending millions of dollars to subsidize private grocery store operators (which are not even required to take SNAP/WIC!) , we should redirect public money to a real “public option.” Housing by and for New York. We need a lot more affordable housing. But for decades, New York City has relied almost entirely on changing the zoning code to entice private development – with results that can fall short of the big promises. And the housing that does get built is often out of reach for the working class who need it the most. As Mayor, Zohran will put our public dollars to work and triple the City’s production of permanently affordable, union-built, rent-stabilized homes – constructing 200,000 new units over the next 10 years. Any 100% affordable development gets fast-tracked: no more pointless delays. And Zohran will fully staff our City’s housing agencies so we can actually get the work done. For the additional housing we need, Zohran will initiate a Comprehensive Plan for New York City to create a holistic vision for affordability, equity, and growth. This planning will allow NYC to address the legacy of racially discriminatory zoning, increase density near transit hubs, end the requirement to build parking lots and proactively chart our future. Cracking down on bad landlords. One in ten renter households reported a lack of adequate heat last winter. One in four reported mice or rats in their homes. Half a million live in poor quality housing. Every New Yorker deserves a safe and healthy place to call home. That’s why Zohran will overhaul the Mayor’s Office to Protect Tenants and coordinate code enforcement under one roof, making sure agencies work together to hold owners responsible for the conditions of their buildings. Tenants will be able to schedule and track inspections with a revamped 311. If a landlord refuses to make a repair, the City will do it and send them the bill. And in the most extreme cases, when an owner demonstrates consistent neglect for their tenants, the City will decisively step in and take control of their properties. The worst landlords will be put out of business. Taxes on big corporations and the wealthiest New Yorkers Zohran has a plan to bring down the cost-of-living through city-owned grocery stores, universal childcare, and other bold proposals, and he knows exactly how to pay for it, too. Zohran’s revenue plan will raise the corporate tax rate to match New Jersey’s 11.5%, bringing in $5 billion. And he will tax the wealthiest 1% of New Yorkers—those earning above $1 million annually—a flat 2% tax (right now city income tax rates are essentially the same whether you make $50,000 or $50 million). Zohran will also implement common-sense procurement reform, end senseless no-bid contracts, hire more tax auditors, and crack down on fine collection from corrupt landlords to raise an additional $1 billion. Read Zohran’s platform on all of the issues New Yorkers are facing HERE . Endorsements New York Working Families Party New York Working Families Party DC37 DC37 NYC DSA NYC DSA UNITEHERE! Local 100 UNITEHERE! Local 100 Sunrise Movement National Sunrise Movement National United Auto Workers - Region 9A"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Affordable Housing",
    "score": 2,
    "link": "https://www.zohranfornyc.com/",
    "text": "United Auto Workers - Region 9A IATSE Local 161 IATSE Local 161 CAAAV Voice CAAAV Voice DRUM Beats DRUM Beats New York Communities for Change New York Communities for Change Jewish Voice for Peace Action Jewish Voice for Peace Action Coalition for a District Alternative Coalition for a District Alternative New Kings Democrats New Kings Democrats New York Progressive Action Network New York Progressive Action Network Three Bridges Democratic Club Three Bridges Democratic Club The Jewish Vote The Jewish Vote Sunrise NYC Sunrise NYC College Democrats of New York College Democrats of New York Muslim Democratic Club of New York Muslim Democratic Club of New York Lambda Independent Democrats of Brooklyn Lambda Independent Democrats of Brooklyn Jim Owles Liberal Democratic Club Jim Owles Liberal Democratic Club Stonewall Democratic Club of NYC Stonewall Democratic Club of NYC Featured Press Zohran Mamdani Wants You to Have More Money in Your Pocket There’s a reason he resonates with so many New Yorkers, and it’s not just because he’s relatable—he grew up here, almost failed Mandarin class, and got sent to detention one too many times in high school—it’s because he’s straightforward, funny, and sincere. He is the antithesis of politics for show. He has proven to be what many voters now think is impossible: an elected official for the people. Can Zohran Mamdani, a Socialist and TikTok Savant, Become N.Y.C. Mayor? In the crowded race for mayor of New York City, Zohran Mamdani has become a magnet for attention, ascending in the polls and raising money through a mix of social media savvy and a plain-spoken, everyman approach. The Democrats Are Losing the Social Media Wars. This Young Socialist Is Changing That. As Democrats around the country debate moderation, doing nothing or pursuing a politics of abundance — calling for government to stop getting in the way of things like building housing with over-regulation — Mamdani is an example of another path, one that follows in the footsteps of Sanders by lifting up concrete leftist policies toward a social safety net and affordable cost of living. The Happiest Democrat in America A recent surge of glowing profiles and features have underlined the New York state assemblyman’s unlikely No. 2 position in polls for mayor, behind only Andrew Cuomo, the disgraced former governor who leads the race. They tend to point to his acumen online, especially on TikTok—this kind of video is a prime example—and his ambidextrous appeal to different voters despite his unapologetic democratic socialist politics. His fundraising, driven by small donors, has topped $8 million. He is the rare Democrat who is meeting the most stark and uncertain moment in the party’s recent history with a message that’s both urgent and, against all odds, upbeat. Mamdani maxes out fundraising for NYC mayoral primary, campaign says The democratic socialist, who is currently serving as a state assemblymember from Queens, said he plans to announce Monday that his campaign is the first in the New York City mayor's race to hit the fundraising cap. He said he has raised more than $8 million with projected matching funds from about 18,000 donors citywide and has done so at a faster rate than any campaign in city history. Zohran Mamdani, a Democratic Socialist, Will Run Against Mayor Adams Mr. Mamdani, who has called on Mr. Adams to resign, said in an interview that the mayor had failed New Yorkers. He said that he would focus his campaign on addressing the city’s affordability crisis. ‘Working-class New Yorkers are being pushed out of the city they built’: why Zohran Mamdani is running for mayor In 2021, Mamdani went on a 15-day hunger strike to protest predatory loans that targeted the taxi drivers who purchased “medallions”, the physical certificate required to operate a yellow cab. The city eventually caved and struck a deal with medallion loan guarantors, securing $450m in transformative debt relief for these drivers. Twenty Minutes With Queens State Assemblymember Zohran Mamdani, Candidate to Unseat Mayor Eric Adams In the crowded 2025 mayoral primary race, Zohran Mamdani stands out. The 33-year-old Queens State Assemblymember was behind the City's first free bus pilot , introduced legislation that would bar charities from funding illegal Israeli settlements, and went on a hunger strike to secure debt relief for taxi drivers. Mamdani was born and raised in Uganda until he moved to New York at the age of seven, and would be the city's first Muslim mayor. N.Y.C. Grocery Prices Are High. Could City-Owned Stores Help? A New York City mayoral"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Veterans & Military",
    "score": 2,
    "link": "https://www.zohranfornyc.com/",
    "text": "United Auto Workers - Region 9A IATSE Local 161 IATSE Local 161 CAAAV Voice CAAAV Voice DRUM Beats DRUM Beats New York Communities for Change New York Communities for Change Jewish Voice for Peace Action Jewish Voice for Peace Action Coalition for a District Alternative Coalition for a District Alternative New Kings Democrats New Kings Democrats New York Progressive Action Network New York Progressive Action Network Three Bridges Democratic Club Three Bridges Democratic Club The Jewish Vote The Jewish Vote Sunrise NYC Sunrise NYC College Democrats of New York College Democrats of New York Muslim Democratic Club of New York Muslim Democratic Club of New York Lambda Independent Democrats of Brooklyn Lambda Independent Democrats of Brooklyn Jim Owles Liberal Democratic Club Jim Owles Liberal Democratic Club Stonewall Democratic Club of NYC Stonewall Democratic Club of NYC Featured Press Zohran Mamdani Wants You to Have More Money in Your Pocket There’s a reason he resonates with so many New Yorkers, and it’s not just because he’s relatable—he grew up here, almost failed Mandarin class, and got sent to detention one too many times in high school—it’s because he’s straightforward, funny, and sincere. He is the antithesis of politics for show. He has proven to be what many voters now think is impossible: an elected official for the people. Can Zohran Mamdani, a Socialist and TikTok Savant, Become N.Y.C. Mayor? In the crowded race for mayor of New York City, Zohran Mamdani has become a magnet for attention, ascending in the polls and raising money through a mix of social media savvy and a plain-spoken, everyman approach. The Democrats Are Losing the Social Media Wars. This Young Socialist Is Changing That. As Democrats around the country debate moderation, doing nothing or pursuing a politics of abundance — calling for government to stop getting in the way of things like building housing with over-regulation — Mamdani is an example of another path, one that follows in the footsteps of Sanders by lifting up concrete leftist policies toward a social safety net and affordable cost of living. The Happiest Democrat in America A recent surge of glowing profiles and features have underlined the New York state assemblyman’s unlikely No. 2 position in polls for mayor, behind only Andrew Cuomo, the disgraced former governor who leads the race. They tend to point to his acumen online, especially on TikTok—this kind of video is a prime example—and his ambidextrous appeal to different voters despite his unapologetic democratic socialist politics. His fundraising, driven by small donors, has topped $8 million. He is the rare Democrat who is meeting the most stark and uncertain moment in the party’s recent history with a message that’s both urgent and, against all odds, upbeat. Mamdani maxes out fundraising for NYC mayoral primary, campaign says The democratic socialist, who is currently serving as a state assemblymember from Queens, said he plans to announce Monday that his campaign is the first in the New York City mayor's race to hit the fundraising cap. He said he has raised more than $8 million with projected matching funds from about 18,000 donors citywide and has done so at a faster rate than any campaign in city history. Zohran Mamdani, a Democratic Socialist, Will Run Against Mayor Adams Mr. Mamdani, who has called on Mr. Adams to resign, said in an interview that the mayor had failed New Yorkers. He said that he would focus his campaign on addressing the city’s affordability crisis. ‘Working-class New Yorkers are being pushed out of the city they built’: why Zohran Mamdani is running for mayor In 2021, Mamdani went on a 15-day hunger strike to protest predatory loans that targeted the taxi drivers who purchased “medallions”, the physical certificate required to operate a yellow cab. The city eventually caved and struck a deal with medallion loan guarantors, securing $450m in transformative debt relief for these drivers. Twenty Minutes With Queens State Assemblymember Zohran Mamdani, Candidate to Unseat Mayor Eric Adams In the crowded 2025 mayoral primary race, Zohran Mamdani stands out. The 33-year-old Queens State Assemblymember was behind the City's first free bus pilot , introduced legislation that would bar charities from funding illegal Israeli settlements, and went on a hunger strike to secure debt relief for taxi drivers. Mamdani was born and raised in Uganda until he moved to New York at the age of seven, and would be the city's first Muslim mayor. N.Y.C. Grocery Prices Are High. Could City-Owned Stores Help? A New York City mayoral"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Elections & Democracy",
    "score": 5,
    "link": "https://www.zohranfornyc.com/",
    "text": "United Auto Workers - Region 9A IATSE Local 161 IATSE Local 161 CAAAV Voice CAAAV Voice DRUM Beats DRUM Beats New York Communities for Change New York Communities for Change Jewish Voice for Peace Action Jewish Voice for Peace Action Coalition for a District Alternative Coalition for a District Alternative New Kings Democrats New Kings Democrats New York Progressive Action Network New York Progressive Action Network Three Bridges Democratic Club Three Bridges Democratic Club The Jewish Vote The Jewish Vote Sunrise NYC Sunrise NYC College Democrats of New York College Democrats of New York Muslim Democratic Club of New York Muslim Democratic Club of New York Lambda Independent Democrats of Brooklyn Lambda Independent Democrats of Brooklyn Jim Owles Liberal Democratic Club Jim Owles Liberal Democratic Club Stonewall Democratic Club of NYC Stonewall Democratic Club of NYC Featured Press Zohran Mamdani Wants You to Have More Money in Your Pocket There’s a reason he resonates with so many New Yorkers, and it’s not just because he’s relatable—he grew up here, almost failed Mandarin class, and got sent to detention one too many times in high school—it’s because he’s straightforward, funny, and sincere. He is the antithesis of politics for show. He has proven to be what many voters now think is impossible: an elected official for the people. Can Zohran Mamdani, a Socialist and TikTok Savant, Become N.Y.C. Mayor? In the crowded race for mayor of New York City, Zohran Mamdani has become a magnet for attention, ascending in the polls and raising money through a mix of social media savvy and a plain-spoken, everyman approach. The Democrats Are Losing the Social Media Wars. This Young Socialist Is Changing That. As Democrats around the country debate moderation, doing nothing or pursuing a politics of abundance — calling for government to stop getting in the way of things like building housing with over-regulation — Mamdani is an example of another path, one that follows in the footsteps of Sanders by lifting up concrete leftist policies toward a social safety net and affordable cost of living. The Happiest Democrat in America A recent surge of glowing profiles and features have underlined the New York state assemblyman’s unlikely No. 2 position in polls for mayor, behind only Andrew Cuomo, the disgraced former governor who leads the race. They tend to point to his acumen online, especially on TikTok—this kind of video is a prime example—and his ambidextrous appeal to different voters despite his unapologetic democratic socialist politics. His fundraising, driven by small donors, has topped $8 million. He is the rare Democrat who is meeting the most stark and uncertain moment in the party’s recent history with a message that’s both urgent and, against all odds, upbeat. Mamdani maxes out fundraising for NYC mayoral primary, campaign says The democratic socialist, who is currently serving as a state assemblymember from Queens, said he plans to announce Monday that his campaign is the first in the New York City mayor's race to hit the fundraising cap. He said he has raised more than $8 million with projected matching funds from about 18,000 donors citywide and has done so at a faster rate than any campaign in city history. Zohran Mamdani, a Democratic Socialist, Will Run Against Mayor Adams Mr. Mamdani, who has called on Mr. Adams to resign, said in an interview that the mayor had failed New Yorkers. He said that he would focus his campaign on addressing the city’s affordability crisis. ‘Working-class New Yorkers are being pushed out of the city they built’: why Zohran Mamdani is running for mayor In 2021, Mamdani went on a 15-day hunger strike to protest predatory loans that targeted the taxi drivers who purchased “medallions”, the physical certificate required to operate a yellow cab. The city eventually caved and struck a deal with medallion loan guarantors, securing $450m in transformative debt relief for these drivers. Twenty Minutes With Queens State Assemblymember Zohran Mamdani, Candidate to Unseat Mayor Eric Adams In the crowded 2025 mayoral primary race, Zohran Mamdani stands out. The 33-year-old Queens State Assemblymember was behind the City's first free bus pilot , introduced legislation that would bar charities from funding illegal Israeli settlements, and went on a hunger strike to secure debt relief for taxi drivers. Mamdani was born and raised in Uganda until he moved to New York at the age of seven, and would be the city's first Muslim mayor. N.Y.C. Grocery Prices Are High. Could City-Owned Stores Help? A New York City mayoral"
  },
  {
    "candidate": "Mamdani, Zohran K",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://www.zohranfornyc.com/",
    "text": "candidate wants the city to open its own, more affordable grocery stores. The idea has gained momentum in Chicago and other cities. Videos Subscribe * * * By submitting this form and signing up for texts, you consent to receive donation asks and informational messages from Zohran for NYC. Msg & data rates may apply. Msg frequency varies. Unsubscribe at any time by replying STOP. Reply HELP for help. Privacy Policy and Terms . Facebook logo Instagram logo TikTok logo X.com logo YouTube logo Contact & FAQ Jobs Show your support! For press inquiries, please contact press@zohranfornyc.com Photography by Kara McCurdy Heading font by Matthew Hinders-Anderson Designed and built by Forge.coop"
  }
]