[
  {
    "candidate": "Wilkinson, Amanda M*",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://amandamariewilkinson.com/",
    "text": "Home Bio Music Shows Photos Official Music Video- \"Spiritual Level\" Store Song List Press Kit Onesheet Onesheet Crowdfunding Contact Amanda Marie Wilkinson- Artist on One Page Amanda Marie Wilkinson Amanda Marie Wilkinson Amanda Marie Wilkinson Home Bio Music Shows Photos Official Music Video- \"Spiritual Level\" Store Song List Press Kit Onesheet Onesheet Crowdfunding Contact Amanda Marie Wilkinson- Artist on One Page Join our mailing list for the latest news Spiritual Level - Nominated for Best Music Video Join us on April 13-15 Hudson International film festival in NYC screening and awards for selected nominees for best Feature Film, Short Film, and Music Video. Nothing To Lose (When You Say Goodbye) Nothing To Lose (When You Say Goodbye) Newest Single Out Now! Listen and order on any streaming platform Available Everywhere! Spiritual Level single Spiritual Level single \"Spiritual Level\" is out on all music streaming platforms! Simple as just this click to enjoy and share: https://distrokid.com/hyperfollow/amandamariewilkinson/spiritual-level Join our mailing list for the latest news \"What if the fire burned out earlier on, What if the fight was easier oh, What if\"... My latest music single \"What if\" is out now on all music streaming platforms! Go have a listen and enjoy! https://distrokid.com/hyperfollow/amandamariewilkinson/what-if WHAT IF is out now! Visit all music platforms to listen Also, head over to my YouTube channel to watch the official music video below. Don't forget to subscribe! Shows Shows Latest News Latest News Some images © Log out notes 0:00 / ??? 1 Spiritual Level 2:59 $0.99 In cart Not available Out of stock 0:00 / 2:59 0:00 / ??? 0:00 / ??? 0:00 / ??? 1 Spiritual Level 2:59 $0.99 In cart Not available Out of stock 0:00 / 2:59 1 Spiritual Level 2:59 Spiritual Level 2:59 0:00 / 2:59 0:00 / 2:59 0:00 / ??? 0:00 / ???"
  },
  {
    "candidate": "Wilkinson, Amanda M*",
    "category": "Civil Rights & Discrimination",
    "score": 2,
    "link": "https://www.currentobituary.com/member/obit/292763",
    "text": "OBITUARY GUESTBOOK DIRECTIONS PRINT PAGE Obituary FRANKLIN ---- Amanda Jean Kelley, 43, of W. Bow Street, passed away at her home on Monday, April 28, 2025. Amanda was born on December 1, 1981, in Keene, the daughter of Randall and Rebekah (Forman) Carpenter. Amanda is survived by the love of her life, Patrick Kelley, son Aiden Kelley, daughter Alexis McCormack, granddaughter Everleigh McCormack, brother Spencer Carpenter, sister Hannah Carpenter, her parents Randall and Rebekah and two nieces. A Celebration of Life will be held at a later date. For those who wish, the family suggests that memorial donations in Amanda’s name be made to the American Pain and Disability Foundation, 1075 Broad Ripple Avenue, Suite 389, Indianapolis, IN 46220 or Monadnock Kitty Rescue & Adoption, 11 Plantation Drive, Jaffrey, NH 03452. Wilkinson-Beane-Simoneau-Paquette Funeral Home & Cremation Services/603Cremations.com, 164 Pleasant St., Laconia, NH, 03246, is assisting the family with arrangements. For more information and to view an online memorial, please visit wilkinsonbeane.com. Directions to Funeral Home 164 Pleasant Street Laconia, NH 03246 603-524-4300"
  },
  {
    "candidate": "Wilkinson, Amanda M*",
    "category": "Uncategorized",
    "score": 0,
    "link": "https://unitywithcommunity.com/",
    "text": "Unity With Community Together We Thrive! Contact Blog Community October 18, 2018 March 4, 2025 unitywithcommunity unitywithcommunity Together We Thrive! Welcome to our site! Unity with community is not only how we survive, but thrive. Each of us have a voice and story to share and when we do, we are uplifting others and ultimately community as a whole. This is a place for everyone to feel welcomed, supported, and an outreach of resources aiding individuals and families in crisis, and further support our community missions. Unity with Community! – Amanda M. Wilkinson Name (required) Email (required) Website Comment (required) Submit Δ Unity with Community! Follow on Instagram @unitywithcommunitynyc @closets_to_community In a world that is so weakened by division, let us prove our strength by coming together”. -Amanda M. Wilkinson Together We Thrive! Welcome to our site! Unity with community is not only how we survive, but thrive. Each of us have a voice and story to share and when we do, we are uplifting others and ultimately community as a whole. This is a place for everyone to feel welcomed, supported, and an outreach of resources aiding individuals and families in crisis, and further support our community missions. Unity with Community! – Amanda M. Wilkinson (required) (required) (required) Submit Δ Unity with Community! Follow on Instagram @unitywithcommunitynyc @closets_to_community In a world that is so weakened by division, let us prove our strength by coming together”. -Amanda M. Wilkinson Subscribe Subscribed Unity With Community Join 50 other subscribers Sign me up Already have a WordPress.com account? Log in now. Subscribe Subscribed Unity With Community Already have a WordPress.com account? Log in now. Unity With Community Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Unity With Community Subscribe Subscribed Subscribe Subscribed Sign up Log in Copy shortlink Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments..."
  }
]